{
    "id": "qep8zx",
    "score": 67893,
    "title": "kicking someone off the stairs for no valid reason",
    "author": "QuenzoO",
    "date": 1635069945.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/qep8zx",
    "media_urls": [
        "https://v.redd.it/08zy19aggdv71"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Literally a cartoon leather jacket gang of bullies",
            "score": 8296,
            "author": "Neurotic_Z",
            "replies": [
                {
                    "level": 1,
                    "comment": "What happened to just taking her lunch money. Jesus Christ, bullies have upped the ante.",
                    "score": 2084,
                    "author": "yellowfolder",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This isn't a bully this is a criminal",
                            "score": 1628,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah what he did is kinda like attempted murder",
                                    "score": 949,
                                    "author": "BeefMcFist",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly, I hope they find them and charge them.  Idiots in today's 'it's a prank bro' society need to learn that what they do has real consequences.  10 years prison will make you think about your life choices.",
                                            "score": 503,
                                            "author": "RincewindToTheRescue",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't think it was a prank. My guess is they said something to her and she ignored them so he retaliated. I am probably wrong but that's my geuss",
                                                    "score": 510,
                                                    "author": "yeoldpepaw",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No I bet you're right.",
                                                            "score": 215,
                                                            "author": "theRealGleepglop",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That happened in Berlin some years ago. They got the dude. He got 35 months. Fortunately he was beaten up heavily in jail.",
                                                            "score": 105,
                                                            "author": "Pizza_YumYum"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That was my first thought too. Maybe he catcalled her even.",
                                                            "score": 124,
                                                            "author": "pe4cebeuponyou",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "My first thought as well. Not the first or last time this will happen to a woman just fucking existing in the world. \n\nGuys, even if you mean super well, don’t take it personally if a random girl you’re trying to flirt with responds rudely. There’s a good chance the situation feels familiar in the worst way and she wants to get you away from her as fast as possible before you decide to assault her for not being interested.",
                                                            "score": 87,
                                                            "author": "[deleted]"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They probably cat called her, not wanting to engage with their vulgar bullshit she continued on her way and their fragile ego's got hurt and they had to \"teach her\" what happens when you cross the \"good guys\". \n\nby KICKING HER DOWN A FUC*ING FLIGHT OF STAIRS! \n\nholy shit this enraged me sorry...",
                                                            "score": 25,
                                                            "author": "Jyobachah"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Exactly. She ignored him, said no, walked away, etc. and this is his reaction. Wonder why women get nervous saying no to men?",
                                                            "score": 108,
                                                            "author": "ValPrism"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "This portion of the comment section 👑",
                                                            "score": 11,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "This was in the UK, it was a good few years ago and yes they were caught and dealt with. I recall the poor girl had quite a few breaks from it.\n\nEDIT: I stand corrected eveyone, this happened in Berlin and not the UK. This was definitely in the news over here quite a bit so i incorrectly assumed it was here. Sorry for the confusion and thanks to all who pointed put my error.",
                                                    "score": 223,
                                                    "author": "Right-Valuable-2615",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This wasn't in the UK. It happened in Berlin, Germany.",
                                                            "score": 149,
                                                            "author": "meffeo",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yes can recognize the station , were they caught ?",
                                                                    "score": 49,
                                                                    "author": "bujbuj1",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yes. He was caught and sentenced to 2 years and 11 months of prison.",
                                                                            "score": 25,
                                                                            "author": "Elk-Tamer"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not kinda like, totally is.",
                                            "score": 125,
                                            "author": "Sea-Environment-7102",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tunnel Snake wannabes",
                    "score": 265,
                    "author": "WhatAmIDoing229",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even though Tunnel Snakes rule, they wouldn't push Amata down the stairs.",
                            "score": 148,
                            "author": "sierrabravo1984",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even those anarchical fuckers recognise that's the Lone Wanderer's job. /s",
                                    "score": 61,
                                    "author": "otakushinjikun",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nice way of describing them",
                    "score": 148,
                    "author": "ElegantSurround6933"
                },
                {
                    "level": 1,
                    "comment": "Random act or did he try/fail to pick her up prior? Looks motivated",
                    "score": 67,
                    "author": "scraps4T",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "„Don’t judge a book by it’s cover“ is what you always get told. But damn damn with those people you know there isn’t anything written inside",
                    "score": 62,
                    "author": "JDescole",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "He got nearly three years in prison for it",
            "score": 22125,
            "author": "starbuck8415",
            "replies": [
                {
                    "level": 1,
                    "comment": "While I'm glad he got prison time, kicking someone down a set of stairs could have resulted in serious harm or death. He got off easy with three years.",
                    "score": 2638,
                    "author": "ak-blackjack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "can you imagine if she snapped her neck? Maybe he gets 10 years. So when he's 35 years old, still in the prime of his life, he gets to walk outside and feel the sun on his face, take a trip to the beach, swim in the ocean, stroll through the park and grab a latte. Meanwhile she sits in a wheelchair with a chin rest and someone to wipe the shit from her ass, for the rest of her life. All her hopes and dreams, gone.",
                            "score": 1457,
                            "author": "MoeFugger7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;  35 years old, still in the prime\n\nas a 33 year old thank you for this",
                                    "score": 1131,
                                    "author": "CreativeCandy9",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "36 here, you're gonna have to speak louder.",
                                            "score": 444,
                                            "author": "TaedusPrime",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He said\n\n#as a 33 year old thank you for this",
                                                    "score": 266,
                                                    "author": "TonarinoTotoro1719",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You youngy'ins, always yelling at your elders.",
                                                            "score": 94,
                                                            "author": "TaedusPrime",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'm 50. Fuck all y'all! :)",
                                                    "score": 224,
                                                    "author": "soonerpgh",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "35 is the new 50, haven't you heard?",
                                                            "score": 87,
                                                            "author": "Kate_Luv_Ya",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's not exactly comforting...",
                                                                    "score": 61,
                                                                    "author": "soonerpgh",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah dude. Sometimes the justice system doesn't quite deliver. A guy who had just gotten out of prison for stabbing his ex(she survived) went right back to her house to attack her again once he was out. My nephew saw him attacking her in an alley, she was my nephews childhood friend. So nephew grabs a branch because this dude is twice his size, and he manages to get the attacker off the woman. Dude turns around and tazes my nephew then stabs him over 30 times. He got 13 years in prison, he'll be out at the age of 32. Full life ahead of him to stab whoever he wants, my nephew died.",
                                    "score": 21,
                                    "author": "Lupo_Bi-Wan_Kenobi"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He got the shit kicked out of him in jail and had to be transferred to another prison. So there's that.",
                            "score": 238,
                            "author": "megamoze",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Heck yea.",
                                    "score": 70,
                                    "author": "ECA0"
                                },
                                {
                                    "level": 3,
                                    "comment": "As someone who’s been in jail. Your fellow inmates in your unit will know the details of your case. And if you’ve done any harm to a woman or child—you get your ass beat. Simple as that.",
                                    "score": 84,
                                    "author": "fckndan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How do they know?",
                                            "score": 9,
                                            "author": "ChampNotChicken",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There are no secrets in prison. The first thing guys want to know when you hit a compound is what you are in for.   \nInmates can search you on public records at the library or by phoning a friend/family member. Or the guards themselves will just rat you out. \n\nAgain, this is especially the case if you abused a child or woman.",
                                                    "score": 39,
                                                    "author": "fckndan"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Pushing someone down the stairs should be an attempted murder charge every time.",
                            "score": 259,
                            "author": "Cryptoporticus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes. Same with strangulation.",
                                    "score": 79,
                                    "author": "oeufscocotte",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 23,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Did his friend steal her phone after the attack?   The friends seem equally shite.",
                            "score": 35,
                            "author": "Appropriate-Access88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Looked like a beer bottle to me?",
                                    "score": 12,
                                    "author": "Elle2NE1"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This eases my disgust slightly - he deserves longer, but still, at least he was caught. Do you know if the lady was ok?",
                    "score": 9338,
                    "author": "DiveSociety",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 6920,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I knew I’ve seen it somewhere before. Total piece of shit",
                                    "score": 2000,
                                    "author": "Br35-Ba56",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 790,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A total piece of shit",
                                                    "score": 518,
                                                    "author": "thecaptn420",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He's a piece of shit in its entirety.",
                                                            "score": 581,
                                                            "author": "WaitingToBeNoticed",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Just so you know, I noticed you",
                                                                    "score": 262,
                                                                    "author": "EmmaStonewallJackson",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "it's like a calmer, non-violent version of witness me. ^notice me!",
                                                                            "score": 28,
                                                                            "author": "namedan",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "An entire piece of shit.",
                                                                    "score": 59,
                                                                    "author": "Kafka_at_an_orgy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Truly a comprehensive piece of dung he is",
                                                                            "score": 37,
                                                                            "author": "paldo84",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "An absolute POS",
                                                                                    "score": 29,
                                                                                    "author": "justcallmeabrokenpal",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Does anyone else think this guy is a total piece of shit?",
                                                            "score": 136,
                                                            "author": "TrumpIsACuntBitch",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Nah I think he's more of a total piece of shit",
                                                                    "score": 37,
                                                                    "author": "MrShelly-_-1972",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "A complete and total one!",
                                                                    "score": 19,
                                                                    "author": "yuniepie",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Total piece is shit",
                                                                    "score": 74,
                                                                    "author": "PinsNneedles",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Even though there is no good reason, was it found out why he did it?",
                                    "score": 341,
                                    "author": "HalfSoul30",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 633,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is why I don’t go kid’s birthday parties",
                                                    "score": 304,
                                                    "author": "Whatupdoe90",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Next thing you know, you're doing meth on a train in Germany",
                                                            "score": 160,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah that’s not the best play to do meth.",
                                                                    "score": 26,
                                                                    "author": "stefanos916",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It’s happened 6 times too many. The person on the stairs just never learns their lesson.",
                                                                    "score": 8,
                                                                    "author": "Whatupdoe90"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "That 4 year old started the whole thing!",
                                                    "score": 390,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's the Ted Cruz defense.",
                                                            "score": 172,
                                                            "author": "Dirtycurta",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Gary Glitter too",
                                                                    "score": 54,
                                                                    "author": "BootsyCollins123",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Seems like a guy with a level head on his shoulders",
                                                    "score": 120,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You ever been to a 4yo's birthday party???\n\nHe's the real victim here... /s",
                                                    "score": 59,
                                                    "author": "idog99",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Word. \nBut also, bruh...",
                                                            "score": 12,
                                                            "author": "SipAnon"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "So a total piece of shit?",
                                                    "score": 14,
                                                    "author": "omaca"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He was hoping being a crack head and wasted would be an excuse.",
                                                    "score": 35,
                                                    "author": "RedofPaw",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Probably because he hates women and saw a woman while drunk.",
                                            "score": 273,
                                            "author": "diddlysqt",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Interestingly that’s exactly how he was caught. He fled Germany with his wife to lay low with Bulgarian associates in France. When he thought the heat had died down a bit he and his wife tried to sneak back into Germany by bus. \n\nOn this bus journey he behaved so inappropriately towards a random female passenger (in the presence of his wife) that the bus driver paid him personal attention. The driver then recognised he was possibly the wanted man from the original attack and contacted the German police to meet the bus when it stopped.\n\nDude being a piece of shit to random women on such a consistent basis is ironically how he was caught",
                                                    "score": 325,
                                                    "author": "Enough-Equivalent968",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He’s such shit that even on the run trying to stay low he just couldn’t help himself.",
                                                            "score": 89,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "« She asked for it » is what he said I’m guessing.",
                                                                    "score": 17,
                                                                    "author": "homogenousmoss"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "How did this man get to adulthood while being this dysfunctional?? Like how is he not dead or institutionalized, before he snapped and attempted murder I mean",
                                                            "score": 7,
                                                            "author": "waterdrinker14",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And how did he get married?",
                                                                    "score": 13,
                                                                    "author": "z1lard",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "*While being a piece of shit.",
                                                    "score": 96,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "His friends are shit too.",
                                                    "score": 78,
                                                    "author": "dirtdiggler67",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Maybe even worse than him in some ways",
                                                            "score": 8,
                                                            "author": "gray_2shades",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Seems like he hates women",
                                            "score": 98,
                                            "author": "Stephelco",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Once in Germany a random guy in the street tried to kick me for no reason, national sport?",
                                    "score": 142,
                                    "author": "MatadorSalas11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Maybe it’s like the knock out game we had here in the us for a while.",
                                            "score": 39,
                                            "author": "SarahPallorMortis",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Hate to break it to you, but it happened almost exactly 5 years ago. We're getting old.",
                                    "score": 92,
                                    "author": "AmBozz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Daaaamn, I could have sworn this was 2 years ago at most.",
                                            "score": 17,
                                            "author": "DhalsimHibiki",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It happened a month after I moved to Berlin, which was 5 years ago. Otherwise I would also have no idea when it happened.",
                                                    "score": 9,
                                                    "author": "jeapplela"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He was also brutally attacked by other prisoners in jail. He had to be relocated into other jails multiple times, because this video made him famous enough, that most prisoners in Germany would know him and „greet“ him that way, once they make contact with him.",
                            "score": 989,
                            "author": "ZazumeUchiha",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good... Goooood...",
                                    "score": 44,
                                    "author": "Valerina_Minji",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "this is heartwarming and wholesome",
                                    "score": 717,
                                    "author": "lemon_meringue",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Very heartwarming to know he repeatedly got the same over and over and likely from men much bigger.",
                                            "score": 173,
                                            "author": "Belyal",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Do onto others as you want others to do onto you 💕💕",
                                            "score": 229,
                                            "author": "Staple_Overlord",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yessssss they doing king shit 👑",
                                            "score": 63,
                                            "author": "AightFamIDK"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean, most violent acts are committed for a reason. Drug deal gone bad, rival gang members, argument in a bar that escalated, etc.\n\nBut to just kick some random woman down the stairs? Total piece of shit.",
                                    "score": 139,
                                    "author": "ITSigno",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Where’s the story?",
                    "score": 43,
                    "author": "MrCarnality",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "28 yo guy kicked her down the stairs, back in 2016. In court he told the judge under tears that he couldn't recall the incident. \n\nThe Woman suffered a broken arm, a laceration to the head and psychological damage. \n\nHe got 35 Months in Jail for this stunt and was severely beaten up by fellow inmates once he was incarcerated.",
                            "score": 94,
                            "author": "dontgonearthefire",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; was severely beaten up by fellow inmates once he was incarcerated.\n\nnice",
                                    "score": 48,
                                    "author": "jessbird"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What about the guy who took her wine bottle?",
                    "score": 292,
                    "author": "isaidillthinkaboutit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pretty sure that bottle falls from the kicker's jacket's inner pocket.",
                            "score": 66,
                            "author": "Eastuss",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, the whole pack of them were clearly accomplices.",
                            "score": 300,
                            "author": "SpirituallyMyopic",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I legit can’t figure out that bottle. It appears before he makes the kick motion but it is largely obscured by the one guy at the top of the stairs. It is a few stairs above him but I didn’t see it fall anywhere to get there. It almost looks like something cut into the video in an edit but the rest of the scene doesn’t look fake or edited.",
                            "score": 31,
                            "author": "mrcheez22",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He deserves more",
                    "score": 53,
                    "author": "Adeum1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Dude cmon 3 years? People this detached from reality should not share the same reality as everyone else.",
                    "score": 722,
                    "author": "Lumpy_Staff_2372",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 303,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 69,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 320,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 59,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 39,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 306,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 140,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 77,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 54,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 47,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 18,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 75,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 21,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s a whole crew of losers. She could have died if she hit her head.",
            "score": 2755,
            "author": "Gogowhine",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 822,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Broke her arm this is from years  ago",
                            "score": 256,
                            "author": "Reallysuckatever",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I listen to a few TV/film production podcasts and have heard numerous times that falling down stairs is one of the most dangerous stunts to perform. And that's with trained professionals that *expect* to fall. So the danger in a surprise kick like that is extreme.",
                    "score": 153,
                    "author": "MadRaymer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is very interesting to hear. I once did this stunt as a child. I specifically set it up so I didn't fall from the top, it was tripping before the stairs then rolling down them. It was very painful. Thankfully we got the shot. 1/10. Do not reccomend.",
                            "score": 16,
                            "author": "_sinewave_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Guy right at the end is the one that makes me the most angry. Hung around, looked at her crumpled at the bottom, picked up the beer of all things, looked back and carried on with his cowardly life.\n\nSay Курва and move on, little man.",
                    "score": 96,
                    "author": "space_keeper",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "gonna walk backwards down stairs from now on",
            "score": 3909,
            "author": "M19Wielder",
            "replies": [
                {
                    "level": 1,
                    "comment": "Careful, someone might kick you back up them.",
                    "score": 2853,
                    "author": "Republic_of_Ash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "then i have the high ground",
                            "score": 1554,
                            "author": "M19Wielder",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't try it",
                                    "score": 524,
                                    "author": "Heiliger_Katholik",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You were supposed to destroy the Sith, not join them",
                                            "score": 586,
                                            "author": "vish_the_fish",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't lecture me, Obi-Wan! I see through the lies of the Jedi. I do not fear the dark side as you do. I have brought peace, freedom, justice, and security to my new Empire.",
                                                    "score": 142,
                                                    "author": "Oblivion_007",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You underestimate my power.",
                                                            "score": 80,
                                                            "author": "theplasmasnake",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Just fly over the stairs",
                                    "score": 40,
                                    "author": "NotYourBuissnesMate",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Slide down the railing! Everybody wins",
                                            "score": 16,
                                            "author": "Ketchup-Chips3"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You guys don't jumps down full flights of stairs in a single bound?",
                                            "score": 11,
                                            "author": "Post-Alone0",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I lived much of my childhood like this because of my uncle",
                    "score": 19,
                    "author": "flavor_blasted_semen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate me for having hopes for the last one... What a shame",
            "score": 2100,
            "author": "Cramhug",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ugh, right! I was like, surely one of the guys at the top of the stairs will help her or at least call the guy out. But nope, they just pick up their shit and carry on",
                    "score": 775,
                    "author": "Seaboats",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Might be wrong but I am guessing all 4 of them are friends.",
                            "score": 318,
                            "author": "Guardian125478",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can tell by their cool matching jackets",
                                    "score": 230,
                                    "author": "7laserbears",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "They are. The kicker dropped something. The last guy picked it up for him.",
                                    "score": 39,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Was that thing on the floor lady's? So not only did they push her off the stairs but they also stole her shit?",
                    "score": 85,
                    "author": "Mega3000aka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No it looks like a bottle of beer. Think it flew out of the kicker’s pocket",
                            "score": 71,
                            "author": "ConstantSignal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ahh I see, still it dosen't make the situation any better.",
                                    "score": 23,
                                    "author": "Mega3000aka"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thank you I just spent too long trying to figure out where that bottle came from.",
                                    "score": 17,
                                    "author": "Cynthiaistheshit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep, me too lmao \n\nStill inconclusive if I’m honest, that’s just my best guess",
                                            "score": 9,
                                            "author": "ConstantSignal",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a dog shit",
            "score": 2072,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 473,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My mistake Dog Shit’s",
                            "score": 59,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "dont do dog shits like that! this guy is so much worst",
                    "score": 62,
                    "author": "AnalTuberculosis",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you get to a point in life where you're like \"I'm gonna kick this lady down the stairs for no reason\"?",
            "score": 82,
            "author": "Scrubbadubdoug",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1608,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this happened in Berlin a few years ago.",
                    "score": 679,
                    "author": "Herzogsteve",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wasn’t this some football fan from a balkan country?",
                            "score": 303,
                            "author": "billobongo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some petty criminal from Bulgaria. Claimed to have no memory of the incident due to brain damage from an unrelated car crash.",
                                    "score": 699,
                                    "author": "Herzogsteve",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And if this is the case then this guy can make no assurances that it won’t happen again (or worse) so keep his ass in jail.",
                                            "score": 342,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's not how Germany works. A psychiatric expert said he had diminished responsibility due to the brain injury and alcohol and drug abuse, so he was given a lighter sentence.",
                                                    "score": 223,
                                                    "author": "Herzogsteve",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I always love how judges give time off for been an even bigger danger to society, I'll bet that the brain injury was self inflicted.",
                                                            "score": 149,
                                                            "author": "micksack",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 151,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "So he was high, drunk and had \"amnesia\" so instead of attempted murder, he gets a slap on the wrist?  3years, out in 12mo if he was on good behaviour.. and the fact he has memory problems and drug problems, probs a low tier psyche ward, too",
                                                            "score": 72,
                                                            "author": "Bobthemime",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "And how did his buddies end up brain dead too?",
                                            "score": 27,
                                            "author": "belegerbs",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That man makes me ashamed for being Bulgarian. Things like these make me wish I was born in a different country, I really really hate my country. Its not out of character that someone from my country would do something so horrible.",
                                            "score": 46,
                                            "author": "anobrainidiot",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Someone else said that he got 3 years for that.",
                    "score": 23,
                    "author": "Primaniel",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trash people",
            "score": 185,
            "author": "DumboRElephant"
        },
        {
            "level": 0,
            "comment": "This scares me. Sometimes I have balance issues a d have to take the stairs slowly and I've had people behind me get a little bent out of shape about it. I'd hate to have this happen to myself or anyone be else. It's just needless violance.",
            "score": 786,
            "author": "Kthaanid",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. I also have balance issues and  one of my biggest fears is being pushed off the stairs. Already, I’m at a risk of falling off to begin with.",
                    "score": 133,
                    "author": "I-Iabibi",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 923,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 271,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 135,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 143,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They they also take her bottle thing. It’s really hard to see what and how the thing falls cause the dude covers it up",
            "score": 508,
            "author": "Shaggy_Days",
            "replies": [
                {
                    "level": 1,
                    "comment": "The second guy down drops it.\n\nOr it falls out of kickers pocket...\n\nOr maybe it did pop out of the outside pocket of her bag...",
                    "score": 147,
                    "author": "NoobieSnax",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe it fell out of the ladies bag when the kick connects",
                            "score": 53,
                            "author": "peachbubblegummies",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Its actually a bit of a mystery where that bottle comes from, even going frame by frame. You can see the bottle already bumbling on the stairs before the kick even connects, so I can't imagine it was hers.",
                    "score": 56,
                    "author": "Mvin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 24,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah it seems to be something like to me. You can see the guy in front of him kind of point to the bottle before the kick like a “what was that for?”",
                                    "score": 13,
                                    "author": "thenotoriousnatedogg",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 105,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "“No valid reason”? What would a valid reason have been?",
            "score": 439,
            "author": "Set_in_Stone-",
            "replies": [
                {
                    "level": 1,
                    "comment": "She has a cobra on her back ready to strike\n\nShe murdered his wife but got away with it in court.\n\nHe has a steel souled shoe and she activated a powerful electromagnet on her middle back\n\nShe’s a masochist and he’s a satist, and they arranged this public stunt as one of their kinks",
                    "score": 421,
                    "author": "LordBammith",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 135,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Football is serious business over in Europe",
                                    "score": 15,
                                    "author": "rigel2112"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Or maybe he clicked the attack button by mistake.",
                            "score": 42,
                            "author": "Slurp_Lord",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or quicksaved and kicked to see what would happen",
                                    "score": 24,
                                    "author": "LordBammith",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Aw, damn dude. I meant to say 'Howdy'. Sorry for the bullet to the spine.\"",
                                    "score": 9,
                                    "author": "theghostofme"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "His wife and kids were taken hostage and the man on the payphone said \"kick the girl\"",
                            "score": 38,
                            "author": "58king",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "At first I thought the third guy was rushing down to help her, but nope. Just going after her stuff… what a douche canoe.",
            "score": 189,
            "author": "Iron_Chip",
            "replies": [
                {
                    "level": 1,
                    "comment": "He looked back too, my guess is he knew this was wrong and his conscience was telling him to help, but groupthink won over",
                    "score": 62,
                    "author": "I_dont_bone_goats"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I was one of those friends walking with that POS,  I would of thrown that POS down the stairs too or beat the shit out of him.",
            "score": 26,
            "author": "2deaf2see",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"The sentence would have been longer, but a psychiatric expert argued that the attacker had diminished responsibility because of the brain injury as well as alcohol and drug abuse.\"\n\nThe fucking psychiatric expert needs his head checked, he's just as bad.",
            "score": 245,
            "author": "darkuro91",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah yes, his brain isn't working right which causes him to hurt and endanger everyone around him - we simply have to do everything we can to get him back into the public as soon possible!",
                    "score": 55,
                    "author": "open-print",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Can you link where you read this from btw? I wanted to read any news story about this.",
                    "score": 7,
                    "author": "xinxy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love how the bot is like no wishing harm or death no exceptions and everyone is doing exactly that and it’s doing nothing lol.",
            "score": 95,
            "author": "Zanemob_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Who gave this a wholesome award",
            "score": 27,
            "author": "BlakeKDM",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Anyone got the story?",
            "score": 7,
            "author": "Milfing_Man",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 252,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 101,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They didn't know each other and had no prior interaction. Happened in 2017 in Berlin. \n\nIt's a bit complicated but afaik he had an IQ of 60 and a brain injury from a car accident that led to mood swings. He was drunk and high on hard drugs after a fight with his wife and family. Maybe she reminded him of his wife, but he claimed he couldn't remember that night so he never explained why he did it. \n\nThat's why they let him off rather easy and gave him only 3 years prison.",
                    "score": 48,
                    "author": "hotbox4u",
                    "replies": []
                }
            ]
        }
    ]
}