{
    "id": "zjjo46",
    "score": 3450,
    "title": "Letter from neighbor for not putting up Christmas lights",
    "author": "Altruistic-Leg-525",
    "date": 1670811839.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/zjjo46",
    "media_urls": [
        "https://i.redd.it/cie0xw7f5f5a1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "You want a 20 foot high light up pentagram on my front yard?\n\nCause that's how you get one....",
            "score": 1018,
            "author": "publicbigguns",
            "replies": [
                {
                    "level": 1,
                    "comment": "...... but is it LED?",
                    "score": 172,
                    "author": "madeupsomeone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why wouldnt it be? it glows with the blood of my enemies.",
                            "score": 84,
                            "author": "PricknamedNick"
                        },
                        {
                            "level": 2,
                            "comment": "...and reasonably priced?",
                            "score": 3,
                            "author": "bgsrdmm"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Baphomet statue in front yard..",
                    "score": 163,
                    "author": "nmeofst8"
                },
                {
                    "level": 1,
                    "comment": "Malicious compliance is the only way to proceed is this situation.",
                    "score": 31,
                    "author": "Oblivion615"
                },
                {
                    "level": 1,
                    "comment": "I like the thought, but I was thinking they should lean into the “grinch” insult. Maybe get a projector that only has the Grinch’s “wonderful awful idea” smile on a gif loop.",
                    "score": 4,
                    "author": "Nowimhere996"
                },
                {
                    "level": 1,
                    "comment": "I prefer high-intensity spotlight shining directly in the neighbor’s window.",
                    "score": 3,
                    "author": "Jak_n_Dax",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’d make a light up sign that says “ditto”",
                    "score": 3,
                    "author": "larson_5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You disappointed all the old children. Good job.",
            "score": 857,
            "author": "Reasonable-Ebb-7226",
            "replies": [
                {
                    "level": 1,
                    "comment": "All the old children can feel free to purchase and put up lights for me if they're so damn disappointed.\n\nNo? Then get TF out of here with your letter.\n\nIf I'm paying and taking the time, then it's my decision to not do it if I want.",
                    "score": 161,
                    "author": "ashleyorelse",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's nothing up at my house. Maybe if I celebrated Christmas here I would but I don't. No stupid letters either.",
                            "score": 21,
                            "author": "Reasonable-Ebb-7226"
                        },
                        {
                            "level": 2,
                            "comment": "Exactly, I thought Christmas with the Kranks. They were going to offer to put them up for them, instead some bullshi* passive aggressive Christmas letter shaming you for having to work more than your neighbors",
                            "score": 2,
                            "author": "Thelastpieceofthepie"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They said \"children, young, and old\", not \"children, young and old\"",
                    "score": 8,
                    "author": "memer227",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're old people acting like children. Should of had yes or no boxes at the bottom.",
                            "score": 17,
                            "author": "Reasonable-Ebb-7226",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, sorry, didn't know what you meant",
                                    "score": 6,
                                    "author": "memer227"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A thrift shop string of led lights and a dollar store extension cord lit in the shape of *flipping the bird* would be my response.",
            "score": 1076,
            "author": "Wise-Sense5782",
            "replies": [
                {
                    "level": 1,
                    "comment": "Beat me to it, and aim it at the house of the person who wrote the letter. Also, post a blown up copy of the letter on the front lawn.",
                    "score": 220,
                    "author": "axle_smith",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can guarantee that THAT particular letter was sent anonymously …",
                            "score": 111,
                            "author": "Narrow-Peace-555",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not anonymous.\n\nPrinciples of detection suggest narrowing the search to the neighborhood Karens. Primarily the ones with kids.",
                                    "score": 62,
                                    "author": "Camcapballin",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would cast this exact letter on my house with a projector and maybe a naked santa next to it",
                    "score": 66,
                    "author": "2zdebut1"
                },
                {
                    "level": 1,
                    "comment": "I wanted to write the exact same thing. Or maybe in the shape of a dick'n'balls, or something similar obscene.",
                    "score": 10,
                    "author": "Myhrros"
                },
                {
                    "level": 1,
                    "comment": "Or just TP the house. Here comes the downvotes",
                    "score": 22,
                    "author": "JustAboutLit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I had the money, I'd get strings in different colors and leave some on ALL THE TIME.\n\n\"What do you mean take them down? The red, white, and blue ones are on for President's Day!\"\n\n\"What do you mean take them down? The red and white ones are for Valentine's Day!\"\n\n\"What do you mean take them down? The green ones are on for St Patrick's Day!\"\n\n\"What do you mean take them down? It's almost Easter, and...\"",
            "score": 104,
            "author": "AtheistBibleScholar",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got diagnosed with cancer in early January and my (now) husband is afraid of heights so we didn't take our lights down this year. We DID unplug them so they stopped turning on at night. All our neighbors knew about my diagnosis (25F with colon cancer spreads like wildfire) so no one gave me a hard time. Once I was feeling well enough to get the lights down it was already September so no point taking them down.",
                    "score": 20,
                    "author": "mackpiano96",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, but that's for a scenario with good and cool neighbors, not ones that passive-aggressively leave a note accusing you of ruining Christmas. \n\nAlso, congrats on kicking cancer's ass!",
                            "score": 6,
                            "author": "AtheistBibleScholar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks!!! Yeah I lucked out when it comes to neighbors. They really were willing to help out as needed even though they're all retired. They all laughed with me when I joked about keeping them forever.",
                                    "score": 3,
                                    "author": "mackpiano96"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had an old buddy that was a car buff. He had the Chevy insignia on his roof in Christmas lights. He left them up year round",
                    "score": 5,
                    "author": "kmj420"
                },
                {
                    "level": 1,
                    "comment": "I'd have lights all the time for different occasions, too. Annoyingly, some of the stricter HOAs implement a set timeframe for when you can have Christmas lights and decorations. If you fail to take them down in time, you get put on the naughty list. Usually, they've got to be gone by New Years' or shortly after.\n\nAnother reason that I just want to buy a house on a regular-ass city street instead of in some gated community full of people with nothing better to do than annoy each other.",
                    "score": 2,
                    "author": "derpbynature",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "now my son's crying thanks a lot",
            "score": 431,
            "author": "Chickelope",
            "replies": [
                {
                    "level": 1,
                    "comment": "Must have seen the snowman I made. I forgot I had put a foot long snow dick on it",
                    "score": 77,
                    "author": "ChampionStrong1466",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why work so hard? Get a cucumber.",
                            "score": 23,
                            "author": "ColtS117",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's much better to work the dick than get a tool that makes it easier",
                                    "score": 4,
                                    "author": "MeunsterCheeseMan"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You've ruined his birthday/ first day at college/ naptime",
                    "score": 6,
                    "author": "madeupsomeone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Should totally put out one single light in protest.",
            "score": 57,
            "author": "johnguntherreinhold",
            "replies": [
                {
                    "level": 1,
                    "comment": "Big halogen spotlight to help illuminate the neighbor's house.",
                    "score": 16,
                    "author": "sunderthebolt",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Had something happen to me before. Neighbour went full force about this and I said I had family member pass away that year. Awkward how they had to walk back on what they said. I don’t even care about Christmas anymore",
            "score": 265,
            "author": "Dense_Relate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, my neighbor kept complaining about the leaves from my trees in the yard last week. She asked me to come talk to her about it. Normally I would say no, but I couldn't resist. I went out so she could see that I have a broken leg and I'm on crutches. She got really awkward and has not bothered me since.",
                    "score": 159,
                    "author": "LittleSqueesh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I went out so she could see that I have a broken leg and I'm on crutches. She got really awkward and has not bothered me since.\n\n**That would have been the perfect moment to say. Thank you so much for noticing my yard. As you can see I broke my leg and I am currently on these crutches, but you are more than welcome to be that awesome neighbor of mine and help clean up my leaves. Would you like me to open my garage and pull out the rake and leaf blower?**",
                            "score": 92,
                            "author": "HelloAttila"
                        },
                        {
                            "level": 2,
                            "comment": "😂 she didn’t even help you clean after all that?",
                            "score": 25,
                            "author": "Das-Noob"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep. People ruin Christmas. Honestly, was alone most of my life so I just honestly forget holidays are a thing. When I do though it's hardly ever a pleasant reminder",
                    "score": 7,
                    "author": "SecretOfficerNeko"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even if I had a big box of lights something like this would stop me from putting them up...",
            "score": 286,
            "author": "Lucifersasshole",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Anyone else read this in the Karen voice in their head?",
            "score": 243,
            "author": "doubleOhdorko",
            "replies": [
                {
                    "level": 1,
                    "comment": "I read it in the voice of what I imagine a female HOA associate/inspector would sound like.",
                    "score": 60,
                    "author": "Skye_fox223",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah so a Karen! 😜",
                            "score": 8,
                            "author": "TylerOsage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ofc, I just like organizing my Karens by category. You have the regular unhinged psychos, you have the methanies, you have the large and in charge, etc.",
                                    "score": 5,
                                    "author": "Skye_fox223"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": " I was hearing Click's voice parodying Karen's voice. So almost yes.",
                    "score": 4,
                    "author": "rhtashrut"
                },
                {
                    "level": 1,
                    "comment": "I like reading HOA letters in the voice of the HOA lady in Over The Hedge. Perfect tone and pitch",
                    "score": 3,
                    "author": "Zardu_Hasslefrau159"
                },
                {
                    "level": 1,
                    "comment": "I could hear the upward inflection at the end of each sentence…",
                    "score": 2,
                    "author": "WizdomHaggis"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s not that I don’t like Christmas lights. It’s that they’re a pain in the ass to put up and take down.",
            "score": 103,
            "author": "Karizmology",
            "replies": [
                {
                    "level": 1,
                    "comment": "Put them up and leave them up until next season see how they like that. Along with blow up Christmas decor.",
                    "score": 16,
                    "author": "zazoopraystar",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Or you dont even there during christmas. During holiday i went back to my parent house so there no reason for me to put up decoration",
                    "score": 1,
                    "author": "badstone69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone’s neighbor needs to mind his own business.  I doubt lights ever go up now.",
            "score": 34,
            "author": "Revolutionary_Eye887"
        },
        {
            "level": 0,
            "comment": "I would go to one of those places that does screen printing and stuff. Make a giant one of these and post that one your lawn. Just so everyone can see why you will never, ever ever put up lights",
            "score": 90,
            "author": "parkerm1408",
            "replies": [
                {
                    "level": 1,
                    "comment": "A small projector may be less effort and may or may not be more cost effective",
                    "score": 10,
                    "author": "Deus-Ex-Processus",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Put the christmas lights around the sign",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "That is pretty genius",
                    "score": 3,
                    "author": "Brains_For_peanut"
                },
                {
                    "level": 1,
                    "comment": "I'd print this out like 25 ft tall and put lights all over it!",
                    "score": 2,
                    "author": "OldFirefighter8287",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd put some adult themed lights after I got a note like that.",
            "score": 62,
            "author": "turbski84",
            "replies": [
                {
                    "level": 1,
                    "comment": "60ft light up cock on the lawn",
                    "score": 59,
                    "author": "Slow-Razzmatazz-4005",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That would be great",
                            "score": 7,
                            "author": "turbski84"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "LPT: using exclamations after each sentence makes every sentence equal, so none of them are exclaiming.\n\nAfter thought edit: OP should pull a homer simpson and just hang a ball of tangled Christmas lights in the window.",
            "score": 39,
            "author": "Muchablat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fun fact(?): The African Bushmen (you know - the ones from the movie \"The Gods must be crazy\") use an exclamation point in the english language to represent the click sound they make in their native language - according to Russell Peters anyway...\n\n...ok so I rambled a bit there but my point is that maybe every sentence has an exclamation point because \"they\" were *clucking/tut'ing* at the end of every sentence?\n\nDid any of that make sense?  I'm high.  ;)",
                    "score": 11,
                    "author": "Wise-Sense5782",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Color me impressed, someone else who knows \"The God's Must be Crazy!\" I upvoted you for that alone, but the fact you're a stoner makes it all the sweeter. 8-D\n\nEdited for typo, lest the English/Grammer police also get their panties in a twist...",
                            "score": 5,
                            "author": "R-Amitola"
                        },
                        {
                            "level": 2,
                            "comment": "I understood it 😊👍",
                            "score": 2,
                            "author": "Muchablat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "it's those damn phones",
            "score": 13,
            "author": "Dear_Negotiation2012"
        },
        {
            "level": 0,
            "comment": "What if you don't celebrate Christmas?",
            "score": 79,
            "author": "711straw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Festivus for the rest of us. The place I go to on Friday nights even has a metal pole.",
                    "score": 40,
                    "author": "Onlyroad4adrifter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You get a lap dance there as well?",
                            "score": 13,
                            "author": "ColtS117",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hold up, I'll ask my mom....",
                                    "score": 9,
                                    "author": "publicbigguns",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Our mum comrade.",
                                            "score": 2,
                                            "author": "Rhymer74"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don’t worry she didn’t forget to mention she also allows lights from other faiths, in one of the last sentences. Glad my Hanukkah lights will be up to par with her requirements",
                    "score": 28,
                    "author": "skitz_shit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What about non-religious people?",
                            "score": 7,
                            "author": "LittleSqueesh"
                        },
                        {
                            "level": 2,
                            "comment": "Why is the genderless type on a piece of paper a “she”? We have no indication of the sex of the person who wrote this letter. Are women the only ones who make ridiculous complaints like this? The word “they” exists perfectly for a situation like this. There is zero need to gender this.",
                            "score": -41,
                            "author": "Draxilar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oops… I wasn’t saying she to insinuate anything like that. Just picked she and went with it, just as easily could’ve been he. You’re getting way too worked up over one little word my friend, it’s not that deep I promise you",
                                    "score": 17,
                                    "author": "skitz_shit"
                                },
                                {
                                    "level": 3,
                                    "comment": "Cuz, it feels like it was written by a she",
                                    "score": 10,
                                    "author": "Buttben8",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "You must be a blast at parties.",
                                    "score": 8,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "My question: does calling the person a she do any harm at all to anybody ever? No, it doesn't. It doesn't matter. They made themselves anonymous because they were a fucking coward, so we can assume what we want",
                                    "score": 3,
                                    "author": "Lynthos00"
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't know whether to upvote in moral agreement or downvote because of annoyance.",
                                    "score": 1,
                                    "author": "CoffeeTableStudios",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m just trying to point out the word “they” exists so we don’t have to assign a gender to a place where none are needed.",
                                            "score": -26,
                                            "author": "Draxilar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "or we could focus on more important problems of our society rather than pointless stuff",
                                                    "score": 10,
                                                    "author": "Snakise",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You know people can focus on more than one thing right? Doing something that is helpful and doesn’t unnecessarily associate a specific gender with “crazy” behavior doesn’t preclude you from doing anything else about other issues. The fact that you think that is pointless is a bit sad.",
                                                            "score": -8,
                                                            "author": "Draxilar",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "No. \nThey means two or more people. \nIt only recently has been appropriated by LGBTQ community. \nIf you don't want to assign a gender, correct word to use is \"it\".\nObviously that would offended a lot of people.",
                                                    "score": -5,
                                                    "author": "PaisaLover",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is categorically not true.  I was taught in the early 90s that “they” is an acceptable pronoun when you don’t know if Aaron or Erin is a guy or a woman.  English doesn’t have a royal academy of grammatical standards like Spanish.  People change the rules all the time.",
                                                            "score": 1,
                                                            "author": "DrSlaggathor"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Holy, someone's panties are in a twist.",
                                    "score": 2,
                                    "author": "S_204"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ehhh, not buying this one.",
            "score": 95,
            "author": "Bokbokeyeball"
        },
        {
            "level": 0,
            "comment": "That's some audacity right there",
            "score": 26,
            "author": "PrimearchClaire"
        },
        {
            "level": 0,
            "comment": "Oh yeah, I’m sure if they put up lights celebrating Ramadan the person who wrote this would be 100% on board",
            "score": 24,
            "author": "thepluralofmooses"
        },
        {
            "level": 0,
            "comment": "Fun fact: three bucks IS expensive for some people.",
            "score": 23,
            "author": "MilkCool",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where's the fun here? Is it in the welfare check that I need to pay for rent?",
                    "score": 2,
                    "author": "S_204"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d be like, sure, I’d be happy for you to buy and put up lights for me and then take them down after. Don’t be a grinch. Put up my lights!",
            "score": 8,
            "author": "Dark_Booger"
        },
        {
            "level": 0,
            "comment": "You disappointed the 40 year child that throws tantrums still",
            "score": 18,
            "author": "roughneck78show"
        },
        {
            "level": 0,
            "comment": "This would immediately go in the trash",
            "score": 6,
            "author": "RealisticAd2293"
        },
        {
            "level": 0,
            "comment": "You've ruined Christmas. Thanks Marie Calendar",
            "score": 5,
            "author": "Grimm221b"
        },
        {
            "level": 0,
            "comment": "\"Remember,there is still time.\"\n\nGreat. Get to the discount store and buy some cheap ass led Christmas lights. Get to the liquor store and buy a bottle of cheap ass booze. Get home,and kill time until dusk drinking booze. Get drunk, naked and wrap yourself in the Christmas lights. Run out onto front lawn and do slow Interpretive dance to the song \"I saw Mommy kissing Santa Claus\". Scream out \"Here's the lights  ya wanted Karen! I threw in a couple of shiny baubles for you as well.\"",
            "score": 13,
            "author": "icedragon71"
        },
        {
            "level": 0,
            "comment": "The epitome of audacity. Wow!",
            "score": 12,
            "author": "Michael_Misanthropic"
        },
        {
            "level": 0,
            "comment": "If I had to fabricate a letter it would be exactly this",
            "score": 12,
            "author": "bunga7777",
            "replies": [
                {
                    "level": 1,
                    "comment": "But this includes a humbug sticker. Gotta be authentic.",
                    "score": 3,
                    "author": "Dark_Booger"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh no!! Anyways",
            "score": 3,
            "author": "NethrixTheSecond"
        },
        {
            "level": 0,
            "comment": "'Scrooge' the grinch doesn't say \"humbug\"....\n\n\nPfft amateur.  next thing know Cindy luwho says \"god bless us everyone\"",
            "score": 5,
            "author": "Dorlinos"
        },
        {
            "level": 0,
            "comment": "Literally not everyone celebrates Christmas for a multitude of reasons and this person has no idea what’s going on in their neighbors life to assume why they didn’t put lights up",
            "score": 7,
            "author": "cantbesohelpmenotbe"
        },
        {
            "level": 0,
            "comment": "I would put up my Menorah lights",
            "score": 3,
            "author": "DinklePhone"
        },
        {
            "level": 0,
            "comment": "I live peaceful and private. I'm friendly in the street and all but for 22 years here I have never told or even nicely suggested a neighbor \"do something\" for any reason.\n\nYou know why?\n\nBecause it's THEIR FUCKING HOME AND THEY PAY FOR IT.\n\nKaren needs to run the bath and get to know herself.",
            "score": 3,
            "author": "Sudden-Reflection456"
        },
        {
            "level": 0,
            "comment": "Whenever people do stuff like this I like to make up the most outrageous lie I can think of to make them feel bad for not minding their business and teach them a lesson that the world doesn't revolve around them. In this circumstance I would tell this neighbour I have epilepsy and the sight of flashing lights could trigger me and put me in danger every time I enter my driveway. Or I would tell them my family had a home invasion happen on Christmas which is why I don't celebrate the holidays. Idk it isn't true for me but it could be for others so lesson learned don't bother other people because you never know.",
            "score": 3,
            "author": "Dr_Fluffybuns2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Time to pull everyone’s lights down when they’re sleeping",
            "score": 11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The note did say you're now the Grinch. Time to steal until you learn a lesson.",
                    "score": 14,
                    "author": "unlistedname",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Better get those cholesterol levels up so you can grow that heart",
                            "score": 2,
                            "author": "simpkill"
                        },
                        {
                            "level": 2,
                            "comment": "OP should steal everyone else’s and hang them all on their own house.",
                            "score": 2,
                            "author": "SpankMyBumBum69",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re in the USA it’s your European neighbor",
            "score": 4,
            "author": "FoodFarmer"
        },
        {
            "level": 0,
            "comment": "All these freaks bordering into being psychos who dedicate hours of their lives to survey what other people does with their lives, never seem to sing their letters, how odd taking on account how full of themselves they are.",
            "score": 2,
            "author": "Amadis_of_Albion"
        },
        {
            "level": 0,
            "comment": "Tis the season to mind your own business.",
            "score": 2,
            "author": "Martyrotten"
        },
        {
            "level": 0,
            "comment": "Get two ow the brightest LED Lights you can and aim right at his house with green and red color over them, just right in their window.",
            "score": 2,
            "author": "sogiotsa"
        },
        {
            "level": 0,
            "comment": "Taken straight from Christmas with the Kranks?",
            "score": 2,
            "author": "wheninhfx"
        },
        {
            "level": 0,
            "comment": "I would send them my light bill and see if they’d like to pay it too",
            "score": 2,
            "author": "eatcurlyfries"
        },
        {
            "level": 0,
            "comment": "This is ridiculous.  The holidays can a very emotional time for people for many reasons.  Not everyone wants to slap on a smile and hang lights.  This would be like salt in a wound if you were already having a difficult time getting through the season.",
            "score": 4,
            "author": "AD480"
        },
        {
            "level": 0,
            "comment": "I wish someone would try to put something like this on my door. I have 7 Chow Chows that are getting tired of the taste of jehovahs witness. HOA would be a good switch in flavor for them.",
            "score": 3,
            "author": "ChampionStrong1466"
        },
        {
            "level": 0,
            "comment": "This is why I can’t stand Christmas especially the people who love Christmas like their children still",
            "score": 5,
            "author": "Almost-Honest"
        },
        {
            "level": 0,
            "comment": "You big Funsucker!",
            "score": 2,
            "author": "Educational-Spread41"
        },
        {
            "level": 0,
            "comment": "Haha. My family doesn't celebrate a lot of holidays, we're all atheist commies, and I never considered putting up holiday decorations as a result.\n\nIf I got this letter, I'd be tempted to do something strange or weird. Just for fun. Like put up Independence Day decorations on Christmas. Pretend like I don't understand the concept each time, say next year I'll get right. Then just put up like Valentines Day stuff the following year.",
            "score": 2,
            "author": "Dubious_Titan"
        },
        {
            "level": 0,
            "comment": "Remember to tell them to decorate their house on Pride month. An LGBTQIA+ flag isn't expensive.",
            "score": 1,
            "author": "jakob767",
            "replies": [
                {
                    "level": 1,
                    "comment": "Funnily enough, they put “show your pride” near the bottom and op should put up light in a pride flag pattern and send a note saying “ok, I showed my pride”",
                    "score": 4,
                    "author": "HBenderMan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh... Well I just don't expect them to be the type to celebrate Pride month, which then would be quite hypocritical of them.",
                            "score": -1,
                            "author": "jakob767",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don’t know this could very easily be limousine liberal stuff. They even talk about cost in this, but only to handwave it away.",
                                    "score": 1,
                                    "author": "Mudderway"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't celebrate Xmas",
            "score": 1,
            "author": "Infinite-Watch-6419"
        },
        {
            "level": 0,
            "comment": "You must comply",
            "score": 1,
            "author": "d3athdr0ne"
        },
        {
            "level": 0,
            "comment": "Now I may be petty, but I would put up the trans and pride flag in lights, then also a giant middle finger in my front yard, if they want light they will get them, but not the kind that want.",
            "score": -2,
            "author": "Cedar_Pumpkin"
        },
        {
            "level": 0,
            "comment": "Bro I think this is straight up fascism.",
            "score": -3,
            "author": "yamahadodger"
        },
        {
            "level": 0,
            "comment": "Put up the damn lights lol",
            "score": -46,
            "author": "Comfortable-Twist-54",
            "replies": [
                {
                    "level": 1,
                    "comment": "Put the damn lights up yourself 🤷🏻‍♂️😂",
                    "score": 11,
                    "author": "Nuclear1975"
                },
                {
                    "level": 1,
                    "comment": "Not everyone wants to decorate their house for the holidays. That doesn't mean they're a Grinch or a Scrooge.",
                    "score": 6,
                    "author": "ReesesBees"
                },
                {
                    "level": 1,
                    "comment": "Not everyone celebrates Christmas.",
                    "score": 3,
                    "author": "NOMUMON",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gather up couple hundred pounds of dog crap and leave it on Karen's porch.",
            "score": 1,
            "author": "coocoocachoo699"
        },
        {
            "level": 0,
            "comment": "I bet this guy doesn't put up decorations for Eid",
            "score": 1,
            "author": "soi_boiiiiiiiiiiii"
        },
        {
            "level": 0,
            "comment": "Counterpoint: if you want Christmas lights up, why don't you pay for them yourself and decorate their property yourself, oh letter writer? Smh",
            "score": 1,
            "author": "Padamson96"
        },
        {
            "level": 0,
            "comment": "I don’t usually tell people to worship satan, but if you can find the right lights to get the mood right……",
            "score": 1,
            "author": "Willing_Pension"
        },
        {
            "level": 0,
            "comment": "This would make me want to not put up lights.",
            "score": 1,
            "author": "apersonthingy"
        },
        {
            "level": 0,
            "comment": "Put up Christmas lights next year\n\nAnd have them spell out \"Are you happy now\"",
            "score": 1,
            "author": "Sweetexperience"
        },
        {
            "level": 0,
            "comment": "Lol same people that call the cops when they see a homeless person walking down their street. Help the unfortunate my ass!",
            "score": 1,
            "author": "shardamakah"
        },
        {
            "level": 0,
            "comment": "Bloody cheek.",
            "score": 1,
            "author": "johnsgrove"
        },
        {
            "level": 0,
            "comment": "Exclamation marks are suppose to convey strong feelings, they lose their grammatical impact when they are overused to this degree.\n\nThey should have spent more time in English class and less on perfecting their Karen impersonations.",
            "score": 1,
            "author": "Zodiac_NZL"
        },
        {
            "level": 0,
            "comment": "A letter like that would make me less motivated to put up lights",
            "score": 1,
            "author": "chugchugz"
        },
        {
            "level": 0,
            "comment": "I mean if it's that easy and inexpensive why don't you buy me the lights and hang them up yourself if your so pressed you have to make a whole letter for it.",
            "score": 1,
            "author": "Everleigh_core"
        },
        {
            "level": 0,
            "comment": "I’d be so pissed if I got this letter. Only because I’m planning to decorate and do it big outside next year, and I wouldn’t want them to think they had anything to do with it. My husband and I have both either been sick or insanely busy since before Thanksgiving, and at this point, we won’t be able to get to until next weekend. I don’t feel like doing all the work of decorating and then having to take it right back down.",
            "score": 1,
            "author": "Advanced_Nerve_7602"
        },
        {
            "level": 0,
            "comment": "Why don't you buy me some?",
            "score": 1,
            "author": "2007FordFiesta"
        },
        {
            "level": 0,
            "comment": "Put this in a frame and hang it on your front door with LED lights around the frame.",
            "score": 1,
            "author": "fuzzymonkey"
        },
        {
            "level": 0,
            "comment": "Just get one of those inflatable snowmen decorations with a dick and balls made out of a carrot and snowballs",
            "score": 1,
            "author": "dumbbunny-"
        },
        {
            "level": 0,
            "comment": "Shame on you for not helping the energy crisis!\nOne of us, one of us!",
            "score": 1,
            "author": "ThatSweetCoffee"
        },
        {
            "level": 0,
            "comment": "Somehow find a way to do a singular light. Or maybe 2 individual lights that way technically it's plural.",
            "score": 1,
            "author": "gunnbee02"
        },
        {
            "level": 0,
            "comment": "Just put 1 singular led",
            "score": 1,
            "author": "Martin_crakc"
        },
        {
            "level": 0,
            "comment": "Ok, so now time to show your pride with the colors red and black, then put up lights for the other faith of Luciferianism. Laminate and post that letter in front of the street.",
            "score": 1,
            "author": "Azzpirate"
        },
        {
            "level": 0,
            "comment": "I would simply say I'm an atheist and don't celebrate any religious holidays. Any further comments would be harassment on the part of the author of the letter.",
            "score": 1,
            "author": "120m256"
        },
        {
            "level": 0,
            "comment": "Now put them up in march and run them until Thanksgiving.",
            "score": 1,
            "author": "AntoKrist"
        },
        {
            "level": 0,
            "comment": "Add lamps that make your house look like a red light district. See if he still likes Christmas lights",
            "score": 1,
            "author": "The-Fumbler"
        },
        {
            "level": 0,
            "comment": "I’d hope the next letter is “Please rearrange the lights to not make a middle finger” or to say they can be taken down.",
            "score": 1,
            "author": "Ellereind"
        },
        {
            "level": 0,
            "comment": "Maybe they are not christan and don’t celebrate Christmas ? Maybe mind your own fkin business",
            "score": 1,
            "author": "Demonboy995"
        },
        {
            "level": 0,
            "comment": "Put up a big middle finger led that points to her house. I'm sure the community would love to see it!",
            "score": 1,
            "author": "TheRealMylo"
        },
        {
            "level": 0,
            "comment": "Damn that's when u get some of those long lines and spell out piss off with your leds...",
            "score": 1,
            "author": "UltraHawk_DnB"
        },
        {
            "level": 0,
            "comment": "A Santa on the roof with an empty liquor bottle with a string light of pee and I’d call it a job well done",
            "score": 1,
            "author": "New_Restaurant_6093"
        },
        {
            "level": 0,
            "comment": "And here you are on your damn device, not putting up lights!",
            "score": 1,
            "author": "13aph"
        },
        {
            "level": 0,
            "comment": "You should write them back that if you're the Grinch, you will make sure everyone's stuff is stolen and thrown to a nearby mountains so they can't have fun during Christmas",
            "score": 1,
            "author": "Todd_Renard_Fox"
        },
        {
            "level": 0,
            "comment": "cult neighborhood",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Ask them to buy you Christmas lights as a present for Christmas to use the following year.",
            "score": 1,
            "author": "RealisticTax2871"
        },
        {
            "level": 0,
            "comment": "Why did I read this in a Karen voice 😂",
            "score": 1,
            "author": "julsbvb1"
        }
    ]
}