{
    "id": "zmae2n",
    "score": 770,
    "title": "Package delivered",
    "author": "ABKB",
    "date": 1671073369.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/zmae2n",
    "media_urls": [
        "https://v.redd.it/qvq56wta9z5a1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "That should be an easy crook to find",
            "score": 96,
            "author": "ToastyWoasty",
            "replies": [
                {
                    "level": 1,
                    "comment": "I saw a comment on another post like this, from an Amazon driver. They said that sometimes the drivers pull up to the wrong house accidentally, and there’s something about their scanner that tells them what house they’re at when they scan the package. So most of these videos just show Amazon drivers at the wrong house, where they don’t realise it until they’ve scanned the package. Then they gotta grab the package back and deliver it to the right house. It makes a lot more sense than to assume that these drivers are gonna risk it all for what could potentially be a pair of socks.",
                    "score": 95,
                    "author": "Blood_sweat_and_beer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm an Amazon driver this is definitely what happened she went to mark it delivered and snap the pic and the geo fence told her she was at the wrong location. Those trucks have cameras inside and out. And even if a driver were to try to steal something they literally check our vans inside and out when we get back",
                            "score": 41,
                            "author": "Ill_Difficulty_1075"
                        },
                        {
                            "level": 2,
                            "comment": "Ahhh very true. That does make sense!",
                            "score": 18,
                            "author": "ToastyWoasty"
                        },
                        {
                            "level": 2,
                            "comment": "Then I don’t understand why this person posted this video if they weren’t expecting a package at all??",
                            "score": 3,
                            "author": "SRKFRIES",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For views",
                                    "score": 4,
                                    "author": "DependentCranberry82",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ur right",
                                            "score": 1,
                                            "author": "SRKFRIES"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s the wrong house when they tried taking a photo it won’t let you since it’s based on the location",
            "score": 4,
            "author": "Carhelp2222"
        },
        {
            "level": 0,
            "comment": "If these guys have low skill jobs already and can’t help themselves from stealing, do they end up living on the subway cars? I can’t help but think you’re basically screwed at that point in life.",
            "score": 22,
            "author": "JackalopeZero"
        },
        {
            "level": 0,
            "comment": "How do these get tracked and punished. There are so many vids like this.",
            "score": 17,
            "author": "Kirris",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's just a driver realizing they're at the wrong house.",
                    "score": 8,
                    "author": "Jake0024",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s funny because I can see it now. She snaps the pic and for half a sec starts to walk away and turns to grab it .",
                            "score": 2,
                            "author": "United_Falcon8183"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Every single route and stop is tracked using their app, i don’t think it would be hard too see a string of missing packages along a certain route and narrow down who’s doing it",
                    "score": 21,
                    "author": "palindrom_six",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it would be rather obvious. They have to scan those packages with their own device/app. That's got every package scanned linked to their employee ID. So if The Big A get's a bunch of missing packages linked to one specific employee...",
                            "score": 6,
                            "author": "treoni"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cutting out the middle man, sad porch pirate noises",
            "score": 9,
            "author": "RainbowBier"
        },
        {
            "level": 0,
            "comment": "Do none of these people realize that a lot of people have cameras now.",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s because they realized they were at the wrong place, when they go to scam it their device tells them they are not at the right house, people often post these vids for views",
                    "score": 2,
                    "author": "LLoadin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or they take the picture of the drop off and then take the package for themselves.",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There’s a small problem with that, that being packages are tied to the drivers ID, and not to mention the cams in the trucks, they’d get caught the second they get back. Why would someone even risk it for what could easily be playdough?",
                                    "score": 3,
                                    "author": "LLoadin"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s what I was thinking, a lot of people that ordered in Amazon had ring cameras 🎥",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This stuff really makes me sick.",
            "score": 0,
            "author": "Nightcrawler227"
        },
        {
            "level": 0,
            "comment": "That’s like the 4th different ones of these I’ve seen in 24 hours. Is it happening more frequently now?",
            "score": 0,
            "author": "throwawaytrash6990"
        },
        {
            "level": 0,
            "comment": "God people are dumb - HELLO SEE THE CAMERA!?!?",
            "score": -1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Wow that's dirty af",
            "score": -2,
            "author": "ElvenJustice"
        },
        {
            "level": 0,
            "comment": "I’m seeing this more often and hearing how Amazon isn’t doing anything about it.",
            "score": -1,
            "author": "valkate_d",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s the wrong house. He tried taking a photo but realized it was the wrong location since you can’t take a photo since it’s based on your location",
                    "score": 2,
                    "author": "Carhelp2222"
                }
            ]
        }
    ]
}