{
    "id": "zq4kgu",
    "score": 3989,
    "title": "A former Colorado police officer gets 5 years in prison after rough arrest of woman with dementia. But there is more to it. Just watch.",
    "author": "botcraft_net",
    "date": 1671486343.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/zq4kgu",
    "media_urls": [
        "https://v.redd.it/fb0sdaz9dx6a1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "This is heartbreaking. How can you be so twisted to laugh at this with your buddies like it's nothing?",
            "score": 654,
            "author": "dahoudinho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because cops exclusively and proudly only hire psychopaths and sociopaths. Having a conscious and morals is the only disqualification",
                    "score": 390,
                    "author": "admiralrico201",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And an IQ above average. Seriously",
                            "score": 108,
                            "author": "Hungry_Elk_9434",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was a last of disqualifications you were adding to. You were correct the first time. An above average iq is a disqualification.",
                                    "score": 28,
                                    "author": "DarkRider89"
                                },
                                {
                                    "level": 3,
                                    "comment": "Iq below*",
                                    "score": 16,
                                    "author": "Mattermaker7005and8",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes. Thank you",
                                            "score": 10,
                                            "author": "Hungry_Elk_9434"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m actually starting to believe that they give cops psych evals and then if the fail they actually pass",
                            "score": 16,
                            "author": "No-Friendship-3723"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It surely makes me angry the way they were joking about pop. 😔😔",
                    "score": 28,
                    "author": "Halceon441",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Afew years before the George Flyoid case there was a very similar one where some cops pinned a guy down for something like 13 minutes. Man was crying and having mental issues and they laughed about it up until the paramedics came and told them no... he's not sleeping. The man died.",
                            "score": 7,
                            "author": "Glint6411"
                        },
                        {
                            "level": 2,
                            "comment": "Can't even imagine if that was my mother or grandmother. Seeing the way they joked about it afterward. I'd lose my goddamn mind.",
                            "score": 5,
                            "author": "FlaccidBuddah",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Typical cop behaviour. You'll find this sort of thing everywhere. I recall reading a blog post about an ex-cop who quit because of this exact behaviour, and then there was that whole news report of a cop being beaten to death by his fellow cops in a \"\"training accident\"\" because he reported them for raping a suspect. Truly, good cops don't exist because the good ones either quit or get killed.",
                    "score": 19,
                    "author": "parkwatching"
                },
                {
                    "level": 1,
                    "comment": "\"did you hear the pop\" They're so casual about it",
                    "score": 5,
                    "author": "One_Paleontologist59"
                },
                {
                    "level": 1,
                    "comment": "You would be surprised. It isn’t just cops though they are some of the worst. There are many people like this in general. Most people do not have good intentions. \n\nSome Paramedics will make jokes about victims and patients for conditions and situations, military members will make jokes about war crimes, even office workers will choose someone to harass.\n\nThere are a lot of twisted individuals out there and some of them are closer than you would think.",
                    "score": 4,
                    "author": "Jesterzoop",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "We call those types **Corrupt Cops.**",
                    "score": -7,
                    "author": "Queen_Asuka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We call those types **Typical Cops** in the US.",
                            "score": 44,
                            "author": "Vibrantmender20",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Who is the dude who asked for his info. Dudes a hero. I doubt this woulda seen the light if he hadn't said anything.",
            "score": 130,
            "author": "disisdashiz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe a social worker?",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "We don't play this game. UNDERSTAND ME?!\n\nWow, congrats, you beat up an old lady big guy.",
            "score": 290,
            "author": "AnonTheRabbitGod",
            "replies": [
                {
                    "level": 1,
                    "comment": "He will have plenty of games to play in prison. Grandma beating cops are pretty high on the “kill on sight” list.",
                    "score": 47,
                    "author": "Super_Discipline7838",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately he’ll get housed with the rest of the undesirables, like the pedophiles, and, believe it or not, other law enforcement officers that have been sent to prison. Those prisoners don’t typically go into gen pop for the very reason of “they won’t last more than a week”.",
                            "score": 27,
                            "author": "Bbaftt7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow Sounds almost like the entire prison complex is a broken concept",
                                    "score": 3,
                                    "author": "UnclePuma",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What’s the kill list order? pedophiles are #1 rapists #2 then cops who beat up the elderly #3?",
                            "score": 3,
                            "author": "memento_mori_1220",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Those officers need to be locked up for life",
            "score": 47,
            "author": "Odd-Engineering-3582"
        },
        {
            "level": 0,
            "comment": "This was in Loveland, CO a city close to where I live when this first surfaced there was another video of the same officer who made this arrest rewatching the body cam footage and laughing with other officers. I think they broke her arm too if I'm not mistaken as well.... truly disgusting.",
            "score": 380,
            "author": "Vyrysyko",
            "replies": [
                {
                    "level": 1,
                    "comment": "The footage of them laughing is at the end of this video. Truly disgusting",
                    "score": 199,
                    "author": "herbloodyvalentine"
                },
                {
                    "level": 1,
                    "comment": "I was born in ft Collins and grew up in Longmont in the 60's and 70's. Cops didn't act like that back then. Idk what is wrong with the people they get to \"serve and protect\" these days. I'm a Gulf war vet and to watch people with authority act like punks makes me sick.",
                    "score": 51,
                    "author": "lickmastrr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They absolutely did act like this back then. They’ve gotten away with it all this time because there was no accountability. Cameras are the ultimate witness.",
                            "score": 79,
                            "author": "True_Reception1834",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly, \"Cops didn't get **caught** acting like...\". That's what people who get misty eyed for the golden days forget: just because it didn't infiltrate your little tiny bubble doesn't mean it didn't happen.",
                                    "score": 34,
                                    "author": "Ceb1302",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was never Andy Griffith Show in real life people.",
                                            "score": 11,
                                            "author": "clonedspork"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Unfortunately it's not that it didn't happen back then. I'm afraid that it's more a \"wasn't caught\" thing.\n\nWith the massive rise of personal communication devices, CCTV and so on America is steadily getting aware that it's police forces have been doing this stuff for awhile and getting away with it.\n\nWhich makes them very good at covering it up and very good at backing each other up. Plus they all think it's normal because that's a lot of the culture.\n\nI am sure there are good cops but just like is happening worldwide with the police forces we are now being made aware of the bad cops and cop culture.",
                            "score": 31,
                            "author": "BastK4T",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I really wish there'd be a military versus police smack down with the former teaching the latter what discipline actually means.",
                            "score": 8,
                            "author": "Experienced_AP",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Amen. I've been saying that for years.",
                                    "score": 5,
                                    "author": "lickmastrr"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sounds about right for loveland",
                    "score": 3,
                    "author": "rydogthekidrs"
                },
                {
                    "level": 1,
                    "comment": "Colorado is such a beautiful place and there are a lot of things to enjoy about living there. For some reason though the cops there are more monstrous than usual.",
                    "score": 3,
                    "author": "Forcedcontainment",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Did u really just comment without watching the video fully? Lol",
                    "score": 2,
                    "author": "Key-Regular674"
                },
                {
                    "level": 1,
                    "comment": "Time for people to stand up and do something this is ridiculous! I’ve lost respect for cops definitely! When I was little I wanted to be one",
                    "score": 3,
                    "author": "NotasheepLOL"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This breaks my heart.  This is someone’s mother for gods sake.",
            "score": 332,
            "author": "Icy_Western_1174",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;This is someone’s mother\n\nNah, this is someone and that's value enough to be heartbreaking.",
                    "score": 131,
                    "author": "Even_Title_908",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fr, this is a disgusting way to treat a human being",
                            "score": 31,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, she had family. Granted, having dementia you do all sorts of things you shouldn't like she basically \"stole\" $14 worth of goods from a store, so that's why police were after her. But it surely doesn't legitimize this sort of assault on her.",
                    "score": 208,
                    "author": "botcraft_net",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well in the US they really only exist to protect and serve private property interests.\n\nIt's a feature not a bug.",
                            "score": 62,
                            "author": "lefkoz",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Oh There is more to the story.\n\nThe woman accidentally stole the goods from the store. When the store questioned her, she apparently apologized and put the good back and walked away. This POS deserves Prison.",
                            "score": 26,
                            "author": "ZiOnIsNeXtLeBrOn",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "As I recall, when confronted by Walmart employees she left without the \"stolen\" items. So no harm was done.",
                            "score": 6,
                            "author": "ElvenJustice"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That doesn’t even matter! She’s a human being, period.",
                    "score": 23,
                    "author": "Substantial-Canary15"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unbelievable. I was a police officer for 10 years and officers like this is the biggest reason I left the profession.",
            "score": 48,
            "author": "jbooch_263",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's the comment I was looking for. Thank you.",
                    "score": 20,
                    "author": "botcraft_net"
                },
                {
                    "level": 1,
                    "comment": "Yup you are the only type of good cop",
                    "score": 2,
                    "author": "TheNightHaunter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The woman was 73. And the guy was facing 10 to 30 years in prison. Was lucky to get away with just 5. While in detention, she was left without any help with a broken arm, sprained wrist, and a shoulder injury. She received a compensation of $3m.\n\nBut there is still more to it. Tell me what shocked you the most.",
            "score": 205,
            "author": "botcraft_net",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 85,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, the shocking thing is that they faced any consequences at all.",
                            "score": 23,
                            "author": "MidwestBushlore"
                        },
                        {
                            "level": 2,
                            "comment": "Being an old white guy I agree wholeheartedly with your 2nd paragraph, I always gave the cops the benefit of the doubt. Not anymore.",
                            "score": 1,
                            "author": "ras_1974",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m most shocked that the surveillance videos were sought after and available.",
                    "score": 23,
                    "author": "MorddSith187"
                },
                {
                    "level": 1,
                    "comment": "Cops should always face maximum penalty minimum",
                    "score": 29,
                    "author": "admiralrico201"
                },
                {
                    "level": 1,
                    "comment": "What shocks me is that she lived after charges were filed. Cops kill to protect that wall of silence.",
                    "score": 29,
                    "author": "Brilliant_Shine2247",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They had to have figured out she was a demented old lady by then, so I'm sure they thought no one would listen to her.",
                            "score": 2,
                            "author": "JohnWithAnUhh",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's literally in this video bro",
                            "score": 15,
                            "author": "shents1478",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Whoops I was at work so I didn’t play the audio",
                                    "score": 3,
                                    "author": "ohio_guy_2020",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It has subtitles.",
                                            "score": 1,
                                            "author": "Even_Title_908"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "just press play",
                            "score": 1,
                            "author": "stolid_agnostic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Whoops. My bad bruh",
                                    "score": 3,
                                    "author": "ohio_guy_2020",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I had heard about this happening, but didn't actually see the videos prior. Pretty sickening, glad they got what was coming.",
                                            "score": 2,
                                            "author": "stolid_agnostic"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I am shocked that the officer didn’t get payed vacation",
                    "score": 2,
                    "author": "Fit_Lengthiness_1666"
                },
                {
                    "level": 1,
                    "comment": "I’m shocked the camera recordings didn’t “accidentally” get deleted",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "im shocked the cameras were on at all",
                    "score": 2,
                    "author": "habb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "5 years isn't long enough",
            "score": 14,
            "author": "games_and_coffee"
        },
        {
            "level": 0,
            "comment": "I hope the other inmates don’t figure out who he is lol.",
            "score": 64,
            "author": "Euphoriffic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait until he’s locked up. His location will be Public information on the BOP website. Find out where he is and as a concerned citizen, mail in the printed pages to 15 or 20 guys that are in the same prison. Word will get around.",
                    "score": 26,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "...yeah, that would be a real shame. \n\nApropos of nothing, I wonder if the pokey he's going to has a pen pal program...",
                    "score": 17,
                    "author": "SturdyBeard"
                },
                {
                    "level": 1,
                    "comment": "Cops in prison don't go with general population, do they?",
                    "score": 9,
                    "author": "abuomak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, generally(no pun intended) they do not. \n\nThey go to prisons with prisoners that are non-violent or are also social pariahs like pedophiles",
                            "score": 5,
                            "author": "Bbaftt7"
                        },
                        {
                            "level": 2,
                            "comment": "Not for long lol",
                            "score": 10,
                            "author": "Euphoriffic"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is sad to watch",
            "score": 13,
            "author": "apachetrainer"
        },
        {
            "level": 0,
            "comment": "$3,000,000 isn’t enough. Around the clock care isn’t cheap.",
            "score": 43,
            "author": "pawesome_Rex",
            "replies": [
                {
                    "level": 1,
                    "comment": "No money is enough. Yeah, 3m will help the family with care and such, but after what they did, it may as well be a box of bottle caps. No money can undo what they did or clean up their evil bullshit. Again, the money is nice for the family, sure. But I'd never ever get past being sick over what was done to my loved one. I'd probably spend a chunk of that cash sabatoging those cops' personal lives if I could.",
                    "score": 15,
                    "author": "AnEgoJabroni",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Completely unrelated but a box of bottle caps would work well in the event of a nuclear apocalypse",
                            "score": 2,
                            "author": "Str3eters",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would like to be sworn in to arrest these shits, with as much force as the made her feel. Then sit them in a cell for as long as she was with her injuries untreated. The mental pain of dementia plus all that physical pain she had to go through. My god I’m raging… then you show us them laughing about it, ZERO pity for them.",
            "score": 22,
            "author": "BongoFett17",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know exactly what you mean. My dad has dementia and my grandma passed away in 2013 from it. It was awful. My dad has been a carpenter his whole life and built houses, shops, and businesses from the ground up. And now he doesn’t even know what a tape measure is or how to use it. It kills me. And if someone treated him like this, laughing about cracking his shoulder out of place while he sits alone in a cell, confused? I would make it my life’s mission to ruin theirs.",
                    "score": 3,
                    "author": "CashAlternative7911",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My dad died in 2019 from Alzheimer’s. He was only 74. He was doctor. He went through the same thing your dad is going through. Watching him know there’s something very wrong with him, but not being able to do anything about it, the helplessness, it was the worst part. \n\nIf this had happened to him, I’d have been the one that ended up in prison.",
                            "score": 3,
                            "author": "Bbaftt7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Average cop behavior",
            "score": 8,
            "author": "AndTheRestIsGay"
        },
        {
            "level": 0,
            "comment": "Watch all 3 cops get hired at another station, probably Aurora.",
            "score": 8,
            "author": "AtomicBlastCandy"
        },
        {
            "level": 0,
            "comment": "Cops are really tough when attacking old ladies.  Not so much when it comes to saving schoolchildren from a shooting.",
            "score": 8,
            "author": "Martyrotten"
        },
        {
            "level": 0,
            "comment": "When a person is as old as this women, a simple fall could mean the death of her. For them to joke and laugh about dislocating her arm, it’s disgusting. They are really pieces of shits",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Just so everyone is clear.  This is what all cops do. You are a joke to them and they frame you whenever they can. ACAB.",
            "score": 16,
            "author": "Elman103",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I’m shocked they even got in trouble at all",
                    "score": 5,
                    "author": "MorddSith187",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sad thing is without the title, without the audio, you know it’s America. Always America.",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "THIS is what Defund the Police is talking about",
            "score": 5,
            "author": "SaltyboiPonkin"
        },
        {
            "level": 0,
            "comment": "Yet another coward pig trying to compensate for having a micro cock.",
            "score": 19,
            "author": "hardrocker943"
        },
        {
            "level": 0,
            "comment": "5 years wow. I need to look this up bc I doubt he’s actually going to spend time in prison. He could’ve shot a guy and got paid admin leave",
            "score": 19,
            "author": "FinalVegetable6314"
        },
        {
            "level": 0,
            "comment": "Ugh American police always seem to be on a power trip.",
            "score": 5,
            "author": "Vast-Grass-6216"
        },
        {
            "level": 0,
            "comment": "That guy that said he wanted the supervisor is a fucking CHAD",
            "score": 4,
            "author": "erichw23"
        },
        {
            "level": 0,
            "comment": "I still never understand why the city or the state has to pay the compensation THE COPS SHOULD",
            "score": 9,
            "author": "cantbesohelpmenotbe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah our tax dollars",
                    "score": 3,
                    "author": "MorddSith187"
                }
            ]
        },
        {
            "level": 0,
            "comment": "wHy dOn'T pEpUL ReSpeK PoLiCe???!",
            "score": 9,
            "author": "mistakl"
        },
        {
            "level": 0,
            "comment": "yup, total pos right there.  love to the citizen who confronted this fucking pig, especially considering he's non-white.",
            "score": 29,
            "author": "nobodynewknew",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean if the cop had shot and killed the intervenor I can already hear the right wing talking heads. \n\n\"And in Colorado one of our heroes in blue fought of an illegal immigrant who tried to attack him while protecting YOU the real Americans.  Fortunately the illegal was killed in the confrontation proving over again the value of the second amendment.\"",
                    "score": 10,
                    "author": "clhomme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Read this in Fucker Carlson’s voice",
                            "score": 9,
                            "author": "The_Mighty_Bird",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Precisely whose voice was in my head as I wrote it.\n\nGod I hate than sub-human.",
                                    "score": 7,
                                    "author": "clhomme"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im glad they were punished but ive seen police get away with much worse on this sub.\n\nA small but important win for the people here.",
            "score": 3,
            "author": "ImFleurious"
        },
        {
            "level": 0,
            "comment": "Bruh tf is wrong with people that was someone’s grandma",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It's a sad day when our brave officers can't do their job(which is to protect and save use from sin I mean crime) without worrying about being crucified for it in the media/s",
            "score": 3,
            "author": "OfficerMcNasty7179"
        },
        {
            "level": 0,
            "comment": "I really feel that the authorities in the US don’t recognise or respect mental illnesses.  Even the courts etc.  I hope they’re educating themselves…",
            "score": 3,
            "author": "Relevant-Passenger19"
        },
        {
            "level": 0,
            "comment": "Can you imagine a world if there wasn’t cameras, and what would happen, it still happens even with cameras, it’s absolutely they lowest life form that intentionally injures a being thats weaker or is actually in need of your care! Appalling",
            "score": 3,
            "author": "Ok_Wallaby_7653",
            "replies": []
        },
        {
            "level": 0,
            "comment": "These are disgusting pigs.",
            "score": 3,
            "author": "DominicRo"
        },
        {
            "level": 0,
            "comment": "My dad has dementia. My grandma passed away from dementia. This video fills me with such rage I can’t even describe it. This poor woman, I am so sorry for her treatment. She didn’t “shoplift”, she forgot to pay for her Pepsi. That’s it, a freaking bottle of Pepsi. I wish I could reach out to her family, I know how I would react if she had been my dad and it wouldn’t have been pretty. This is beyond heartbreaking and I’m very glad the officers are being held responsible for their actions.",
            "score": 3,
            "author": "CashAlternative7911"
        },
        {
            "level": 0,
            "comment": "In my grandmothers final 5 years she developed dementia which turned into alzheimers. 80% of the time my grandma couldn't remember what she was doing a few minutes beforehand and later in the years she was forgetting personal things like her family, friends, important dates etc. My heart aches so bad watching this video. That lady seemed truly confused and lost. I hope she is living the rest of her life with a caring staff who can attend to her needs properly. :'(",
            "score": 3,
            "author": "ph0enxwitch"
        },
        {
            "level": 0,
            "comment": "The way they fucking laughed, I hope someone breaks their arm and then laughs in their god damn face about it. “Hear the pop??” They make me sick.",
            "score": 3,
            "author": "badlilbishh"
        },
        {
            "level": 0,
            "comment": "I hope they get cancer",
            "score": 3,
            "author": "ifsavage"
        },
        {
            "level": 0,
            "comment": "Fuckin PIGS",
            "score": 3,
            "author": "Axel_axelito"
        },
        {
            "level": 0,
            "comment": "Acab. They think they can get away with attacking vulnerable people. Because we can't afford adequate legal defense. I guess this cop targeted the wrong old lady. How many times before this did he get away with the same thing though?",
            "score": 10,
            "author": "OniBoiEnby",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Local cops again. Surprise, surprise.",
            "score": 6,
            "author": "stilusmobilus"
        },
        {
            "level": 0,
            "comment": "Hey piggys you get Fired? Well you will always have a home here on TotalPOS's  and never forget it you disgusting humans who use their power to bully and intimidate. I'm ready for the revolution!",
            "score": 5,
            "author": "Kirtons-4u"
        },
        {
            "level": 0,
            "comment": "Once again, there needs to be a minimum college education level of all police officers.\nThis is what happens when cops are drop outs",
            "score": 4,
            "author": "Unidentifiedpoo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm starting to question, is police even here to help us or what",
            "score": 6,
            "author": "afreeNPC880",
            "replies": [
                {
                    "level": 1,
                    "comment": "nope,  never have been.",
                    "score": 3,
                    "author": "Any_Constant_6550"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is why the training budgets need to be reallocated to more de-escalation training and social awareness training and less military style training.\n\nIt's like the saying: when the only tool you have is a hammer, then everything looks like a nail.  \n\nIn this case, when the only training is military escalation based, then then all interactions are handled using military methods.",
            "score": 2,
            "author": "Go_Gators_4Ever",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All and any person in a position of trust that has psychological or sociopathic behavior issue should be terminated from the position and put into the appropriate care.\n\nIf they harmed people as a result of their behavior, then they need to be fully prosecuted.\n\nNew training really will make a difference, however, those who are unable or unwilling to adhere to the revised training need to find new jobs outside of law enforcement",
                            "score": 3,
                            "author": "Go_Gators_4Ever"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If that was my mum I'd never see the light of day again",
            "score": 5,
            "author": "dan100x"
        },
        {
            "level": 0,
            "comment": "Evil people and they all need accountability",
            "score": 2,
            "author": "peppebbb"
        },
        {
            "level": 0,
            "comment": "This made me literally sick to my stomach. Why is the world such a dark and shitty place?",
            "score": 2,
            "author": "Key-Decision1220"
        },
        {
            "level": 0,
            "comment": "Why?  He should have a great time in prison with a bunch of cop hating, grandma loving convicts. He deserves a dislocated shoulder a week for 5 yrs for this. There was no reason to manhandle a 73 yr old lady, much less a smiling, senile grandma.",
            "score": 2,
            "author": "Super_Discipline7838"
        },
        {
            "level": 0,
            "comment": "Decent people don’t join police force!",
            "score": 2,
            "author": "Anbeezi"
        },
        {
            "level": 0,
            "comment": "ACAB, every single one",
            "score": 2,
            "author": "TheNightHaunter"
        },
        {
            "level": 0,
            "comment": "Dislocate their shoulders….. put them in general population and let nature do its work",
            "score": 4,
            "author": "willflyforcookies"
        },
        {
            "level": 0,
            "comment": "Man the number of « police officers » abusing people around the world is disgusting.\nThe colleagues joking about it is prtty F***ed up as well….",
            "score": 4,
            "author": "turbodindon1"
        },
        {
            "level": 0,
            "comment": "He will burn in hell. Just a matter of time.",
            "score": 3,
            "author": "Express_Ad8584"
        },
        {
            "level": 0,
            "comment": "All cops",
            "score": 4,
            "author": "WhenBugAttack"
        },
        {
            "level": 0,
            "comment": "Cops. Are. Scum.",
            "score": 2,
            "author": "CnamhaCnamha"
        },
        {
            "level": 0,
            "comment": "I can't believe he threw a 73 year old to the ground. I'm not even sure if cops go to regular prison. Surely he should forfeit tangible assets to provide the care she now has to receive for the rest of her life. Surely he should have to pay her compensation, from his assets. Will he be isolated or chucked in with others? Maybe she gets his retirement fund.",
            "score": 2,
            "author": "TopMud7031"
        },
        {
            "level": 0,
            "comment": "Charges will be dropped and officers will get hired a few counties or states away from their current location",
            "score": -1,
            "author": "reditmodzRnotZlovers"
        },
        {
            "level": 0,
            "comment": "I do hope he an an absolutely lovely time in prison. When I say lovely time I mean I hope he needs pain relief for his bumhole",
            "score": 1,
            "author": "Sweddybob69"
        },
        {
            "level": 0,
            "comment": "None of this would have happened if she didn't try to escape",
            "score": -9,
            "author": "Paavikana",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you miss the part where she probably doesn't know what's going on. She's got dementia.",
                    "score": 3,
                    "author": "Elle_mactans"
                }
            ]
        },
        {
            "level": 0,
            "comment": "funny how they get kicked off the force and face criminal charges when it’s a white woman but only get suspended with pay when it’s a black man",
            "score": -6,
            "author": "NOLSY420",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This cop didn’t do anything wrong, free him",
            "score": 0,
            "author": "Thom180",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I work at a hospital and we have to restrain some people because of how they act with their kicking, punching, biting, walking away, pulling IVs, pulling caths, etc…some are redirectable with a video sitter, some need a physical sitter, and some are too wild to be contained with just that and require mittens and/or soft restraints. \n\nUntil I worked in medicine, I would have said guilty without a second thought, but having sat through a night of getting kicked in the neck and arm, punched multiple times, luckily dodged the biting attempts, and this list goes on, I would have to see the full, unedited video and hear the full story to make an educated decision.",
            "score": -13,
            "author": "notsohandiman",
            "replies": [
                {
                    "level": 1,
                    "comment": "except the cops don't have the training,  medication,  restraints,  personnel, experience, or basic human decency that would be taken to restrain a patient.  Haldol goes along way to helping people become less combative.",
                    "score": 3,
                    "author": "Any_Constant_6550",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I think the fact that he was sentenced to 5 years in prison for this exact crime, speaks volumes.",
                    "score": 8,
                    "author": "princess_jenny",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Should of taken their 41k as well , teaches these pricks and any corrupt cop in the future what to expect if you hide behind your badge to abuse members of the public. \nAlso the whole department should be taught on how to approach anyone with a mental health condition and how  descalate the situation .",
            "score": 1,
            "author": "Ouch78"
        },
        {
            "level": 0,
            "comment": "I’m still enraged by this!  They wouldn’t want their mothers treated this way. Why did they think this was within the scope of their responsibility and authority?",
            "score": 1,
            "author": "Sofarbeyondfucked"
        },
        {
            "level": 0,
            "comment": "3 million damn",
            "score": 1,
            "author": "Yousucktaken2"
        },
        {
            "level": 0,
            "comment": "They all un professional a holes",
            "score": 1,
            "author": "CaliBull2030"
        },
        {
            "level": 0,
            "comment": "Scumbags thinks they're some sort of action hero for assaulting strangers on the streets.",
            "score": 1,
            "author": "jakob767"
        },
        {
            "level": 0,
            "comment": "If I was a cop and saw my partner doing this, I'm beating their ass. I'm sick of officers just letting their partners be bitches and abusung their power. This is why everyone say there are no good cops.",
            "score": 1,
            "author": "ShawnvellLocc"
        },
        {
            "level": 0,
            "comment": "Fucking monsters.",
            "score": 1,
            "author": "pandorafoxxx"
        },
        {
            "level": 0,
            "comment": "Make it 50 minimum with no early release etc.  This was demonstrable malice.  We have laws that add punishments for cops, but they are never applied.  Should be mandatory charges against any police.",
            "score": 1,
            "author": "Lazy-Jeweler3230"
        },
        {
            "level": 0,
            "comment": "Betraying the public trust. Losers.",
            "score": 1,
            "author": "bronxbomma718"
        },
        {
            "level": 0,
            "comment": "Colorado hit different bro💀",
            "score": 1,
            "author": "Randommilkdude"
        },
        {
            "level": 0,
            "comment": "What a pair of human trash they both are. I hope they get jail time for that.",
            "score": 1,
            "author": "Top_Fox2692"
        },
        {
            "level": 0,
            "comment": "It’s really hard to want to be a friends of the police these days. Videos has shown how corrupt and disgusting of a group they could be. It sucks as an American citizen to be put in the situation.",
            "score": 1,
            "author": "Appropriate_Sale7339"
        },
        {
            "level": 0,
            "comment": "At least this one has a happy ending I.e. they resigned and face charges. Throw them in jail with General population and make sure everyone knows who they are",
            "score": 1,
            "author": "SessionPowerful"
        },
        {
            "level": 0,
            "comment": "Good job boys! Serving and Protecting in the land of the freeee! Go USA!",
            "score": 1,
            "author": "Professional-Yak1239"
        },
        {
            "level": 0,
            "comment": "Wow this is why everyone hates cops literally bragging about popping grandmas shoulder out wtf.",
            "score": 1,
            "author": "InsaneTechNYC"
        },
        {
            "level": 0,
            "comment": "Cops don’t hate you cause of your skin they hate you because you are the product that they are paid to keep under control",
            "score": 1,
            "author": "Docta-J-Dizzle"
        }
    ]
}