{
    "id": "zt3p9s",
    "score": 870,
    "title": "Oklahoma state secretary calls the extremely popular Black Santa \"woke\".",
    "author": "4dailyuseonly",
    "date": 1671761211.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/zt3p9s",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "What was that Chris Rock tagline from his “Never Scared” standup?\n\n“…but It’s all right cos it’s all white”. \n\nSome people need to get over themselves! A fictional character of a guy living in the North Pole flying overhead in a magic sleigh drawn by magical reindeer is not exclusively one race. Even though it was created by that race.",
            "score": 74,
            "author": "Substantial-Green989"
        },
        {
            "level": 0,
            "comment": "Are there really people who have a problem with Santa being Black? What would they say if there was a Chinese Santa? That is some sort of plot by the commies?",
            "score": 75,
            "author": "mifaceb921",
            "replies": [
                {
                    "level": 1,
                    "comment": "Chinese Santa would be cool. Hell I want Samoan Santa to make him like Fatu Claus.",
                    "score": 28,
                    "author": "311Konspiracy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you travel to countries where there’s not that many white people, but still celebrate Christmas, you’ll see non-white Santas at their malls. Is that woke too?",
                            "score": 4,
                            "author": "thegodofgoodfuck",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope, just for America. Which lets you know how most of them think.",
                                    "score": 6,
                                    "author": "TchallaKingofWakanda"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "His toys would break in less than a week 😂",
                            "score": 3,
                            "author": "NocturneHunterZ"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ironically mixing Santa Claus and a decorated tree to celebrate the birth of Christ is kinda woke in and of itself. But “woke” is just right wing code for words the don’t say in public.",
            "score": 43,
            "author": "HumorExpensive",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, “woke” got turned into a racist dog-whistle, it’s sad.",
                    "score": 20,
                    "author": "kat_goes_rawr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wasn't that how it was supposed to be used originally?",
                            "score": 1,
                            "author": "Bleev-or-naught",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope, back in the day, we used it to literally mean \"stay alert.\" Then certain people started using it in everything to be aware of (mainly from hip-hop influence and its rise in popularity). And now, here we are. Turned into another racist dog whistle for the right.",
                                    "score": 5,
                                    "author": "TchallaKingofWakanda",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I misinterpreted",
                                            "score": 1,
                                            "author": "Bleev-or-naught"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The worst part is that it isn’t totally a dogwhistle, it’s still very commonly used for a lot of reasons, but some of these freaks still manage to turn it into one :(",
                            "score": 1,
                            "author": "xxlochness"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "WHERE IS MEXICAN SANTA?",
            "score": 7,
            "author": "New_Cantaloupe_1329"
        },
        {
            "level": 0,
            "comment": "I wish we had all the Santa’s. Cause I don’t know… I feel like Samoan Santa doing the Haka might slap a little",
            "score": 5,
            "author": "PenNo1447"
        },
        {
            "level": 0,
            "comment": "yeah, imagine people trying to have a FICTIONAL CHARACTER be a black guy !!\n\nWe all know black guys have no laps and now our kids are drag queens and pooping in litter boxes.\n\nPlease don't ask how that all adds up",
            "score": 48,
            "author": "Olden_Broken",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t really care about it but santa is based off a real person so I think it may be fair for some people to not like changing that.",
                    "score": 10,
                    "author": "GodlyCheeseFries",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So they should go find a Greek or Turkish guy to play him. And while we’re at it erase all the blonde haired blue eyed depictions of Jesus and make him look like an actual middle easterner. \n\nIt’s laughably transparent when certain folks are incredibly selective about the “historic accuracy” they demand from quasi- and outright fictional characters.",
                            "score": 24,
                            "author": "TahiniInMyVeins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m perfectly fine with being historically accurate with everything",
                                    "score": 2,
                                    "author": "GodlyCheeseFries",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I personally think that’d be silly but I can at least respect the consistency. What I don’t respect is folks whining about black Santa and then depicting Jesus as a Northern European.",
                                            "score": 12,
                                            "author": "TahiniInMyVeins",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Jesus is magic so he could change his skin colour probably lmao",
                                                    "score": 2,
                                                    "author": "GodlyCheeseFries",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol well I guess Santa is magic too so even a “historically accurate” Santa can be any skin color as well.",
                                                            "score": 12,
                                                            "author": "TahiniInMyVeins"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "SJWs love being outraged for no reason. \nEven if u go to Bethlehem today. Everyone looks just like how Jesus is depicted.",
                                                    "score": 0,
                                                    "author": "J_Illyria"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No, I would say more \"inspired by\" not \"based on\".\n\nIt is just like movies.  \"Based on\" means many, if not most, of the things happened whereas \"inspired by\" means that, well, there were in fact people with legs and feet involved.  \n\nIt is stupidity...   but, then again, these same idiots think \"Jesus\" was white with blue eyes and that they are \"patriots\" for wanting to control people.\n\nI apologize if you might be \"one of those people\".  Not trying to argue or fight, just kinda trying to explain my thoughts on it all.",
                            "score": 3,
                            "author": "Olden_Broken",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I meant his appearance was based on someone else not all the magic stuff",
                                    "score": 1,
                                    "author": "GodlyCheeseFries",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Actually Sinter Klaas (what the Dutch called St. Nicholas and the roots of what we now call Santa) was described as a rascal with a blue hat and yellow stockings, and a man with a broad-brimmed hat and \"Flemish trunk hose.\"\n\nThe there was \"Father Christmas\" from England who sprang up but he, too, wore green although he did live in the North Pole.  He did not give give gifts, however, and simply went from house to house having dinner. \n\nThe two of them kinda melded as time went on...\n\nThe more modern (if you can call it modern at all) look came about around 1822 with the creation of \"Twas the Night Before Christmas\" (aka An Account of a Visit From St. Nicholas).  \n\nIt still was not mainstream, however, until the 1920s when Coke started their \"Santa\" campaign and created the, now, iconic look.\n\nSo yeah, his appearance was never based on someone.  :)\n\ntl;dr No it wasn't.\n\n(The story of \"Santas\" origins is actually pretty fascinating though and people whould read up on it.)",
                                            "score": 6,
                                            "author": "Olden_Broken"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The thing is there's depictions of Saint Nicholas as a dark skinned person, Saint Nicholas, Russian icon from first quarter of the 18th century (Kizhi monastery, Karelia).\n\nSo the skin colour of St Nick isn't certain either.",
                            "score": 1,
                            "author": "Enigmatic_Racer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What does ''woke'''even mean? I always think people who complain about ''woke snowflakes'' are snowflakes themselves for 99% of the time.",
            "score": 4,
            "author": "Knownoname98"
        },
        {
            "level": 0,
            "comment": "Idk black Santa gives off more Santa vibes to me honestly, he seems much more cheery and sweet. The white Santa looks like he’s forcing a smile and doesn’t really want to be there. That’s got nothing to do with race, some people just have a better personality for being Santa",
            "score": 66,
            "author": "skitz_shit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Santa is jolly and wise, that’s the Santa I know. As long as Santa is happy to see you and has words of wisdom about being good to each other and caring for your family, that’s my Santa.",
                    "score": 26,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One of the first Santas I ever met when I was a kid was a black Santa, I didn’t think anything of it I was just excited to meet Santa. The black Santa in these pics looks like he’s just naturally a Santa kinda guy, no goofy fake bear or fake smile. He seems like he’s genuinely happy about being Santa and doesn’t even need to act",
                            "score": 6,
                            "author": "skitz_shit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s Santa, then! See, that’s what I think Christmas/Yule/Solstice is all about, “hey buddy, yknow…I know we had our problems this past year, but it’s like -10 degrees out there, come in &amp; get out the cold :) “",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Idk the black santa looks way younger than santa, also he shows his teeth while smiling which doesn't give me much santa vibes. Probably a good thing so considering his only job is to make kids happy for a few moments",
                    "score": -5,
                    "author": "Comgddx-Abrocoma1425",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Santa is not real.",
                            "score": 6,
                            "author": "LeResist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What really?",
                                    "score": 2,
                                    "author": "Comgddx-Abrocoma1425"
                                },
                                {
                                    "level": 3,
                                    "comment": "Found the edgy 10 year old",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My god these people are snowflakes, just let kids enjoy a Santa that looks like them for once.",
            "score": 30,
            "author": "Red-Boxes",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -12,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Why do we care what colour skin Santa has.\n\nMy point exactly.",
                            "score": 20,
                            "author": "Red-Boxes"
                        },
                        {
                            "level": 2,
                            "comment": "Ignorant  and selfish.",
                            "score": 6,
                            "author": "TheJakeBlues"
                        },
                        {
                            "level": 2,
                            "comment": "You are a disgrace to Nates",
                            "score": 2,
                            "author": "Kasilim"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Celebrate your own culture if you want a black holiday figure. Santa has always been a white man and came from white European culture. Its great if you want to share in other people's traditions but you don't need to change other cultures' traditions just so your kids can feel involved.  I promise they don't care if he has blue skin.",
                    "score": -7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not Christian but I assume by being Christian you’re part of the culture of Christmas and Santa. Or do you just mean skin color?",
                            "score": 3,
                            "author": "gypsyscot"
                        },
                        {
                            "level": 2,
                            "comment": "We don't live in fucking Europe.",
                            "score": 0,
                            "author": "dal33t",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So dont fucking celebrate European traditions.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whenever people say “woke” or CRT I can only imagine the scene from *Idiocracy* with Brawndo, it’s got electrolytes.\n\n“What ARE electrolytes? Do you even know?”\n\n“…it’s…what plants crave…Brawndo’s got electrolytes.”\n\nThey just say these words as a blanket term for “something I don’t like.”",
            "score": 18,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Water...you mean like in the toilet?",
                    "score": 3,
                    "author": "m4mab3ar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oklahoma's Santa has does nothing wrong but have black skin, yet the state secretary and other the conservative dipshit lawmakers have derided him.",
            "score": 22,
            "author": "4dailyuseonly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Poor dude is just trying to make some kids and parents happy around the holidays",
                    "score": 8,
                    "author": "Beer_Is_Good_For_Me"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Who cares if Santa’s white, black, Asian or any other race, same jolly old man spreading Christmas cheer around is the only Santa that matters not his race",
            "score": 5,
            "author": "Thebisexual_Raccoon"
        },
        {
            "level": 0,
            "comment": "Why is it so hard to just let African Americans exist and be happy?",
            "score": 5,
            "author": "-ManyFacedGod-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because they can't leave well enough alone. Why is it so hard to let traditions be? Why does everything white have to be changed to accommodate blacks? Enjoy the tradition if you want. If black people want black then look to their own traditions.",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hell y'all changed Jesus to a white dude come tf on.....about  traditions.",
                            "score": 7,
                            "author": "Relevant_Positive417"
                        },
                        {
                            "level": 2,
                            "comment": "This has to be satire. Are you actually implying that EVERYTHING white has to be change to accommodate blacks? (Wtf was segregation about then) It’s not like white people have been destroying traditions of other cultures on every inch of the Earth since the dawn of time. You should read about Colonization. If you think black Santa is bad, you’d be livid about what the “Christians” did to the Native American people . To educate the children in the new ways the white people took children away from their parents, put them in boarding schools far away from their homes and families, cut their hair, took away their medicine bundles, forbade the use of their native language.  \n\nSanta is definitely black not white.",
                            "score": 0,
                            "author": "-ManyFacedGod-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No disagreement that history has been bad. What is this then, revenge? The whole point is to correct the wrongs. Two wrongs dont make a right.",
                                    "score": -1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "are you comparing the colonization and destruction of people to some shitty ass “tradition” from europe? lol",
                                            "score": 1,
                                            "author": "GrumpyGourmet1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nope, but they were",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You remember when we destroyed people's homes, stole their lands, enslaved their peoples, erased their cultures and religions, and killed them en mass in the process? \n\nMaking a fictional fat man black instead of white is just as bad as that. Two wrongs don't make a right, guys!!!",
                                            "score": 0,
                                            "author": "AlmightyJello"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Since your other comment never showed up I'll just respond to it here. You don't get to claim pointing out the atrocities commited by white colonialisers is \"white guilt\" while crying about a black santa. Santa as he appears nowadays is a staple of American culture. A culture people of color who live here are a part of just as much as white people who live here. You don't get to deny them a culture they very much belong to.",
                                            "score": 0,
                                            "author": "AlmightyJello"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You sure it was black Santa? I remember last year all the tucks were going on about a Santa Claus  who went on and on about gun violence when a kid asked for a toy gun. Called him “woke Santa.” He was white btw.",
            "score": 1,
            "author": "bebetterthanthem",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay but who doesn’t love nerf guns",
                    "score": 3,
                    "author": "cadaverco"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Saint Nicholas was Greek , so snowflake boy still fucked it all up",
            "score": 2,
            "author": "Slow_Flow_4722",
            "replies": [
                {
                    "level": 1,
                    "comment": "Greek santa would still be white.  🤣",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "How is a black Santa woke?? Maybe a black guy just wanted to be Santa and got hired as a Santa. Are only white people allowed to be Santa?",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Extremely popular is questionable, but idc what color Santa is because I’m grown and as long as if he has the hat and clothes it’s Santa as far as I know",
            "score": -2,
            "author": "Tiny_Program_3801"
        },
        {
            "level": 0,
            "comment": "When right wings say \"Woke\" I feel they are DL saying the other word. \nMy favorite version of Santa is Russian with full sleeves and double swords.  It's not traditional and no one said a freaking thing about it. Let people just like things.  It's 2022. Do better. Y'all Can have your traditional cookie eating fat guy however you want. \nDon't crap on others for liking something different. 😒",
            "score": 1,
            "author": "woahboei2134",
            "replies": [
                {
                    "level": 1,
                    "comment": "My personal favorite is the cool one from Fatman.  He's mel Gibson and he has am old red ford",
                    "score": 2,
                    "author": "soundwave_fan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just replace him with the Dutch one. I'm sure that will be fine.",
            "score": 1,
            "author": "SignificantView1671"
        },
        {
            "level": 0,
            "comment": "He looks like a ripoff of a ripoff of ryan renolds",
            "score": 1,
            "author": "LeadershipOk8160"
        },
        {
            "level": 0,
            "comment": "Only white people can be santas /s",
            "score": 1,
            "author": "nametakenfuck"
        },
        {
            "level": 0,
            "comment": "I don’t care if the Santa is a purple alien, if he can get the baby to smile like that!! What is wrong with ppl, smh!!",
            "score": 1,
            "author": "rem_1984"
        },
        {
            "level": 0,
            "comment": "This makes me rage. Possibly unreasonable amounts.",
            "score": 1,
            "author": "jerryleebee",
            "replies": [
                {
                    "level": 1,
                    "comment": "You should probably see a therapist about that.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a \"right winger\" I want to see Santas of ALL COLORS, possibly a universal world Santa?",
            "score": 1,
            "author": "Paladin-Steele36"
        },
        {
            "level": 0,
            "comment": "He's mistaken chimney soot for race...",
            "score": 1,
            "author": "Man_in_the_uk"
        },
        {
            "level": 0,
            "comment": "First time I saw a black Santa i was like 6 and I didn't even bat an eye just started telling him my Christmas demands.",
            "score": 1,
            "author": "SammySweets"
        },
        {
            "level": 0,
            "comment": "he was just mad last year cause his wife wanted to sit on Santa's lap",
            "score": 1,
            "author": "BeachHoliday859"
        },
        {
            "level": 0,
            "comment": "You sure he didn't mean tran Santa?",
            "score": 1,
            "author": "GakkVekk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don't give these nutters any new ideas.",
                    "score": 1,
                    "author": "dal33t"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Real Santa looks like neither",
            "score": 0,
            "author": "BeNiceKid"
        }
    ]
}