{
    "id": "ztqibj",
    "score": 25114,
    "title": "Porch pirates sniffing days before Christmas",
    "author": "Bennypuff231",
    "date": 1671823906.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/ztqibj",
    "media_urls": [
        "https://v.redd.it/qcof3citqq7a1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "\"Bye, insulin!\"\n\n\"Hello, Christmas in the hospital...\"\n\nScumbags",
            "score": 1634,
            "author": "Slummish",
            "replies": [
                {
                    "level": 1,
                    "comment": "Happened to my grandparents a few years ago. Grandpa was in his final stage of cancer, but Covid had just begun and the lockdown happened. Doc mailed him his meds, and someone stole them off of their porch. Never brought them back or anything after realizing what it was. Thankfully doc’s office was able to call in an emergency script that was delivered by the next day. Still makes me absolutely sick to think about.",
                    "score": 584,
                    "author": "p-heiress",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hope the person who stole it felt the right thing",
                            "score": 201,
                            "author": "baNNassa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If by the the right thing you mean catastrophic side effects. I could bet anyone stupid enough to steal meds is stupid enough to try and pop them.",
                                    "score": 164,
                                    "author": "Iheardthatjokebefore",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They usually don't open the packages until they've already set off some time later (at least from what I can recall of the Mark Rober video on it recently)",
                                            "score": 28,
                                            "author": "Takamasa1"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If by “felt the right thing” you mean the feeling of being hit in the kneecaps with a baseball bat then yeah, I hope they felt that.\n\nSeriously, people who steal packages off of porches are the lowest form of life. If someone stole cancer meds and then didn’t immediately return them with an apology then they deserve to have the worst things in life happen to them.",
                                    "score": 23,
                                    "author": "jtweezy",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Immense pain and suffering?",
                                    "score": 5,
                                    "author": "LoveFishSticks"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I hope the person who stole it is behind bars by now",
                            "score": 3,
                            "author": "ScaryHarry15"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a diabetic now and wasting so much money that doesn't cost much at all to make. If someone stole my insulin, I hope they're dumb enough to shoot some of it in them so they go into a coma.",
                    "score": 78,
                    "author": "FringeBoi04",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "When stealing packages from porches, turn on hazards so you do not draw any attention to yourself.",
            "score": 3144,
            "author": "hlmcccc",
            "replies": [
                {
                    "level": 1,
                    "comment": "Counter thought: \n\nIt makes you look less suspicious and more like you're just out doing normal stuff. I call it the \"hiding in plain sight\" theory.\n\nIt doesn't fit most people's patterns or preconceived ideas about suspicious behavior.",
                    "score": 1153,
                    "author": "L3tsg0brandon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ya, act like you belong.",
                            "score": 319,
                            "author": "BlueHero45",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "chuck on an orange work vest and carry a ladder around... no one will question you. No sane person would just carry a ladder around to get into places.",
                                    "score": 259,
                                    "author": "vhisic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I worked my way through college delivering pizza. I swear you could get anywhere with a pizza bag. I was once in an airport control tower and through security in a prison. I had the alarm code for multiple nursing homes. Back of a strip club. Probably a lot more that I’m not remembering off the top of my head.",
                                            "score": 204,
                                            "author": "blippityblue72",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah plus people are always stoked to see you lol",
                                                    "score": 111,
                                                    "author": "BeautyDuwang"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You notice in a lot of 90s movies people pretend to be pizza delivery guys a lot.",
                                                    "score": 88,
                                                    "author": "BlueHero45",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Those are actors",
                                                            "score": 83,
                                                            "author": "KatalDT",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "People ACTING like they are ACTING like a pizza man?\n\nWhat is going on??",
                                                                    "score": 23,
                                                                    "author": "MidnightT0ker",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "He's a dude, playing a dude, disguised as another dude!",
                                                                            "score": 15,
                                                                            "author": "magickmanfred",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Hell i deliver jimmy johns sammiches and they are just white paper bags with jimmy johns printed  on the front and a receipt stapled to it and you can get anywhere with it",
                                                    "score": 38,
                                                    "author": "hybridbirdman42069",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The most unremarkable sandwiches ever made",
                                                            "score": 17,
                                                            "author": "Infinite-Fig4959",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They are what I eat when I’m so hungover I can’t eat anything actually good.",
                                                                    "score": 7,
                                                                    "author": "Yaj_Yaj"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I made it into the server room at Amtrak in Philly. All it took me to get through multiple levels of security was a Pizza Hut bag and trying to find someone no one knew.",
                                                    "score": 28,
                                                    "author": "cold-corn-dog"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I kept my car topper after I quit delivering pizzas. Delivery drivers don’t get pulled over. In two years, I only heard of one coworker getting pulled over, and that was cause he was blatantly smoking weed in his car.",
                                                    "score": 16,
                                                    "author": "slimthecowboy",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Did you ever fix the broken washing machine? 😉",
                                                    "score": 3,
                                                    "author": "b1gCubanC1gar",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Asking the real questions",
                                                            "score": 3,
                                                            "author": "DefiantShame4L"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Orange vest and a clipboard works too, and is lighter.",
                                            "score": 58,
                                            "author": "crypticedge",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "people may ask to see the clipboard though, then you gotta have something meaningful on it.",
                                                    "score": 17,
                                                    "author": "vhisic",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Clean orange vest, clipboard, and a new white hard hat. You look like an inspector and no one on site wants to deal with the inspector.",
                                                            "score": 50,
                                                            "author": "BostonDodgeGuy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Collared shirt under the vest just to really sell it.   \n\n\nEven if they don't assume inspector they will assume you are management or something and also not want to deal with you.",
                                                                    "score": 40,
                                                                    "author": "Ok_Spell_4165"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 10,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I have never seen a manager or inspector with anything other than a perfectly clean and polished hard hat. Any gunk or stickers means that's a worker.",
                                                                            "score": 25,
                                                                            "author": "BostonDodgeGuy"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If your carrying a ladder in the Streets of a residential area that's definitely fucking not normal lol. Clipboard would make more sense.  Because no one has a ladder unless its off a work truck. And that's like driveway to house kinda thing.\n\n\nClipboard and safety vest I've seen countless times, for various reasons.\n\nClipboard users are also generally higher up the totem pole, than someone lugging a ladder. Meaning less chance someone stops you.",
                                            "score": 8,
                                            "author": "drewster23",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "well now im going to harass every single person i see wondering my neighbourhood holding a clipboard. we cant allow this to continue",
                                                    "score": 8,
                                                    "author": "vhisic"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Don't give these thieves any ideas..",
                                            "score": 18,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly, without knowing context and just watching the video you could probably think it's someone checking if their order arrived while leaving the car on.",
                            "score": 29,
                            "author": "Intrepid_Watch_8746",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Exactly, without knowing context \n\nTechnically we don't *know* the context. We know the poster claims that it was a porch pirate scoping out a potential target. We assume that's true because that's what it *appears* to be. But it could be a woman selling girl Scout cookies for all we know.\n\nNow I ain't tryna to accuse the OP of lyin'. Rather I'm pointing out that it does indeed look like porch pirates pirating porches.",
                                    "score": 15,
                                    "author": "SycoJack",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've had packages delivered to my neighbors. When Amazon sends me a picture of my package at the wrong welcome mat, I've gone around to collect.",
                                            "score": 5,
                                            "author": "double_expressho"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If I see a car parked with hazards on my street, I'm rubber-neckin through the window to see what happens.",
                            "score": 25,
                            "author": "Nimueah2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Really? Where I live it's almost always a gig worker delivery guy thinking they can park wherever they want because they have hazards on.",
                                    "score": 12,
                                    "author": "BlueHero45",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The ol' park anywhere button",
                                            "score": 19,
                                            "author": "Foreverbostick"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hazard lights turn everyplace into a parking space. \n\nSource: I drive commercial vehicle and do deliveries.",
                                            "score": 12,
                                            "author": "L3tsg0brandon",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You could now just be going to ask for help from a random homeowner, because folks with hazards on, parked on the side of the road, are often in distress of some kind.",
                            "score": 9,
                            "author": "JaggedTheDark",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe if it was 1992 and not 2022.  I'd be super suspicious of anyone approaching my home asking for assistance considering nearly everyone has a cellphone these days.",
                                    "score": 12,
                                    "author": "capecodcarl",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I assume that’s to prevent someone from coming up behind them and laying on the horn because they are just stopped in the road.",
                    "score": 15,
                    "author": "procrastibader"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do these people sleep at night?",
            "score": 1789,
            "author": "SacredBigFish",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mark Rober’s porch pirate videos really show the worst that humanity has to offer. These people never show any remorse and even will get their children involved",
                    "score": 123,
                    "author": "Sharrty_McGriddle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree and the car break-ins kinda threw me for a loop. I've never lived somewhere like that, where people break into cars in broad daylight, with people all around and have seemingly no fear of being caught. Most places I've lived you would literally be confronted by armed, and incredibly angry citizens, and possibly shot.",
                            "score": 38,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There is a sort of selective moral indifference that pops up in every culture. it starts small like petty littering or leaving shopping carts out but the accumulated damage fucks up society at large. Entire systems cease to function efficiently. you start to notice that everyone becomes distrustful of one another or overly emotional about petty things. It actually ends up twisting up the minds of the general population. It's insane.",
                    "score": 1590,
                    "author": "Ezraah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I guess I might be biased coming from a small Bavarian village where everyone knows everyone. Still, it's insane to me.",
                            "score": 314,
                            "author": "SacredBigFish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "These people don't live in these neighborhoods, they're relying on the anonymity of population. But all the police have to do is arrest and prosecute some of them and it would stop pretty fast but they can barely correctly arrest and prosecute major crime as it is",
                                    "score": 335,
                                    "author": "CosmicCyrolator",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well that would take them away from their speed traps!",
                                            "score": 103,
                                            "author": "Shenko-wolf",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "they got to get that department Mr. Coffee somehow!",
                                                    "score": 7,
                                                    "author": "aerojet029"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If you’re already ‘porch-pirating’ you have nothing to lose. Multiply this instance by many, many thousands of people and you get your answer as to the what, how, and why. THIS is trickle-down economics in real-time",
                                            "score": 40,
                                            "author": "beekeep",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Home delivery is a trust based system, porch pirates break that trust.\n\nWebcams, or doorbell cameras increase that trust, but do not catch/stop the porch pirates.\n\nPolice and the webcam companies use the webcams with out home owner authorization to pursue crimes they the police are interested in, decreasing trust.\n\nAmazon takes pictures of delivered packages and emails the purchaser of the delivery, increasing trust.\n\nIt seems like an endless cycle really.",
                                                    "score": 31,
                                                    "author": "random12356622",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s only insane because you know everyone. You have to realize how big America is. In my state, my girlfriend got her car broken in from someone who drove 3 hours away to go on a spree. If a place is wealthy, eventually criminals will discover they can drive there, Rob cars or porches,  drive home and probably not get caught.",
                                    "score": 52,
                                    "author": "AaronRodgersMustache"
                                },
                                {
                                    "level": 3,
                                    "comment": "Cart Narcs is a wonderful service to America.  Putting lazy bones in their place is for the greater good.",
                                    "score": 29,
                                    "author": "poprockcide",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I have never seen anyone say they live in a Bavarian village before on Reddit... or anywhere. Do you live near Takeo Ischi? The chicken yodel guy?",
                                    "score": 19,
                                    "author": "arkrunningbear85",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol I had to look him up, and kind of, but not really. He lives way down southeast of Bavaria, I'm more southwest. Could be a day trip though.",
                                            "score": 19,
                                            "author": "SacredBigFish",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're making me homesick. I lived in Villingen in Schwaben for a year, and stayed in Rosenheim for a bit near the Austrian border. \n\nPretty much the only place I feel like I belong, which is ironic, since I don't. :'(",
                                                    "score": 3,
                                                    "author": "AnalogyAddict"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's also a culture of toxic individualism in America. \n\nIf you're all \"me, me, me\", why would it bother you if someone else gets fucked over for your benefit?",
                            "score": 67,
                            "author": "flaneur_et_branleur",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  that pops up in every advanced economic structure.\n\nFTFY\n\nSocietal decay starts with greed and ends in idiocracy as a response too the greed.",
                            "score": 5,
                            "author": "lejoo"
                        },
                        {
                            "level": 2,
                            "comment": "Broken windows theory",
                            "score": 27,
                            "author": "greater_being",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; In criminology, the broken windows theory states that visible signs of crime, anti-social behavior and civil disorder create an urban environment that encourages further crime and disorder, including serious crimes.[1] The theory suggests that policing methods that target minor crimes such as vandalism, loitering, public drinking, jaywalking, and fare evasion help to create an atmosphere of order and lawfulness.",
                                    "score": 63,
                                    "author": "Autistic_Freedom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's why in Singapore they cane molesters, slap massive fines and community service on people who litter, cane and jail vandals, ban chewing gum etc. Armed robbery can be 25 years jail. Gun homicide is a death sentence.\n\nPeople leave their wallets on tables at the food court to reserve their seats when they go out to collect food. This is in a very dense city of 5-6 million.",
                                            "score": 3,
                                            "author": "ty_xy"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Weet weet skiddly wooht!  That’s not where the carts goooo",
                            "score": 33,
                            "author": "rkd101b",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "cart narc speed engaged",
                                    "score": 22,
                                    "author": "Ezraah",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "KIA boys.",
                            "score": 4,
                            "author": "PaulieBoyY"
                        },
                        {
                            "level": 2,
                            "comment": "I appreciate your answer, makes some sense. I'm in the UK and u wonder if \"porch pirate\" itself is a harmful label as it seems to diminish the severity of this. In the UK we wouldn't can then porch pirates we'd call them thieving pieces of sh*t. I wonder if the label further adds dissonance that they don't think they're really stealing compared to breaking and entering etc",
                            "score": 3,
                            "author": "NotAlanPorte"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "on a large mattress on the floor that they stole off someone's porch.",
                    "score": 35,
                    "author": "vhisic"
                },
                {
                    "level": 1,
                    "comment": "They just don't care about others. \n\nOr they've convinced themselves that society has slighted them, and this is their way of getting what's rightfully theirs. \n\nOr they feel that they're just sticking it to Amazon or whatever. \n\nOr meth.",
                    "score": 52,
                    "author": "jooes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Was watching some of the package thieves in the glitter bomb videos and one of them even says \"we aren't doing anything wrong, but just don't advertise what we did\"",
                            "score": 24,
                            "author": "jj4211",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I always kinda wondered if you could do this, but with bed bugs.",
                                    "score": 12,
                                    "author": "Sta-au",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, but what about the innocent neighbor in their apartment complex - the one who has to share a washing machine with them, for example? That's just going to end up hurting more people, and it's crazy expensive to get rid of bedbugs...\n\nIt's possible I thought too deeply into this lol",
                                            "score": 11,
                                            "author": "Desperate-Strategy10"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "On your pillow cases.",
                    "score": 16,
                    "author": "ThatsRobToYou"
                },
                {
                    "level": 1,
                    "comment": "With a plundered pillow, probably.",
                    "score": 12,
                    "author": "StalledAgate832",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wrapped up in someone else’s blankey",
                            "score": 9,
                            "author": "WhtChcltWarrior"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I stress to my kid that he has to be good when no one is watching. It's for you not others. You live in the same world so make it a good one",
                    "score": 8,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "They are raised from an early age by trashy scum parents who instill these scum values in them, so they feel nothing whatsoever about it, aside from a little thrill of doing it",
                    "score": 54,
                    "author": "Marsupialize",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My cousin is a wonderful person and his daughter is a scummy person that steals whatever she can get her hands on. Sometimes, people suck regardless of parenting. (She isn’t an addict or even broke, she just sucks).",
                            "score": 17,
                            "author": "FloptimasPloptimas",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Thats what saddens me about all the Mark Rober glitter bomb videos on the topic - just how many parents are doing this and involving their kids from a young age. \n\nIt reminds me of the Always Sunny episode where you find out Macs family used to go to other peoples houses and steal presents on Christmas day, and he treats it just like normal. In a lot of the videos, the kids seem old/smart enough to realise the items belonged to someone else, but they're still often treated like gifts or something to play with.\n\nThe thing that always really irritates me about people doing this is the entitlement you see. Like in those videos with the trapped box, the normal reaction to it going off isn't embarrassment or regret, it's anger at the person *who they stole from* as though they have been targeted. Really it's only people with that entitled world view who would feel comfortable just taking whatever box is in front of someone's house.",
                            "score": 6,
                            "author": "hosky2111"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s possible they don’t, at least not well. They’re not just out looking for a thrill.",
                    "score": 4,
                    "author": "FatMaul"
                },
                {
                    "level": 1,
                    "comment": "On stolen pillows.",
                    "score": 3,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Step 1) Be poor  \nStep 2) Convince yourself it is someone else's fault  \nStep 3) Get revenge on strawman image you've built against society\n\nIt's a very short psychological trick people play to justify their actions. Drug addicts are *super* good at it.",
                    "score": 23,
                    "author": "knowyew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most of these videos I've seen the criminals do NOT look poor and I think it's harmful to even partially blame this on being poor. Just because someone is poor, doesn't mean they are morally bankrupt.",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can confirm. Once dated someone who started picking this habit up. They were convinced they came from a disadvantaged background and stole because it was taking from the privileged and they could afford it.\n\nTheir parents made 120K a year and they owned a house and a boat. “Coincidentally” this was around the time we broke up.",
                                    "score": 17,
                                    "author": "linguisitivo",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Soundly, with their new free pillow and and noise canceling headset",
                    "score": 11,
                    "author": "TikiMonn"
                },
                {
                    "level": 1,
                    "comment": "These people feel entitled to the stuff they steal. Check out Mark Rober’s videos if you haven’t. Plenty of the porch pirates talk about how the perosn they steal it from can just buy another thing since they could buy the first",
                    "score": 8,
                    "author": "Hunt_Club"
                },
                {
                    "level": 1,
                    "comment": "They often have some sort of complicated rationalisation for it. \n\nOr they’re sociopath/psychopaths. \n\n/s",
                    "score": 5,
                    "author": "Alan_Smithee_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Had someone steal a parcel for Christmas my family got (and specifically ordered the delivery driver to put behind the bin in our yard) 2-3 days ago. Don’t even know how they found it. Actual parasites. Luckily we got a refund.",
            "score": 715,
            "author": "LieutanantRachel161",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably following the delivery truck...",
                    "score": 289,
                    "author": "bamboozled_doggo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Happens every year around christmas time where I live, it's generally worse on years when the farms lay people off earlier in the fall due to poor weather. People will follow behind the mail man, stealing christmas cards from the mailboxes, packages from doorsteps, etc.",
                            "score": 35,
                            "author": "UnorignalUser"
                        },
                        {
                            "level": 2,
                            "comment": "That happened in my area the other day. There was cctv of the guy looking into people’s letterboxes and recycling bins for parcels. (sometimes delivery drivers hide them in your recycling box) he was following a Amazon delivery van.",
                            "score": 102,
                            "author": "the-midnight-rider69"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’d be so pissed if someone stole the boots I got for christmas",
                    "score": 26,
                    "author": "PoliticalRacePlayPM"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Last night, got home when it was dark and there was a car directly across from my house. There were two Amazon packages out front. The driver started to get out but saw me driving into my driveway/garage and they went straight back in their car and drove off. 🙄\nEdit: I did share the model and color of the car to my neighborhood.",
            "score": 786,
            "author": "thisisallme",
            "replies": [
                {
                    "level": 1,
                    "comment": "Too bad you didn’t get their license plate #",
                    "score": 184,
                    "author": "Tocwa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I said the same thing. Was just too dark.",
                            "score": 103,
                            "author": "thisisallme"
                        },
                        {
                            "level": 2,
                            "comment": "Well the police still wouldnt do anything even if you had a license plate, so...",
                            "score": 66,
                            "author": "strangerkindness",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It makes it easier for them to spot the correct car though.\n\nAnytime Ive called about something a cop drives through less than 5 minutes later.",
                                    "score": 28,
                                    "author": "xXGaMeRtAgXx666",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You must have a much better and more efficient police force than a lot of places then. I called the cops when a couple in another apartment was fighting on their balcony and the dude was trying to pick his wife/gf up and throw her off the balcony, while she was yelling about how she should have cut off his dick. Cops showed up 3 hours later, luckily nobody got yeeted in the meantime.",
                                            "score": 32,
                                            "author": "Adrithia",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The one time i called the police after my home was broken into while I was at work, they reviewed the security video, said they recognized one of the thieves, dusted for prints, and I never heard from them again. Useless lol",
                                                    "score": 13,
                                                    "author": "take-money",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "around here they just have fake or not plates, paper dealer plates, full tint on all windows.. i dont understand how they are not pulled over every 15 minutes just driving around the city like that.",
                            "score": 13,
                            "author": "UnnamedStaplesDrone"
                        },
                        {
                            "level": 2,
                            "comment": "They usually don't have one or if they do it's stolen.",
                            "score": 4,
                            "author": "Suck_Me_Dry666"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Parasites. Not pirates. Just parasites.",
            "score": 825,
            "author": "gadarnol",
            "replies": [
                {
                    "level": 1,
                    "comment": "Uhh...no? Y'all realize pirates weren't amazing people right lol",
                    "score": 13,
                    "author": "Nas160"
                },
                {
                    "level": 1,
                    "comment": "THESE PEOPLE (thieves) are why if possible, you should have a tall fence around the perimeter of your property, barking dogs patrolling the yard and a metal gate which only the postal worker has the key 🔐 (access) to..in addition to merely installing security cameras which as we’ve seen here on Reddit don’t actually deter theft.. 🤨",
                    "score": 116,
                    "author": "Tocwa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a delivery man, if you have a barking dog and a fence, im leaving it in front of the fence",
                            "score": 154,
                            "author": "VindictivePrune",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Admittedly, it is hard to achieve a balance between discouraging thieves and welcoming delivery ppl",
                                    "score": 32,
                                    "author": "Tocwa"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, no. Here in NW Philadelphia were plagued with thieves hitting the corner mailboxes ( they stole the keys, or. . . ) And then we learned thefts were occurring INSIDE the p.o.\n    Thanks De joy for all you do",
                            "score": 13,
                            "author": "FullWorry3044",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, uh, I grew up in South Africa and let me assure you that none of those including razor wire and electric fencing deters theft.",
                            "score": 9,
                            "author": "ProbablyRickSantorum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "South African thievery is a step or two above the US non-drug related crimes.",
                                    "score": 5,
                                    "author": "AdministrativeCap526"
                                },
                                {
                                    "level": 3,
                                    "comment": "Those sound like some hardcore thieves",
                                    "score": 3,
                                    "author": "Tocwa"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; and a metal gate which only the postal worker has the key 🔐 (access) to\n\nWell screw UPS, Fedex, Amazon, and every other delivery service then",
                            "score": 64,
                            "author": "Blurgas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The correct answer here is a locking Dropbox. \n\nWe leave it open if we are expecting a package. Drivers drops it in and shuts the lid, locking the box. \n\nOnly time we have a worry is if we have multiple deliveries the same day, or its too big, but usually one of us can at least run home and grab one. \n\nNone of our drivers have ever had an issue with it or not used it. I really don't know why it's not caught on more. \n\nKentucky,  US btw.\n\n*edit - actually not that I watched it again, is that possibly what the black thing is in the video? Much different than ours.",
                                    "score": 52,
                                    "author": "hereforthelaughs37",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "One idea I've been curious about is if you can buy one of those drop-off boxes the USPS uses and repaint it",
                                            "score": 10,
                                            "author": "Blurgas",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You can buy mail boxes that work the same way as a PO drop box. I don't think you can buy the exact style boxes the PO uses.",
                                                    "score": 6,
                                                    "author": "UnorignalUser",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I didn’t mean it like that but your point is taken",
                                    "score": 3,
                                    "author": "Tocwa"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The delivery truck looking like the keymaker's room in Matrix 2",
                            "score": 3,
                            "author": "Warod0"
                        },
                        {
                            "level": 2,
                            "comment": "It makes society ugly, and reflects an ugly society. Every country I’ve been to where this is the norm, I can’t stand it. It’s really gross. This is not how you improve society.",
                            "score": 3,
                            "author": "Nicodemus888"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The way she sneaks up instantly tells you that she’s up to no good, reminds me of the grinch when he’s stealing everything.",
            "score": 303,
            "author": "UnicornStar1988"
        },
        {
            "level": 0,
            "comment": "Presumably “porch pirates” is shorthand for feckless opportunistic thieves now 😡",
            "score": 193,
            "author": "Ian1147",
            "replies": [
                {
                    "level": 1,
                    "comment": "Uhh no pirates were pretty shitty people too lol",
                    "score": 19,
                    "author": "Nas160"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Okay hypothetical question from a legal perspective. If one were to leave a “bait” package on their own doorstep with a sharp object or something that would harm whomever would grab it. Would you be liable?",
            "score": 30,
            "author": "Jaded_Goth",
            "replies": [
                {
                    "level": 1,
                    "comment": "Booby traps are illegal. (not a lawyer)",
                    "score": 45,
                    "author": "SaveTheAles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But pranks for lols aren't!",
                            "score": 9,
                            "author": "HatsAreEssential"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "google \"glitter bomb mark rober\" for a series of videos where a guy did this but with glitter and fart spray.",
                    "score": 32,
                    "author": "ihahp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s fine, but genuine booby traps designed to injure or kill someone are 100% illegal.\n\nSome bait to catch criminals and prank them is fine though.",
                            "score": 3,
                            "author": "the-ist-phobe",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yup. (A lawyer)",
                    "score": 26,
                    "author": "FullWorry3044",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Before lockdown in the UK, parcels never got left on steps. I used to look at videos from the US of people nicking parcels and think why are they getting left on steps rather than a neighbour or a designated hiding spot..\n\nNow Amazon drivers just leave them on the doorstep here too. I find it ridiculous.",
            "score": 373,
            "author": "beatnikstrict",
            "replies": [
                {
                    "level": 1,
                    "comment": "There was a time when I was a kid in the US I remember having to sign for all packages delivered to our door.",
                    "score": 195,
                    "author": "Bagoforganizedvegete",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same. In the 90s every package was brought to the door and the ups driver knocked and waited. However there were faaaaaar fewer packages - maybe a couple around Christmas. Pre Amazon days",
                            "score": 96,
                            "author": "GothWitchOfBrooklyn"
                        },
                        {
                            "level": 2,
                            "comment": "since covid, they even did away with that here in Australia. if it NEEDS a signature they just dont deliver it and you need to pick it up from parcel centres. if soft needs a signature the drivers can \"sign\" for it on your behalf which i find defeats the purpose but whatever my mail guy is decent so havnt had to complain yet.",
                            "score": 34,
                            "author": "vhisic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "UPS and Fedex forge my signature all the time and leave small packages worth sometimes a few thousand dollars on my doorstep. it's fucking infuriating.",
                                    "score": 8,
                                    "author": "UnnamedStaplesDrone"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I live on a farm, I now find parcels left on the ground in front of the gate, two miles up the road.",
                    "score": 35,
                    "author": "SookHe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve driven for amazon. there is a geofence they have to leave it in and yours sounds like it’s by the gate.",
                            "score": 16,
                            "author": "Lexx4"
                        },
                        {
                            "level": 2,
                            "comment": "If there is a gate with a fire number for the address then I don't blame them. As a UPS worker the only way I'd take the time to go through the gate and bring it right to the house is if the owner specifically asked me.",
                            "score": 19,
                            "author": "OohVaLa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, the entrance to the farm is not the entrance to the house property, we rent on the farm and each house has its own mailbox. They are supposed to drive to the house and drop it off. From one of the videos the farm owners showed us, the driver just pulls up parallel to the main road, chucks the package out the window towards the fence and drives off. It's usually the parcel people who use their personal cars",
                                    "score": 16,
                                    "author": "SookHe"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I found this a bit odd when I moved to London, where package delivery was a multi-neighbour ordeal.  No one had ever stolen the many, many packages that were left in front of my Canadian house.  Made me think that London was full of petty thieves; until one day TFL returned an iPod that my daughter left on The Tube.  She later lost her same iPod in a Rome subway, where it has since been enjoyed by a fellow named Adriano Armantia.",
                    "score": 11,
                    "author": "Sir_Arthur_Vandelay"
                },
                {
                    "level": 1,
                    "comment": "The sheer amount of packages that get delivered in the US now would make it impossible if they had to ring each doorbell, wait, then go ring the neighbor’s doorbell, wait, try the other neighbor, wait, then go leave a note.",
                    "score": 21,
                    "author": "2010_12_24",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Recently got a new mailman on my route. He won't wait around, too much to deliver but he at least rings the doorbell/knocks on the door when he delivers packages which is more than any in the past have done.   \n\n\nUsually I am not home when they come so it is moot but the few times I was home it was appreciated because without it I don't hear them at the door so the packages could sit for hours until I check for the mail.",
                            "score": 10,
                            "author": "Ok_Spell_4165",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have no idea what are you talking about it happened to me so many times before lockdown. Amazon,DPD(they have most strict rules now about safe places) dhl and hermes (now evri I think) they all used to do that.",
                    "score": 10,
                    "author": "Eijin88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That had never happened to me. They put it where I said. Like, in the back porch or the paper and cardboard bin.",
                            "score": 6,
                            "author": "beatnikstrict",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In Europe (At least in france) Delivery guy give you package in hands. If you are not home, the delivery guy put a note in your mailbox noticing you of the delivery guy passage and that your package got stored in the closest deposit for you to come get with a valid ID. Never ever you will see a delivery guy put a potentially valuable package outside in the view of anyone, that's putting too much faith in humanity",
            "score": 124,
            "author": "K0htA",
            "replies": [
                {
                    "level": 1,
                    "comment": "Over here in Romania we have a system that I’m pretty sure it exists in western europe too for smaller packages called “easy box”. Basically you can have your order delivered to some secure boxes that only unlock you put in a code you received on SMS and pay. These boxes are usually scattered all over our major cities, probably in smaller cities too but I’m not sure. Unfortunatelly it’s only one company that owns these so you can only use their site order through these boxes.",
                    "score": 25,
                    "author": "Leupateu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I friggin love parcel lockers. Can pick my packages in the middle of the night if I so desire. No need to play the guessing game of \"will i be home when the delivery guy comes by\". It's so convenient and rarely do I order things too big to fit in a parcel locker.",
                            "score": 6,
                            "author": "MHcharLEE",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In practice it's very different. Amazon packages are regularly left at the door in France, 2 this week were left outside my building and I was actually at home...",
                    "score": 11,
                    "author": "Ken1drick"
                },
                {
                    "level": 1,
                    "comment": "Argentina too, but yet packages may be robbed in the mail company lol (Obviously, not by strangers picking up your package)",
                    "score": 3,
                    "author": "SheClB01",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Just 2 days ago ups in paris left my cos parcel under a common tree in the yard which is open for everyone until 7pm// paris",
                    "score": 5,
                    "author": "nastikplastik"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meanwhile I have to always feel suspicious AF when I get a misdelivered package and carry it off from my own porch to bring to the neighbor's house where it was supposed to go.",
            "score": 58,
            "author": "PSteak",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amazon misdelivers my packages to a building next to me all the time. I feel like a thief taking something with my name on it.",
                    "score": 22,
                    "author": "asmallsoftvoice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Happened to me in college once. Package got delivered to unit one building over - they use the same layout and the same numbering system for each building, just a different building number.\n\nI noticed my package wasn't there went one building over, saw a box in front of the same unit. I went to grab it and the exact second I reached down, the door opened. I wasn't doing anything wrong, but it sure felt like it. I embarrassingly tried to explain how it was mis-delivered. I even showed them my ID proving it was me.\n\nBut the guy who opened the door was stoned out of his mind and couldn't care less - he just thought the pizza guy finally showed up.",
                            "score": 18,
                            "author": "psychobilly1",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This may be an unpopular opinion but - wouldn't the world be better without these people?",
            "score": 114,
            "author": "JaKtheStampede",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Excuse my ignorance, but what's the point from the porch pirates perspective... My Amazon packages contain toothpaste and dog food what can they possibly gain from this?\n\nUnless obviously a package contains something of notable worth... Are they just crack addicts stealing to get their fix etc",
            "score": 190,
            "author": "ClumsyPyro",
            "replies": [
                {
                    "level": 1,
                    "comment": "Edit its loot boxes\n\nNumbers game at that point, they might get tooth paste from you but amazon has an absolute ton of stuff that gets shipped everywhere, so it's like going to a casino or slot machines, sometimes youll walk away with big bucks, sometimes with not much, and sometimes you lose it all (getting caught)",
                    "score": 190,
                    "author": "cdunk666",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Loot boxes",
                            "score": 63,
                            "author": "jj4211"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They probably look at the packages as like a scratch-off lotto ticket or something. \n\n“There COULD be something good in them!”",
                    "score": 70,
                    "author": "Useful_Feed_7421"
                },
                {
                    "level": 1,
                    "comment": "People will steal anything doesn't even have to be boxed. We had a worthless fake poinsettia planter on our porch for decoration, it was sun damaged to hell and had cobwebs in it. One summer day I randomly open my cameras to see an unknown car pull up, methy looking woman gets out and puts her hood over her head and heads for the porch. I run to the door not sure what she's doing, and sure enough she took the planter. I ran out yelling \"it's fake!\" and they peeled off. I yelled out their plate number to get that on camera, cops said it was a successful registration hit on that vehicle and they lived in the area, never heard back.",
                    "score": 35,
                    "author": "Kinet1ca",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "eat another can of dog food. Brush your teethh. Order more toothpaste and dogfood.. Repeat",
                    "score": 18,
                    "author": "My_Body_The_Mystery"
                },
                {
                    "level": 1,
                    "comment": "Someone stole a plastic bag filled with toddler books and clothes off my porch at 4am the other morning. They even looked inside first and still took it. Some people will steal anything not locked down.",
                    "score": 15,
                    "author": "hahasadface",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wtf is wrong with people? You can’t even sell that for much money",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They don’t care about the size of the package really. What matters to them is what *could* be inside them. These people either use what they steal or sell them for money (it’s free money to them). We had issues with porch pirates on my street in the past. Lost a cookbook one time, lost medication for my senior cat another time. Thankfully that thief was eventually caught, but having things taken, no matter how small, really sucks!",
                    "score": 9,
                    "author": "robo-dragon"
                },
                {
                    "level": 1,
                    "comment": "Many of these people follow delivery trucks. So they're not just getting one house, but every house on the route. They get a lot of worthless crap, but also a lot of valuables. Also a lot of valuable goods that are for very niche hobbies, so they're worthless to the theif. Houseplants for example. Certain Houseplants can cost hundreds or even thousands of dollars, unless you know what kind of plant it is, you probably won't know if it's valuable or not. Most of these people probably wouldn't recognize a valuable plant. Meanwhile they need to be taken care of, and they're probably going to let it just die.",
                    "score": 7,
                    "author": "johnhtman",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Probably a crack addict trying to pown like 10$ for more crack",
                    "score": 4,
                    "author": "Oliveoil404"
                },
                {
                    "level": 1,
                    "comment": "I mean they don't know what's in it. There could be jewelry or an electronic in there. Or it could be toothpaste. If they don't get caught, there's not really a downside for them. If they want it, they keep it. If they don't, they can toss it or sell it.",
                    "score": 3,
                    "author": "jadegoddess"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone help me out? Did the package say something? I'm confused...",
            "score": 80,
            "author": "SaraSmashley",
            "replies": [
                {
                    "level": 1,
                    "comment": "The black thing is a lock box for packages. You open the top and put the package in, then close the top. When you do that it drops the package into the locked portion. It's impossible to grab items out of the top because the \"bottom\" is there until the top closes.\n\nIt looks like it also has a sign on top explaining to delivery drivers on what to do. Porch Pirate saw it, knew she wasn't going to score, and immediately turned away.",
                    "score": 187,
                    "author": "Trumpet6789",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was felling so stupid trying to understand what was going on here. Thanks for that.",
                            "score": 22,
                            "author": "Deaabo"
                        },
                        {
                            "level": 2,
                            "comment": "It even sounds like they say “lock box” as the video is ending.",
                            "score": 5,
                            "author": "drunken_therapist"
                        },
                        {
                            "level": 2,
                            "comment": "Yes I have this exact lock box. The top gives instructions to delivery drivers. It’s a great box when it gets used. Half the time they just throw the package in the side other times they just put it right on top of the box.",
                            "score": 3,
                            "author": "HelloKittyTiffy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Might’ve just been checking to see if there was a package",
                    "score": 48,
                    "author": "ConflictGrand4078"
                },
                {
                    "level": 1,
                    "comment": "Looks like the little box she looks at has something written on it. Could be something along the lines of \"you're being filmed\" \n\nThat also could be a lock box for packages. I use one now for small packages and anything big and expensive gets delivered to the distribution center down the street.",
                    "score": 32,
                    "author": "Paterwin"
                },
                {
                    "level": 1,
                    "comment": "I’m assuming she saw the camera",
                    "score": 27,
                    "author": "kaykay34657",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm assuming she just didn't see any packages.  She's wearing a hat, sunglasses and such to counter the cameras.",
                            "score": 55,
                            "author": "x-munk",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stupid crooks.",
            "score": 11,
            "author": "Giggingurl"
        },
        {
            "level": 0,
            "comment": "Someone stole my taxidermy fox pelt I ordered off my porch",
            "score": 10,
            "author": "Boingo_Zoingo"
        },
        {
            "level": 0,
            "comment": "I always enjoy watching those videos where a guy leaves an \"unattended\" package at his front porch and it would fire shotgun blanks.",
            "score": 8,
            "author": "Faiithe"
        },
        {
            "level": 0,
            "comment": "Maybe I've just seen too many of these videos but it's to the point I literally get anxiety about whether my packages will get stolen because they get delivered when I'm at work. There really needs to be a failsafe but I understand how many people would exploit it.",
            "score": 5,
            "author": "ugly_pizza1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Put all your wrapping trash in a box and leave it out there over the holiday. They take your trash.",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I wanna take a dump in a box and leave it for them.",
            "score": 13,
            "author": "diarrheainthehottub",
            "replies": [
                {
                    "level": 1,
                    "comment": "there's that youtube guy who got famous for leaving packages that tracked the thieves and included fart spray and glitter bombs that went off when they opened the box. kinda entertaining to watch.",
                    "score": 36,
                    "author": "black-kramer",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "My roommate accidentally got one of them by ordering some items of a (to put it delicately) very niche \"interest\". First and last time we've been porch pirated. I'm guessing the pirate was not pleased to open that one.",
                    "score": 5,
                    "author": "SadAwkwardTurtle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bad dragon delivery?",
                            "score": 6,
                            "author": "Boxed_Juice",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I told a tweaker on my doorbell cam. Put it back. He ran so I released my two dogs. Got my stuff back. My dogs got treats and belly rubs. Tweaker was arrested and taken to the hospital.",
            "score": 5,
            "author": "CollectionSlight8294"
        },
        {
            "level": 0,
            "comment": "I feel they only do it because the name is pretty cool \"porch pirate\" yavast me matey, \n\nIf it was something sillier like;\n\n\"Box prigger\" \n\nThen they wouldn't do it.",
            "score": 17,
            "author": "WheredMyPiggyGo"
        },
        {
            "level": 0,
            "comment": "Hazards on and everything.",
            "score": 3,
            "author": "octafed"
        },
        {
            "level": 0,
            "comment": "Do you have a secured locker for packages? Or is that thing something else.",
            "score": 3,
            "author": "SnooShortcuts7657"
        },
        {
            "level": 0,
            "comment": "This stuff is the only silver lining of having my house so far from the street. I hate mowing my huge ass front yard, and shoveling in winter is absolute murder, but in my 3 years in this house, I've never had anything stolen off my porch.",
            "score": 3,
            "author": "Captinsmelly987"
        },
        {
            "level": 0,
            "comment": "I wonder if their think was \"this house seems to be owned by rich people, they surely have to be ordering expensive stuff!\"",
            "score": 3,
            "author": "losthemo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thieving RATS 😡🖕🏻🖕🏻",
            "score": 3,
            "author": "Unlucky-Power4036"
        },
        {
            "level": 0,
            "comment": "Someone should copy mark rober but make it a little less friendly",
            "score": 10,
            "author": "Galaxygon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Plant a small bomb inside",
                    "score": 5,
                    "author": "introvert_silence",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fucking saw trap package",
                            "score": 3,
                            "author": "AlbanianSlaveTrader"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would touch em with a 39.5 foot pole",
            "score": 4,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As a European, I genuinely 100 % cannot comprehend, how in the world can a courier leave your (expensive) delivery on your porch, without any signature from you, or anything.",
            "score": 11,
            "author": "Nertez",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because it’s still very rare . Porch cameras have made this more visible. I order a lot of things online and never had anything stolen. In decades. I leave my door unlocked. I don’t lock my car . I live in a large city where according to the nightly news crime is threatening to destroy the city. So far, city still here",
                    "score": 13,
                    "author": "jawshoeaw"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can sympathize with those who have to steal to feed their family. But like, that is a gas-guzzling SUV in decent condition. They are clearly not hurting.\n\nThese people should be locked up",
            "score": 7,
            "author": "MJamesK",
            "replies": []
        }
    ]
}