{
    "id": "zvlw6z",
    "score": 15029,
    "title": "Woman stealing a foul ball from little girl",
    "author": "Kindly_Effort_9891",
    "date": 1672056552.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/zvlw6z",
    "media_urls": [
        "https://v.redd.it/ver581ely98a1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "This is so sad. This girl was probably so excited when she got it and felt so disappointed when the lady snatched it. And the lady was proud of it??? Wtf???",
            "score": 4016,
            "author": "Todokawa_Kaardo",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is several years old, and if memory serves the little girl got a bunch of swag from the team.",
                    "score": 2656,
                    "author": "apietenpol",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, she got hooked up. The stadium made it up to her. Pretty wholesome. I know people don’t like baseball, but it does have some really good folks involved in the game.",
                            "score": 1788,
                            "author": "tactical_tree_troll",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Little did we know, that woman was playing high IQ 3D chess. She figured she could take the ball, which is a win for her, and she'd also at the same time do a service to the little girl because people would do cool things for her out of sympathy.",
                                    "score": 58,
                                    "author": "Maixell",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "holy crap",
                                            "score": 14,
                                            "author": "AmaraCrab"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Bro? People love baseball, wym they don't?",
                                    "score": 429,
                                    "author": "-_Vorplex_-",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s pretty unanimously hated among my friends for being too boring. I can’t necessarily disagree, it can be a bit slow, but I love the game nonetheless.",
                                            "score": 337,
                                            "author": "nayr310",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's just best enjoyed in person.",
                                                    "score": 24,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes if I’m staying for 9 innings + if there’s a tie… I’m going for the hot dogs, drinks, popcorn, and walking around. (+ fireworks if it’s home game Friday where I’m from). Otherwise I would not go.",
                                                            "score": 7,
                                                            "author": "Sxilla"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I agree, I never watch baseball on the tv but I was invited to a game so I decided to go and it was a LOT more enjoyable.",
                                                            "score": 5,
                                                            "author": "TheDankNoodle"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It's only enjoyed drunk.",
                                                            "score": 3,
                                                            "author": "Keylimepietime"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's so got damn boring",
                                                    "score": 193,
                                                    "author": "PandaButtLover",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Good excuse to get a hotdog and a beer and shutdown for a few hours...",
                                                            "score": 111,
                                                            "author": "wophi",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "\"Cold hot dog and a warm beer. Perfect day\"",
                                                                    "score": 85,
                                                                    "author": "PandaButtLover",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Almost as slow as watching Golf Balls dry while submerged in water.",
                                                                            "score": -6,
                                                                            "author": "taekee"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Watching baseball and golf is like watching paint dry",
                                                            "score": 21,
                                                            "author": "MeanBig-Blue85",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I agree, snore fest",
                                                            "score": 40,
                                                            "author": "Organic_Valuable_610",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I feel this way about all sports except for Fighting ones (no, not WWE). They’re so pointless, stupid, and boring to me. \n\n Look, they’re really good at throwing a ball, and look there: they’re also really good at catching it and then running. That guy can really put that ball in that net, and that guy is good at making sure other people don’t get the ball in the net. Wow they sure can hit a ball with a stick really hard, look at that thing go. Let’s give them all millions of dollars. \n\nI also have a strong bias because of my hometown.  I lived in a small hick town and if you didn’t play sports or go to church you were considered a nobody, failure, druggy satanist. Nobody? Sure. Why would I want I be somebody amongst backwards town of incest and racism",
                                                                    "score": 2,
                                                                    "author": "bobby-spanks",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That was so many words when, “I am not athletic” is what you meant.",
                                                                            "score": 13,
                                                                            "author": "dicknut420",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah I rambled. Everyone does now and then.",
                                                                                    "score": 2,
                                                                                    "author": "bobby-spanks"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Ultimate hugging is the worst",
                                                                            "score": 4,
                                                                            "author": "Agitated_Pilot8629"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'll go even further, every ball game is boring.",
                                                                    "score": -37,
                                                                    "author": "JoPepsi",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "My argument against this is that you don’t understand it. There is so much strategy that goes into a single inning that if you don’t know what you’re looking at it may come across as boring. But everything has a purpose, from the location and speed of the pitch to the position of the defense. And what the batters goal is and what he is thinking. I think soccer is boring, but I also never played it and don’t really understand the game. Baseball is the same way.",
                                                            "score": 6,
                                                            "author": "tjshaugh",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Most boring of all sports and there are a lot of other boring ones too.",
                                                            "score": 3,
                                                            "author": "WhiskeyRadio"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You should get them to partake in a softball or slow pitch game. Baseball is lots of fun to play. I used to think it was boring to watch but that changed once I started playing. Besides it a good way to meet with a bud and grab some beers hahaha I was in the second teir right above where where Aron Judge hit his 61st. Felt so bad for the guy that dropped the bag lool think someone offered 2million for it before the game even started",
                                                    "score": 19,
                                                    "author": "cum_toast",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh mannnnn seeing that hit must’ve been crazy. I definitely agree with that, I think my love for baseball comes from playing it as a kid, and I think if my friends had a chance to play they’d definitely enjoy it more. I think I’ll have to suggest it next time we all get together.",
                                                            "score": 11,
                                                            "author": "nayr310",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "When I saw it coming our way I was a man of faith for a few seconds. We were debating about how messed up you'd get if you jumped over the railing from the first teir. Figured atleast a broken leg at minimum but totally worth the payout. I would have done it if I was the guy that fumbled it lol it was a buzz around the city. Everyone was talking about the 2million dollar ball before the game/ on the train / outside the stadium lol yeah definitely try that. My first time they needed a ringer, I couldn't hit forvshit but had wheels so I'd ground out and rip to first all the time. Made a sick catch my first game though and I started bugging the guys to put me in again !",
                                                                    "score": 6,
                                                                    "author": "cum_toast",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "All that being said I still won't watch it on TV outside of post season but have no problem going to a game, the stadium makes it a much better experience imo",
                                                                            "score": 4,
                                                                            "author": "cum_toast"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Better than dudes flailing to the ground when tapped by a butterfly.",
                                                    "score": 3,
                                                    "author": "MrRickGhastly",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "watch out you might offend some *soccer* fans (yea i said it, I watch *real* football not this friggen european stuff)\n\n^/s",
                                                            "score": 2,
                                                            "author": "nayr310"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "We don’t hate it bro.  We just don’t care about it.",
                                                    "score": 9,
                                                    "author": "JiMEagle12"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Baseball will always be a sport that's incredibly fun to play, boring as hell to watch. But that's just my opinion",
                                                    "score": 2,
                                                    "author": "SimonSimpingService"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Soccer has entered the chat.",
                                                    "score": 5,
                                                    "author": "SetPsychological6756",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Followed by Curling 🥌",
                                                            "score": 2,
                                                            "author": "Carmine-Raguzza"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Watch Cricket, then",
                                                    "score": 2,
                                                    "author": "The99thCourier"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not as slow as soccer.",
                                                    "score": -1,
                                                    "author": "pn1159",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "i wasn’t gonna be the one to say it but i’m definitely with you on that",
                                                            "score": 4,
                                                            "author": "nayr310"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Its better than (american) football lol",
                                                    "score": -5,
                                                    "author": "Plushhorizon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No you are incorrect.",
                                                            "score": 2,
                                                            "author": "1bobl"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "the majority of people don't care about the sport. they have been losing viewers and fans for years since the mid 2000s.",
                                            "score": 37,
                                            "author": "thathaitianguy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh look people confusing their own opinion with a popular opinion",
                                                    "score": -2,
                                                    "author": "OGRaysireks987",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's Reddit, what did you expect?",
                                                            "score": 2,
                                                            "author": "thearctican"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I do not love baseball. I dont fault people for liking it but I don't personally see the appeal.",
                                            "score": 14,
                                            "author": "Corslutty",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can leave and come back without fearing that I lost any life changing moments, yet still know what's going on",
                                                    "score": 2,
                                                    "author": "Chaos_1x"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The MLB has been steadily sliding downward since the late 90s. It is what it is.",
                                            "score": 8,
                                            "author": "C9RipSiK",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Baseball can be amazing, but when teams like the Houston Astros have success the sport becomes pretty terrible.",
                                            "score": 2,
                                            "author": "6TheAudacity9",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The only time I have found baseball to not be omega teir boring is if I’m at the game in person. Then all the stadium fair is more than entertaining",
                                            "score": 4,
                                            "author": "IThinkImNateDogg"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Both baseball and American football are boring AF.",
                                            "score": 3,
                                            "author": "LeDestrier",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m with you on baseball but American football boring AF lol, what are you on?",
                                                    "score": -5,
                                                    "author": "DotNormal6785",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah! AF boring, boring, boring, deal with it pal",
                                                            "score": 1,
                                                            "author": "arituck"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Baseball is boring. I think I heard a saying like baseball is only alive because it’s people having nostalgia and trying to live their younger days through baseball. Most people that play or watch, played when they were younger. \n\nWell that’s what I heard. I’m not saying it’s true. \n\nBut my opinion on baseball, it’s boring. I feel like it’s boring like NASCAR.",
                                            "score": -5,
                                            "author": "Lightyear18",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Baseball is a sport that's only fun to watch in person and it's real value comes from actually playing it because it's really fun",
                                                    "score": 6,
                                                    "author": "-_Vorplex_-"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sports are boring af",
                                            "score": -2,
                                            "author": "Drougen"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Love baseball but I won't lie it can be boring af lol",
                                            "score": 1,
                                            "author": "Itchy_Professor_4133"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Aww that’s a great ending :D",
                                    "score": 2,
                                    "author": "Todokawa_Kaardo"
                                },
                                {
                                    "level": 3,
                                    "comment": "This isn't related to the post but just a genuine question, when you say people don't like baseball, is that because it's genuinely bad or do you mean it's just not popular? \n\nI'm mainly a boxing fan, but looking for a new secondary sport to get into. Baseball might be my new go to, if it's a positive as it sounds.",
                                    "score": 2,
                                    "author": "ILS_APL_99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It is, it’s an excellent sport with a rich history, some amazing stories (look at Bug Papi), and genuinely good people. It’s truly does bring people together like no other sport (except maybe hockey). That being said the “slow” nature of the sport can drive some away. Personally I played high level ball for a long time so I love it. The only way to know if it’s for you is pick a team and watch some games. It’s truly fun!",
                                            "score": 2,
                                            "author": "tactical_tree_troll"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Since when do people not like baseball?",
                                    "score": 1,
                                    "author": "rudyattitudedee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not sure, but it’s definitely a thing. A lot of people find it boring. Which I can understand if you don’t understand the game it probably is boring.",
                                            "score": 4,
                                            "author": "tactical_tree_troll",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It basically started going downhill after all the major league teams went on strike(again) in the 90’s. Even though it technically is the national sport in America, it left enough of a gap for (American)football to squeeze through and take over.\n\nAt least I think it was the one in the 90’s. Sports history is not my thing and They went on strike like, 7 times before that",
                                            "score": 2,
                                            "author": "silent_rain36"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This also went so viral the Karen will likely never live it down, so karma was served.",
                            "score": 21,
                            "author": "CyptidProductions"
                        },
                        {
                            "level": 2,
                            "comment": "It’s not the same though.",
                            "score": 5,
                            "author": "Sandy0006"
                        },
                        {
                            "level": 2,
                            "comment": "It's a win win in my book. Little girl gets hooked up and this woman's sad behavior is forever immortalized for all to see. I like to think 90% of the people that know this woman are aware of this clip and treat her accordingly.",
                            "score": 2,
                            "author": "Anktious"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“Like taking candy from a baby!” - that old lady probably",
                    "score": 180,
                    "author": "Squidwardiard2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Like taking a foul ball from a stupid kid!” - that old lady, definitely.",
                            "score": 34,
                            "author": "devster75",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“Like robbing the happiness from a literal child!” -that old lady, 100%",
                                    "score": 18,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's not a lady, its a POS",
                    "score": 41,
                    "author": "Leon_Krueger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You spelled see you next Tuesday wrong.",
                            "score": 10,
                            "author": "Diligaf2233"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kris Jenner wins at everything",
                    "score": 12,
                    "author": "Mr_RobotNick"
                },
                {
                    "level": 1,
                    "comment": "Also- its very unlikely a foul ball, its being tossed up to the kids by a player.",
                    "score": 18,
                    "author": "inspectoroverthemine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was a foul ball that a player went after, grabbed, and tossed up in the stands.",
                            "score": 18,
                            "author": "KaisarDragon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fair point. I guess I meant: the ball is being deliberately tossed at the girl- it wasn't ripped off the bat in a random spot and the girl just happened to be standing there.",
                                    "score": 9,
                                    "author": "inspectoroverthemine",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, it is worded weird, but it is technically a foul ball. This happens a lot on foul balls that don't make it to the stands. The player will simply toss it up into them.",
                                            "score": 3,
                                            "author": "KaisarDragon",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Aren’t we all just children at heart?\n\n/s",
                    "score": 6,
                    "author": "4Bigdaddy73"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did the stadium replay this on the big screen by chance? I bet if they did that stadium would have been in an uproar.",
            "score": 1771,
            "author": "gonejahman",
            "replies": [
                {
                    "level": 1,
                    "comment": "She would probably love the attention. \n\n“Look at all these haters, Jesus really gives the strongest people the toughest battles”",
                    "score": 1621,
                    "author": "magicallybland",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I could tell just by her hair.",
                            "score": 563,
                            "author": "gonejahman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The other moms at jaiden and braiden's football practise will be talking about this for sure.",
                                    "score": 126,
                                    "author": "1singleduck",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Rude! It's spelled \"Jeighdynn\" and \"Breighdynn\"!",
                                            "score": 50,
                                            "author": "SadAwkwardTurtle",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think you mean “Jheighhdhyiinn” and “Breighhdhyiinn”",
                                                    "score": 7,
                                                    "author": "secret_orion"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What I’d do just to take a razor and go to town on it",
                                    "score": 52,
                                    "author": "Nights1405"
                                },
                                {
                                    "level": 3,
                                    "comment": "Looking like ghislane maxwell with that hair.",
                                    "score": 4,
                                    "author": "Tennis_22"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They should have played this over and over on the stadiums Jumbotron till that twat was forced to leave the game. What a POS.",
            "score": 841,
            "author": "Significant-Water845",
            "replies": [
                {
                    "level": 1,
                    "comment": "This video be old af. The kid got swag from the team",
                    "score": 188,
                    "author": "kalitarios",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Didn’t the commentators go in on her for a while too?",
                            "score": 31,
                            "author": "UnCxlored",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tbh if I was a stadium cop I’d probably tell her to give it back or face theft/battery charges. Even if they don’t stick maybe it would bring her just sliver of def awareness",
                                    "score": 7,
                                    "author": "dopebro13"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What does pos mean???\n\nEdit: figured it out by myself, yeah im stupid thanks",
                    "score": 3,
                    "author": "Randommalehuman6547",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s ok, we’re all POS’s. People of Substance",
                            "score": 2,
                            "author": "EvaVonH-Bomb",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Idk why these clips of grown adults taking baseballs from young children always make me laugh because of how absurd and pathetic it is. Like you want a foul ball that bad that you stole it from a child? A ball that will probably collect dust for years and eventually end in the trash bin?",
            "score": 211,
            "author": "Maxmutinium",
            "replies": [
                {
                    "level": 1,
                    "comment": "Foul ball* but I will say the image of a fowl ball has me cracking up",
                    "score": 48,
                    "author": "MuchoManSandyRavage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You won't be able to take harry potter very seriously then.",
                            "score": 8,
                            "author": "Specific_Ad1457"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Like. If they both went for it and she grabbed it, but noticed what happened and gave it to the kid, that would be one thing. I just can't get over the fact that she like. Committed to stealing from a seven year old kid. You're completely right that it would be junk to this lady. But, it would have been a treasure to the child.",
                    "score": 5,
                    "author": "reunitedthrowaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Her haircut was a dead giveaway",
            "score": 682,
            "author": "Junior_Teacher6446",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you even know who her husband is??? Cause he's.....a pretty big deal around there.",
                    "score": 152,
                    "author": "kaeji",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jeffrey Epstein? She looks like she just took 1st place at a Ghislaine Maxwell lookalike contest.",
                            "score": 111,
                            "author": "hatechicken82",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Karebs gonna karen.",
                    "score": 2,
                    "author": "sticksnXnbones"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is that Kris Jenner?? Lol",
            "score": 564,
            "author": "Careful_Expression63",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought Ghislaine?!",
                    "score": 344,
                    "author": "RissaMeh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah she grabbed the ball not the kid",
                            "score": 458,
                            "author": "RandumbStoner",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok that’s a fucking good line",
                                    "score": 36,
                                    "author": "spinblackcircles"
                                },
                                {
                                    "level": 3,
                                    "comment": "You think Ghislaine didn't grope the balls of kids?",
                                    "score": 25,
                                    "author": "Barbosse007"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Haha I was gonna say is that the kardashian tramp",
                    "score": 16,
                    "author": "DeezMuhfuhNizzuts"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same thing happened to me when I was 6-7 years old. Was at an expos game and Bobby Bonilla saw me above his dugout asking for a ball during pregame warmups and tossed one a little too hard and it went over my head. An older man rushed to grab it and got it before I could. The whole section I was in noticed what happened and booed him relentlessly until he gave it back, he was reluctant at first but after several minutes of boos and chants he finally did. You have to shame these people into doing the right thing.\n\nNow every July 1st when it’s Bobby Bonilla day, I get a smile on my face and remember the small act he did for me. For him it was a small gesture that he obviously doesn’t remember. For me, it was a fond memory that will be with me for the rest of my life. Will always be one of my favourite players because of it.",
            "score": 227,
            "author": "Kemomiwiwane",
            "replies": [
                {
                    "level": 1,
                    "comment": "Baseball was fun with the Killer B’s!",
                    "score": 17,
                    "author": "stumpner"
                },
                {
                    "level": 1,
                    "comment": "Same happened to me with Greg Maddox, but the guy leaned over the dugout and got it. Never did get the ball though, sadly.",
                    "score": 10,
                    "author": "WildGooseCarolinian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She needs a high five across her face",
            "score": 243,
            "author": "almostthere69420",
            "replies": [
                {
                    "level": 1,
                    "comment": "...with a chair",
                    "score": 111,
                    "author": "jasonp7599",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "…by the hulk",
                            "score": 71,
                            "author": "Lukaxius",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "From the top rope.",
                                    "score": 40,
                                    "author": "jeffersonairmattress",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Outta nowhere!",
                                            "score": 23,
                                            "author": "TheFr1nk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This thread is nice and dandy",
                                                    "score": 15,
                                                    "author": "Ash_WasTaken123"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "With a foot.",
                    "score": 13,
                    "author": "OscarDeltaAlpha",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "High foot",
                            "score": 10,
                            "author": "meeorxmox"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow the older lady has no idea she did anything wrong. All about herself and no care for anyone else. Poor little girl she looked heart broken walking up the stairs hopefully they gave her something after.",
            "score": 286,
            "author": "Pegger9999",
            "replies": [
                {
                    "level": 1,
                    "comment": "Someone else mentioned that she ended up getting a bunch of merch from the team afterwards",
                    "score": 105,
                    "author": "windmillninja"
                },
                {
                    "level": 1,
                    "comment": "She knows exactly what she did. That’s why she wouldn’t look back at that little girl. She’ll get hers.",
                    "score": 78,
                    "author": "BeenHere_DoneThis89"
                },
                {
                    "level": 1,
                    "comment": "Beyond clueless",
                    "score": 19,
                    "author": "MeniscusToSociety"
                },
                {
                    "level": 1,
                    "comment": "Don’t worry the team noticed and gave her loads of merchandise of their team",
                    "score": 3,
                    "author": "IIHackerKing092"
                },
                {
                    "level": 1,
                    "comment": "Caught up in the fervor.",
                    "score": 2,
                    "author": "inter71"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This woman 100% verbally assaults service workers after church",
            "score": 876,
            "author": "windmillninja",
            "replies": [
                {
                    "level": 1,
                    "comment": "She probably tips them with those fake $100 bills that have a bible quote them. Then pats herself on the back on social media.\n\n“What’s better than a $2 tip? Jesus”",
                    "score": 228,
                    "author": "magicallybland",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "100% she also asked to speak to the manager.",
                            "score": 67,
                            "author": "Neoarsenal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hope Dusty Baker hit her in the eye with his toothpick",
                                    "score": 8,
                                    "author": "visionzero81"
                                },
                                {
                                    "level": 3,
                                    "comment": "Mother of Karens.",
                                    "score": 21,
                                    "author": "ShoppingOutrageous87"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Applebee's staff have ptsd because of this woman.",
                    "score": 18,
                    "author": "abigllama2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And then she had a surgery, bc the ball was stuck up in her ass.",
            "score": 38,
            "author": "melo8164",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was unsuccessful",
                    "score": 5,
                    "author": "esleydobemos",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The “wow” from the woman on the other side of kids had me in stitches.",
            "score": 32,
            "author": "mypeepeehardz"
        },
        {
            "level": 0,
            "comment": "She even high fived them… «YESSS I WON OVER THAT LITTLE CHILD HIGH FIVE BABESSS»",
            "score": 83,
            "author": "Ok_Day9466"
        },
        {
            "level": 0,
            "comment": "Ghislaine Maxwell?",
            "score": 78,
            "author": "TocinoPanchetaSpeck",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can tell by how she celebrates fucking over little girls",
                    "score": 28,
                    "author": "Archietooth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can tell by how she celebrates fucking little girls\n\nftfy",
                            "score": 2,
                            "author": "T--Td"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nah, she would of taken the child and left the ball.",
                    "score": 66,
                    "author": "daeron187"
                },
                {
                    "level": 1,
                    "comment": "No. She only steals virginity and innocence",
                    "score": 11,
                    "author": "SoberTek"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This isn't even a foul it looks more like it was deliberately thrown to the little girl",
            "score": 74,
            "author": "Patriquito",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was a foul that was then chucked up to the girl i read in another comment",
                    "score": 12,
                    "author": "IIHackerKing092"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This should be pinned to the front page n show everyday.\nOh we know she's so sorry once exposed. Her true colors have shown in this clip.",
            "score": 99,
            "author": "Powerwagon64"
        },
        {
            "level": 0,
            "comment": "Her daughter looked a little mortified",
            "score": 18,
            "author": "Ande64"
        },
        {
            "level": 0,
            "comment": "Old video. Woman’s gonna pay for it forever",
            "score": 17,
            "author": "TwoWheelWanderer"
        },
        {
            "level": 0,
            "comment": "As you can clearly see, not all Karens are blonde",
            "score": 42,
            "author": "MrZaroni"
        },
        {
            "level": 0,
            "comment": "What a mean pos 😡\n\nNot only did She step in, infront of that little Girl, She didnt Catch it and then forced it out of the hands of that little Girl. Then She even High Five her friends cheering. Yeah real great Karen! You snatched a Ball from a little Girl, how low life you have to be🤦‍♀️ that her friends Hugh Five her back and cheering with her, just says it all about the groups entitlement 😳😡\n\nThat sort of behavior should be giving several years of quarantine, to all stadiums and games. No tolerance for ben mean and bully a little kid. WTF 😡",
            "score": 11,
            "author": "Primary_Meringue_902"
        },
        {
            "level": 0,
            "comment": "She’s got the Karen cut. No surprise here",
            "score": 10,
            "author": "staylifted024"
        },
        {
            "level": 0,
            "comment": "One word for her, and it is C**T",
            "score": 24,
            "author": "rhussia",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Damn Ghislaine cold",
            "score": 8,
            "author": "MKirk_Ultra"
        },
        {
            "level": 0,
            "comment": "People like this need to be shamed, and kicked out of the stadium for behavior like this. The ball was intended for the little girl, obviously, and so should be considered theft from a child.",
            "score": 9,
            "author": "Camfromnowhere"
        },
        {
            "level": 0,
            "comment": "Ghislain maxwell at a baseball game. Stealing from little kids..",
            "score": 7,
            "author": "FireInPaperBox"
        },
        {
            "level": 0,
            "comment": "She can buy many of those balls if she wants to. Why did she feel the need to compete with a child? For an adult, that ball doesn't mean much, but for a kid, it's a big difference.",
            "score": 51,
            "author": "DMeror",
            "replies": [
                {
                    "level": 1,
                    "comment": "She obviously has the maturity of a child so this is a big day for her.",
                    "score": 2,
                    "author": "Kamikaze_Ninja_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yea what a C-word…",
            "score": 6,
            "author": "BettyG2424"
        },
        {
            "level": 0,
            "comment": "Must say that little girl displayed more maturity in this scenario",
            "score": 16,
            "author": "LewdBerZerk"
        },
        {
            "level": 0,
            "comment": "Im glad the little girl got a ball at the end when the anoucer said something about going down also at the begining the emfaces on \"adult lady\"",
            "score": 15,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This reminds me of my wedding. I threw the bouquet, and my neighbor’s date, an adult woman probably 60+ who I had never met before, snatched the bouquet away from my 8 year old cousin. It was so awkward.",
            "score": 32,
            "author": "richard-bachman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wtf 😳 The audacity to do so, and in a bridal party being a very peripheral guest!\nDidnt anyone tell her to get the bouquet back to your little cousin.",
                    "score": 12,
                    "author": "Primary_Meringue_902",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No one said anything, but we all stared at her mouths agape for a minute. My cousin took it in stride- she’s a great kid.",
                            "score": 10,
                            "author": "richard-bachman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ghislaine Maxwell?",
            "score": 4,
            "author": "ShanDoyle8710"
        },
        {
            "level": 0,
            "comment": "High fives all around",
            "score": 4,
            "author": "CyKa_Blyat93"
        },
        {
            "level": 0,
            "comment": "IME at least in NY security handles these situations pretty swiftly. They tell the \"adult\" their either giving up the ball or their seat. Most choose not being ejected.",
            "score": 6,
            "author": "Rbaxter49ers"
        },
        {
            "level": 0,
            "comment": "“Sweet Dee catches a foul ball”",
            "score": 5,
            "author": "Psychological-Bit581"
        },
        {
            "level": 0,
            "comment": "What a skunk",
            "score": 5,
            "author": "OliJalapeno"
        },
        {
            "level": 0,
            "comment": "That little girl is probably the same age as this lady by now",
            "score": 4,
            "author": "Blo1630"
        },
        {
            "level": 0,
            "comment": "The look in the little girl's eyes is heart breaking, she cried. I hope the stadium owner  and team saw that and gave her lots of stuff.",
            "score": 5,
            "author": "DrGreenthumb_rb",
            "replies": []
        },
        {
            "level": 0,
            "comment": "“Hey guys! Can you believe it. I stole the ball from that little girl, High 5!”",
            "score": 5,
            "author": "toughtiggy101"
        },
        {
            "level": 0,
            "comment": "There is a direct correlation to how short a woman’s hair is to how insufferable they behave",
            "score": 47,
            "author": "Lord_Mandingo_69",
            "replies": [
                {
                    "level": 1,
                    "comment": "😭😭 I just got a haircut",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Short hair is so much more manageable 😭",
                            "score": 2,
                            "author": "pennypiepup22",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Something about middle aged short haired women just screams bitchy and high maintenance for some reason",
                    "score": 13,
                    "author": "ConflictGrand4078",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Jada Smith really took the cake with that one.",
                    "score": 2,
                    "author": "Kamikaze_Ninja_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a piece of work",
            "score": 3,
            "author": "Immediate_Raise4712"
        },
        {
            "level": 0,
            "comment": "Some people just need to bite the curb.",
            "score": 3,
            "author": "Electrical_Animal697"
        },
        {
            "level": 0,
            "comment": "What about the pathetic simp who’s so desperate to high five her?\n\nI’m pretty sure he periodically sneaks into Senior Living centres to sniff old womens’ panties to get off.",
            "score": 27,
            "author": "Half41monk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "With that haircut...that lil kid better not make a scene about this  From the video evidence that lady would probably sue that kid for assault.",
            "score": 5,
            "author": "MtnDewCasperFart"
        },
        {
            "level": 0,
            "comment": "Nobody around them reacts.   None of the other people in view does or says anything at all.",
            "score": 9,
            "author": "burywmore",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be fair, you are watching it from this perfect angle and even have a slow motion of it. I do not think it is reasonable to blame this one on the people around who may or may not understood what was going on.\n\nI want to see the reaction if the station when they show an replay of this on the big screens.",
                    "score": 20,
                    "author": "RandomComputerFellow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "uncouth behavior at Houston's stadium? shocked i tell you. actually not that shocked.",
            "score": 5,
            "author": "lospantaloonz"
        },
        {
            "level": 0,
            "comment": "I once caught a hockey puck shot almost directly to me and afterwards a kid two rows down asked for it. We worked it out but I also left understanding how people, especially competitive people, can lose their damn mind in these situations.",
            "score": 2,
            "author": "systemfrown"
        },
        {
            "level": 0,
            "comment": "A real Kunt",
            "score": 2,
            "author": "popeyegui"
        },
        {
            "level": 0,
            "comment": "I’m sorry but my child wouldn’t have gotten anything from the team because I would have taken this situation way left. She missed it, then took it from baby girl? Oh now you get to receive these hands 😌",
            "score": 2,
            "author": "QuinnEm707"
        },
        {
            "level": 0,
            "comment": "thats how someone is gunna snatch her husband and high five after lol",
            "score": 2,
            "author": "drowsydaydreamer"
        },
        {
            "level": 0,
            "comment": "I'm sorry did she just grab at a child? That would be my flimsy excuse to smack a hoe.",
            "score": 2,
            "author": "bjrharding"
        },
        {
            "level": 0,
            "comment": "The dude in the peach shirt looks like he understands what she did wrong, doesn't look like he high-fives her",
            "score": 2,
            "author": "itsOktobeGamer"
        },
        {
            "level": 0,
            "comment": "There are times when it makes me sad to be a human.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "“Oh bless her heart”",
            "score": 2,
            "author": "Jake3074"
        },
        {
            "level": 0,
            "comment": "They should have kicked her out of the stadium for that.",
            "score": 2,
            "author": "ashpanda24"
        },
        {
            "level": 0,
            "comment": "Ghislaine maxwell is such a dick to kids",
            "score": 2,
            "author": "Dyelift20111"
        },
        {
            "level": 0,
            "comment": "Didn’t know Ghislane Maxwell was out…",
            "score": 2,
            "author": "Snoo_30496"
        },
        {
            "level": 0,
            "comment": "FMD, this footage is soo old, I'm almost surprised it isn't Babe Ruth's ball she's catching.",
            "score": 2,
            "author": "Snowmann88"
        },
        {
            "level": 0,
            "comment": "That woman is so typical being a Karen that she’s even proud at it. \nBless the team for making it up to her.",
            "score": 2,
            "author": "Karena_tha_bitch"
        },
        {
            "level": 0,
            "comment": "I think I know her, pretty much her name is Karen 🤣",
            "score": 2,
            "author": "xxxkarmaxxxx"
        },
        {
            "level": 0,
            "comment": "I am so glad baseball season has restarted!!!",
            "score": 2,
            "author": "Fit-Boomer"
        },
        {
            "level": 0,
            "comment": "Please, don't ruin kid's fun that done nothing bad to you. I have a somehow similar memory -which I'm not sure if anyone wants to hear it but anyways- from when I was 7-8 y/o. My mother and I went to the book fair every year. It's was far from where we lived, almost three hours with subway. We spent over 8 hours in the book fair and we return at the evening, so we could arrive home at almost night. Well, as a 7 y/o, 8 hours of continuous walking made me tired as hell, and I couldn't stand up for 3 more hours after that, so I always found a place to sit in the subway. Once, a middle-aged woman pushed me down -I was already sitting- and I fell down on my chin -it hurts more than it seems like-. My mom started arguing with that woman but she didn't listen or feel regret at all. Without any other choices, I sat on the floor -and the subways here are really dirty-. By saying this, I'm just trying to show that kids are not always freaking stupid, but they deserve more attention, knowing they're in a more sensitive age -physical and mental- then most adults. I hope Karens understand it someday...",
            "score": 2,
            "author": "Spare-Illustrator-82",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Probably a christian",
            "score": -1,
            "author": "FriedPotatowithSalt",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"*Oh bless her heart...*\"\n\nAs a Canadian, I love southerners for this saying. It's so perfect because it says everything you need without sounding the least but offensive. Truly an incredible turn of phrase.",
            "score": 1,
            "author": "VioletJones6"
        },
        {
            "level": 0,
            "comment": "Is that Kari lake!?",
            "score": 1,
            "author": "sethmeister1989"
        },
        {
            "level": 0,
            "comment": "\"I'm a top percentile earner and I got there by taking what I want and deserve\"",
            "score": 1,
            "author": "RalfMurphy"
        },
        {
            "level": 0,
            "comment": "This is posted monthly. The girl got hooked up by the team.",
            "score": 1,
            "author": "Better__Off_Dead"
        },
        {
            "level": 0,
            "comment": "\"Well she did touch it first\"-🤓",
            "score": 1,
            "author": "Dogbean20"
        }
    ]
}