{
    "id": "zvy5bz",
    "score": 1004,
    "title": "Continuously harassing a girl for being “fat” to the point of crying",
    "author": "TheCanineLady",
    "date": 1672091993.0,
    "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/zvy5bz",
    "media_urls": [
        "https://i.redd.it/t9j7ax8zvc8a1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Jack’s wife is a confirmed baddie wtf",
            "score": 51,
            "author": "Beakdoor21"
        },
        {
            "level": 0,
            "comment": "this is a youtuber so i feel blocking his name is unnecessary. also, unrelated, but this is a bit of an old situation.",
            "score": 271,
            "author": "Monkeyojacko",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know just trying to follow rules. \n\nThe reupload is still up though and I still see people harassing her in comments to this day.",
                    "score": 64,
                    "author": "TheCanineLady"
                },
                {
                    "level": 1,
                    "comment": "Read the rules of this sub",
                    "score": -84,
                    "author": "micropeen-sheen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hate that rule my post go taken down because I don’t have the right tools to edit out a name on a video I think we should remove that rule",
                            "score": 0,
                            "author": "Amongman101YT"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "she’s not even fucking fat god i hate society",
            "score": 239,
            "author": "OhHaex",
            "replies": [
                {
                    "level": 1,
                    "comment": "I lost 50lbs and couldn't belive how much nicer people were to me lol",
                    "score": 23,
                    "author": "MasterFriendship9140"
                },
                {
                    "level": 1,
                    "comment": "Homegirls a little thicker, nothing wrong with it. Everyone's entitled to the life they choose. Other people just need to learn to mind their business.",
                    "score": 81,
                    "author": "Flashy_Let2021",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She's the same size as me. I know I'm fatter I don't need people to tell me and this is why I will never post a video.",
                            "score": 5,
                            "author": "nvrsleepagin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "exactly bro i promise you that every person after her in the comments for being fat would be considered obese if thats what \"fat\" looked like",
                    "score": 2,
                    "author": "zolopimop123"
                },
                {
                    "level": 1,
                    "comment": "She looks pretty chunky.",
                    "score": -1,
                    "author": "sadowsentry"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Body shaming anyone says more about you than the target of your vitriol",
            "score": 101,
            "author": "lonewolf143143"
        },
        {
            "level": 0,
            "comment": "Most people just want an excuse to insult others. And they will use the convenient excuse of ‘being fat is unhealthy’. Bullying will help them lose weight kinda bullshit.\n\nunless it is someone close to you, or someone whom you genuinely care about, I don’t see the point of people discussing with random strangers about their weight.",
            "score": 91,
            "author": "Ghost_1774",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. Oftentimes people who are overweight are stuck. They really genuinely would love to lose weight, but it is tough once you are stuck with your habits.\n\nCalling someone fat out in public will achieve what? The person will get more depressed and have even less motivation.\n\nLeave it to the medical professionals or people close to the person to talk about health issues.\n\nHarassing someone for their weight is senseless.\n\nBut the other side of things is this. I live in a country where my tax money funds someone's heart surgery.\n\nObesity and cardiovascular diseases are one of the biggest if not the biggest money pit in our tax system alongside our free education system and social security.\n\nWe pay a tremendous amounts of euros to fix up obese people.\n\nStill, leave it to the doctors and lawmakers to decide how to counter obesity in the long run. People are the product of their environment.\n\nCalling someone fat will always make things worse.\nI don't like ultra-plus size models who advocate for being overweight either, but it is everyone's own right to believe what they want.",
                    "score": 9,
                    "author": "TheFriendlyFinn"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -63,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I'm verbally abusing you cause I just care so much about your health\n\nYou're a real hero.",
                            "score": 47,
                            "author": "Elapse52"
                        },
                        {
                            "level": 2,
                            "comment": "Oh, get fucked. That's such a line of horseshit. You're just doing mental gymnastics to justify why you're shitty to people.",
                            "score": 26,
                            "author": "GordonBombay102"
                        },
                        {
                            "level": 2,
                            "comment": "How are you comparing a illegal thing to something like being fat. Taking something else for example. smoking drinking and so many other stuff are harmful for health. Are we going to go around grabbing cigarettes and alcohol from random strangers or make comments to them like you are going to die of cancer whenever you see them? \n\nTalking to your friend, family, your loved one. Motivating them and helping them lose weight in a positive way is the way to go. How is abusing someone who is already having so much mental issues (as you said) going to help them in any way? I am not asking you to encourage them, but there is no need to go out of your way to insult someone or bully someone to the point they are affected mentally and physically just for existing.",
                            "score": 20,
                            "author": "Ghost_1774"
                        },
                        {
                            "level": 2,
                            "comment": "Do you think fat people don't know they're fat? Saying something won't help, *they already know*",
                            "score": 9,
                            "author": "Tayloren52"
                        },
                        {
                            "level": 2,
                            "comment": "This isn't Nikacado Avocado, she's just got a little pudge. \n\n&gt;depression, or simply self esteem,\n\nYeah I wonder what would cause that here.",
                            "score": 10,
                            "author": "Saintsauron"
                        },
                        {
                            "level": 2,
                            "comment": "That is something you can only ever do with people you are very close with and actually care about, not with total strangers.",
                            "score": 1,
                            "author": "Rhadamantos"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "She’s perfect sized to me",
            "score": 52,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That’s wifey material . People are gross",
            "score": 19,
            "author": "crypt0_sports"
        },
        {
            "level": 0,
            "comment": "She’s beautiful! Wtf internet",
            "score": 75,
            "author": "bebetterthanthem",
            "replies": [
                {
                    "level": 1,
                    "comment": "She is really pretty",
                    "score": 17,
                    "author": "big_hungry_joe"
                },
                {
                    "level": 1,
                    "comment": "This statement would’ve been said regardless of how she looked tbh",
                    "score": 4,
                    "author": "PeachWhisperer"
                },
                {
                    "level": 1,
                    "comment": "Grams \"buttyful\" Body proportions have become soo unattainable that ppl can't even differentiate between what's attractive and what's unachieveble edited bs",
                    "score": 9,
                    "author": "oto60"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She’s not even fat…🤷🏻‍♂️ commenters are incorrect. She needs some positive self affirmations.",
            "score": 24,
            "author": "Successful-Split-886"
        },
        {
            "level": 0,
            "comment": "She’s not even fat wtf",
            "score": 7,
            "author": "thisbetternotcrash"
        },
        {
            "level": 0,
            "comment": "Jacksfilms on yt, if your wondering",
            "score": 3,
            "author": "Yo_moma_is_fat_lol"
        },
        {
            "level": 0,
            "comment": "Are they talking about the woman in the picture? She looks like a normal, healthy weight to me.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "i dont even think i could say that girl is \"chubby\". how tf could you call her fat ???",
            "score": 3,
            "author": "BeepBeepLettuce3"
        },
        {
            "level": 0,
            "comment": "She isn’t even that fricking fat! I hate society…",
            "score": 11,
            "author": "TheWolfOfDeathLol"
        },
        {
            "level": 0,
            "comment": "I don’t want to excuse piss poor behavior, but those who live their life on YouTube and want to complain about the trolls crack me up. What do you expect from faceless people?",
            "score": 28,
            "author": "PuzzleheadedCat8959",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s his wife, though. She’s not a YouTuber. She just appeared in one of his videos",
                    "score": 44,
                    "author": "coldestwinter-chill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To those who want to criticize, they view her as fair game - again, shitty behavior, but that’s the internet.",
                            "score": 6,
                            "author": "PuzzleheadedCat8959",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course, I understand, but it’s every man’s right to tell his fanbase that they are not welcome.",
                                    "score": 14,
                                    "author": "coldestwinter-chill"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 0,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, I accept it…\n\nOr, I don’t, but I’m just a random dude with zero power…",
                                            "score": 0,
                                            "author": "PuzzleheadedCat8959"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Who's the fat girl, then one I'm the pic? It doesn't look to me.",
            "score": 4,
            "author": "ActuallyNotAmused"
        },
        {
            "level": 0,
            "comment": "i remember when this happened\n\nwhat posses people to make fun of someone that isn’t even fat",
            "score": 2,
            "author": "batouttahell24"
        },
        {
            "level": 0,
            "comment": "What’s his channel name?",
            "score": 2,
            "author": "anobody121",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jacksfilms, he's a genuinely funny guy, I recommend watching him",
                    "score": 11,
                    "author": "Mr-TaxFraud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah okay, now I recognize him. Thanks!",
                            "score": 1,
                            "author": "anobody121"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "True those people are nasty,  but you a grown ass adult letting mean nasty people hurt you.  There will always be nasty people you have to tune them out, the world won't change for you,  you have to change to it.",
            "score": 6,
            "author": "coocoocachoo699",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let people feel what they want to feel, grown adults have insecurities too.",
                    "score": 26,
                    "author": "DolphinPencil",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Isn't reacting like this called immaturity?",
                            "score": 0,
                            "author": "Omdras_AMI"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People are allowed to have emotions",
                    "score": 7,
                    "author": "TokioHighway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Absolutely. I hate how people on the Internet have decided that people can’t feel anything and that if you do, then you’re weak, childish, etc. It’s disgusting.",
                            "score": 8,
                            "author": "Young-Idiot07"
                        },
                        {
                            "level": 2,
                            "comment": "Didn't say they weren't.  My take away is, if you let another human who isn't a loved one hurt you with words or gestures you will be hurt all the time and they win.  You lose by allowing morons to hurt you.   Could spend your whole life in despair due to others disdain for happiness.  Emotions are amazing,  the love I have for my wife is there best feeling imaginable, and only she or my mother could hurt my feelings as well.",
                            "score": -4,
                            "author": "coocoocachoo699"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Haven't seen eren on camera lately. Maybe she is self-conscious about her weight, but it doesn't seem like something to be made fun of.",
            "score": 2,
            "author": "2nd-hand-doctor"
        },
        {
            "level": 0,
            "comment": "Shes not that fat either",
            "score": 2,
            "author": "LadyPink28"
        },
        {
            "level": 0,
            "comment": "That's a huge no go zone, you never talk about women and their weight. That's like asking to die.",
            "score": 0,
            "author": "MrZaroni"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fat is not the opposite of beauty. They're actually unrelated to each other.",
                    "score": 4,
                    "author": "akai_mk3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What was the original comment?",
                            "score": 6,
                            "author": "Mediocre-Walk-1528",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -6,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i mean its not okay to say those things but cmon, writing in the comments of a Youtube videos is not \"continuously harassing\" someone",
            "score": -8,
            "author": "beisorott"
        },
        {
            "level": 0,
            "comment": "ive seen a lot of their youtube videos and they are really nice people. and definetly nicer than most of us. we shouldnt be bullying people on how much they weigh. we should be helping them.\n\n(ps. almost forgot the nt in shouldnt)",
            "score": -13,
            "author": "sovreign-0927",
            "replies": [
                {
                    "level": 1,
                    "comment": "OR you could just let them live their lives, they don't need anyone's input unless asked for it.",
                    "score": 18,
                    "author": "Use_this_1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If they want to live their lives without anyone's input they could, I don't know, NOT post videos?",
                            "score": -2,
                            "author": "Luxval"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Jack's a cuntwaffle who built his *entire* channel off of bullying people and calling people stupid. He can't just flip the script now that he suddenly decided to \"be nice\"",
                    "score": -16,
                    "author": "Solayc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lmao what? are you talking about YGS? that wouldn’t make any sense but i guess it’d be a little funny",
                            "score": 3,
                            "author": "GordionKnot"
                        },
                        {
                            "level": 2,
                            "comment": "I was about to say. Something seems off. Even the information at the bottom of the image about “being nice”.",
                            "score": 3,
                            "author": "Substantial-Green989",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The part at the bottom is from someone else who reuploaded the video.",
                                    "score": 5,
                                    "author": "GordionKnot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah makes sense! Thanks for clarifying",
                                            "score": 4,
                                            "author": "Substantial-Green989"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only person who should be calling her fat is her husband.",
            "score": -13,
            "author": "Antares987",
            "replies": [
                {
                    "level": 1,
                    "comment": "Uhm, no?? That's just as toxic, might be even more toxic and shitty than some random neck beard commenting on her. Kinda like yourself.",
                    "score": 9,
                    "author": "Ilikefishtheycute"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is that- Jacksfilms?",
            "score": 1,
            "author": "Mikaxu42"
        },
        {
            "level": 0,
            "comment": "why jacksfilms? hes a legit awesome guy, most real creator on yt",
            "score": 1,
            "author": "DragonsHidden"
        },
        {
            "level": 0,
            "comment": "I get it. \n\nBut don’t make public posts and try to minimize in a public domain if you’re too thinned skinned to deal with the public.",
            "score": 1,
            "author": "Cariboob"
        },
        {
            "level": 0,
            "comment": "I understand that they were upset at seeing these kinds of comments on their videos but at the same time... I kinda think it's pathetic. Jack has been doing YT for years and years and isn't a stranger to criticism, that's what the internet is famous for. \n\nRising to it only makes it easier for trolls to react this way next time, especially if they think it'll touch a nerve everytime. \n\nGood for you for standing up for your wife though Jack; unfortunately now trolls know this is a sore spot for both of you so she may get called fat more often, but at least you said something.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I don't get it. It looks like he's literally describing her as fat",
            "score": 1,
            "author": "Adhdpenguin813"
        },
        {
            "level": 0,
            "comment": "she isnt even fat bro wtf? she has like a little more meat on her bones than usual so she's fat? huh?",
            "score": 1,
            "author": "zolopimop123"
        },
        {
            "level": 0,
            "comment": "Who is that",
            "score": 1,
            "author": "Original_Tour488"
        },
        {
            "level": 0,
            "comment": "Unless there is a health problem people shouldnt be skinny like this dude or fat, tho this  girl is not that fat. Am i wrong?",
            "score": -2,
            "author": "Tkk_4"
        },
        {
            "level": 0,
            "comment": "Eat a salad fatty",
            "score": -1,
            "author": "Busey_in_the_walls"
        }
    ]
}