{
    "id": "11uil1d",
    "score": 6,
    "title": "New student! Tell me all about Georgia Southern. I want to know anything I can about dorms, food, classes, campus, etc. Anything helps!",
    "author": "Fabulous_Sea3327",
    "date": 1679128743.0,
    "url": "https://www.reddit.com/r/GSU/comments/11uil1d",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome! I graduated in November 2020 and had a great time at GSU.\n\n-Try to hit Chick-fil-A during non-peak times, aka when class let's out.\n\n-I recommend looking at the club web page and find like minded people to do activities with. The garden club was really fun for me.\n\n-Take advantage of the indoor hottub at the RAC. I miss that thing so much!\n\n-Dont waist your electives on dumb classes like \"walking\". There's plenty of fun electives, for example I took horseback riding and archery.\n\n-Splash in the Boro is amazing!!! Please go see it this summer at least once!\n\n-There's lots of on-campus jobs if you're interested in working while taking classes\n\n-Living off campus is much cheaper\n\n-When you get homesick listen to \"Statesboro Blues\" by Blind Willie McTell\n\n-Embrace the suck of hard classes. Never surrender.\n-Take trips to go see historic Savanah \n\n-Go see the beach at Hilton head or Tybee Island \n\n-Stop and smell the flowers while walking around campus some time \n\n-One day you're going to miss college, I'm telling you! Try and enjoy the little moments!\n\nJust to name a few. If you have any specific questions, I'm here for you!",
            "score": 14,
            "author": "Dump_Pants",
            "replies": [
                {
                    "level": 1,
                    "comment": "So for freshman year in the dorms, are people generally responsible and respectful? Are dorm rooms female or male separate? (I already have a roommate in mind so it doesn’t matter too much) it would just be something I didn’t know before hand. I will definitely look into the clubs, but what is RAC? Also are what are meal plans like? Is it only GSU specific places or does it include other things? I’m assuming I can get a student discount places??? Sorry for all the questions I just don’t have anyone to talk to about this lol",
                    "score": 1,
                    "author": "Fabulous_Sea3327",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "-The dorms are not male/female segregated, but the individual rooms are.\n\n-It's a mixed bag of roommates. I've had some that were great, and others from hell. You'll smell a lot of weed around the dorms.\n\n-RAC = Recreation Activity Center. Imagine a huge gym, indoor &amp; outdoor pools, basketball courts, rock climbing, sauna, etc. You'll have your freshman orientation there.\n\n-Freshman are required to be on a meal plan. Unlimited food and visits at the Lakeside diner and Landrum cafeterias. I thought the food was good, but it does get a little old after a while.\n\n-Also another big tip is to buy a Brita water filter pitcher. Statesboro water is GROSS AF, and in my 6 years of living there I could never get used to drinking that water straight from the tap.",
                            "score": 2,
                            "author": "Dump_Pants",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is amazing advice and information! Would you recommend me buy a bike? How is parking around dorms and class buildings? What about road qualities??? (I would be driving a pretty low car and am wondering about potholes and speed bump type things) I hate the smell of weed :( I hope it’s not too bad. Also what about laundry and cooking for areas without the included things in the dorm rooms?",
                                    "score": 1,
                                    "author": "Fabulous_Sea3327",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "On campus transportation is decent. Frequent buses and the walk is not bad either as long as you don’t have back to back classes on opposite ends of campus. A car to get to class really isn’t needed your first year since you already are required to live on campus. A car becomes useful for groceries and eating out. The buses even go to some off campus housing. I got a bike my sophomore year and rode it to campus because the bus didn’t stop near me. Roads are decent.\n\nAll dorms have either a full community kitchen and community laundry room or in your room. You will have a place to cook and do laundry. You will need to bring your own laundry and cooking supplies though.\n\nYou will smell weed. That’s a college thing, not a GSU thing. Improvise, adapt, overcome.\n\n(I graduated in 2018 but pretty sure the above is all still true. Think they have electric scooters on campus now? I’ll let a current student confirm.)",
                                            "score": 1,
                                            "author": "OldManBombadil"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "- Don't buy a bike. I had one for a little bit and it was a headache more than anything.\n\n- If you spend the night parked at your bf/gf's dorm you'll get a parking ticket if you don't park in the visitor's lot.\n\n- I drove a low car too and there are some speed bumps around campus, but only really bad one I can think of where I scraped (at the Health Services building).\n\n- as far as I know all dorms have a campus and some have stoves. Freedoms Landing has a washer and dryer in every room, but in most dorms you'll have a communal laundry room.",
                                            "score": 1,
                                            "author": "Dump_Pants"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So do students have unlimited access to the gym and pool stuff?",
                                    "score": 1,
                                    "author": "Fabulous_Sea3327",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Absolutely!",
                                            "score": 1,
                                            "author": "Dump_Pants"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go to as many football and baseball games as you can as an undergrad. They are free and a ton of fun",
            "score": 3,
            "author": "Deskust1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Will do!",
                    "score": 1,
                    "author": "Fabulous_Sea3327"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a current student and there’s so much I could tell you that I don’t even know where to start. If you have any specific questions I’d be happy to answer them",
            "score": 2,
            "author": "nomoresmoothies",
            "replies": [
                {
                    "level": 1,
                    "comment": "What are the meal plans like? Is it like high school lunches or like fast food? What about dorms? Are they generally pretty hectic? I just wanna know all I can about living there. Also for classes, are there any known extremely hard core classes to stay away from?",
                    "score": 1,
                    "author": "Fabulous_Sea3327",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Meal plans are expensive as hell but all freshman are required to have one. You do get a good amount of swipes (enough to go 3 times a day for every meal if you want). The food isn’t bad but it’s extremely repetitive. It will also make you sick at least a couple of times. After about a month you’ll learn what to avoid. It’s different for everyone, but for me it was the salad bar. Every time I got a salad, I got stomach cramps and bad poops later on.  The dining hall is set up like a giant cafeteria with multiplier different stations like salad bar, sandwiches, burritos, pizza, burger and fries, etc. there are also a couple different places on campus that take dining dollars (chick-fil-a, Starbucks, Gus mart) that you can get food from.\n\nThe dorms can be complete chaos at times but are also super fun and an essential part of college. They’ll help build character. Each dorm has a different vibe. I lived in Eagle Village and loved it. The RA’s I had there were very chill and easygoing so we got away with a lot. I don’t know too much about the other dorms but I do know to avoid  Kennedy and Watson. They are set up traditional dorm style, which means you share a room with someone and have communal bathrooms. The rest of the dorms have private bedrooms and you just share a bathroom, living room and kitchen area with your roommate. The RA’s are strictest in Centennial Place dorms. Other commenters were right when they said you will constantly be smelling weed. It’s not to bad in individual rooms but can be rank in the hallways depending on the habits of your neighbors. \n\nIt’s going to be hard to avoid tough core classes. Most of the work isn’t hard at all, it’s the professors who make or break a course. Rate My Professor will be your best friend. Use it and believe it. People don’t lie. If they say a professor is shitty, that professor is shitty and will make your life hell.",
                            "score": 2,
                            "author": "nomoresmoothies"
                        }
                    ]
                }
            ]
        }
    ]
}