{
    "id": "1v7ss1",
    "score": 36,
    "title": "The Sun Belt has released its naming standards for each of its teams. Officially, Georgia State is to be referred to as GSU and Georgia Southern is to be referred to as GS. So that's that.",
    "author": "dboyer87",
    "date": 1389730927.0,
    "url": "https://www.reddit.com/r/GSU/comments/1v7ss1",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "It would be nice if the two GSU's could have an annual rivalry game to see which school will hold the \"GSU\" title for the next year.",
            "score": 29,
            "author": "mdangles",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats badass actually. ",
                    "score": 9,
                    "author": "dboyer87",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Either way we need to come up with a trophy for the 2 teams to play for. \n\nGot a feelin I'm gonna hate u scrubs a lot more starting next year. 😏",
                            "score": 3,
                            "author": "ATLREP",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[Like This?](http://www.craftbarrow.com/ekmps/shops/julius/images/papp-art-3d-giant-letter-u-7390-p[ekm]433x433[ekm].jpg)",
                                    "score": 10,
                                    "author": "manicapathy"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Southern would keep it every year.",
                    "score": 10,
                    "author": "rl_faith"
                },
                {
                    "level": 1,
                    "comment": "We did that when we played their rugby team and not only did we win the game we also won the boat race at the social so southern is the real GSU!",
                    "score": 2,
                    "author": "yeah_i_lift_bro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The bar tar on the floor at Rudy's has more talent than Georgia State's football team.",
            "score": 15,
            "author": "trueblue31",
            "replies": [
                {
                    "level": 1,
                    "comment": "bahahahahahahahahahahahahahahhah so true\n",
                    "score": 1,
                    "author": "Azrolicious"
                }
            ]
        },
        {
            "level": 0,
            "comment": "our rivalry is going to be fucking awesome. there is so much hatred in here.\n\n\nps fuck ga state.",
            "score": 3,
            "author": "montrevux"
        },
        {
            "level": 0,
            "comment": "I really just don't understand the shit talking from the ga state fans. The panther's program record is 10-23. They've lost 16 straight games. They don't even have their own stadium to lose in. I cannot wait for that beat down. You clowns have never, and will never, win a national championship in football. Come enjoy our six flags over Statesboro someday. GATA ",
            "score": 8,
            "author": "Cbrewthehebrew",
            "replies": [
                {
                    "level": 1,
                    "comment": "HAIL SOUTHERN!",
                    "score": 2,
                    "author": "Azrolicious"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Georgia Southern beat the University of Florida last year and Georgia State beat nobody. I think this one is easy to figure out.",
            "score": 4,
            "author": "EagleWorldOrder"
        },
        {
            "level": 0,
            "comment": "Georgia Southern University alumni here, GO EAGLES!\n\nThe real GSU!",
            "score": 2,
            "author": "Azrolicious"
        },
        {
            "level": 0,
            "comment": "Sounds like someone needs to change their subreddit name",
            "score": 10,
            "author": "gsupanther",
            "replies": [
                {
                    "level": 1,
                    "comment": "/r/gsu belongs to GEORGIA STATE UNIVERSITY!!!",
                    "score": 1,
                    "author": "dboyer87",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Guess you can take that up with the mods :P",
                            "score": 1,
                            "author": "Xeno4494",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " I WILL!",
                                    "score": 0,
                                    "author": "dboyer87"
                                },
                                {
                                    "level": 3,
                                    "comment": "Your mod's name is no longer relevant either.",
                                    "score": 0,
                                    "author": "SiameseGunKiss"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "ha. funny.",
                            "score": -1,
                            "author": "rl_faith"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe that will help Ga State feel better about their athletic department, because the teams obviously aren't doing anything. ",
            "score": 7,
            "author": "ATLREP",
            "replies": [
                {
                    "level": 1,
                    "comment": "http://espn.go.com/ncb/recap?gameId=400502382\nand we haven't lost since. Thanks iggles.",
                    "score": -4,
                    "author": "Butcherandom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "http://espn.go.com/college-football/team/schedule/_/id/2247/georgia-state-panthers\n\nEmbarrassing. ",
                            "score": 4,
                            "author": "ATLREP",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good luck this fall with your new coach in your new system in your new conference, especially when you get to our dome. I wouldn't expect the 2013 panthers to show up in 2014.",
                                    "score": -9,
                                    "author": "Butcherandom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Man, I hear EVERYONE goes to Georgia State games!! They're ***SO*** much fun and full of team spirit!! Nah, Im playin. Fuck state and your lack of School Pride. ",
                                            "score": 15,
                                            "author": "Ezzar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Have fun visiting GSU in the fall. Enjoy our dome, which could fit double the population of Statesboro in it. No excuse for the lack of attendance, but it's only a matter of time. We actually have a future here in Atlanta.",
                                                    "score": -2,
                                                    "author": "Butcherandom",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "...y'all went winless last year",
                                                            "score": 7,
                                                            "author": "StatesboroBlues"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "aren't there attendance requirements to stay in the sunbelt? I'm pretty sure it's like 15K average you need to meet.\n\nDidn't your school drop $10,000 from the rafters and STILL didn't get 10K people to show?",
                                                            "score": 4,
                                                            "author": "notwhereyouare"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "\"Our\" dome. Lol",
                                                            "score": 11,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "well if they're GA residents it works. Not much for Georgia State though.",
                                                                    "score": 1,
                                                                    "author": "mehjbmeh"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "A future of losing, and eventually being shut down. It is full retard y'all play in the Georgia Dome. But Southern will be more than happy to join you in the location and hand you the first of MANY beat downs. ",
                                                            "score": 9,
                                                            "author": "lamaface21",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lol wut? That comment was full retard. It's crazy that so many southern fans actually believe we're gonna shut down. It took us 2 years to get to FBS, took you guys 100, and that was after we did. Face it; the potential of a big research school with good academics, a larger athletic budget than GS, in Atlanta is just too much to pass up. SDT-U in Statesboring with mediocre academics and a tick museum just aint gonna move the bar i'm afraid. Talk to the rest of the Sun Belt; they know we're likely to move up and you guys are lucky to have even moved to FBS.",
                                                                    "score": -4,
                                                                    "author": "gsupanther",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Georgia State has potential, but to be honest, that's all that is has. I do believe that your team is going to get better, but the reasons you listed are not the reason why. I see very little support for the Panthers despite these 'reasons' why you are a better football team. The biggest thing you can boast is a winning season your inaugural year. Since then it's been downhill for your football program. One victory in the last two years, the athletic department dropping money as an incentive to bring students in, and you think Georgia State is on an uprise? Your fan base thinks they are entitled to be successful because of its qualifications, and that's not the case. GS was built from the ground up. We had no field, plain uniforms, and a football from K-Mart when we started football, yet we won our first national championship the second year we were in the FCS. GS may be in 'Statesboring' but Paulson Stadium will always have more seats filled with people than whatever field the Panthers decide to use.\nFor the record, I prefer the GS acronym to the GSU one; I feel it pays tribute to the Georgia Southern College teams who helped compile the six national championships. You've been GSU the entire time you've compiled your ten total wins.",
                                                                            "score": 12,
                                                                            "author": "deathoftheparty"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "First of all, our academics are excellent and second how stupid you actually believe that is a factor for most major recruits. lol \n\nAll of what you're saying is moot anyway, perhaps anticipatory bitterness over how badly were going to GATA. ",
                                                                            "score": 6,
                                                                            "author": "lamaface21",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Lol. Excellent academics? You're fooling yourself. Maybe it's because we're used to high quality at GSU, you know, nationally ranked top 10 programs and such...",
                                                                                    "score": -7,
                                                                                    "author": "gsupanther",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "this guy",
                                                                            "score": 0,
                                                                            "author": "dboyer87"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Shut down with our undergrad the size of your city. Okay bro. Enjoy your shitty bars and \"women\"",
                                                                    "score": -8,
                                                                    "author": "Butcherandom",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm not a bro. And youre missing one huge component of a sustainable football program: A CAMPUS ON WHICH THE MAJORITY OF STUDENTS ACTUALLY LIVE AND CAN WALK TO THE STADIUM. Kind of a huge component of any major football program. \nI absolutely can't wait to watch us embarrass you this year and so many to come! :))",
                                                                            "score": 6,
                                                                            "author": "lamaface21",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Embarrass us? Like we already did to you in basketball? You're talking hypotheticals, i'm just looking at the game we already played this season.",
                                                                                    "score": -4,
                                                                                    "author": "gsupanther",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I think you'll be surprised. There's another major factor when it comes to building a successful football program, and that's appeal. Statesboro doesn't have it. GSU is dumping money into improving the campus. GS can do that all they want but they're still in statesboro. The end is nearer than you think for you guys. ",
                                                                                    "score": -5,
                                                                                    "author": "Butcherandom",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "lol. By women i assume you mean sheep.",
                                                                            "score": -5,
                                                                            "author": "gsupanther"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Can't wait till GSU plays Ga State in the dome. \n\nGuarantee you there will be way more GSU fans than Ga State fans. \n\nOne of these schools actually cares about their teams. ",
                                                            "score": 5,
                                                            "author": "ATLREP",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm confused. You're confusing all of us. I believe its GS vs GSU",
                                                                    "score": 5,
                                                                    "author": "dboyer87",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I believe it's a JOKE vs a real college football team.\n\nOh, did I say that in public?\n\nSorry, not sorry.\n\nGATA.",
                                                                            "score": 3,
                                                                            "author": "rl_faith"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You're in the minority. \n\n",
                                                                            "score": -5,
                                                                            "author": "ATLREP"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Still referring to it as GSU eh? Looks like it's time to let it go...",
                                                                    "score": -2,
                                                                    "author": "gsupanther",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "When were playing in the Sun Belt championship year after year, while state struggles to win a game, the media will refer to Southern as GSU.",
                                                                            "score": 2,
                                                                            "author": "ATLREP"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Our attendance is shit but I guarantee that we care enough to show up for that game. Love that GS or GASO or whatever thinks they will run us over. Good luck",
                                                                    "score": -7,
                                                                    "author": "Butcherandom",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well Georgia state is pretty terrible.",
                                                                            "score": 7,
                                                                            "author": "fratstache"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Actually our teams are pretty well off. And, conversely to you guys, so are our academics. ",
                    "score": -9,
                    "author": "gsupanther",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; And, conversely to you guys, so are our academics. \n\nAnd here's the real point.  Nobody gives a shit about sports at the end of the day, but you guys let us know when you're an R1 research institution, mkay?",
                            "score": 7,
                            "author": "CapWasRight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "/thread\n\nI'll take academics over sports any day of the week.",
                                    "score": 5,
                                    "author": "Xeno4494"
                                },
                                {
                                    "level": 3,
                                    "comment": "my fucking sides, you know this is about sports not academics right? it dosent say the university system of georgia has released its naming standards \n\nso much for those academics when you dont have any reading comprehention",
                                    "score": -5,
                                    "author": "coug117",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Way to miss the point of a friendly pissing match!  This post was never about sports, it was about the subreddits, but now you've gone and spoiled it.",
                                            "score": 4,
                                            "author": "CapWasRight"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've been alive longer than \"GS\" has been a university. You gotta earn the U.",
                            "score": -1,
                            "author": "Butcherandom",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You gotta earn respect. State has yet to do that.",
                                    "score": 3,
                                    "author": "rl_faith"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll never take State seriously. When you have losing records and have to PAY your students to show up to a game.....that's sad and merits no respect whatsoever.\n\nSouthern's student section has made other teams CRY from how much loyalty they spew out at games.\n\nHail Southern. The REAL GSU.",
            "score": 7,
            "author": "rl_faith",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hail Southern!",
                    "score": 3,
                    "author": "Simbot9000"
                },
                {
                    "level": 1,
                    "comment": "Hail Southern.",
                    "score": 3,
                    "author": "trueblue31"
                },
                {
                    "level": 1,
                    "comment": "Hail Southern. ",
                    "score": 8,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This conversation again? Who care what we are called? Only thing that matters is the fact that we destroy state this year and bring 10k more to their home game. ",
            "score": 1,
            "author": "hail_southern"
        },
        {
            "level": 0,
            "comment": "Let the downvotes begin. ahahahaha!",
            "score": -4,
            "author": "dboyer87"
        },
        {
            "level": 0,
            "comment": "Am I the only one who just doesn't care one bit?",
            "score": 0,
            "author": "notmadeofbeef"
        },
        {
            "level": 0,
            "comment": "There's a lot more to a school than its acronym. Idk why this is such a big deal to people.",
            "score": -3,
            "author": "Xeno4494",
            "replies": [
                {
                    "level": 1,
                    "comment": "For me it's mostly how the FUCK were supposed to call ourselves \"GS\"... \"GSU\" rolls off the tongue. Oh well, \"Southern\" it is!",
                    "score": 6,
                    "author": "crashdummy45",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Since when do you call your team by its official scoring acronym? You don't call the Braves or the Falcons \"ATL\" just because that's their official acronym on the score board.",
                            "score": 1,
                            "author": "notmadeofbeef",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well the choice of acronym is different for everybody, but the main topic of debate has been who is the \"official\" gsu. Since this is the most official ruling we've received thus far, there's nothing much else GS can do but admit defeat. ",
                                    "score": 0,
                                    "author": "crashdummy45",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Okay whatever. I really just don't care.",
                                            "score": 0,
                                            "author": "notmadeofbeef"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Football doesn't matter. Butts in seats matter. Georgia Southern and West GA will completely shut down before Georgia State. Holla back when Southern has 32,000 students and owns a couple of downtown Atlanta skyrises. Sports is just a gimmick distraction to draw attention from job placement and real world internships.  ",
            "score": -2,
            "author": "Justhammer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dude, wut. Aside from your first game, you've never touched that kind of attendance. It was a novelty game. Tell me, were the not reports this past year about your inflated attendance numbers (which were already embarrassing low)? And did your AD not publicly say that she'll buy tickets, personally, so that State doesn't fall before the required NCAA DI 15k attendance? Yes, those both happened. \n\nWe AVERAGED 20k+ (past season was low due to restrictions because of construction). \n\nOwn skyscrapers? Weak. You can only build up, I wouldn't expect anything else. Our campus is much larger than UGA's and about 12x larger than yours. Give us a cookie. ",
                    "score": 3,
                    "author": "EagleBoro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hail Southern.",
                            "score": 1,
                            "author": "rl_faith"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are you a moron.... Southern has an almost 20k enrollment and rising.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Enrollment topped 20k in 2011. We've been hovering in the mid 20's ever since. But I think fall 2014 is gonna push us over 21k for sure.",
                            "score": 0,
                            "author": "gsuengineer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i graduated in may of 2010 so my numbers were off.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "'Grats!\n",
                                            "score": 0,
                                            "author": "gsuengineer",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hard to imagine it was almost 4 years ago.",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reading through the comments I just want to say:\n\nFuck Georgia Southern.",
            "score": -11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Takes a big man to throw out insults and retreat rather than take your downvotes. I guess this is the type of class we should expect from Ga State.",
                    "score": 10,
                    "author": "indotherm"
                }
            ]
        }
    ]
}