{
    "id": "7v9fu0",
    "score": 29,
    "title": "Edwin Jackson, former Eagle, was killed by a drunk driver last night.",
    "author": "Penguinkeith",
    "date": 1517777022.0,
    "url": "https://www.reddit.com/r/GSU/comments/7v9fu0",
    "media_urls": [
        "https://www.indystar.com/story/news/crime/2018/02/04/suspected-drunken-driver-kills-2-70/304726002/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This is a real loss. I didn't know him personally but I got to see him play in every game at Southern and watched his interviews. He was not only a great football player, but a great person. This one hurts.",
            "score": 11,
            "author": "indotherm"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;The presence of a detainer is not indicative of an individual’s immigration status. Further, detainers do not initiate deportation proceedings and do not signify whether or not a person will be deported.\n\nSo he may not be illegal.\n\nHere's an article about a US citizen who had a detainer placed on his arrest record. https://www.texastribune.org/2016/02/27/us-citizen-held-immigration-question/",
                    "score": 0,
                    "author": "notwhereyouare",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oppps................................\n\n\nREVEALED: 'Drunk' driver who killed Indianapolis Colts linebacker Edwin Jackson is a Guatemalan illegal immigrant who has been deported twice and made it back into the US under a fake name\nIndianapolis Colts say linebacker Edwin Jackson was one of two men killed when a drunk driver struck them early on Sunday\nState police identified the victims as Jackson, who grew up in Atlanta, and 54-year-old Jeffrey Monroe, of Avon, Indiana\nPolice arrested a man who said he was 37-year-old Alex Cabrera Gonsales  \nLater found out his name is Manuel Orrego-Savala, a Guatemalan illegal immigrant who was using an alias\nHe had been deported twice before, once in 2007 and again in 2009 \nOrrego-Savala drove without a license and a BAC of at least .15, police say\nHe allegedly struck them before dawn on Sunday and then tried to flee on foot\nThe Colts said in a statement that the team is 'heartbroken' by Jackson's death \n\nhttp://www.dailymail.co.uk/news/article-5353535/Drunk-driver-killed-Colts-player-illegally.html",
                            "score": 5,
                            "author": "bfwilley",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not sure why we need to exploit a horrible tragedy by fear-mongering about 'illegal aliens'.",
                                    "score": 4,
                                    "author": "redavid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe. Not like plenty of citizens or legal residents don’t drive drunk and kill people, though. The fact that this person was apparently an ‘illegal immigrant’ doesn’t really have anything to do with what happened.",
                                                    "score": 1,
                                                    "author": "redavid"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He was one of those walk-on to NFL dreams you like to hear of. I hope his story comes to mind any time anyone on this sub thinks about driving while intoxicated.",
            "score": 6,
            "author": "deathoftheparty"
        },
        {
            "level": 0,
            "comment": "Damn, Edwin was one of my favorite players to watch my freshman year. This really sucks.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Damn shame. Take an uber if you have been drinking.",
            "score": 3,
            "author": "duderex88",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was in an Uber.  Apparently the driver had to pull over because he was sick, and they got hit on the shoulder of the road.  No matter what it’s tragic, and yes take an Uber or Lycra or call a friend if you’ve been drinking.",
                    "score": 5,
                    "author": "daygo448",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know he was he did the responsible thing the driver that killed him didn't. ",
                            "score": 8,
                            "author": "duderex88"
                        }
                    ]
                }
            ]
        }
    ]
}