{
    "id": "9d8io9",
    "score": 9,
    "title": "Presidential Search Committee announces a confidential search for GS' next president",
    "author": "RhinestoneTaco",
    "date": 1536166799.0,
    "url": "https://www.reddit.com/r/GSU/comments/9d8io9",
    "media_urls": [
        "http://www.thegeorgeanne.com/news/article_eb4f73ee-6244-53ef-af37-e0384461e7f2.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Good or bad? ",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "99.999% of all Job searches are confidential.  College president searches have traditionally been open but that trend is changing. This just means there won't be open forums before the final selection is made. I've never seen those have an actual effect on the outcome either way the search committee makes the decision.\n\na closed search also has the advantage of people being able to throw their hat in the ring that don't necessarily want their current employers to know their leaving yet.",
                    "score": 4,
                    "author": "fetch04",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My worry, particularly with a university president position, is that a closed search can sometimes be used as a way to sneak in an outside candidate -- often a political friend of the Governor or someone who donates a lot of money to the state assembly -- who would otherwise not be qualified for the position. \n\nIn an open search, political picks are scrutinized in the sunshine. In a closes search, there's far less time to do that.  ",
                            "score": 2,
                            "author": "RhinestoneTaco",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That is absolutely an advantage of open searches.  This scrutiny becomes easier.  However, with a search committee formed this is unlikely.  The USG has directly appointed presidents in the past (Kennesaw) and don't seem interested in doing that here.",
                                    "score": 1,
                                    "author": "fetch04",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; However, with a search committee formed this is unlikely.\n\nI'm less worried about a direct appointment -- they'd have already done that if they wanted to -- and more worried about a political favorite getting ushered through the closed candidate pool and into the open finalists selection without outside scrutiny. \n\nNamely, I very much don't want GSU to end up like FSU has with John Thrasher. ",
                                            "score": 1,
                                            "author": "RhinestoneTaco"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Like with what happened at KSU. ",
                                    "score": 1,
                                    "author": "phoenixgsu"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I agree, as long as the committee is transparent in which direction they see the University growing in. ",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}