{
    "id": "afc1sv",
    "score": 10,
    "title": "Armstrong Internet Speeds(on-campus)",
    "author": "TxOutlaw24",
    "date": 1547329239.0,
    "url": "https://www.reddit.com/r/GSU/comments/afc1sv",
    "media_urls": [
        "https://www.reddit.com/r/GSU/comments/afc1sv/armstrong_internet_speedsoncampus/"
    ],
    "other_urls": [
        "http://www.speedtest.net/result/7952341896.png)"
    ],
    "postText": "Hi, so I researched heavily and couldn't find anything on this before I moved here to live on campus so I assume some people are very curious about internet speeds as I was if you are living on campus..\n\nI live in University Terrace and here are the internet speeds for my room. \n\n[Speeds](http://www.speedtest.net/result/7952341896.png)\n\nI come from a house with 100/10 so I can deal with this, especially with a lot more upload speed.\n\nAlso, I don't have a picture of the one Lab's speed I went into the other day but those speeds were around 500/500 up and down so pretty good.\n\nEDIT: the 50/50 internet is free. hopefully it stays that way.(you can upgrade to 100/100 for $89/month)",
    "comments": [
        {
            "level": 0,
            "comment": "I live in Freedoms Landing in Statesboro and it’s around 80 down 80 up, but it will spike down to zero for a micro second every minute or two. It’s stupid as shit and kinda pisses me off when I’m playing a game like Siege or something.",
            "score": 3,
            "author": "CajunBoi69"
        },
        {
            "level": 0,
            "comment": "I pay 67 for 100/20 but I don't live on campus",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That's pretty awesome. I cannot remember what the speeds were in Statesboro in 2015. However, when I was in grad school at Texas A&amp;M I paid $100 a month for 100/20 in 2016. I live in Tallahassee now and pay $119 a month. Google says 9.8/5.63. Xfinity (my provider) says 72/5.9. It's trash. Side note, my parents pay $50+ a month for sub 10/10 in rural Lee County, GA. Internet service around here is pretty shitty. ",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Man that sucks about Xfinity. But I've heard they fuck people.. I lived in Fort Worth Texas last year before I moved to Florida and my parents paid around $100 for 25/5 so I know the pain. Now my parents pay $90 for 110/10 which is decent. BTW, the internet here on campus is free.. forgot to mention that.",
                    "score": 1,
                    "author": "TxOutlaw24"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live in Southern Pines and I get about 95/95 on wifi and a little bit higher on ethernet. Pins is between 2 to 10ms",
            "score": 1,
            "author": "TheAllHolyOne"
        }
    ]
}