{
    "id": "ahbjw4",
    "score": 9,
    "title": "Documents posted by GSU administration provide further background on commencement ceremony changes.",
    "author": "RhinestoneTaco",
    "date": 1547825303.0,
    "url": "https://www.reddit.com/r/GSU/comments/ahbjw4",
    "media_urls": [
        "http://www.thegeorgeanne.com/news/article_061358fc-3418-57a1-9477-6203aa9de118.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "God damn that would be one of the dumbest things GSU has ever done I am more or less okay with having different commencements for different colleges but for fucks sake. Just let the Armstrong campus have their own commencement or wrap it in with the one in Statesboro. Having over 900 students A bit over 20% of all the people graduating this spring  (who have to graduate at a campus they probably have never set foot on)  drive 50 miles just to walk is fucking absurd. Especially when we have a big ole stadium here in the boro.\n\n&amp;#x200B;\n\nTLDR Option 2 is the only one worth considering imo.",
            "score": 2,
            "author": "Penguinkeith",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I am more or less okay with having different commencements for different colleges but for fucks sake. Just let the Armstrong campus have their own commencement or wrap it in with the one in Statesboro. \n\nI am just guessing, but I bet that what happened was they decided to split the graduations up via college -- which I think is actually a smart move, from a logistics standpoint spring graduation has gotten hard to manage because of its size, and most universities with more than 20k students do it that way anyway. \n\nBut, I bet when they split the colleges out on paper, they realized that if you split them via college AND campus, each nugget of students is too small to justify the use of the bigger venues. \n\n",
                    "score": 1,
                    "author": "RhinestoneTaco"
                }
            ]
        }
    ]
}