{
    "id": "ak7u19",
    "score": 10,
    "title": "Question about the Gus Bus",
    "author": "McFloppers",
    "date": 1548555311.0,
    "url": "https://www.reddit.com/r/GSU/comments/ak7u19",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone used the Gus bus before? How does it work? Will they pick you up and drop you off anywhere within a reasonable distance (2.5 miles away)? If my date doesn't go to GSU can she still ride? If not, can she just give the name of a roommate that does go to GSU or do they check student id's or student #'s? ",
    "comments": [
        {
            "level": 0,
            "comment": "Isn't Gus bus a charter bus service? Not affiliated with the school I think.\n\nOr are you thinking of the actual campus bus system?",
            "score": 5,
            "author": "Penguinkeith",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a free service run by the SGA. It only runs Friday and Saturday from 10pm-1am.",
                    "score": 3,
                    "author": "McFloppers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shuttlegus I'm pretty sure it's no questions asked. And it'll take you home from anywhere in Statesboro ",
                            "score": 5,
                            "author": "Penguinkeith"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah ShuttleGus is a few vans that run on the weekends and don’t ask anything about why you need a ride and I don’t recall them asking for student IDs but I would think even if they do, as long as one of you are students they’d take you. At the end of the day, they’re there to help. The goal is to keep everyone safe and off the roads if they don’t need to be, but they’ll take you anywhere in town for any reason. They’ve even taken people to the store to buy groceries. \nI used to work for the SGA in a non-senator/elected a few years back, and designed a lot of the rebranding of it. ",
            "score": 3,
            "author": "jus_tin"
        }
    ]
}