{
    "id": "evaw7o",
    "score": 3,
    "title": "Apartments/off campus housing",
    "author": "laurawake",
    "date": 1580242594.0,
    "url": "https://www.reddit.com/r/GSU/comments/evaw7o",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a transfer student coming in Fall 2020 as a Nursing major. I’m trying to find the best apartments to live in off campus! I’ve looked into the Islands and didn’t know if y’all or anyone you know lives there! I’d appreciate any information on houses, apartments, or condos. I’ve looked into 111 South, the Hudson, and the Monarch. Also I am possibly looking for roommates. I am 18 and will be a sophomore at GSU in the Fall, I have one of my friends who might be my roommate but if she doesn’t I would love to make new friends who would want to room with me! I’m rushing as well so we could rush together!! Comment or message me!!",
    "comments": [
        {
            "level": 0,
            "comment": "The Hudson is a great place I am a alumni of gsu and lived at The Hudson(The Forums) recent name in the past. It is under good management.If you go for a tour make sure to ask to speak to Bianca .",
            "score": 5,
            "author": "kraavin"
        },
        {
            "level": 0,
            "comment": "Lakeview is also good! I've lived there for 4 years. They recently upgraded everything (hardwood floors, ceiling fans, etc.). It's super close to Walmart Marketplace and McAlisters. A bit further from campus, but they have a bus.",
            "score": 2,
            "author": "pinklionesss"
        },
        {
            "level": 0,
            "comment": "I love the Hudson!  They are super nice.  Also, people day Monarch is nice but my mom knew an alumni and he said Monarch is nice but mean when you leave.  I'm not sure what is meant by that.",
            "score": 2,
            "author": "StarLightHope"
        },
        {
            "level": 0,
            "comment": "I'm at Monarch atm, I can't really speak for the other places. I'll be there for only 6 months since I'm taking over someone else's lease.\n\nI started out rough with my roommates, but it's gotten better. As for the apartment itself, it's quite nice for the money (I'm in a 4BD/4.5BR), which is $565/month. All the Monarch units have a half bath, which is nice for guests. My room is quite large, I was able to fit two desks in there and still have a wide open area. The unlimited coffee/tea/hot cocoa is nice, too. Their website lists the other amenities they have.\n\nWelcome to Southern!",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}