{
    "id": "fou9nf",
    "score": 0,
    "title": "Petition for Georgia Southern to give A's to all students gains thousands of signatures",
    "author": "RhinestoneTaco",
    "date": 1585157119.0,
    "url": "https://www.reddit.com/r/GSU/comments/fou9nf",
    "media_urls": [
        "http://www.thegeorgeanne.com/news/article_58edd98a-6e9b-11ea-9d59-63b6846f1c77.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly as a student, I think that a pass fail option is a fairer idea and is also what a lot of other schools have been doing. That being said, I'm also not complaining if they were to magically give me A's for all of my classes this semester.",
            "score": 9,
            "author": "The_illuminati_1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pass/fail would be my preference as well.",
                    "score": 6,
                    "author": "RhinestoneTaco"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I say give the grade they currently have. If they have a C, why do they deserve to get an A in the class",
            "score": 3,
            "author": "notwhereyouare"
        },
        {
            "level": 0,
            "comment": "Seriously, what did Marrero expect when he shut down the school offering little guidance to faculty and even less to students?\n\nYou can't just 180 an entire system and not expect substantial amounts of people to be frustrated and at a loss at how to turn in assignments through their phones... especially when you also shut down much of the students only access to internet (the libraries).\n\nAnd for me, as a veteran student, I worry because my benefits are affected by this crap.\n\nJust under a third of the student body is in Academic Probation, what'd they think was gonna happen!?\n\nScrew this, I'm dropping out and flip some burgers for a few months until I pay off these loan and benefit debts. I'll come back next semester.",
            "score": 1,
            "author": "GunnyK92"
        }
    ]
}