{
    "id": "icm9fv",
    "score": 36,
    "title": "Face coverings now required in Statesboro",
    "author": "RhinestoneTaco",
    "date": 1597838333.0,
    "url": "https://www.reddit.com/r/GSU/comments/icm9fv",
    "media_urls": [
        "https://www.wjcl.com/article/face-coverings-now-required-in-statesboro/33639359"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I honestly don't expect people to listen. I saw about 75-100 people walking from Greek Row to Blue Room yesterday, no masks. This virus is about to explode here.",
            "score": 21,
            "author": "Joe555678",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "AFAIK the pln is to go online after Thanksgiving? I don't think they'll make it that long.",
                            "score": 4,
                            "author": "Joe555678",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm literally holding onto my classes until tomorrow. It's looking like the school is committing to a full semester, but I'm betting big bucks that they're gonna shut it down early next week (when everyone has paid their tuition).",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Luckily for me, I Just graduated last semester; Im not sure that I would be going back this semester unless all my classes were online.",
                                            "score": 4,
                                            "author": "Joe555678",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Same here. My engineering profs don't seem to be that great at online instruction. I think I might pass lol.\n\nAlso it's nice to see alumni here on this sub",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Also was am engineering student. Im glad that I didn't have many major classes my last semester cause I don't think I could have done it online.",
                                                            "score": 2,
                                                            "author": "Joe555678"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; I'm betting big bucks that they're gonna shut it down early next week (when everyone has paid their tuition).\n\nI do believe you'll lose that bet. \n\nThe university won't even have data to forward-face until Monday at the earliest, and are planning on only releasing data weekly. And from the faculty senate meeting yesterday, our official positive numbers through the first week have remained low. \n\nI think folks who believe we're going to move online super early in the semester are 1) underestimating how stubborn the USG is, and 2) forgetting that administration makes this decision, not faculty. No amount of faculty complaining will make that needle move an inch. Administration is, and has been, dead-set on keeping an in-person semester. \n\nMarrero said in the faculty senate meeting yesterday that they've got a slew of steps they already plan to take if needed when numbers go up -- moving individual classes online, or moving classes online only for folks who live in a particular apartment complex or dorm wing if that ends up being a problem -- that they will try for at least a few weeks before going fully online if it comes to that.",
                                            "score": 2,
                                            "author": "RhinestoneTaco",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wow, it almost sounds like the school isn't as careless as I thought they were. Good to know",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "UGA made that official -- we still have not, but me and pretty much everyone else in my department has made that our unofficial policy.",
                                    "score": 2,
                                    "author": "RhinestoneTaco",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are professors given the option to put their classes online? Or are there rules about in class teaching this semester?",
                                            "score": 2,
                                            "author": "Joe555678",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Are professors given the option to put their classes online?\n\nNot at this point. For faculty to teach online, they had to get a doctor to send documentation to the university proving you have a medical condition that would put you in the \"high-risk\" category for COVID. And that paperwork had to be filed by the beginning of July.\n\nAccording to what we were told yesterday, about 77% of all classes at the university are in-person. Less than 10% are online. The rest are hybrid.   \n\n&gt;Or are there rules about in class teaching this semester?\n\nThere's a bunch. Masks are mandatory. Classrooms have smaller capacity limits and dividers up for social distancing. The majority of in-person classes are what we call \"grouped.\" As in, A student in a T/R class would be put in the Thursday Group and only come in-person for Thursday. On Tuesday, depending on what the given professor chose, you might watch a Zoom lecture live, or a recorded Zoom lecture, or work on an assignment outside of class during what would normally be class time.",
                                                    "score": 2,
                                                    "author": "RhinestoneTaco",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thanks for the in depth explanation! Hopefully things dont go complete sideways in the next few weeks.",
                                                            "score": 2,
                                                            "author": "Joe555678"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Long enough to keep that money.",
                            "score": 0,
                            "author": "phoenixgsu"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good move. Hopefully it's not too late. I don't believe for a second that anyone is going to enforce this but we will see.",
            "score": 21,
            "author": "McFloppers"
        },
        {
            "level": 0,
            "comment": "Go to any urban hospital and talk to a doctor, they will tell you ICU has become a death sentence and most are not accepting transfers. Yet I STILL hear people calling this a hoax.",
            "score": 10,
            "author": "TheLocke"
        }
    ]
}