{
    "id": "ldrewe",
    "score": 2,
    "title": "Sociology Undergrads: Carroll Building - Some Advice",
    "author": "flashmanMRP",
    "date": 1612591958.0,
    "url": "https://www.reddit.com/r/GSU/comments/ldrewe",
    "media_urls": [],
    "other_urls": [],
    "postText": "It's a great major (class of '13 here)  It really is... but hell - 2/3's or more of my class had ZERO plans after Statesboro -- The most important thing you need to be thinking about is how you plan to use this unique degree.\n\nMulti-disciplinary team building is a huge buzz word right now.\n\nFind a niche. When I lived at Southern Pines (#118)  I  got really in to the college scene and all ... once I got over that... this idea I started thinking about: How will I use my degree in SOCI ? You need to be thinking about this.\n\nMy roommate at SoPi got his crosshairs set on Pharmacy because in his words.... \"Why the hell not?\n\nI know this is quiet random, but think about it ...sewer grates - nuts/bolts - whatevr -- there's a lot of money to be made ----  making contract money on the most mundane government supply items... who is making that money &amp; why not me?  My hot fantasy in college was adhesives .\n\nIt's as that easy. you are obviously socialized if you are involved with this major  &amp; as a SOCI major you have a deeper understanding of social interactions.\n\nAfter college find a niche - Mine ended up being paint. Boring wall paint. But actually there ia a lot to unpack between Epoxys/Alkyds/ Xylene....  I promise you there is a lot to understand in this sub- **discipline**   BUT, that is not the point .\n\nYou can learn the specs of any widget. And after you learn the ins and outs - before you know it you are an expert on some obscure topic.\n\nEspecially if you survived Eric SILVA's theory class - \\[My #1 favorite class - but very challenging\\]\n\nSALES DRIVES BUSINESS  - BECOME A SALES REP it's awesome",
    "comments": [
        {
            "level": 0,
            "comment": "Please feel free to PM for better Prof info &amp; Advice",
            "score": 1,
            "author": "flashmanMRP"
        }
    ]
}