{
    "id": "lxdtca",
    "score": 12,
    "title": "To everyone at the Walmart not wearing masks",
    "author": "can-not-compute",
    "date": 1614836855.0,
    "url": "https://www.reddit.com/r/GSU/comments/lxdtca",
    "media_urls": [],
    "other_urls": [],
    "postText": "This isn’t entirely GSU specific, but it is directed mostly towards those of us that are in college.\n\nTo everyone at the Walmart not wearing masks: you have actual problems. For the last however many months, you’ve been idiots, but now that it’s been affecting the university directly for almost a year... you have serious empathy problems. Same goes for the people lining up in swarms outside Dingus at 5 something on a Monday night. Same for anyone else partaking in any other similar situation.\n\nThere are still some people on campus walking around in buildings and testing centers without masks on. These people know they’re about to be in a computer lab or some other type of enclosed space around MANY other people, and they’re fully content not wearing a mask.\n\nI was at Walmart last week. There was this old lady who was getting around just fine, but she was the stereotypical older person at a store: going slow, had her shopping list written on a notepad in red ink, taking her time making decisions. All around her were friend groups bumbling, doing fuck-all, and not a single mask in sight. People like HER are the victims to your recklessness. You and your friends may not be impacted as harshly, but many, many innocent people like her have been taken down by this.\n\nI suppose if you’re content not wearing a mask inside a store, you probably never have been from the jump, and so this post won’t resonate with you in the slightest. I just wanted to vent. Majority of you doing this BS are probably the same ones complaining about nothing going back to normal, but you’re literally the reason why.\n\nIf you have a blatant disregard for those around you, you have no right to complain about a “new” normal, and you have no right to complain about online classes. If you’re the type of person walking in campus buildings and around stores without a mask on, I hope you’re happy. You’re the reason why we’re rounding around the one-year anniversary of the school’s shutdown last March with COVID still a concern.\n\nEDIT: To those of you who ran across this post/subreddit, welcome to Statesboro! I believe this town alone tanks the average IQ of not only Georgia, but the entire southeast region as a whole. We’re glad to have you.",
    "comments": [
        {
            "level": 0,
            "comment": "I graduated from Southern and lived in Statesboro for 7 years. A lot of roots in that town.\n\nThat said, its full of the most selfish dumbfucks who were too stupid to get into another school in GA and it shows in a big way.",
            "score": 6,
            "author": "DoorJambRambler",
            "replies": [
                {
                    "level": 1,
                    "comment": "taking the college argument out of the equation bc i think southern is a really great place - agreed. the people around here are nigh immovable. pure selfishishness",
                    "score": 3,
                    "author": "can-not-compute"
                }
            ]
        },
        {
            "level": 0,
            "comment": "sounds like someone is mad they don’t have any friends to go to dingus with",
            "score": 8,
            "author": "nomoresmoothies",
            "replies": [
                {
                    "level": 1,
                    "comment": "you couldn’t have made yourself look like more of a tool if you tried. congrats",
                    "score": 2,
                    "author": "can-not-compute",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The mask is to protect others from you. Not you from others. There is no excuse to be this fucking stupid anymore. What do you propose the elderly or people with immunodeficiency do? Just die because you cant wear a piece of fucking cloth?",
                                    "score": 4,
                                    "author": "DoorJambRambler",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "it’s like we’re living in a bizarro world. god forbid an even worse epidemic hits, and that virus is even deadlier. we will be screwed. people can’t handle having their lives be “put on hold” even if it’s to protect others. people not being able to go to dingus is so stupidly inconsequential. i’m literally kept awake at night thinking about how selfish people are sometimes",
                                            "score": 4,
                                            "author": "can-not-compute",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": -1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "i do go out. but i also have the capability of putting two and two together and realizing that it’s the incorrect thing to do\n\nyou really seem bent in defending being a shitty person. should probably stop that and place it elsewhere",
                                                            "score": 5,
                                                            "author": "can-not-compute"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "nope, youre the exact reason why life is still “on hold.” you and people like you. it’s seriously just tragically stupid at this point. baffling. you’re the exact cause of what you’re complaining about. this is mind numbing",
                                    "score": 3,
                                    "author": "can-not-compute",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 0,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "your right to go out does not supersede others’ right to live. you are selfish.",
                                                    "score": 4,
                                                    "author": "can-not-compute",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "it’s great that you’re taking care of yourself and putting your needs first! self love is important. but your self love does not trump the health of those around you when you’re doing completely unnecessary things. you’re able to do 95% of the things you could do pre-pandemic, you just have to wear a mask. if that’s asking too much, then i hope like hell you’d stay inside away from people who understand what’s been going on and are taking precaution.\n\nwanna go to walmart? sure, we all need groceries - wear a mask. wanna go to dingus? that’s not necessary. you’re putting others at risk. there’s a line and you’re defending crossing it and it’s the exact reason why everyone, collectively, is still dealing with this bullshit. going to dingus is not a “need” and if it is, then look into AA",
                                                                    "score": 2,
                                                                    "author": "can-not-compute",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 2,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "so you can’t get a few of your friends together to be at your dorm/apartment and drink? sounds like you don’t have any friends you can invite over",
                                                                                    "score": 4,
                                                                                    "author": "can-not-compute",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Right? Like damn. Stay home if you’re scared. But don’t tell me what the hell to do.",
                                                    "score": 1,
                                                    "author": "nomoresmoothies",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "“scared” is poor rhetoric here. it’s more shock and awe at how careless you’re being. distinct difference",
                                                            "score": 2,
                                                            "author": "can-not-compute"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "nah, trump got his ass kicked in the election.\n\nsad he didn’t come back on the *real* inauguration date of march 4th for you guys",
                            "score": 1,
                            "author": "redavid"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "yeah, it's unfortunate how quickly Walmart just stopped trying to enforce their mask requirements. they were pretty good about it for a few weeks last Spring/Summer and it seemed like most customers were abiding and wearing masks, but it's a horror show anytime i go there now. and i guess it's not reasonable to expect &lt;$10/hr retail workers to try to deal with hostile customers who refuse to wear them.\n\nof course, this is rural Georgia and if you go downtown in Statesboro you'll see plenty of stores with signs that are anti-mask...",
            "score": 6,
            "author": "redavid",
            "replies": [
                {
                    "level": 1,
                    "comment": "i don’t expect them to enforce it either, especially with all the crazies around here. they don’t get paid enough to do that. they also shouldn’t have to in the first place though, sucks that they’re caught up in a work environment like that",
                    "score": 2,
                    "author": "can-not-compute"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm the middle aged woman wearing my mask and writing my list in blue or black ink. And I walk quickly, but seldom into WM unless there's no reasonable choice. But thank you for being aware. I wear mine to protect my parents, my in laws, my aunts, my diabetic husband, your professors, etc. I'm so damned tired of the utter thoughtlessness of people who refuse to be mildly inconvenienced for the safety of others.\n\nTomorrow is the one year anniversary of the first known Covid death in Georgia, and almost 18,000 of our neighbors have died since. Probably more than that, but surveillance data has been iffy, at best. That's basically equal to the annual number of deaths from heart disease or cancer. And thousands more are dealing with long-term health complications after recovery. \n\nI want normalcy as much as anyone else. I want to go have dinner and drinks with my friends. I want to take the kids to the pool. I want to have Sunday dinner at my Mama's house. I want a hug. And masks, hand hygiene, and vaccines are the only way to get there.",
            "score": 1,
            "author": "50EffingCabbages",
            "replies": [
                {
                    "level": 1,
                    "comment": "i hope it all gets better too. thanks for sacrificing that valuable time and doing what’s right. i think fortune will favor us and others that actually care",
                    "score": 3,
                    "author": "can-not-compute"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Step away from the caps lock, dude.",
                            "score": 3,
                            "author": "50EffingCabbages"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "because what YOU do adversely affects others, but i guarantee you that you’ve never thought about that once in the past year. it’s really not rocket science. anyone with an ounce of empathy can understand this",
                    "score": 3,
                    "author": "can-not-compute",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then please tell me how anything I do affects others if your mask works so good that you want us to wear.",
                            "score": -1,
                            "author": "01champ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "you not wearing a mask affects others. your mask protects others from you - you have been negligent, so you are putting others at risk by not wearing one. does this compute?",
                                    "score": 2,
                                    "author": "can-not-compute",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 0,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "genuinely can’t believe i actually have to lay this out for you, but then again based on your comments, i guess i can\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/cloth-face-cover-guidance.html\n\nthis is a good website! might have some big words you’ll struggle through but i promise you’ll get the gist in time. masks are most effective when everyone is wearing one (click the blue words, that’s a link. it’ll give you more info) but i figured i’d make it more personal for you so you could see the consequences of your actions. that didn’t work\n\nhere’s another cool link:\n\nhttps://www.google.com/amp/s/www.forbes.com/sites/williamhaseltine/2020/12/17/why-covid-19-is-overwhelming-california/amp/\n\nhttps://www.google.com/amp/s/www.propublica.org/article/two-coasts-one-virus-how-new-york-suffered-nearly-10-times-the-number-of-deaths-as-california/amp\n\none for each state! and the general consensus is: negligence on the part of state/federal government (you and people like you are none the better) and dense urban population centers (both states have them!). absolutely nothing to do with the ineffectiveness of masks, which isn’t true in its own right. they work well:\n\nhttps://www.pnas.org/content/118/4/e2014564118\n\nthis post took 3-4 minutes and 3-4 google searches. clearly more than youve done in the past year\n\nedit: from the california article:\n\n“Some individuals will no doubt choose to defy public health guidelines willingly. As California Senator Richard Pan put it to the Los Angeles Times, “We can’t save people from themselves after a certain point.” But those we can help, we should. Simple as that.”\n\n:/",
                                                    "score": 1,
                                                    "author": "can-not-compute",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "once again - the ineffectiveness of masks are not the reason those states have had spikes. read the links i sent, do some critical thinking, and apply it to other states. what could other factors be? is it state-specific? really good mental exercises! we could all do with that from time to time.\n\nand i wouldn’t meet up with you because i guarantee you wouldn’t have a mask on",
                                                                    "score": 1,
                                                                    "author": "can-not-compute"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}