{
    "id": "qrtkll",
    "score": 2,
    "title": "Unstable home environment, need roommate or funds",
    "author": "calladit4",
    "date": 1636660669.0,
    "url": "https://www.reddit.com/r/GSU/comments/qrtkll",
    "media_urls": [],
    "other_urls": [],
    "postText": "I recently just got out of an abusive relationship, and I'm living in my car. I'm a student at GSU, and after moving, my family lives in a motel. My parents had to give away my dog, and I've been just really depressed, and I feel alone. If anyone can help with finances, my cash app is $tortamom. I know things will get better, it's just really hard for me right now.\n\nAlso, if anyone can provide me with housing, I'd appreciate that; I'm willing to contribute to paying rent, or any other bills, if it means finally sleeping in a bed.",
    "comments": [
        {
            "level": 0,
            "comment": "Hey GA state has some resources available for student in your exact situation. https://deanofstudents.gsu.edu/student-assistance/\n\nI encourage you to reach out to them and use the resources that they provide.",
            "score": 3,
            "author": "erkstatue",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't really know how to provide documentation proving I'm homeless and my ex boyfriend was beating the fuck out of me every other night; it was pretty discouraging",
                    "score": 1,
                    "author": "calladit4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just call the office. From my experience these programs are responsive and confidential.",
                            "score": 3,
                            "author": "erkstatue"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you in Statesboro or Savannah?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "no, I live in the greater Atlanta area, so my commute to campus via MARTA is about 25 minutes",
                    "score": 1,
                    "author": "calladit4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay well this is the subreddit for Georgia Southern not Georgia State. You’ll probably have better luck there. Edit: r/gastate",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "oh damn I feel really stupid. Forgot about the different Reddits",
                                    "score": 5,
                                    "author": "calladit4",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don’t feel stupid. You’ve been through a lot. I hope things get better for you soon. Please send me a DM if there’s anything I can do from Statesboro to help.",
                                            "score": 5,
                                            "author": "silentsnarker",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you for being so kind, makes me remember people really do care",
                                                    "score": 3,
                                                    "author": "calladit4",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "On the bright side, there are probably better resources to help you in Atlanta. I sincerely hope you can find help OP! If our community can do anything to help please feel free to post here anytime",
                                                            "score": 6,
                                                            "author": "Winneroftheyear"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}