{
    "id": "sa403e",
    "score": 7,
    "title": "Dissatisfaction with dining commons.",
    "author": "focksmuldr",
    "date": 1642862774.0,
    "url": "https://www.reddit.com/r/GSU/comments/sa403e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone else bothered by the lack of quality and options at the dining commons recently? Coffee bar closed, no more steak / noodle bar, vegan bar closed… i’m beginning to question if it was even worth it this year. \n\nI went this morning around 9:30, an hour after they’re supposed to open. The doors were locked. I waited for about 10 mins before a manager came out and posted a sign that said they wouldn’t open until 11. Wtf. \n\nI signed up this year because I’m a busy senior and live nearby, so I thought it would be a convenient option. I guess I was wrong.",
    "comments": [
        {
            "level": 0,
            "comment": "This may be outdated, but I will never understand why more people don't go to Lakeside. \n\nI mean, I was on the dining plan all four years at Southern. It felt like people avoided Lakeside like the plague. The food was always WAY better, the staff was WAY nicer, and the options were always cooked fresh and not sitting out all day. Plus, it was usually pretty empty. I would only ever go to Landrum/Dining Commons if there was no food at home and it was late/weekend.",
            "score": 9,
            "author": "EsquirelyBoodro",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah. I agree. Lakeside is better. However, landy is the only choice for weekends + dinner.",
                    "score": 6,
                    "author": "focksmuldr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's still a better deal financially than buying food at the retail dining every day, but you're right, it used to be far better. The only improvement that came out of the pandemic was the ability to get to-go. They don't even do the allergy friendly station anymore, so they REALLY need to stop advertising it on the walking tours. (Yes I've seen ambassadors do that)",
            "score": 5,
            "author": "Sylveonne",
            "replies": [
                {
                    "level": 1,
                    "comment": "That being said, I do need to somehow obtain the recipes for Landy's Mac and cheese and Lakeside's grilled chicken before I leave, those are extremely good",
                    "score": 3,
                    "author": "Sylveonne"
                }
            ]
        }
    ]
}