{
    "id": "ig9u4z",
    "score": 333063,
    "title": "She did her best ok?",
    "author": "BlackAdder7",
    "date": 1598352840.0,
    "url": "https://www.reddit.com/r/memes/comments/ig9u4z",
    "media_urls": [
        "https://i.redd.it/g4vm7de3q4j51.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "My primary school teacher did this while he was our home teacher and we would always get some cake and pizza. But then he was going through a divorce and honestly that man looked so broken near the end of the year but the whole staff gave him a party for the end of the year and I never saw him so happy. I dont know what happened to him afterwards but I know he's still teaching in primary school.\n\nEdit: wow this is insane, and I will try to contact them because honestly they deserve this love\n\nEdit 2: Finally contacted them and we had a chat, he is happily retired and remarried and is happy that you guys sent so much kindness his way",
            "score": 18153,
            "author": "Yeetus_Deletus_6969",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you know how to get in touch with him it may be worth sending a message to him and let him know you appreciated him! \n\nYou never know how much a simple message will mean to someone",
                    "score": 5446,
                    "author": "guess_its_me_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This, for real. \n\nI'm not a teacher or anything, but recently received a message from a kid I went to HS with (I graduated in 2002). He thanked me for being nice to him and treating him like a person unlike most of the other students. He brought up the time that I defended him in front of a big group of classmates about his hobbies (drawing and computer games) and how he was planning on killing himself since he thought everyone hated him. He also had a shitty home life, lots of bullies, and had aspergers syndrome. \n\nIt looks like his life is going great now and he has his own family.\n\nI had sort of forgotten that whole situation since it was so long ago, but it was really nice to hear that I was able to make a positive impact on someone's life, even if I was kind of a loser in high school too.",
                            "score": 605,
                            "author": "Reveen_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good on you for being nice to people!",
                                    "score": 141,
                                    "author": "guess_its_me_",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "fair play to you for being nice to people :-)",
                                    "score": 26,
                                    "author": "bencos18"
                                },
                                {
                                    "level": 3,
                                    "comment": "you're such a king! 👑",
                                    "score": 22,
                                    "author": "ExtendedGHG",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2281,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For sure! Teachers deserve way better treatment than they get from both students and employers! \n\nIf you’re a teacher than thanks for doing gods work chief, and on behalf of your students: you’re great, keep on keeping on\n\nAlthough some teachers do work their students too hard and while not always the case, there have been a few teachers ice had that don’t seem to realize that kids and teens can be utter dicks without meaning to. Which is why some of my favorite teachers are the ones that never shout or scold the students and take the time to be understanding.",
                                    "score": 665,
                                    "author": "guess_its_me_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My biology teacher in high school straight up went on diss battles against us and many times she won",
                                            "score": 320,
                                            "author": "revcio",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My bio teacher was a girl from south La who worked her way up from nothing, no way were we privileged Australian white boys ever going to be able to out diss her but we tried",
                                                    "score": 224,
                                                    "author": "Impedus11",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is what I love about reddit. Its the best place to tell stories anonymously and everyone here thinks the same and accepts you. If you got a story to tell, tell it on reddit.",
                                                            "score": 94,
                                                            "author": "god_avocado",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I once jumped and hit my head on a ceiling fan (big sharp metal fucker) going *fast* \n\nHad a bone from my skull removed and spent 2 months in a hospital and spent like a year without any bone in my skull on the left side of my forehead",
                                                                    "score": 74,
                                                                    "author": "guess_its_me_",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I am so fucking sorry about what happened to you but the randomness of the story and the way you told it gave me the hardest laugh in months",
                                                                            "score": 63,
                                                                            "author": "71Atlas",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Sounds horrendous, but it’s just so bizarre that I mainly use it as a cool/funny story to tell, and laugh while telling it xD",
                                                                                    "score": 39,
                                                                                    "author": "guess_its_me_",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I had this one teacher in middle school who was an 80 year old irish lad. In a section about how the US won the Revolutionary War he explained that the US troops were farmers and hunted more frequently and to show this he had one group train for ten minutes by throwing paper balls at targets while the other just sat there and then had us line up and throw paper at each other",
                                            "score": 44,
                                            "author": "Def_Not_Alt_Acct",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I cringe at how callous we were in high school with some of our teacher nicknames. I sometimes wish I could go back and slap teenage me. Don't get me wrong, I was pretty polite in most ways, but I definitely yielded a lot more to peer pressure on how to view teachers than I should have.",
                                            "score": 56,
                                            "author": "Mysterious_Lesions"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I so wish I could remember my fifth grade teacher's first name... It was close to 20 years ago but he was the one who kickstartred my love of science by having us do about 400% more science projects (poster board and all...) than any other fifth grade class that year.  \n\nI threw a soccer ball at his face once when we were playing at recess and he put me in timeout, I was dealing with a lot of shit at home and wasn't processing my anger at all.  I really badly want to apologize, and thank him, but it's been so long and I can't seem to find him :(",
                                    "score": 104,
                                    "author": "Clumsy_Chica",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly there’s certain things I want to get off my chest to certain teachers too. I never did anything like throwing a ball into a teacher’s face, but as a class we badgered the fuck out of a lot of teachers, particularly a really old Christian brother who (ironically) taught science. Because of his age we messed with him a lot (some really funny shit ngl but nonetheless cruel), but I know at least 3 guys who majored in a science field in college because of him.",
                                            "score": 58,
                                            "author": "YourTypicalBoss",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In our school, there was a tonne of badgering of the bus driver as well. It would be totally unacceptable to do this for a public transit driver.\n\nSchool kids on this topic: You can be better than me.",
                                                    "score": 22,
                                                    "author": "Mysterious_Lesions"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There might be a Facebook group for the school- mine was tiny, about 600 pupils, but it's got a busy FB page with people who left decades ago. There's also likely to be a few people who never mentally left school and I bet they can name they guy you're talking about very quickly.",
                                            "score": 19,
                                            "author": "mronion82"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My 5th grade teacher just died last year (over 20 years after 5th grade). He was such a legend that there were probably 75 former students in their 20s and 30s that he taught when they were 11. I hope I can make an impact like that one day.",
                                            "score": 22,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Especially teachers, they already always feel like they aren't appreciated enough.",
                            "score": 251,
                            "author": "Azureflamedemon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pretty sure it's more than a 'feeling'.",
                                    "score": 70,
                                    "author": "InkTide",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Especially for a teacher. My GF is a high school math teacher in a underprivileged school. She deals with a lot of bullshit, way more than I ever would have put up with. She's said it at least a dozen times, the thing that makes it worth it is when she gets that rare \"thank you\" from one of the kids she helped.",
                            "score": 42,
                            "author": "TehFuriousOne",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because that's what heroes do.",
                    "score": 97,
                    "author": "51LOKLE",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt;  I dont know what happened to him afterwards \n\noh no please dont take a left turn\n\n&gt; but I know he's still teaching in primary school.\n\npheew",
                    "score": 32,
                    "author": "Phormitago"
                },
                {
                    "level": 1,
                    "comment": "This whole comment stream is so wholesome *I’m so proud of this community*",
                    "score": 14,
                    "author": "Hmmtasteslikepowder"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember I had a teacher that told us if no one got a bad mark (meaning anything lower than mark 2) she'd go buy pizza for us all, well we did it and expected a big pizza for everyone, but no she bought a pizza for every individual person from her own funds.",
            "score": 3363,
            "author": "The_Daddelbox",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn y'all bankrupted her.",
                    "score": 1905,
                    "author": "floopyxyz1-7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "5 dollar hot n ready, 20 students, that’s only $100.",
                            "score": 534,
                            "author": "WubbaLubbaDubStep",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 779,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "100$ is nothing for a great lifelong memory of 20 people",
                                            "score": 408,
                                            "author": "erto66",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 221,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In the West it's a lot, especially for a teacher. I think what he means is that the 100$ is worth the memory that it created.",
                                                            "score": 195,
                                                            "author": "BiggestStalin",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I wish classes were only 20 kids lol. Try more like 35",
                                    "score": 97,
                                    "author": "59265358979323846264",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Classes in China with 50 students lol",
                                            "score": 16,
                                            "author": "Fannerbuoy36",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Little ceasers isn’t $5 anymore. More like $6 (don’t forget tax too)",
                                    "score": 28,
                                    "author": "tlozone",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sales tax?\n(Laughs in Oregonian)",
                                            "score": 13,
                                            "author": "Budtending101",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "(Ugly cries in Washingtonian)",
                                                    "score": 12,
                                                    "author": "tlozone",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In highschool my chemistry teacher told me that if I passed the final he would buy me a pack of cigarettes, and he did when I barely passed with a 70. Those were much different times lol.",
                    "score": 393,
                    "author": "jcutta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Our school had it if we all passed the TAKS test I think, our principal would kiss a pig on the morning announcement. \n\nThat wasn't exactly the same motivation or personal type heartfelt message people have going on here, but it's something I remembered.",
                            "score": 149,
                            "author": "waitingtodiesoon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Black Mirror has an episode about a pig... not kissing tho.",
                                    "score": 47,
                                    "author": "Anomalous-Entity",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ugh, I never understood why they started the series with that episode! I took a long time to watch it after that. I could not understand why so many people raved about the show.",
                                            "score": 15,
                                            "author": "Stardust_and_Shadows",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Fuck the ciggies, i wanna see a principal kiss a pig",
                                    "score": 18,
                                    "author": "Matteo0770123"
                                },
                                {
                                    "level": 3,
                                    "comment": "On tonight's episode of black mirror",
                                    "score": 10,
                                    "author": "rish2308abh"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "that's a great teacher alright",
                    "score": 56,
                    "author": "Ultimateattack123"
                },
                {
                    "level": 1,
                    "comment": "“Next up on today’s news: heist on local pizza store!”",
                    "score": 42,
                    "author": "Confused-System"
                },
                {
                    "level": 1,
                    "comment": "How thats like 200$ or 100$ if she lucky",
                    "score": 38,
                    "author": "horonlapsi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In germany teachers aren't underpaid",
                            "score": 95,
                            "author": "The_Daddelbox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Big oof",
                                    "score": 34,
                                    "author": "dwefgert354"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When my highschool calculus teacher heard I was not doing great in university level calculus,  he offered to have me come into the school on his day off and tutored me for free to get my grades up.\n\nLater on that year his father died and shortly after he found out his wife was having an affair with the vice principal.  He ended up shooting himself and I was heartbroken.  I still remember the last time I saw him and he asked how my calc was - I was still flunking it but since he had made such an effort I lied and said my grades had turned around.",
            "score": 7332,
            "author": "CeeArthur",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jfc, that man just had every bad thing hit him all at once. I’m so sorry.",
                    "score": 2967,
                    "author": "-parkthecar-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 740,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Vile and animalistic\n\nYou got it right there, some people literally are just bored and have nothing interesting about them besides their sex organs so they cheat to feel alive",
                                    "score": 369,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Like if you're gonna cheat, break off the relationship and let the person down gently before you fuck their mental health and stability",
                                    "score": 49,
                                    "author": "TheLonelySyed27",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thats not how the sociopaths work. For them you are just a resource.",
                                            "score": 8,
                                            "author": "curiousboi0504"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Fuck cheaters. Breakup with your partner(s) first atleast.",
                                    "score": 201,
                                    "author": "GravityFallsChicken",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What's jfc?\n\nEdit: Jfc 450 upvotes for just a question",
                            "score": 732,
                            "author": "TheDankPotatoRises",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jesus fucking christ",
                                    "score": 1012,
                                    "author": "-parkthecar-",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Calm down it’s just a question",
                                            "score": 2259,
                                            "author": "GBE-Sosa",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "he's so short tempered. he should go see a therapist",
                                                    "score": 350,
                                                    "author": "drlqnr",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What good will the rapist do for anger issues?",
                                                            "score": 267,
                                                            "author": "LOL-o-LOLI",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Therape",
                                                                    "score": 154,
                                                                    "author": "ignaffee",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Underrated",
                                                                            "score": 40,
                                                                            "author": "DabanggSaanaad",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "John f ^cennedy",
                                            "score": 38,
                                            "author": "xJonroe",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hey now, no need to be rude. They just asked what jfc meant",
                                            "score": 158,
                                            "author": "MrTeddybear",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 102,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Dude! Calm down, they were just providing context for the acronym jfc.",
                                                            "score": 99,
                                                            "author": "HK47WasRightMeatbag",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "ikr",
                                                    "score": 13,
                                                    "author": "u_Adi",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Just felling chonky.",
                                    "score": 63,
                                    "author": "newmacbookpro",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Jerusalem's Fried Chicken",
                                    "score": 150,
                                    "author": "Mortress_",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Jesus fried Christ",
                                    "score": 18,
                                    "author": "Zabuzaxsta",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I think he is a president in America",
                                    "score": 14,
                                    "author": "Eren_Veigar",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "John Fricking Candy",
                                    "score": 58,
                                    "author": "SnuggleMuffin42"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Jesus Fried Chicken",
                            "score": 33,
                            "author": "Jaspersong",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Look man, I don't know you or that teacher. I don't know when or where this happened and I don't know if it's recent or old. But you better have gotten your fucking calc grades up...",
                    "score": 620,
                    "author": "CaptainTeaBag24I7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I eventually passed with an 80, which is pretty good by university standards.",
                            "score": 490,
                            "author": "CeeArthur",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fuck yeah! That teacher would be proud of you, don't forget it.",
                                    "score": 191,
                                    "author": "CaptainTeaBag24I7"
                                },
                                {
                                    "level": 3,
                                    "comment": "im sure your calc teacher is gonna be proud of you up there",
                                    "score": 257,
                                    "author": "i-LLuXXion",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Hey, 80 is an A- where I'm from. So that's a hell of a turnaround from flunking. Great job!",
                                    "score": 97,
                                    "author": "ZahariasX",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Where are you from? Where I'm from in the US the lowest possible A was 93.",
                                            "score": 37,
                                            "author": "CookieIsAMobster",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Canada. 80-84 = A- / 85-89 = A / 90+ = A+",
                                                    "score": 27,
                                                    "author": "ZahariasX",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ye then that A- is more equivalent to a B+ or a B in systems where there's no A+.\n\nNot a bad grade by any means, just looks better than it is when you're used to A- being really close to perfect.",
                                                            "score": 9,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fuck man. This made me sad. Like legit sad.",
                    "score": 89,
                    "author": "u_Adi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it was pretty tragic, really shook up our small town. He was a young guy, father of 2, black belt in a few different martial arts as well, very disciplined with a really dry sense of humor. One of those teachers that is really hard on you and pushes you but you come to love and appreciate for it",
                            "score": 100,
                            "author": "CeeArthur",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A father of two?? Now it's even worse",
                                    "score": 56,
                                    "author": "splat152"
                                },
                                {
                                    "level": 3,
                                    "comment": "When the person you thought only loved you ends up loving someone else, I cannot imagine an easy way to be ok again\n\nIn my high school, we had this one math teacher who was absolutely drop dead gorgeous. She fucked another math teacher for a while and ended up getting pregnant. She might've been able to convince her husband that it was his child except that he had gotten a complete vasectomy a few years prior to this. \n\nPeople need to stop marrying people that they don't want to be with forever and this will be less common.",
                                    "score": 23,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But if people stop doing this how would they coast through life on someone else's money/emotional support while having the personality of a piece of cardboard",
                                            "score": 11,
                                            "author": "gitshrektson",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s always the ones who try the hardest..",
                    "score": 53,
                    "author": "PrincessPeachxo21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is the saddest part of all for me. I see ppl who put their everything into things and ppl who are so complacent that they barely exist, and it sucks when ppl who care so much take it out on themselves.",
                            "score": 15,
                            "author": "woosterthunkit",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Holy sht bro. May God bless him. What a terrible way to go.",
                    "score": 30,
                    "author": "ElCaptain1"
                },
                {
                    "level": 1,
                    "comment": "I hope his piece of shit wife killed herself after what she did to him.",
                    "score": 30,
                    "author": "Drugbugz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This all happened after I moved away so I'm not entirely sure how it played out. I know the vice principal,  who I actually liked before all this, became an absolute pariah in the community, I think he ended up moving. I do know the community got together to start scholarship funds for the mans daughters",
                            "score": 42,
                            "author": "CeeArthur",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Jesus Christ",
                    "score": 37,
                    "author": "SilverDesperado"
                },
                {
                    "level": 1,
                    "comment": "Damn this whole thread is giving out a whole rollercoaster of emotions.  Thank you for sharing your story mate.",
                    "score": 7,
                    "author": "nxcrosis"
                },
                {
                    "level": 1,
                    "comment": "Why are cheating wives such a huge cause of suicide while suicides because of cheating husbands are barely mentioned. Is the rate objectively different somehow and I'm just imagining this? I truly hope i am.",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "\\*hug\\*",
                    "score": 30,
                    "author": "Crafty-Crafter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a teacher it’s pretty rough. I always try to do something special for Halloween and Christmas but of course it’s not in the school syllabus so I have to fund it with my own money, it’s just very fortunate that my wife is also a teacher so she’s understanding.",
            "score": 1232,
            "author": "hungryhograt",
            "replies": [
                {
                    "level": 1,
                    "comment": "respect ✊🏽",
                    "score": 231,
                    "author": "huh_rini",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh you are a teacher? Name every student in the world. /s",
                            "score": 20,
                            "author": "EnvironmentRich214"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "From elementary and intermediate school the district I live in has \"class moms\" (mostly mom's there are a couple dads) that help plan and pay for the class parties. My wife did it before my kids moved on to middle school.\n\nI think it was nice to take the burden of that stuff off the teachers. Generally though most parents wouldn't even donate $5 to fund the parties and my wife would usually pay for the whole thing. We live in an upper middle class neighborhood, I'm sure the vast majority of people could've afforded $5 but they never would.",
                    "score": 90,
                    "author": "jcutta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Class moms work if you live in a relatively privileged area. Though parents fundraising can easily morph into a district underfunding all schools and only the rich neighborhoods get fundraising. Ultimately in the US funding needs to be moved to the state level to break the back of unequal schooling.",
                            "score": 30,
                            "author": "Aliensinnoh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh yeah, it's absolutely a mark of a privileged area. My town is considered poor compared to the town we border but we're definitely upper middle, median home price is somewhere close to $400k, and median income is something like $175k household.\n\nI think state funding would be great, but I want to see the poorer areas be increased and the more well off areas stay steady. I pay a shit load of taxes to have my kids well educated and I don't want them to be handicapped to meet some arbitrary common ground. Bring everyone up to the higher standards rather than lower the standards across the board. I also think teaching should be a 6 figure job not $50-60k or much less depending on district.",
                                    "score": 16,
                                    "author": "jcutta"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stop it, now I feel bad",
            "score": 217,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I upvoted your comment only because it was on 9 points so when  you get notification for the 10th point you will come and feel even worse .",
                    "score": 120,
                    "author": "Hecknope1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks satan",
                            "score": 61,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "HAHAHAHA gotta come see it at 50 too!!",
                                    "score": 25,
                                    "author": "Lil-Beaker",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reminds me of a party me and my class threw for our favourite English teachers birthday a few years ago, we went and bought cake, party poppers and a birthday card that we all wrote out names on wishing him a happy birthday.\n\nAbout 30 min before the class started we asked another teacher to unlock the classroom and we set up in there, 5 minutes before class started he unlocked the door and we all yelled happy birthday!\n\nHe was really happy and instead of doing the actual things he had planned we all ate our cake and played different party games together, it was our last year at that school so we wanted to make it a bit special for him.\n\nStill my best memory from that school.",
            "score": 124,
            "author": "TonyBamanboni_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd bet it's one of the teachers best memories of that school as well",
                    "score": 16,
                    "author": "stillPhil"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Students are like 2nd children to teachers, they try to give them everything they possibly can.",
            "score": 1157,
            "author": "harshjain343",
            "replies": [
                {
                    "level": 1,
                    "comment": "And sometimes they become your kids.\n\nThe amount of children that came from abusive homes that latched onto to me and looked up to me as father is incredibly high.\n\nI have given so many students grocery money to feed their siblings because their parents couldn't stop using. \n\nI even had nights where there was a student sleeping on my couch because they got kicked out.\n\nI even bailed a few students out of jail or been their \"parent\" in hospitals because their parent wouldn't accept the responsibility of parenting.\n\nI have about 12 children that I all love dearly. As their only parent I made sure they got into a good college with a cushy scholarship. I know they can be the best they can be when they have to tools they need.\n\nThey all keep in contact with me. Some already graduated and are settling down and starting a family which makes me feel old.",
                    "score": 46,
                    "author": "dinosaregaylikeme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jesus: I just want to say that I'm a very big fan.",
                            "score": 13,
                            "author": "KeepCalm-ShutUp"
                        },
                        {
                            "level": 2,
                            "comment": "My brother used to really play up how \"bad\" our home life was so he'd get special treatment. He even lived with one of his teachers in their guest room because he \"needed discipline\" and had no respect for our parents. He did whatever that dude told him to, but cussed at our actual parents if they asked him to put in an effort. Ugh, gross. I was glad when he wasn't in our house lol",
                            "score": 7,
                            "author": "laughingashley",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I get some of those kids. But I'm a foster kid. I was in and out so many homes. Always running away. Living on the streets with other runaways. \n\nI can always tell the difference between children that are a mirror image of my younger self and children who can only complain about an unfair bedtime and what's being served for dinner.",
                                    "score": 13,
                                    "author": "dinosaregaylikeme"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Unless you end up with a teacher who treats you like you're less than filth",
                    "score": 605,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or if you end up with kids that treat the teacher like they’re less than filth.",
                            "score": 462,
                            "author": "spicymemes2047",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 193,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So the administration?",
                                            "score": 100,
                                            "author": "mlGpR0"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Or if you end up with filth that treats the students like they're less than teachers... Hol' up...",
                                            "score": 51,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Or if filth ends up with filth that filths filth like they're filth.\n\nWait, what were we talking about again?",
                                                    "score": 15,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Can confirm; my class was AWFUL. We made multiple teachers cry on numerous occasions. In turn, our teachers were always not happy to have us for class.",
                                    "score": 41,
                                    "author": "jerrygergichsmith",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I really respect you for sharing that, but that thought just makes me so mad.",
                                            "score": 7,
                                            "author": "Penguins227"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We had this really nice English teacher who taught at my high school for I think 30 years+ by the time I graduated. However one year before I graduated another class that had her made her feel so bad that she stepped in the garbage bin and said this is how you all are making me feel.",
                                    "score": 23,
                                    "author": "waitingtodiesoon"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly! Just like you’re the teacher’s child!",
                            "score": 20,
                            "author": "theotherbal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hope one of my teachers never has kids then",
                                    "score": 15,
                                    "author": "Expensive-Pudding-54",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "At least they don't leave the classroom for milk and never come back. You're learning maths.",
                                    "score": 11,
                                    "author": "floopyxyz1-7"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just don't accidentally call them mom, cause the whole class will laugh at you.",
                    "score": 24,
                    "author": "Zuetchel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably the most gut-wrenching teaching moment was when a kid called me Dad in front of the class then ran out of the room. Found him in the hallway crying. Eventually he told me he never really had a Dad and asked if he could come to me if he had any issues. Super sweet kid, just terrible home life.",
                            "score": 29,
                            "author": "ReactionarySquirrel",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I accidentally called my teacher mom and the librarian mom, this was in my high school year. The Teacher was fine with it since she loves kids and likes to be a mom to all children in class. She was the best. Although awkward at first.",
                            "score": 12,
                            "author": "Altissia-senpai"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My Mom was a teacher growing up.  I'd come home and find cool art supplies and be like \"Thanks mom!\" only for her to reply, \"Those aren't for you, those are for my kids.\".  Still to this day I'm sure her favorite child is one of her students.",
                    "score": 12,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“It’s” money my good sir it’s a their",
            "score": 1571,
            "author": "angerylittlehoovy",
            "replies": [
                {
                    "level": 1,
                    "comment": "that's why we need teachers.",
                    "score": 846,
                    "author": "is_it_controversial",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OP is ESL",
                            "score": 88,
                            "author": "Tratix",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also “bought” not “bough”",
                    "score": 22,
                    "author": "obeythed"
                },
                {
                    "level": 1,
                    "comment": "\"Their\" and not \"it's\"?  You're implying that a teacher is a real human person, and not a robotic machine designed to give me C- no matter how hard I try ^(^I ^hate ^you ^mrs. ^kogutt)",
                    "score": 123,
                    "author": "tobofre",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I used to love art as a child, I was drawing all the time.  By the time I got to high school The only art teacher then had us for art the entire 5 years. No matter how hard I tries, a C, every time.\n\nThere was another kid in my class who was genuinely a very good artist, certainly put me to shame and he always got an A, and deserved that A.  And there was one other kid who couldn’t care less about art and always got a D.\n\nOne morning before art class we three decided to do an experiment.  Those two other kids swapped homework and signed each other’s.\n\nSure enough, the talented kid still got an A and the other kid still got a D.  None of tried after that, if the teacher didn’t care why should we?  It killed my passion for art.",
                            "score": 44,
                            "author": "Rokurokubi83",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;One morning before art class we three decided to do an experiment. Those two other kids swapped homework and signed each other’s.\n\n&gt;Sure enough, the talented kid still got an A and the other kid still got a D. None of tried after that, if the teacher didn’t care why should we? It killed my passion for art.\n\nPretty sure the teacher probably just found out what y'all did and graded y'all for the work you actually did. If y'all had been in the class doing assignments for that long it probably wasn't hard to figure out. \n\nBut I feel ya, I had an art teacher when I was in 2nd grade erase a self portrait I'd done while standing overtop of me telling me how I'd done it all \"wrong\". Killed my passion for drawing at a young age.",
                                    "score": 25,
                                    "author": "DTSportsNow",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "their*\n\nEdit: Yall downvoters ever hear of an edit button?",
                    "score": 127,
                    "author": "UndeadMunchies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol nothing better than someone correcting someone else’s grammar when they theirselves need to be corrected on grammar.",
                            "score": 23,
                            "author": "Pete_Booty_Judge",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can soooo relate. It's the only job, I guess, where you steal supplies from home and bring them to work.\n\n\nEdit. \nOk, ok, what is happening!? I'm going to read every single post here, I promise. I'm overwhelmed!\nI want to thank the Academy... wait, wrong.\nI want to tell you people that you are awesome. Thank you for commenting and the awards. Truly. Thank you.",
            "score": 6926,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re a teacher? Mad respect to you!",
                    "score": 2251,
                    "author": "Master_JBT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am. I love it. Thank you!",
                            "score": 1476,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It brings back some hope in humanity when a teacher uses reddit and their username is lemonylimedickhead",
                                    "score": 898,
                                    "author": "fffff69420",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also a teacher",
                                            "score": 408,
                                            "author": "liquidmaryjane",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep, another teacher here. My username is too relevant and not funny at all, though, given the current situation.",
                                                    "score": 326,
                                                    "author": "godspeed_guys",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I too teach the little humans",
                                                            "score": 266,
                                                            "author": "MaskedArguer",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;oo teach the little humans\n\nMy wife teaches, does that count? Also, I mad respect you all right now. I have always respected and supported teachers, but even more so now that you guys have to put up with all this mess. YOU are the ones who deserve better pay to begin with, having to deal with the caliber of child bearers (not parents, oh no) that exists today.",
                                                                    "score": 125,
                                                                    "author": "Azureflamedemon",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Teacher here too! It's a wonderful craft!",
                                                                            "score": 53,
                                                                            "author": "WowAUnicorn",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "My girl friend is a teacher! I don't know how she does it! You all have hearts of gold and I'm sorry your so ridiculously underpaid and under appreciated.",
                                                                                    "score": 43,
                                                                                    "author": "yuhyeet999",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 38,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I also teach middle schoolers. I've kinda just come to the realization that they just aren't \"fully cooked\" yet",
                                                                            "score": 15,
                                                                            "author": "waitehosjoe",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Making the switch from high school back to middle school this year. Hopefully kids learned about deodorant in the last 2 years",
                                                                            "score": 11,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Same, mine are medium sized humans",
                                                                    "score": 23,
                                                                    "author": "Beryllium_Prism"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "So you’re why the lounge smells the way it does.....",
                                                    "score": 32,
                                                    "author": "dontquestionmedamnit",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You are one of the few teachers i have seen who seem to actually be content with their predicament.\n\n&amp;#x200B;\n\nI respect that",
                                    "score": 25,
                                    "author": "Waterburst789"
                                },
                                {
                                    "level": 3,
                                    "comment": "You're a teacher? Write \"Redditors love me\" 69 times!",
                                    "score": 159,
                                    "author": "NoCoolSenpai",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "for i in range (69):\nTAB print(\"no\")",
                                            "score": 18,
                                            "author": "Toaru_no-Accelerator",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hello again for the 7th or 10th time already!",
                            "score": 35,
                            "author": "Groundbreaking-Baby6",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You guys going steady?",
                                    "score": 24,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Huh? What do you mean? I'm a guy btw",
                                            "score": 19,
                                            "author": "Groundbreaking-Baby6",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Even better.",
                                                    "score": 15,
                                                    "author": "snowycraq",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Now kith",
                                    "score": 17,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Stay safe, educators!",
                            "score": 17,
                            "author": "Effective-Complete"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Respects! In most of the countries teachers aren't paid enough but you are all and everything supporting children's growth for many kids. I've been there where only trustworthy adult or anybody actually was my class teacher. I hope the best for you because you're doing good.",
                    "score": 68,
                    "author": "jubettu"
                },
                {
                    "level": 1,
                    "comment": "A teacher on a meme subreddit, probably searching memes to understand their students. Quality teacher",
                    "score": 117,
                    "author": "EMRBRT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tbf I was a teacher since I was 23 (I'm 27 now but no longer teach) and I'm well versed in meme culture. I had more in common with the students than my colleagues lol",
                            "score": 96,
                            "author": "totential_rigger",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know that feeling.  On the verge of 40 years old and have more in common with the new teacher than my colleagues my own age.  I have to pretend I don't know things just for the sake of saving face.\n\nSo this online instruction... easy peasy.  Not for others around my age.",
                                    "score": 24,
                                    "author": "quiznex",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Or they just like memes",
                            "score": 14,
                            "author": "supremegay5000"
                        },
                        {
                            "level": 2,
                            "comment": "If I over hear kids talking about TV shows I like to watch them so I can talk to them about things they like.\n\nI could only make it through one season of Riverdale tho.",
                            "score": 11,
                            "author": "Platomuses",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I've been on the internet since I was 9. \n\nI can't say I was on things because I wanted to get to know them better....\n\n\nSurprisingly though, most of my former students didn't do Reddit etc. SC, Instagram, but not Reddit. \n\n\n\nOnly a former teacher now, though.",
                            "score": 16,
                            "author": "2punornot2pun",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nice username...",
                    "score": 27,
                    "author": "SpecTreOP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why, thank you!",
                            "score": 26,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh you are a teacher? Name every student in the world. /s",
                    "score": 53,
                    "author": "Catastrophic_User",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Thank you so much for what you do for children! I wish the US was like here were the government provides supplies for the people who can’t afford them, the families sometimes have to put some money monthly too, but only if they can.",
                    "score": 11,
                    "author": "holoheyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You know, these memes make me feel bad",
            "score": 52,
            "author": "Hybridi666",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Bruh dude really just called the teacher an \"it\"",
            "score": 537,
            "author": "DouchNozzle_REAL",
            "replies": [
                {
                    "level": 1,
                    "comment": "bough it with it is own money",
                    "score": 138,
                    "author": "PlantPowerPhysicist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The trick is to use the pizza's money",
                            "score": 46,
                            "author": "CookedBlackBird",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I literally cried after seeing this post. I am no longer in the classroom but people honestly have NO IDEA the struggles our teachers deal with. &lt;3\n\nOne December I brought in donuts and my Keurig to make hot chocolate for my 4th graders, some of them had never had hot chocolate before. T.T",
            "score": 52,
            "author": "realgirl_fakename",
            "replies": []
        },
        {
            "level": 0,
            "comment": "credits to: u/zevHS for the upper picture",
            "score": 456,
            "author": "BlackAdder7",
            "replies": [
                {
                    "level": 1,
                    "comment": "respect for the credit my dude. This is rare here.",
                    "score": 174,
                    "author": "One_Dependent_3007",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s also a bit passive aggressive, and I’m here for it.",
                            "score": 30,
                            "author": "godofallcows"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Whats a Bough? *Johnny English Intensifies*",
                    "score": 17,
                    "author": "swissans",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "As I grow up I realize how much teachers sacrifice and love their students. I am not a teacher but they deserve all the praise in the world.",
            "score": 420,
            "author": "pandamonium0908",
            "replies": [
                {
                    "level": 1,
                    "comment": "We should just give them more money tbh. It’s sad when they need to change a lesson because they couldn’t afford materials for the experiment they wanted. Or needing to crowdsource field trips.",
                    "score": 103,
                    "author": "Effective-Complete",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am a teacher and can relate. It's one of the few jobs where you spend our of own pocket to bring supplies to the classroom and treats for the kids. I love my job and wouldn't want anything else, but I am slowly seeing that buying pizza and boba tea no longer cuts it",
            "score": 31,
            "author": "marsdudesk8r",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m a preschool teacher and we have $30 a month for class materials for 2 teachers to share. I couldn’t tell you how much money I’ve spent just doing art projects with the kids because my coteacher used up all of the materials money without saving any for me. But damn if those kids don’t have amazing art projects every week and they have a fun time making them",
                    "score": 13,
                    "author": "MamaBear_07",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My teachers usually had us do school fundraisers/a bake sale",
            "score": 43,
            "author": "GlassJackhammer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It's own money?",
            "score": 84,
            "author": "SaatvikChamp06",
            "replies": [
                {
                    "level": 1,
                    "comment": "Of course the teacher is dead.",
                    "score": 39,
                    "author": "Anurag6502"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I honestly can't believe how underappreciated teachers are, it's a crime. Hopefully it'll be fun tho, as I wanna become a teacher.",
            "score": 19,
            "author": "HellaHomoDanny",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wait holy fuck they removed the locked after 6 months feature",
            "score": 12,
            "author": "YourAverageMemeRater",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Lmao “with *it’s*” poor teach was degraded to a thing.",
            "score": 66,
            "author": "Riskay_Raven",
            "replies": [
                {
                    "level": 1,
                    "comment": "And it's not even grammatically correct... it should be \"with its own money\".",
                    "score": 18,
                    "author": "Daveed84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Big up all the underpaid teachers who buy it with their own money but are seldom appreciated 🙌.",
            "score": 10,
            "author": "Lee6er"
        },
        {
            "level": 0,
            "comment": "Wait you guys get party and pizza?",
            "score": 13,
            "author": "kashaan_lucifer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Big thanks to teachers for helping me enter medical school",
            "score": 13,
            "author": "[deleted]"
        }
    ]
}