{
    "id": "12us35w",
    "score": 2,
    "title": "Science requirements for an Arts student",
    "author": "CallyMoore",
    "date": 1682131521.0,
    "url": "https://www.reddit.com/r/Dalhousie/comments/12us35w",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey! I'm taking a BA and I need two science courses for my degree. I've taken a comp sci class (hoping to avoid doing another) and I need one more but I have no idea what to take. I'm like really bad with STEM as a whole and was hoping some of you might have some suggestions for \"easy\" science courses for someone who isn't great in the subject. Thanks!!!",
    "comments": [
        {
            "level": 0,
            "comment": "Just take a couple psychology courses",
            "score": 7,
            "author": "jrhymezz"
        },
        {
            "level": 0,
            "comment": "The physics department has an astronomy course for arts students that’s fun and not too hard. \n\nPhysical geography was also really easy when I took it but I’ve heard it depends on the prof.\n\nETA: the first year history of science class at King’s also counts for a science credit",
            "score": 3,
            "author": "byrnisonn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just took the online version of the physical geography course and it was the easiest A+ so definitely recommend it! There’s quizzes, a midterm, and a final and all are done online and the answers are very easy to find on the slides given or the textbook! :)",
                    "score": 1,
                    "author": "Dangerous_Handle_319"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most people I know who took a BA that required STEM courses took the two intro psych classes - I think that these are the most common choices since psych is a degree that offers both a BSc and BA option. Therefore, while the intro psych classes count as STEM credits, I’ve heard from those who took them while doing a BA, that their opinion is that these are very BA friendly courses, even for people to tend to have some difficulties with other science courses (mainly because they aren’t biology, physics, chemistry, or math heavy WHATSOEVER - so the intro to psych courses are run more like other BA courses than other BSc courses in general). \n\nERTH1030 is also one that I’ve known multiple BA students who’ve taken it for science credits.",
            "score": 1,
            "author": "Silver_Pea_733"
        },
        {
            "level": 0,
            "comment": "Psyo 1031/1032 are fully online / asynchronous. Super easy, you can get a good mark with very little effort",
            "score": 1,
            "author": "inxrx8"
        }
    ]
}