{
    "id": "13pqku1",
    "score": 2,
    "title": "Communauto rates? (the transit version)",
    "author": "xltripletrip",
    "date": 1684853057.0,
    "url": "https://www.reddit.com/r/Dalhousie/comments/13pqku1",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve never felt like such a boomer until I went to their website, I have no clue as to wtf I’m looking at.\n\nI get the basics in that there are different tiers of monthly costs, which in turn reduce other costs. That part is whatever, relatively straightforward.\n\nWhere I am lost is this Dynamic duo + Halifax transit option. It’s 8$/month AND I get a bus pass? Or do I get a discount on bus passes? What is the discount? How do I get it? They provide next to zero information 🫠 pls help. My brain hurts.",
    "comments": [
        {
            "level": 0,
            "comment": "looks like you get a 12.5% discount on a pass and no bond on the membership. https://halifax.communauto.com/transit/\n\nedit: and also a $40 driving credit, look at the bottom at \"How to become a member\"",
            "score": 3,
            "author": "MuchFunk",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. You buy the pass from communauto for a discount and get the value rate plan with no bond at $8/month. You have to call them to register for it I believe, and the plans run for a year from January and July 1st. If you have a U-pass already then you can send them proof to get the plan without buying the bus pass.",
                    "score": 3,
                    "author": "chayan4400"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your best bet is to call their help line and ask one of the agents to help explain it to you. They know their systems and plans inside out.",
            "score": 3,
            "author": "ninjasauruscam",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe I’ll do that, thank you",
                    "score": 2,
                    "author": "xltripletrip"
                }
            ]
        }
    ]
}