{
    "id": "1431y7d",
    "score": 2,
    "title": "Residence Switch",
    "author": "TripleAAA111",
    "date": 1686108211.0,
    "url": "https://www.reddit.com/r/Dalhousie/comments/1431y7d",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does anyone know if it is at all possible to switch residences if I found someone to switch with? I have had no luck with the residence office getting on a wait list or transferring. \n\nAccepted to Gerard Hall but willing to switch with anyone at any of the Studley Campus buildings (Howe, Risley, LeMarchant or Shirreff). Also willing to share a double room! Thanks",
    "comments": [
        {
            "level": 0,
            "comment": "They might agree to it if you find someone first, but likely only once all temp housing, medical, and emergency transfers are handled first. Traditionally, that backlog isn't cleared until after W day, in November.\n\nFinding someone willing to switch is going to be *very* hard. Every first year wants to live on Studley.\n\nI also doubt Res Life will approve a swap if they hear about any sort of payment offered to the switchee for their spot. I know you didn't mention anything about that, but I still think it's worth bringing up.",
            "score": 2,
            "author": "Lusankya",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for the info! Just curious what would constitute a medical or emergency transfer?",
                    "score": 1,
                    "author": "TripleAAA111",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "An emergency transfer is an unforeseeable need for someone to be moved. Examples include fire or flood destroying their room. Obviously, only the people who *didn't* cause the fire or flood would be moved. Until rooms free up, most emergency moves wind up living in hotels at Dal's expense. They're quite rare, but they do happen.\n\nMedical moves are when someone becomes unable to live in their current space. Examples are people who have become disabled and can no longer live in walk-up units, like Shirreff 4th floor, Minires, or Glengary. Medical documentation is required, even when its obvious - my neighbour in Shirreff New Eddy 4th still needed a doctor's note to get a transfer after he shattered his ankle. He wound up getting moved to Gerard, since the rooms and bus routes are all wheelchair accessible.\n\nMedical and emergency moves don't get to pick where they end up. Whatever unit opens first is where they have to go. Most of them wind up on Sexton.",
                            "score": 1,
                            "author": "Lusankya",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Great information! Thank you so much for explaining. Which residence did you stay in? Is Gerard as bad as everyone makes it out to be?",
                                    "score": 1,
                                    "author": "TripleAAA111",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I lived in Shirreff in first year, and then Risley, O'Brien's, and Gerard as an RA.\n\nI liked O'Brien the best, and Gerard in second. The communities were much more diverse with more interesting people. Not to knock the other res communities, but they tended to mostly be people who did well in high school and hadn't yet experienced a lot of adversity. For most of them, Dal was one of their top choices. On Sexton, it's mostly people who applied late, either because Dal wasn't their first choice, or because their choice to go to uni was more spontaneous. They've often got more interesting stories and colourful personalities.\n\nI'm obviously painting with broad strokes. There are plenty of interesting people on Studley campus. But I found a higher concentration of them on Sexton, and they made my upper years an absolute blast.\n\nThe commute isn't nearly as bad as people make it out to be, either. Especially for Gerard: there's a bus stop right outside the door. If you time it right, it's only an extra 3-5 minutes of standing on a bus before you're in the middle of Studley. Hell, it's sometimes a faster commute from Sexton to the CS building than it is from Shirreff.",
                                            "score": 1,
                                            "author": "Lusankya",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you so much for your responses. You've really helped to paint a better picture!",
                                                    "score": 1,
                                                    "author": "TripleAAA111"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If nothing else works, wait until school starts. People get thrown out of residence quite regularly and rooms become open that way.",
            "score": 1,
            "author": "nightowlshopper",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh lol, good to know! Thank you",
                    "score": 1,
                    "author": "TripleAAA111"
                }
            ]
        }
    ]
}