{
    "id": "145dui7",
    "score": 1,
    "title": "Question about Writing requirement",
    "author": "rylan_48",
    "date": 1686337622.0,
    "url": "https://www.reddit.com/r/Dalhousie/comments/145dui7",
    "media_urls": [],
    "other_urls": [],
    "postText": "For my writing requirements in science do you have to take both part 1 and 2 of a course or can you do 2 different part 1’s? (HIST 1020 and HIST 2021 or HIST 1020 and PHIL 1500) And if so which way would be better?",
    "comments": [
        {
            "level": 0,
            "comment": "Taken from the dal website: \n\nClasses with an X or Y in the number (ie. ENGL 1000X) are part of a full-year class, and you must take both the X and the Y part of the class consecutively in order to receive credit for it. If you choose to register in X/Y classes, you must register in the same section for both the X portion and the Y portion.\n\nIt also says under the “Notes section” under the course on the academic timetable that you must take both Hist 1022/Hist 1023 to get the writing requirement. Make sure you’re signing up for the actual writing requirement class, Hist 1020 is the the same course material as 22/23 but is less heavy on writing and therefore does not constitute as a writing requirement. Writing requirement classes will explicitly say (Writing) next to their name on the academic timetable. \n\nHist 2021 is a normal second year class where you are expected to have already learnt how to somewhat efficiently write an academic assignment from your first year classes. I normally don’t recommend taking second year courses in first year because you’re graded on a certain understanding you’ve already done some university work and have underwent the transition shock period of highschool to university already.\n\nHope that clears up your question",
            "score": 1,
            "author": "Kalamaz00_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, Thank you",
                    "score": 1,
                    "author": "rylan_48"
                }
            ]
        }
    ]
}