{
    "id": "146bamv",
    "score": 8,
    "title": "Car Commute",
    "author": "KodokuMakesStuff",
    "date": 1686431628.0,
    "url": "https://www.reddit.com/r/Dalhousie/comments/146bamv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone! I'm an incoming grad student and I'm not super familiar with Halifax. I have a few questions for those of you who commute by car: how complicated is it to park around campus? How often do you get stuck in traffic going to and from campus? How expensive is it to have a car in Halifax? Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "This is going to depend on campus and living location.\n\n&amp;#x200B;\n\ni drive to Woodside, park for free and ferry to Halifax. 10 minute walk to campus",
            "score": 5,
            "author": "BusyPaleontologist9",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe 10 minutes walk to sexton campus but more like 30 to studley (main campus)",
                    "score": 1,
                    "author": "llamaavocado",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Took me 20 minutes in nice weather to get to Dunn. Bus takes about 10 minutes from Barrington with a lot of options.",
                            "score": 1,
                            "author": "BusyPaleontologist9"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I find driving to campus one of the most stressful parts of my day to be honest. First, you should avoid it if possible. Unfortunately Halifax is a car city not a very good public transportation city. The routes toward Dalhousie get pinched into just a few streets no matter which direction you’re coming from. There are so many schools and hospitals in Dalhousie’s area that it is a huge destination for commuter traffic. The only way to get around it is to go in super early, which coincidentally makes parking easier, and leave super early. Anywhere near Dal is hellish gridlock after ~8:20 (aim to get there by 7:45 for best results). If you can’t leave Dal by exactly 3PM you might as well stay at Dal and read papers until 6PM otherwise you’ll add at least 20 - 30 minutes just trying to get out of the Dal area and on to whatever your commute “trunk” is.",
            "score": 3,
            "author": "MrInstructorRob",
            "replies": [
                {
                    "level": 1,
                    "comment": "unless OP is very far away like in bedford they can probably plan to go to campus by bike. I recommend it!",
                    "score": 1,
                    "author": "big-lion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't usually drive all the way to campus, from what I hear spots fill up pretty quickly and you're not guaranteed to find a spot.\n\nHow bad traffic is depends on when and where you're commuting from. Traffic can get pretty bad during rush hour but otherwise it's fine. But if you live close to campus I wouldnt even bother driving. Downtown Halifax is pretty walkable so you wouldnt even need to drive.",
            "score": 2,
            "author": "kayninesquad"
        },
        {
            "level": 0,
            "comment": "I drive from dartmouth to campus (have to pay for a spot in an apt building) and find it takes me 20 minutes to get to my spot if there's no traffic. If there's traffic then it can double (normal rush) or triple (bad traffic). The other thing is I then I have to walk 15 from my spot to school. It's a pain",
            "score": 2,
            "author": "catzinthecity"
        },
        {
            "level": 0,
            "comment": "I drive everyday and it sucks. It depends where and when your driving of course. I take the 102 and park on the road by dal. If you have class starting between 8-10 the drive sucks but parking on the road at campus is easy. If you have a class starting after that the drive isn’t bad but parking sucks. Only time it doesn’t suck is around 1:30 - 3:00 start, parking and driving is good at that time.",
            "score": 1,
            "author": "Sidewayz-"
        }
    ]
}