{
    "id": "az0ls6",
    "score": 48,
    "title": "Justice for Adam: DSU Forcing Fines on Election Candidate Adam Lucas.",
    "author": "EmperorDazbog",
    "date": 1552113121.0,
    "url": "https://www.reddit.com/r/Dalhousie/comments/az0ls6",
    "media_urls": [
        "https://www.reddit.com/r/Dalhousie/comments/az0ls6/justice_for_adam_dsu_forcing_fines_on_election/"
    ],
    "other_urls": [
        "http://dsu.ca/elections](http://dsu.ca/elections)",
        "http://dsu.ca/sites/default/files/image-uploads/Elections%20Policy%20-%20Council%20adopted%20Oct%202018.pdf](http://dsu.ca/sites/default/files/image-uploads/Elections%20Policy%20-%20Council%20adopted%20Oct%202018.pdf)",
        "https://www.instagram.com/adam\\_lucas\\_for\\_dsu\\_president/](https://www.instagram.com/adam_lucas_for_dsu_president/)",
        "http://dsu.ca/elections/campaignrules](http://dsu.ca/elections/campaignrules)",
        "https://m.facebook.com/story.php?story\\_fbid=387405611812975&amp;id=40582581617&amp;refsrc=https%3A%2F%2Fm.facebook.com%2Fdalstudentunion%2Fvideos%2F387405611812975&amp;\\_rdr](https://m.facebook.com/story.php?story_fbid=387405611812975&amp;id=40582581617&amp;refsrc=https%3A%2F%2Fm.facebook.com%2Fdalstudentunion%2Fvideos%2F387405611812975&amp;_rdr)"
    ],
    "postText": "For anyone unaware of the current complications with the Dalhousie Student Union (DSU) Presidential Elections, one candidate, Adam Lucas, has been disqualified from the running and fined $220 by the DSU. Adam Lucas was running on the basis of a satirical platform to present his argument that the DSU does very little in comparison to how high of a pedestal them put themselves on. Upon attending the Presidential Debate, he was shouted at to leave by the moderator within 15 minutes of the actual debate. Adam had been given many guidelines and rules prior to the debate that he alone had to follow to avoid disqualification. Even abiding by these rules Adam left the debate quietly and peacefully only to receive a poorly supported disqualification letter the next day. Not only was he disqualified but under many baseless accusations and abused penalty guidelines, Adam is now being fined $220 by the very Student Union that exists to defend him and other students. He is currently appealing the accusations of Chief Returning Officer (CRO), Nathan Little, who was also the moderator of the debate. Some of the main accusations are listed below:\n\n**-Nathan Little claims he has received complaints about Adam Lucas resulting in a fraudulent fine of $20.**\n\n**-Nathan Little claims his conduct was disruptive during the debate.**\n\n**-Nathan Little claims he received a lengthy complaint at 11:35PM which thus means that the debate \"deeply troubled a student and impacted their ability to sleep\" (This sounds made up, I know).**\n\n**-Nathan Little claims that a group of \"associates\" (Little fails to derive a difference between supporters and associates) asked \"Where the camera was,\" thus meaning that they planned to interfere with the debate live stream.**\n\n**-Nathan Little claims that since the \"associates\" (supporters) dressed in the same attire, this meant they planned and coordinated to disrupt the debate and was directly affiliated with the campaign resulting in a fine of $50 under the Elections Policy subparagraph 6(b)(i)(5) which details that the CRO (Nathan Little) may levy fines of $50 for any reason he sees fit, without any deliberation from others.**\n\n**-Nathan Little claims that two \"associates\" harassed an Election Committee member by hovering his mouse over the members name in a Google Doc of questions to be asked in the debate, later checking on the member to make sure his question would be asked. The question being the candidates opinions on Adam Lucas being removed from the debate resulting in another abused $50 fine from Elections Policy subparagraph 6(b)(i)(5).**\n\n**-Nathan Little claims that he was harassed and antagonized by two \"associates\" after the debate leading to Little shouting at the two in front of many students (Little's reaction, according to the most recently updated DSU Election Rules, is considered in itself to be harassment) resulting in another $50 fine from Elections Policy subparagraph 6(b)(i)(5).**\n\n**-Nathan Little claims that Adam Lucas has had a hostile presence in the campaign being \"unreasonably argumentative\" to the CRO.**\n\n**-Nathan Little claims that Adam Lucas did not leave immediately after the CRO demanded him to, saying that he was asking \"pointless clarifying questions\" as in the question being \"Am I being kicked out?\"**\n\n**-Nathan Little claims that after being shouted at to leave the debate, Adam Lucas \"triumphantly\" raised his hands as he left the debate while the live stream was watched by over 1000 people resulting in another $50 fine from Elections Policy subparagraph 6(b)(i)(5).**\n\n&amp;#x200B;\n\nAdam Lucas is currently appealing these claims and fines as the Dalhousie Student Union is trying to silence the views of one of its own students by charging Lucas with more than $100 in fines, automatically disqualifying him from the election according to the Election Policy subparagraph 6(c)(i)(4). Universities are supposed to be opportunities of intelligent discussion and challenging of free thought. The DSU is directly impeding this basic idea of higher learning by trying to threaten the very students it represents with monetary loss. Nathan Little's Notice of Disqualification also refers to Adam Lucas as instead \"Alex Lucas\" meaning in all technicalities, none of these should apply to him as he was not properly notified of these charges. Please, to preserve free thought, speech and the right of open conversation, bring your concerns and issues to the CRO at [dsucro@dal.ca](mailto:dsucro@dal.ca), thank you.\n\n&amp;#x200B;\n\nEdit: Sources Used\n\nDSU General Elections 2019 Web Page: [http://dsu.ca/elections](http://dsu.ca/elections)\n\nElections Policy: [http://dsu.ca/sites/default/files/image-uploads/Elections%20Policy%20-%20Council%20adopted%20Oct%202018.pdf](http://dsu.ca/sites/default/files/image-uploads/Elections%20Policy%20-%20Council%20adopted%20Oct%202018.pdf)\n\nNotice of Disqualification (In Bio of Adam Lucas): [https://www.instagram.com/adam\\_lucas\\_for\\_dsu\\_president/](https://www.instagram.com/adam_lucas_for_dsu_president/)\n\nCampaign Information and Rules: [http://dsu.ca/elections/campaignrules](http://dsu.ca/elections/campaignrules)\n\nLive Stream Debate:  [https://m.facebook.com/story.php?story\\_fbid=387405611812975&amp;id=40582581617&amp;refsrc=https%3A%2F%2Fm.facebook.com%2Fdalstudentunion%2Fvideos%2F387405611812975&amp;\\_rdr](https://m.facebook.com/story.php?story_fbid=387405611812975&amp;id=40582581617&amp;refsrc=https%3A%2F%2Fm.facebook.com%2Fdalstudentunion%2Fvideos%2F387405611812975&amp;_rdr)",
    "comments": [
        {
            "level": 0,
            "comment": "DSU is a joke filled with weirdos",
            "score": 30,
            "author": "Nersonix",
            "replies": [
                {
                    "level": 1,
                    "comment": "The real answer ",
                    "score": 9,
                    "author": "AKELLAY11"
                },
                {
                    "level": 1,
                    "comment": "king’s student here, are the DSU as toxic and neurotic as the KSU? the whole “this debate troubled a student so much they couldn’t sleep :(“ thing seems like the type of weird bullshit the KSU would do, plus ive literally never heard of the DSU accomplishing anything during my time here ",
                    "score": 4,
                    "author": "abagool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Another fellow King's student here - don't even get me started on ksu jfc. Everyone has a \"if you don't agree with us you suck!\" mentality (especially towards cis white men) and it's just awful and toxic like you mentioned. Almost makes me ashamed to go there tbh",
                            "score": 2,
                            "author": "i_am_the_walnut"
                        },
                        {
                            "level": 2,
                            "comment": "Not sure what the KSU is like but I’d say your impression of the DSU is quite accurate",
                            "score": 1,
                            "author": "PhyzzyKitty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "King’s Student Union, the glorious organization that tried to get the chapel shut down for having Christian services because apparently that’s antisemitic ",
                                    "score": 2,
                                    "author": "abagool",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[“tolerance”](https://imgflip.com/i/2vsxwi) ",
                                            "score": 4,
                                            "author": "PhyzzyKitty"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The DSU hasn’t done anything for anybody I’ve ever known who went to Dal or currently goes there, other than charge fees that students can’t opt out of. After reading this situation I definitely won’t be supporting the DSU and I hope Adam Lucas gets fair treatment and won’t need to pay that fine.",
            "score": 22,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Deleted] had a grammatical mistake, my bad.\nI’m glad you agree. I don’t see the reasoning behind every student having to pay fees to the DSU for services we never see except for some posters on how to make sure your Halloween costume isn’t racist. I’d like to see the DSU focusing on opportunities for students to interact and finding areas to lower costs rather than repeatedly instituting the same diversity and inclusion initiatives that they’ve already done time and time again.",
                    "score": 11,
                    "author": "EmperorDazbog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's lip service for diversity and inclusion too.  They seem to turn on minorities (or anybody really) who dare to speak out against them too. ",
                            "score": 3,
                            "author": "rainfal"
                        },
                        {
                            "level": 2,
                            "comment": "Well said!! I couldn’t agree more ",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This Nathan Little guy seems a lil sus tbh, was this guy elected to be moderator? What gives him the divine judgement to fine people at his discretion?",
            "score": 17,
            "author": "InfamousAmerican",
            "replies": [
                {
                    "level": 1,
                    "comment": "The CRO is actually a student that is hired every year and paid after the completion of the election. Having the ability to fine people without any deliberation is extremely abusable especially in a political climate.",
                    "score": 10,
                    "author": "EmperorDazbog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Doesn't really seem fair that they can fine him for that. Guess it just shows you how full of themselves they really are lol.",
            "score": 8,
            "author": "zeolus123"
        },
        {
            "level": 0,
            "comment": "Not a fan of the DSU by any means whatsoever. But just to play devils advocate what was Adam Lucas expecting if he was running on a satirical platform. Those fines do seem out of control but some sort of penalty should be imposed for breaking the rules right?",
            "score": 5,
            "author": "christdaburg",
            "replies": [
                {
                    "level": 1,
                    "comment": "From my discussions with Adam, he never had the intention to win, but more to present a statement against the DSU. Personally, I would understand the removal of satirical candidates, I wouldn’t be happy with it but I can understand where they are coming from, and arguably the actual fine guidelines aren’t too radical exempting the fine policy of 6(i)(b)(5) as long as those who are running have consented to them. But I would believe a much less messy alternative would be limiting how they can promote after violations, or even just a max count of violations before expulsion, which all should be determined by the Executive Council and not some third rate power crazed law student.",
                    "score": 8,
                    "author": "EmperorDazbog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes I agree the main issue here seems to be how much power Nathan Little has. Those types of penalties should be determined by more than one person and how many people complain about Adam should not have any bearing on his punishment. ",
                            "score": 10,
                            "author": "christdaburg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Could not have said it better myself!",
                                    "score": 5,
                                    "author": "EmperorDazbog"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just a thought, did he actually break any rules? While his platform is satirical, he did not encourage violence or disregard any policies I'm  aware of?",
                    "score": 1,
                    "author": "InfamousAmerican",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From what I am aware of, he did not break any specific rules, I believe some of the rules and regulations are only directly shown to the candidates so I can’t confirm anything but I am aware Adam said he was wary to not break any rules since he was a candidate with a satirical base so I’d imagine he would have taken this into account. ",
                            "score": 6,
                            "author": "EmperorDazbog"
                        },
                        {
                            "level": 2,
                            "comment": "\"Adam Lucas was running on the basis of a satirical platform to present his argument that the DSU does very little in comparison to how high of a pedestal them put themselves on.\"\nProbably had to agree to abide by certain rules when entering a DSU election and running on a satirical platform is probably against the rules.\n\n",
                            "score": 2,
                            "author": "christdaburg"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't you have anything better to do?",
            "score": -34,
            "author": "Enadon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry, I thought the fact that the Student Union no longer representing students was a bit of an issue.",
                    "score": 33,
                    "author": "EmperorDazbog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Imagine putting all this effort into something nice instead. Like a flower arrangement. Or baking a nice pie!",
                            "score": -23,
                            "author": "Enadon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's 3:10 in the morning, the premiere time to go on thoroughly researched rants! ",
                                    "score": 20,
                                    "author": "EmperorDazbog",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh my god, you must be losing sleep over this issue. I fine Nathan Little $20",
                                            "score": 17,
                                            "author": "RanvierHFX",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly. Also as according to Nathan Little, anyone who is supporting a candidate makes them an “associate” and thus the candidate is responsible for their actions even though this is not written anywhere. By that logic if you throw on a mask and a supportive shirt for a candidate and wreck havoc on the Dalhousie campus you could disqualify someone in a matter of seconds.",
                                                    "score": 8,
                                                    "author": "EmperorDazbog",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They're just looking for a reason to kick out the candidate who doesn't fit into their crazy left wing agenda.",
                                                            "score": 7,
                                                            "author": "RanvierHFX",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So far, that seems to be the case. When I talked with Adam after his debate he told me how he focused on being apolitical for his posters and platform, just so something like this could be prevented. It’s a very corrupt system, and there’s no detailing what happens if Lucas refuses to pay the fines.",
                                                                    "score": 5,
                                                                    "author": "EmperorDazbog"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don't you?",
                    "score": 8,
                    "author": "christdaburg"
                }
            ]
        }
    ]
}