{
    "id": "s5im9f",
    "score": 69,
    "title": "What do you think about Dals return to in person classes?",
    "author": "circles789",
    "date": 1642359296.0,
    "url": "https://www.reddit.com/r/Dalhousie/comments/s5im9f",
    "media_urls": [],
    "other_urls": [],
    "postText": "I personally think it’s very short sighted and they made the decision purely for monetary reasons. Public health has already said that we are under severe strain on our healthcare system… even if 1% of Dal ends up needing to go to the hospital, it will literally collapse the hospitals. \n\nHonestly they should’ve had a hybrid system so those who want to attend in person can do so but those who don’t, can choose not to. There’s many people living with their grandparents and people which can pose a serious threat to them. \n\nI find it very shortsighted and I won’t be surprised if we go back online due to a rapid peak in cases. If anything it’s incredibly inconvenient to go back in person only to most likely shift back online. \n\nWondering what your guys thoughts are?",
    "comments": [
        {
            "level": 0,
            "comment": "I agree that a hybrid model, while much harder and more stressful for profs to offer successfully, would be ideal for students. By allowing the students that want/need to stay online to do so would protect the students that want/need to be in person due to smaller class sizes and more ability to socially distance. Obviously hybrid couldn’t work for all courses and course work but for those that could it would be nice if it were offered, at least until the under 30’s cohort has had a chance to be boostered.",
            "score": 31,
            "author": "owenowl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly, I’m sure it’s possible. I was disappointed to see that they haven’t even considered a hybrid model. It’s either all online or all in person, no in-between for them.",
                    "score": 9,
                    "author": "circles789"
                },
                {
                    "level": 1,
                    "comment": "This is what we did at Acadia last year.\n\n100% in either direction has consequences at this point; unfortunately one of the biggest consequences of 100% in-person having to switch back to 100% online.  \n\nBoth people uncomfortable with returning in-person, and people who desperately want to *remain* in-person should be backing a hybrid/streamed model.",
                    "score": 4,
                    "author": "hsrambe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How hard is it to live stream a lecture? I would definitely prefer to watch lectures from home.",
            "score": 35,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly, and it would be ideal for students but also the general public. The students can decide if it’s safe for them to attend or not. Forcing everyone to attend in person is a recipe for disaster considering our extremely fragile health system",
                    "score": 14,
                    "author": "circles789"
                },
                {
                    "level": 1,
                    "comment": "I’m a former Acadia student.  For the 2020-21 academic year (while Dal was almost entirely online) Acadia embraced a parallel hybrid system.  Because there were occupancy limits and physical distancing was being enforced, it would have been impossible for everybody to attend every lecture/test/lab/tutorial in-person.  To solve this, all synchronous classes were either 100% online, or in-person with a livestream (most of which were recorded because some students were in different time zones).  Asynchronous online classes were another solution (albeit less common).  In my first semester here at Dal, it’s individual classes that are either 100% online or 100% in-person, meaning that I’m on campus as a transmission vector every day (even for just 1 hour of in-person learning).\n\nI don’t think fully switching back to in-person is a wise choice, but I understand others may be struggling.  Streaming an in-person class is not that difficult, and there are precedents.  It makes no sense how Dal’s approach has to be so binary.  It would be very easy to appease both parties.\n\nFor clarity, when I refer to a  “parallel hybrid” class I am referring to a synchronous class which can be consumed either in-person or online (may or may not be recorded), with some attendees at home and some in the broadcasting room.  Parallel hybrid classes benefit from the ability to rotate attendees so everyone has the chance to attend in-person, *if they wish*.\n\nIt follows that the “hybrid” classes here at Dal would be “series hybrid” classes, with strictly online and strictly in-person components (ex: lectures are online but labs/tutorials/tests/etc are in person).  Series hybrid classes then require every student to be on-campus at some point (which can interfere with isolation/recuperation).\n\nIn my opinion, the parallel hybrid approach would be a much more appropriate response, because if we come back too big and too fast we’re more likely to have a problem and have to go back online.  By opening campus in a conservative way, Dal could ensure the students who need in-person classes the most can get them.  Based on this subreddit alone (and conversations with some friends), there is a significant portion of students who prefer online (now or in general), so the university wouldn’t have to upsell the online portion in order to keep numbers low, and they represent x transmission vectors which ultimately serve to protect the in-person learners.",
                    "score": 7,
                    "author": "hsrambe"
                },
                {
                    "level": 1,
                    "comment": "What about tests? Presentations? Labs? There is a lot more to making a hybrid class than just live streaming the lectures.",
                    "score": -7,
                    "author": "hfx_sail",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Live stream them too...  that’s what we did at Acadia for 2020-21.\n\nLectures, labs, tests, and presentations were your choice for attending in-person or online.  Each event had a livestream and, for the most part, it worked.  \n\nTests were cheat-proofed or made open book/note.\n\nPresentations were done by screen-sharing in the class Team.  I was part of a blended design project with some members in-person and some online.  I had no problem talking to the class stream or being heard as a booming voice over the classroom speakers.  After the project was over the instructors told us that we were one of the best functioning, best communicating, and most prepared groups, even compared to the fully in-person teams.\n\nLabs (which admittedly took place in small rooms with tiny groups in the classes I took) had a camera at the front of the room, one pointed at the apparatus, and any detail shots/difficult angles were covered by students broadcasting from their phone cameras.\n\nThe approach at Acadia was one of collaboration, cooperation, patience, and adaptation.  Students in-person understood that they relied on others not being present to give them the necessary space (else we’d all have to go online), so they were willing to accommodate others.  Online students also brought unique resources to the table, from ensuring the streams and recording were functioning properly, to simultaneously helping in other parts of lab experiments (like data acquisition and preliminary processing, research, and troubleshooting) which would have otherwise lead to disruption.  For something bestowed upon the student base on such short notice, it worked surprisingly well.  \n\nDalhousie could absolutely embrace a middle-ground, rather than jerking us all back and forth between rushed-online and poorly-executed “series hybrid” in-person classes (which are likely to put us back into another rushed-online period).  \n\nNot every decision needs to be made using a light switch; and knowing how much money I fork over in tuition each year, they can certainly afford to buy dimmers.",
                            "score": 6,
                            "author": "hsrambe"
                        },
                        {
                            "level": 2,
                            "comment": "Can you brainstorm solutions to those? I can.",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course you can. Never said it wasn't possible, just that it isn't as easy as live streaming lectures.",
                                    "score": 1,
                                    "author": "hfx_sail"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’d rather not rely on profs to come up with a solution to those that isn’t complete shit. Have you tried doing a lab online? It’s completely pointless.",
                                    "score": 1,
                                    "author": "LoneSabre"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really would've preferred for everything to stay online or be hybrid because I've had some (unrelated to COVID) health problems come up that restrict my ability to move and cause extreme pain and having online classes was really beneficial to me.",
            "score": 24,
            "author": "lolfuckno",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, sorry if I'm being insensitive, but have you tried contacting the accessibility center at Dal? They might be able to make accomodations for you.",
                    "score": 3,
                    "author": "Kemo_Meme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't worry, you're not being insensitive, but I have tried and they haven't been very helpful.",
                            "score": 2,
                            "author": "lolfuckno",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that's unfortunate, hopefully things go better for you.",
                                    "score": 1,
                                    "author": "Kemo_Meme"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly, I agree with you. I wished they were a little more considerate and weighed a hybrid option if not a full online option.",
                    "score": 5,
                    "author": "circles789"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Online all the way.  I have more free time (and money) without the commute.\n\nThe ability to rewatch recorded/asynchronous classes also helps my learning style.  Watch it first and just follow along, then watch it again to get the notes (contrast that with half paying attention half scribbling notes).  You already know what’s coming/worth noting/how to best format your pages, and if you miss something you can listen to it over and over until it makes sense. TBH, I (and probably a lot of others) resort to YouTube for review/clarification anyway, simply because of it’s accessibility.\n\nPandemic aside, I much prefer the online system.  (I know it doesn’t work for everybody)\n\n\nPandemic not-aside, how are students who inevitably get sick supposed to receive the material/assessment?  Will recycled online lectures from previous online semesters be made available?  Will classes be streamed?  Or are we just saying f-it and embracing the super-spreader it will become?\n\nPublic schools are at least set up for quasi-social distancing, but at Dal you’re always shoulder-to-shoulder with random people in the dankest of human-stacked rooms.  I’m not even sure that fire code is always respected. 🥴",
            "score": 16,
            "author": "hsrambe"
        },
        {
            "level": 0,
            "comment": "A hybrid model is definitely the way to go.\nI transferred to Dal last winter semester, and I recently moved to Halifax a week ago. I signed a lease as I was under the impression we would be in person. Now that I have moved here, unable to find a job, and everything being online, it really fucking sucks. At least with a hybrid model, I can force myself to attend class and make use of my time, instead of having to do everything online. I feel kind of played because I have made a huge financial commitment in order to live here to attend school, when I could’ve just been doing it online. At least In my position, 2/4 professors have sent out an email letting us know that they will be sticking to an online format. They need to stick to a decision and stop fucking around and changing it every 10 minutes. It’s getting ridiculous. But then again, they are still making money so they don’t care regardless. I also understand a hybrid model doesn’t work for certain programs and courses, but I really believe they could find a way around this if they needed to. Again, they just don’t care at all.",
            "score": 9,
            "author": "healthyprotectionlol"
        },
        {
            "level": 0,
            "comment": "Tbh I’m not sure how I feel about the return to In person classes. I definitely support opening residence tho",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "For the money I’m paying… it’s beyond time to go back",
            "score": 27,
            "author": "wetdeclan111",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re not gonna get much out of it in person. Online isn’t ideal but in person is far from the right answer right now I feel",
                    "score": -3,
                    "author": "circles789",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is a massive difference between online and in-person learning. It’s been 2 years of this shit, it’s time to get back to some sort of normalcy. The right answer is going back to in person.",
                            "score": 10,
                            "author": "wetdeclan111",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What about when we inevitably get covid at least once? A lot of my profs don’t intend to post online lectures at all so do we just miss week(s) of class every time we have covid symptoms and are told by public health to quarantine? I think the suggested hybrid model would be much safer and more effective.",
                                    "score": 9,
                                    "author": "AlayaCameron",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I definitely see your point in that. The hybrid model would be the best way forward and allow students to catch up on a missed week of lectures. For the amount we are paying lectures should have always been recorded and posted online. Being able to go back and re-listen to what the prof said after the class is over would be great",
                                            "score": 9,
                                            "author": "wetdeclan111",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Welcome aboard.  Everyone with a shred of sense (no matter which system you prefer) seems to come to accept that a hybrid model is the best approach at this point.\n\nWho is supposed to be representing us, and how do we get in-contact with them?  We’ve still got two weeks to make our case!",
                                                    "score": 4,
                                                    "author": "hsrambe",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don’t know who or how we can have our voices heard. Nearly everyone I’ve heard from agree that the hybrid model would help everyone and everyone will be satisfied.\n\n I wish the DSU spoke on solutions like these for us….",
                                                            "score": 1,
                                                            "author": "circles789",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You don’t get your voice heard. Dal does not care, and the DSU is a joke. Welcome to dal",
                                                                    "score": 2,
                                                                    "author": "wetdeclan111"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hey there Circles. Never been big on social media, but I can give you my \"informal\" reply to this.  \n\n\nThis is Frey, one of your DSU exec.  \n\n\nWith regards to \"how we can have our voices heard\" it is a complex question and answer.  \n\n\nThe short and easy action is : The first step is to email a rep, flag down your department's councilor, or really engage in any way shape or form. Most of the exec are even accessible outside of the 9-5, sometimes to the detriment of their academics. Email me. You don't really need to have clear actions, if there's something we're already doing, I can point it out to you and help you understand where we're at. If you have suggestions, happy to hear them. We're in strange and unfortunate political times. I'm also happy to just sit around for a cathartic chat whenever there's a gap in my schedule.\n\nNobody needs to be unheard.\n\nThe Long answer is: Your reps are present in most admin meetings, though some are covered by confidentiality agreements. I'm personally in ongoing meetings with regards to which meetings are by default confidential vs \"move to confidential when confidential things are discussed\", trying to do exactly what I promised: Ensure students are present in conversations about them, and are when possible privy to any information they need. \n\nFun note: If I remember right, senate meetings / minutes and discussions are accessible even when confidential via\n\n\"https://beta.novascotia.ca/apply-access-information-under-freedom-information-and-protection-privacy-foipop-act-form-1\" &lt;- this form.\n\nBut I'm fairly certain there's a processing cost associated as a means of reducing frivolity of requests.\n\nFor your title question here \"What do you think about Dal's return to in person classes\": We have the complicated situation of representing a student body that is not a monolith. Wetdeclan111 here in this thread, if a student, does exist, and says this stuff.   \n\n&gt; \"There is a massive difference between online and in-person learning. It’s been 2 years of this shit, it’s time to get back to some sort of normalcy. The right answer is going back to in person.\"\n\nand he's not alone. We also have students who are not ok with returning to in person. There isn't a clear path where everyone is going to be happy, but more importantly, there are limits to where we can pressure, and by how much. \n\nI have my office hours now by appointment via teams or zoom as a result of medical status in my household, and I've worked in the front line of public health response to covid, so I have my thoughts, but I'm still functionally here to represent the views of Dal in aggregate, not just stand on a soapbox made of other students.\n\nIf you're looking for what we're currently doing to approach this situation, there's a pretty broad swathe of things. As many are in my portfolio (academic and external): We're meeting with NS public health reps, we are and have met with admin to discuss. With regards to the \"back to in person classes\" decisions, there's a science board / consultation with NSPublic health that I'm not personally privy to, but I'm in the process of identifying whether we can get a student rep there, even if just in an observer capacity. \n\nIf you dredge through my council reports (Minutes are on https://www.dsu.ca/council ) you can get a general picture of the week to week, and if ever you want to get clarification on anything that happens there, you're welcome to email us, or look at the various proactive communications (newsletter, various instagram and social media blasts etc). \n\nThe interesting opportunity that the contention of return to in person offers is a position where faculty interests and student interests can be more similar than different. The faculty has its share of (sorry to use you as shorthand wet) wetdeclans, vs people who would be more akin to your view. They're both asking for support and resources and concrete answers from the same body. It also gives you more insight into the decision making bodies in Dalhousie, and how competing needs are triaged, it also gives opportunities to engage in more collaborative discussions which can foster less of a separation between the two.\n\nA decent takeaway I can disclose is: Dalhousie as an administration will be in lock-step with NS Public health. How you view that depends on how you view NS Public health. Arguing against current public health standards is the kind of battle that would require significantly more visibility and numbers, and as it stands there are limited means for me to directly communicate with all students simultaneously (there is a firm limit on how many mass emails we can send out, and anything outside of \"Everybody has an @dal\" starts fracturing into social media platform preferences.",
                                                                    "score": 2,
                                                                    "author": "FreyHasAReddit",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thanks for this response Frey. Really appreciated.",
                                                                            "score": 1,
                                                                            "author": "wetdeclan111",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "If you need anything further, union members aren't hard to find. Most will reply in less than 24 hrs to an email. Trying to keep work out of your weekend is a losing battle.",
                                                                                    "score": 1,
                                                                                    "author": "FreyHasAReddit"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The rent prices are ridiculous right now and frankly I don’t even know if there’s enough units available for the influx of people who will be coming back… I think a hybrid model would’ve benefited everyone and been satisfactory to everyone",
                    "score": 8,
                    "author": "circles789",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean most of the people coming back probably already have a place to live since they needed one in the fall",
                            "score": 7,
                            "author": "catzinthecity",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For me it’s back to commuting 3 hours per day.  😔",
                                    "score": 6,
                                    "author": "hsrambe"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think they should have offered more classes online in the first place because there were MANY people that couldn't get to Dalhousie this year and are screwed for classes :(",
            "score": 8,
            "author": "JustKiddingRoombas"
        },
        {
            "level": 0,
            "comment": "Just FYI, if anyone hasn't been to a class since the add/drop date, in light of the announcement, you *may* still be able to get a refund :)",
            "score": 2,
            "author": "dapplestreak"
        },
        {
            "level": 0,
            "comment": "Just gonna mention that not all profs/departments are choosing to go back to in person. Profs are supposed to communicate to their students the plans for their classes by Tuesday at the latest. Some profs are definitely choosing to stay online or do hybrid. \n\nIf you're worried about going back to in person, you can definitely email your prof and see if they're open to doing hybrid or if they're planning on staying online.",
            "score": 2,
            "author": "ConsciousDisaster183",
            "replies": [
                {
                    "level": 1,
                    "comment": "Except that many profs already made their in-person schedules so even if students try to communicate and ask the possibility of online or hybrid, it wouldn‘t be easy for profs to change their plans.",
                    "score": 1,
                    "author": "Puzzleheaded-Ease-65"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They do online, people complain that they've traveled all this way and paid for housing.\nThey do in class, people complain that it's not safe.\nThey literally can't win",
            "score": 2,
            "author": "Firm_Edge_5974"
        },
        {
            "level": 0,
            "comment": "agreed",
            "score": 2,
            "author": "tonne97"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not scared for myself but for those around me that are high risk. I’m a young and healthy person so I’m not worried about covid myself. \n\nAlso I’m not loaded financially to take a semester off. I need to graduate asap and start working to make money as I’m sure many people are.",
                    "score": 11,
                    "author": "circles789",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Except the booster shot isn’t available to the majority of Dal students rn and even if it does become available before the 31st, it takes two weeks to become effective. Besides immediate severe illness, more and more people with “mild” COVID have long term symptoms. New chronic conditions. “It’s just a flu”. Do you really have time to be sick with a very bad flu for 1-2 weeks this term (“best case” scenario) ? Most people certainly do not. Your mentality is incredibly problematic. Taking the booster and “hoping for the best” is not all we can do, Dal should be protecting its students right now instead of knowingly sending them out to get sick.",
                                    "score": 17,
                                    "author": "verycoolshoelaces",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is truly perverse: knowingly setting students up to get sick and sending out notice the very day fees are due so little time to weigh impossible options of health or education. Very clear Dal cares nothing about its students except a tuition cheque. Waited weeks for information and then Friday’s Update basically says, everyone come back in person with the protective upgrade from cloth masks to medical masks. No further safety protocols or system changes to reflect increased transmissibility of Omicron. Wow, feel so safe and supported! Ridiculous!  Even worse, still left hanging since profs have more time to decide how they will deliver individual courses. Meanwhile, courses will have been rolling along for two weeks and tuition paid to avoid late fees and 25% gauging of tuition refund. No real choice for students. Dal’s messaging and communication skills definitely earn a failing grade, a solid “F”.  Where is the DSU?",
                                            "score": 14,
                                            "author": "allfiredup2020",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep. Add it to the list of things that would make Dal an excellent case study in some public/financial/business ethics course. 🙄",
                                                    "score": 3,
                                                    "author": "hsrambe"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Wasnt this message sent out in December? The latest email just confirmed what they had said a month ago.",
                                                    "score": 2,
                                                    "author": "hfx_sail",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Not at all, in December they had said that we would be staying online until *at least* January 28th, and would only come back to in-person classes *if* it was safe. This is not safe.",
                                                            "score": 4,
                                                            "author": "dapplestreak",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Definitely not safe and left us hanging way too long. “We will need more time for our academic community as a whole to assess, understand and prepare for how best to deliver a safe and successful winter term.”  Took 3 weeks to conclude that having students wear medical masks instead of cloth would make us all safe. What a sad joke! They are messing with our health and our academic success. Who can be sick for a week or two and still keep up with heavy work demands of full course load? Setting us up to fail, physically, mentally and academically.",
                                                                    "score": 2,
                                                                    "author": "allfiredup2020",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Indeed! And this is not to say anything of how much extra work this is inevitably going to create for the professors, instructors, and TA's no matter which way you slice it....or of what happens if any of those people got sick. 3 ply medical masks, indeed. Those are so easy to find right now too! It is a sad joke, and I really hope that most of my professors at least pursue a hybrid model so I can avoid campus.",
                                                                            "score": 1,
                                                                            "author": "dapplestreak"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I actually think I prefer online courses, especially for early morning classes. \n\nHaving more students going back to taking public transportation along with going back to class just doesn't seem like a good idea in the long run.",
            "score": 1,
            "author": "Poison-Hot-Chocolate"
        },
        {
            "level": 0,
            "comment": "I agree there should be options to do school online… but at the end of the day, 1 percent of dal students are not going to end up in the hospital and the health care system is not going to collapse. We are paying to attend an in person and if you do not wish to come to campus then take online courses. Most courses I’m in are already offering online for the entire semester anyways.",
            "score": 0,
            "author": "gangsterd21",
            "replies": [
                {
                    "level": 1,
                    "comment": "My entire department is in person only with no consideration for online so that doesn’t work. Also I was just making a point that even if 1% get covid and then they spread it around to their friends/family, it can collapse the healthcare system. I’m not sure if you follow the updates but public health has already stated that their under severe strain. I’m not really worried about getting covid myself but we have a very large at risk population here in NS that could suffer direly",
                    "score": 3,
                    "author": "circles789"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Covid’s over hyped and the hospitals are doing just fine. It’s time to get back to normal life",
            "score": -13,
            "author": "D-Rockwell",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m sorry sir but I know nurses personally who have not had time to breath the past 2 years, our health care system is no where close to fine. We were short something like 600 nurses before this mess even began and due to burn out I’d say it’s probably worse now.",
                    "score": 8,
                    "author": "AlayaCameron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair point— the healthcare system is a mess, but the hospitals aren’t chuck full of COVID patients",
                            "score": -6,
                            "author": "D-Rockwell",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No they aren’t but there’s enough stress on the system that life changing surgeries are being put on hold indefinitely. 58 covid cases in hospital is anywhere between 58 and 232 exposures daily whether it be nurses or other hospital staff. Those 58 staff each interact with 20 more staff and we eventually have to force staff to work sick and expose more people, or face an entire collapse of our hospitals.",
                                    "score": 2,
                                    "author": "AlayaCameron",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah idk man, it’s a hard situation- don’t get me wrong. \n\nBut we’re going on two years with trying to control COVID; we’ve gotta learn how to live with it like we do with the cold &amp; flu",
                                            "score": -7,
                                            "author": "D-Rockwell",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Isn’t discussing and adapting systems to make them more safe in light of the contagion “learning to live with it”?\n\n... or do you mean just go on ignoring it as some sort of hike-yourself-up-by the-bootstraps non-solution? 🤨",
                                                    "score": 7,
                                                    "author": "hsrambe"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is completely the fault of the govt for not upgrading the healthcare system. My third world country vaccinated more than  a billion people in less than a year and yet here we are over here. Be mad at the govt not us!",
                            "score": -3,
                            "author": "Sean__2000"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly! Just 50 people the hospital and a couple in the icu. Now that we all will be boostered soon, this is just a flu now",
                    "score": -4,
                    "author": "Sean__2000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Time to go back to normal. Oldies have gotten their boosters and we will get one soon. Cant stay like this forever. Mexico., UK, UAE are already thinking of scrapping all covid rules since this is endemic now. Only way to solve this is countinuous boosters for the vulnerable population.",
            "score": -5,
            "author": "Sean__2000"
        },
        {
            "level": 0,
            "comment": "I feel bad for the faculty and professors. They can't win no matter what they try and do for you guys. Especially the social work community, seems like those students always look for something to complain and whine about.",
            "score": 1,
            "author": "Firm_Edge_5974"
        },
        {
            "level": 0,
            "comment": "It's important for students to go back to school. This virus is not going anywhere. It's an endemic. It's time to start living like we were prepandemic.",
            "score": 1,
            "author": "Few_Positive3379"
        },
        {
            "level": 0,
            "comment": "bad idea",
            "score": 1,
            "author": "npcompleety"
        },
        {
            "level": 0,
            "comment": "&gt;Healthcare System\n\nIf only you knew how bad it really is.\n\nThat said, unless the Deltacron memes become the real deal a university student population would add minimal additional strain. Now if the entire Dal population was living with their grandparents that might be another conversion.",
            "score": 1,
            "author": "i_keep_a_low_profile"
        },
        {
            "level": 0,
            "comment": "Dont masks and vaccines work? Are these measures not mandatory at this school?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It's about time - I may have graduated uni a few years back but online learning is hot garbage. If you're still scared of the Rona, stay home and deal with the quality of online learning.\n\nFor the rest of those who would rather actually learn stuff, open everything up. And yes I am boosted so don't come at me for being anti vax or whatever.",
            "score": 1,
            "author": "mcmcclassic"
        },
        {
            "level": 0,
            "comment": "Really silly. Being immunocompromised I'm a bit paranoid about getting sick. I haven't been able to attend classes consistently, or really finish a class in sometime. I graduated a few years ago but need courses to apply for a masters. It would have been good to have a hybrid system like I've been reading about in these posts.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Lol.. omicron has killed less that 50 people world wide I think we’ll be fine",
            "score": -10,
            "author": "Illustrious_Kick9720",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure what kind of fever dream you are getting your made-up number from",
                    "score": 6,
                    "author": "Effective-Ride2840"
                }
            ]
        }
    ]
}