{
    "id": "ya0kmf",
    "score": 64,
    "title": "Vroom vroom, no hesitation",
    "author": "Dal_Ghost",
    "date": 1666376139.0,
    "url": "https://www.reddit.com/r/Dalhousie/comments/ya0kmf",
    "media_urls": [
        "https://i.redd.it/u3zhwdl8a7v91.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah for real, Dalhousie is acting like a typical shitty driver from Rhode Island. The meme is from Exit 12 (straight north towards Boston, and right towards Providence). Us here in New England know full well that RI driver’s are the shittiest drivers in America. It’s not an untrue stereotype, they’re the worst.",
            "score": 3,
            "author": "punkbeatjohn"
        },
        {
            "level": 0,
            "comment": "contact these people about the strike and tell them to get back to the bargaining table\n\nLaura Neals, director, laura.neals@dal.ca 902-494-6236\n\nMarlo Shinyei marlo.shinyei@dal.ca\n\nMiriam Breslow miriam.breslow@dal.ca\n\nDipti Periwal dipti.periwal@dal.ca\n\nJennifer Dooks jennifer.dooks@dal.ca 902-494-7090",
            "score": 1,
            "author": "TAonStrike"
        },
        {
            "level": 0,
            "comment": "Oh to be young and dumb. What are you, first year or CUPE?",
            "score": -27,
            "author": "InteralChip",
            "replies": [
                {
                    "level": 1,
                    "comment": "What are you? An undergrad who complains about not having a job yet all you manage to do in every comment section about this issue is put down TAs, markers and other CUPE members.\n\nWhen you're done your undergrad you will be so sad when you realize that you can't get food or shelter because TAs still make 24 an hour and that's the job you get in grad school.\n\nHow about you realize that by dal increasing TA wages it:\n\na) costs you nothing personally as fee schedules are pretty much set in stone for the remainder of your degree. \n\nb) will secure you a good quality education for the remainder of your undergrad. \n\nThe quality of your education will dwindle if this issue doesn't get addressed. I've been at dal for 4 years and all I can say is that teaching quality is getting progressively shittier than it was before and a lot of that is due to unfair compensation of TAs. One of my courses has no TAs despite having tutorials scheduled. After this strike, it only gets better.\n\nc) will increase the wage that YOU can earn in the future if you become a TA. \n\nThere is literally no benefit for you to carry this opinion unless you lack the capacity to endure mild inconveniences for future reward.",
                    "score": 19,
                    "author": "avril04",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I'm done my undergrad I'll find a job that pays me well. \n\nYou're right! It would be so wonderful if everyone had all the money but that's not the way the fucking world works lmao. Do they make 24? I read 27,! That's 14 above minimum ! And if they're science students their post graduate studies are paid for wowza. Average ta pay in Canada is 25~ \n\nHow about you realize I'm getting fucked by this and I have an issue with it. I'm not going to weigh who is getting more fucked with you but I'm actually just beginning my degree and paying up the ass for it. I'm not getting paid at all.",
                            "score": -17,
                            "author": "InteralChip",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "TAs at Dal make 24$/h and marker/demos make $16/h. Although the number sounds good, it’s actually not because we are super limited to how much we can work in a semester as we are expected to put the majority of our time into research (some of us not getting a research stipend for it either but that’s a separate issue). For example, common TA contracts are 45h or 90h for a semester and you can only TA a few hours a week. This doesn’t end up in a lot of money… especially since some faculty will actually consider you a TA for half the hours (earning $24/h) and a marker/demonstrator for the second half (earning $16/h) which seriously reduces the pay as well. \n\nThe average TA pay among the U15s is approx $35/h which is what the TAs are asking for I believe. Keep in mind that many universities are actually pay their TAs nearly double what we’re being paid currently. Also, a while other thing to think of is the part time academics (the folks who teach a LOT of courses at Dal). They make the worst wage compared to all U15 universities in Canada. \n\nWhere would the money come from? Definitely not students. Dal has a $67million surplus from 2021-2022 that you can find on page 1 of their 2021-2022 financial report. They have the money. It is worth noting that your tuition money goes to paying the president half a million dollars a year as a salary as well as paying for his house, private car and insurance, phone and internet, and his golf membership.\n\nI don’t really understand the “they’re so greedy perspective” when there are literally TAs telling the student body that they can barely afford rent or groceries and have to work multiple jobs. They’re very open about their direct experiences which isn’t really something that is arguable.",
                                    "score": 3,
                                    "author": "FlowGlittering4534",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just one correction, they are asking to move halfway to parity with the other universities, so ~30/hour",
                                            "score": 1,
                                            "author": "Effective-Ride2840"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You have to stop playing the fucking victim Olympics If you want to actually want to have a discussion about what's going on. Indont buy the whole support the TAs and plenty of other students don't either. Come with a better.argument",
                            "score": -17,
                            "author": "InteralChip",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ay fuck you man. I love the TA's. My science tutorial TA is hot af.",
                                    "score": 8,
                                    "author": "sylagogue"
                                },
                                {
                                    "level": 3,
                                    "comment": "You literally have no argument besides you yourself playing the victim olympics card and saying that you're poor and have barely started your degree while inferring that you're somehow better than every TA. I hope karma bites you for that one because sounds like you need a reality check. \n\nYour only argument is you making a big fuss about how it's temporarily inconvenient for you as you disregard the numerous points I've brought up. \n\nOnce you make an attempt to counter each of my 3 points in some way that isn't just a snarky, over-emotional comment, only then will this become a discussion.",
                                    "score": 2,
                                    "author": "avril04"
                                },
                                {
                                    "level": 3,
                                    "comment": "dude you’re out here whining about paying tuition fees and getting angry at CUPE members asking to be fairly compensated for their labor while the dal board gives massive payouts to themselves and the president, who now makes $550k per year. people have pointed this fact out to you multiple times across different threads and you have had zero rebuttals. redirect your anger and stop projecting.",
                                    "score": 2,
                                    "author": "Smocke55"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I can't even afford a car. If greedy tas like you weren't around dal could build stables so I could park my horse.",
                            "score": -13,
                            "author": "InteralChip",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most students cannot afford to buy a car (shocking!). I also cannot afford a car at this time. Welcome to the real world. So.. how exactly do you suppose raising TA wages is going to hurt you  financially?",
                                    "score": 8,
                                    "author": "avril04"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}