{
    "id": "138exkb",
    "score": 2,
    "title": "Hey all, have a few questions",
    "author": "SomaliSavage_",
    "date": 1683274381.0,
    "url": "https://www.reddit.com/r/IIT/comments/138exkb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! IIT is one of my choices to potentially transfer into and was wondering about the universify as a whole. What’s it like in terms of academia, social life, etc. I consider myself an average students (hard worker but not necessarily gifted) is IIT meant for bright nerds? Lol. \n\nI plan on majoring in CyberSec/IT if it matters.",
    "comments": [
        {
            "level": 0,
            "comment": "Not sure why people say it's depressing. I had plenty of friends, had a great social life, you just have to find a student org you like or something. Everybody I spoke to was really friendly and willing to hang out. \n\nAcademics were great. Had a lot of research and other extracurricular opportunities. Most of my professors were great and very willing to help. If you're willing/able to come to office hours and talk to the profs about any issues you have, you'll do fine. \n\nI also liked that there was a train station basically right on campus, made it really easy to get around Chicago, which is a great city. \n\nMost of the students (at least when I was there) were extremely smart. A lot of my friends went on to get great jobs right out of college either in tech or engineering.",
            "score": 5,
            "author": "exterstellar"
        },
        {
            "level": 0,
            "comment": "Social life is about as bad as it gets. Academia is fine I guess. It's only notably good for architecture students. I'm a pretty shit student, but I managed to bullshit my way through just fine. I transferred to Ohio State after 2 years and I'm glad I did. Everybody at IIT just talks about how depressing the school is and I wanted student with more social life and school pride. I don't regret going to IIT, but I'm glad I transferred. Another big thing is how expensive it is. I was paying less than half the price of IIT ay OSU.",
            "score": 3,
            "author": "Zefphyrz"
        },
        {
            "level": 0,
            "comment": "As with most things in life, it is completely what you make of it. Yes it’s a small, nerdy tech school without the flashy allure of a big state school with a huge social community, but I made several lifelong friends during my time there and don’t regret it a bit.  My degree (BS BME) has allowed me to make a good living so far (graduated in 2016), though obviously I can’t speak for the CS/IT programs. As said by others, being in Chicago is great for being able to just go out and forget about school for a bit, and will also provide ample opportunities when you’re looking to work around graduation time. I’m not a genius by any means, but hard working like you.",
            "score": 3,
            "author": "Colts4con"
        },
        {
            "level": 0,
            "comment": "Only go there if you want to develop mental health issues and handicap your social development. \n\nDespite what other people say, I think the academics is bad. It did not prepare me for graduate school.\n\nI would also take the suggestions \"it is what you make it out to be\" and so on with extreme caution and skepticism. \nChances are you are not that type of a person.\n\nAlso, having gone to a school with normal social environment, I can say that you have no idea how big of a difference it makes to overall well-being and how much of a garbage social experience is at IIT in comparison.",
            "score": 1,
            "author": "Mc41998",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes agreed. Glad I'm not the only one that felt this way",
                    "score": 1,
                    "author": "Successful-Network66"
                }
            ]
        }
    ]
}