{
    "id": "165hvi",
    "score": 1,
    "title": "Anyone know how to screenshot an entire page in MyIIT? The header is making this so much more difficult than it needs to be.",
    "author": "Cyadd",
    "date": 1357605274.0,
    "url": "https://www.reddit.com/r/IIT/comments/165hvi",
    "media_urls": [],
    "other_urls": [
        "http://i.imgur.com/WerKv.png)."
    ],
    "postText": "A little background, I would need a screenshot of the entire webpage that has my unofficial transcript on it. Using Chrome, there's a handy extension made by Google that would take a screenshot of an entire page. Except, whenever you go a tab, I, at least, get something along the lines of [this](http://i.imgur.com/WerKv.png). See how the scroll bar doesn't get to the very top of the page? Now, whenever I use the tool, it won't scroll down all the way, since I guess it thinks that all the webpage is the only visible part of the screen. Thoughts?",
    "comments": [
        {
            "level": 0,
            "comment": "Have you tried the screen shot button and then stitching individual shots together in paint/photoshop? ",
            "score": 2,
            "author": "sarch",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would have hoped to avoid this. The website should be a butt. ",
                    "score": 1,
                    "author": "Cyadd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "a slightly easier way is to put screenshots into microsoft word and save the whole thing as a pdf or whatever format you want. I had the same problem trying to get a copy of my unofficial transcripts and this is what I did. I tried everything...",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For transcripts I print as pdf.",
            "score": 2,
            "author": "take_once_daily",
            "replies": [
                {
                    "level": 1,
                    "comment": "What do you mean by this?",
                    "score": 1,
                    "author": "Cyadd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I assume they mean you should use something like [Cute PDF Writer](http://www.cutepdf.com/) to print the page to a pdf.",
                            "score": 1,
                            "author": "wombatgal"
                        },
                        {
                            "level": 2,
                            "comment": "I was a bit unclear.\n\nTo get unofficial transcripts without all of the bogus details at the top and bottom I highlight a selection and say print. Then from the print menu you can save as a pdf. This is on OSX, but I'm sure there are PC options.",
                            "score": 1,
                            "author": "take_once_daily"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What would my pin be for this?",
                    "score": 2,
                    "author": "Cyadd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay, I finally understood what you meant. This works. Thanks so much. ",
                                    "score": 2,
                                    "author": "Cyadd"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "when I did the print thing and save as pdf it only got what is on the screen at the time not the whole thing. maybe its different now or different browser have a better time.",
                            "score": 0,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hold control and pull back on the scroll wheel till everything gets in view.",
            "score": 0,
            "author": "MaxLemon"
        }
    ]
}