{
    "id": "25m2d6",
    "score": 10,
    "title": "Tips for Freshmen students!",
    "author": "princemaxx",
    "date": 1400144877.0,
    "url": "https://www.reddit.com/r/IIT/comments/25m2d6",
    "media_urls": [],
    "other_urls": [],
    "postText": "This subreddit is mostly filled with posts related to the Indian IIT. \nHow about something related to the IIT that's meant to be in this sub?\n\nPost a tip you wish someone had told you while you were a freshmen at IIT.\n\nHow to manage time wisely\nHow to get a good GPA\nWhich are the best/worst professors \nWhat are the best things in campus \n\nPost away! ",
    "comments": [
        {
            "level": 0,
            "comment": "Don't buy books before class. Wait until the first lecture and the professor might say how often you will need it, an alternative, etc... I spent about $100 last semester on books. 1 bought used, 2 rented, one I found a full PDF online. And I didn't buy from the bookstore.\n\nGet enough sleep, living in the dorms means you don't have a bedtime, but you should get enough sleep. Also try not to skip meals.\n\nIf you are lost in a class, make friends and ask them. If that doesn't work, maybe talk to the professor and go to the ARC. Also check your grades often to see how you are doing in class.",
            "score": 4,
            "author": "lt13jimmy",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the most frequent tip I see.\nI will decide to not buy books. \n\nHow difficult is it to maintain a good GPA? (3.7+)\n",
                    "score": 1,
                    "author": "princemaxx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "First semester was bad for me. This semester I did good, 2 As 3 Bs. The courses I got Bs in were the most work intensive. I could've put much more time and effort and gotten all As.\n\nI guess procrastinating was my biggest problem. \n\nIt is not too hard (depending what the classes are) to get almost all A's. Just give each class time out of your day and don't wait until last week to study. I find it helpful going to the library to do some homework. Also visit the ARC. They offer tutoring services, the tutors are graduate students and know their stuff. If I could redo last year, I would spend more time on schoolwork and going to the ARC.",
                            "score": 1,
                            "author": "lt13jimmy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you're beginning to lament how seemingly asocial the student body is, (I don't know how much things have changed the past few years, this might not be a big deal anymore) don't fall into the trap.  If there's no social events (or just ones that don't interest you), set some up!  Be the change you want to see.\n\n-----\n\n&gt; This subreddit is mostly filled with posts related to the Indian IIT\n\nSeriously?  Are the mods active at all..?",
            "score": 3,
            "author": "sugardeath",
            "replies": [
                {
                    "level": 1,
                    "comment": "Current IIT student. Can confirm not much is done by people here. Most of the people I know/hang out with DONT go to IIT (anime con ppl)",
                    "score": 2,
                    "author": "warsie"
                },
                {
                    "level": 1,
                    "comment": "&gt; Seriously? Are the mods active at all..?\n\nI know, right. This sub-reddit has no activity at all! \n\n",
                    "score": 1,
                    "author": "princemaxx"
                }
            ]
        }
    ]
}