{
    "id": "2ttzz0",
    "score": 3,
    "title": "Possible future foreign exchange student with some questions :)",
    "author": "TVantenna",
    "date": 1422360342.0,
    "url": "https://www.reddit.com/r/IIT/comments/2ttzz0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I’m a student at the technical university of Denmark who’s interested in a semester abroad in the United States. I’m not entirely sure how the academic terminology translates but I’m currently doing my first year (second semester) of my bachelor degree in design, I read that you have an institute of design, which got me interested in the first place. I’ll be able to go abroad in my fifth semester (summer to winter 2016).\n\n-\tDoes anybody here have experience with the institute of design? What do you think of it? How is the balance between humanitarian sciences and natural sciences?\n-\tHow is the foreign exchange programme? Any experience with it?\n-\tSocial life, I read that something like 70% of students live on campus (NOT the case at DTU), which I imagine helps the social life a bunch. But still, engineering students have a reputation of being reclusive, what can I expect?\n-\tLast but not least, economy; I expect the Danish government to pay at least the lions share of tuition and provide a monthly stipend at ~800 dollars, will this be enough or should I start saving? And what about transportation? I don’t have a driver’s license and don’t plan on getting one, will this be a problem?\n\nThanks for you time, English obviously isn’t my native language so if something is unclear feel free to correct me :)\n",
    "comments": [
        {
            "level": 0,
            "comment": "So I  just realized that it's 6 in the morning in Chicago, sorry about that, I still hope somebody sees this though :)",
            "score": 3,
            "author": "TVantenna"
        },
        {
            "level": 0,
            "comment": "Institute of Design is in the downtown campus so much of what I said is irrelevant. It's more centralized in the city but away from the rest of IIT. I know nothing about the social life/rent up there. I don't know too much about the institute of design but looking at the website, it says that its a graduate only school so you probably can't get in even as a visiting student without a bachelor degree. \n\nIf you're looking more at IIT in general, we have a great architecture program on main campus that would welcome you. \n\nIf so $800 US is do-able but it won't be very fun. I have very cheep rent in the area that's $400 a month. $600 is probably a more reasonable expectation. Cheapest you're going to get on campus is sharing a room with someone for $5000 a semester which works out to ~$700 a month. Most people live on campus because they have housing scholarships so they don't directly pay for them.\n",
            "score": 1,
            "author": "moonluck"
        },
        {
            "level": 0,
            "comment": "Howdy; currently working an all night shift at the technology support desk as a student worker, hoping I can help answer some of your questions!\n\nMy experience of the Institute of Design is only from my friends who have studied there or are currently there and they absolutely love it! They think it's a great program that has really helped them professionally.\n\nUnfortunately I don't have too much experience in the foreign exchange program :(\n\nSocial life at IIT is interesting; it really boils down to what you make of it. There are obviously those who choose to stay in their rooms or in the library at all times and don't have the common college social experience; but then there are those like myself who go out almost every weekend, or whenever my schedule allows with friends from IIT and the other colleges around Chicago, UIC, DePaul, Roosevelt, Loyola, etc.\n\nAre you staying in the dorms? Does your exchange program cover the cost of housing? If so you should be fine; if not there are some apartments around the neighborhood that you can pick up cheap with a couple of room mates (I'm sure there are small solo ones too, but I haven't had the chance to look). You should be able to live comfortably off of that for food/going out/school supplies/etc. As far as transportation goes Chicago has one of the most extensive public transportation systems in the USA, I know that students at IIT receive UPasses which provide unlimited use of the CTA(Public transport) for the entire semester, and beyond that it's pretty cheap. \n\nIf you have any more questions feel free to ask! I'll be around for another hour or so before trying to get some sleep before my classes later today!",
            "score": 1,
            "author": "dr_vodnick"
        }
    ]
}