{
    "id": "3kuiu2",
    "score": 3,
    "title": "[INFO Request] Future student here, looking to transfer fall of '16. Things I can start doing now to have a richer experience when I arrive?",
    "author": "0utlast",
    "date": 1442189766.0,
    "url": "https://www.reddit.com/r/IIT/comments/3kuiu2",
    "media_urls": [],
    "other_urls": [],
    "postText": "[M][20] Currently in my 3rd year (full time student) at community college in the 'burbs. I work at a business that manages small businesses IT. Just looking for an insider's opinion on a few different things. \n\n- I definitely want to be involved on campus, I'd imagine there are clubs/organizations dedicated to projects or fields? Programming/robotics/similar majors?\n\n- For anyone who lives in the dorms, rough estimate of monthly expenditures on going out if you're moderately social into the city or on campus?\n\n- General tips to get the most out of the 2 years I'm looking to spend there? I've spent the past two working my ass off to pay for community college and come out ahead $ wise, while taking night classes. really have no idea what to expect.",
    "comments": [
        {
            "level": 0,
            "comment": "https://illinoistechrobotics.org/\n\nwww.facebook.com/IllinoisTechRobotics",
            "score": 3,
            "author": "RDT2"
        },
        {
            "level": 0,
            "comment": "At least in the past, as a student you are forced to get a CTA UPass. It's awesome. You should use it once or twice a week to go into the city. Get off at a different stop and walk around and find something for lunch. It's a great way to learn the city and make use of that UPass. \n\nPersonally I was in a fraternity and worked in the MTCC &amp; HUB and those led to tons of fun social events and interacting with other student groups. Both working on campus and my fraternity life gave me tons of soft skill experiences that have helped me in my career and life. \n\nIllinois Tech Robotics is an awesome group that I helped the founders get up and going with funding from the Student Activity Fund. Which brings up another point. Most clubs get funding from the SAF and then post invites to the events they are hosting. There are always events somewhere that you can go to to meet new people. ",
            "score": 2,
            "author": "RDT2"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "currently in the CIT program at college of dupage, ill be transferring as a junior I believe as well. So the ITM major would apply to me I think. Thanks for your input! didn't know how often people checked this sub. ",
                    "score": 1,
                    "author": "0utlast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "will do, thanks!",
                                    "score": 1,
                                    "author": "0utlast"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}