{
    "id": "ce6vwg",
    "score": 3,
    "title": "Incoming Freshman as CS Major",
    "author": "eunseok07",
    "date": 1563330969.0,
    "url": "https://www.reddit.com/r/IIT/comments/ce6vwg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I am an incoming freshman (CS Major) at IIT. I just wanted to ask for advice on how many classes I should take. Currently, I am registered for 5 classes (14 credit hours), but would you say it is okay to take 6 classes? The six classes would be 2 300x humanities courses, calc 3, 2 CS courses, and psych 300+ (17 cred. total). The class I am waitlisted for is PHIL300+. If I do get into the waitlist, would you recommend me to take the course or just take 5 courses? I'm also planning to work on campus.",
    "comments": [
        {
            "level": 0,
            "comment": "Hello, I'm not a CS major, but am entering my senior year. For the humanities courses it can really depend on the course itself. Some have lots of essay assignments and others not so much. Personally, I think it is better to take just 5 classes your first semester. That way it's easier for you to adjust to the college life. Then you will be better able to judge how much you want to take your second semester. Also, if you think you will have too much on your plate you can always drop a class in the first 2 weeks with no penalty.",
            "score": 2,
            "author": "Uncommon_sharpie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see. I think, honestly, I was aiming to take 15+ credit hours so that I can stay on track but I guess it’s also a good idea to try to see where I stand first. Thank you for the helpful feedback!",
                    "score": 2,
                    "author": "eunseok07"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which CS courses?",
            "score": 1,
            "author": "thejewsdidit1738",
            "replies": [
                {
                    "level": 1,
                    "comment": "CS100 &amp; CS115",
                    "score": 1,
                    "author": "eunseok07"
                }
            ]
        },
        {
            "level": 0,
            "comment": "With an on-campus job in the mix, I would stick to only 5.",
            "score": 1,
            "author": "unknownvar-rotmg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I think that’s what I’ll do. Thanks for the feedback :)",
                    "score": 2,
                    "author": "eunseok07"
                }
            ]
        }
    ]
}