{
    "id": "g563dr",
    "score": 4,
    "title": "Mech E Program Question",
    "author": "diammeterr",
    "date": 1587433450.0,
    "url": "https://www.reddit.com/r/IIT/comments/g563dr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I got accepted to IIT, and UIUC my first choice. But because of tuition and costs, I’ve been considering to go to IIT. \n\nAnyone know how the mechanical engineering major compares to both schools? \n \nI just wanna know if it’s worth it. sorry if these comparison questions are annoying.,",
    "comments": [
        {
            "level": 0,
            "comment": "UIUC is a better engineering school but IIT is not that far behind. When I went there IIT had a top 25 aerospace engineering  program and a top 50 material science program nationally. both are in the same department as mechanical and share a lot of the same professors.\n\nIf the cost difference is that extreme, IIT is a good school to fall back on.  Keeping your school costs down during college will pay off way more after college than the difference in school name for the same degree.",
            "score": 4,
            "author": "lostmessage256"
        },
        {
            "level": 0,
            "comment": "Congrats on 2 acceptances. Was in the same boat when i got accepted to both as well.   \nThe two major factors for you to decide will be tuition and culture.   \n\n\nAcademically compared I think UIUC always comes out on top from those ranking websites. But if you're looking to work in chicago, the IIT name will still carry you just as far as UIUC will. Plenty of prof industries hire MechEng from IIT (me included :p)   \n\n\nIf the tuition IIT is offering you is miles above UIUC, do IIT.   \nIf you want a traditional college experience that trumps tuition, do UIUC. If you like niche stuff, can self-initiate, and prefer urban to cornfield do IIT.",
            "score": 1,
            "author": "ekm323moy"
        },
        {
            "level": 0,
            "comment": "I'm in the same boat except for architecture. I think most people would say UIUC is substantially better for engineering though.",
            "score": 1,
            "author": "MightyKhan21"
        }
    ]
}