{
    "id": "jb1fq",
    "score": 7,
    "title": "Advice for new students?",
    "author": "hyper-horse",
    "date": 1312663813.0,
    "url": "https://www.reddit.com/r/IIT/comments/jb1fq",
    "media_urls": [],
    "other_urls": [],
    "postText": "What advice would you give students new to IIT and Chicago in general? I am curious about basic information that would make a new student's experience easier: Which teachers/classes to take/avoid? Laptops or paper for notes? Where do you get groceries (i.e. shampoo)? Any bad on-campus experiences? Any cool clubs? Any groups to avoid?\nI am attending in a few weeks and would appreciate any guidance fellow redditors can give. Thanks!\n\n",
    "comments": [
        {
            "level": 0,
            "comment": "Go explore the city when you have time, there is tons of good food of all ethnicities (incl. American) for cheap up on broadway, lincoln, and clark north of ~North Ave.\nSleep when you can, honestly, sleeping the right amount makes you more productive so you don't need to stay up so damn late. And don't procrastinate. I know you probably will anyways, but if you don't you can sleep, and not feel like shit every day.\n\nNow and then drop everything and take a walk, go see a new part of town ride a bike up the lakefront, just get the hell off campus and see the world and don't worry about homework for a couple hours. ride to the end of an el line, I don't care, just do something to relax and explore. \n\nIf you're going into architecture, there is a starbucks on jackson and wabash that is lightning fast while you're up in the loop getting supplies (blick and utrecht) \n\nAlso, join the Illinois Tech Robotics team, we have a ton of fun, destroying things, building things, volunteering with high school and elementary schoolers, and generally being AWESOME.",
            "score": 3,
            "author": "alexfrancisburchard"
        },
        {
            "level": 0,
            "comment": "Here's what I learned in school. \n\n1. I didn't avoid teachers that were tough. I sought them out because they were invariably the ones that were most dedicated to teaching. I don't know if that was smart because my grades suffered for it. \n\n2. Use paper for notes. Always. Do not use a laptop in class. \n\n3. I never did groceries because I just ate at the cafeteria. It was more convenient for me than to cook my own food. In retrospect, I should have cooked my own food. \n\n4. I never had a bad experience but be careful at night on all public transport until you get acclimated to Chicago. Don't flash your smartphone or cash on buses and trains until you're more comfortable. Once you're used to the place, it'll all be second nature to you. \n\n5. The best advice I ever got (and didn't take) was -- sleep. When you have time, sleep. \n\n6. I stayed away from all ethnic/religious/race-based groups. I came to the U.S. for new experiences so it was important for me to meet all sorts of people. Depending on your own priorities, this could be good or bad advice. \n\n7. Get a job on campus ASAP. If you get to the point where you can work full time, I think they will offer you free or reduced tuition. \n\n",
            "score": 3,
            "author": "PakistaniAmerican",
            "replies": [
                {
                    "level": 1,
                    "comment": "these are all really good points! a couple of notes to add (notes apply to numbers):\n\n1. those \"tough\" teachers are definitely the most dedicated.. I had one last semester and it was so incredibly tough, but I worked my ass off, and after the class was over, he offered me a job to work for him. ie. it really paid off to work extremely hard.\n\n2. the ipads freshman are getting have a good notes app (I think mine's called \"notes plus\" or something) which can record the lecture too, which is really helpful... if you can avoid the temptation of stupid games and facebook during class.\n\n3. can't cook your own food without a kitchen! I had a rice cooker in my room (which I later found out wasn't really allowed in the dorms...oops) and all sorts of quick snacks I could take to class in a rush. Saved my life! Please remember to eat. Some students gain weight on campus, I lost nearly 20 pounds because of stress and skipping meals....Don't do that.\n\n4. I agree!\n\n5. SLEEP!! anywhere and everywhere... it's college. you have an excuse.\n\n6. As mentioned above, don't just hang out with people from where you're from...even if it's more comfortable. Too often, it sucks that students all group together and focus on where they're from rather than where they ARE and what they can learn here! Branch out and meet/hang with people from all over the world.. that's one of the great things about our college!\n\n7. The max hours a student can work on campus is 20 hours a week. Don't expect to get a full time job on campus until after you're done being a student unless you can find some sneaky work-around. In the end, that rule is in place to help YOU though.\n\n8. Remember that your health comes first. It took me three years of struggling and sickness (even hospitalization) to realize how important it is to take care of yourself. Is getting that A worth what you put yourself through? I used to say yes. Now, I realize in the grand scheme of things it's definitely not....though it is frustrating knowing your *capable* of it, and still expect a B.\n",
                    "score": 2,
                    "author": "gmbyphotographer"
                },
                {
                    "level": 1,
                    "comment": "&gt;I think they will offer you free or reduced tuition.\n\nRequesting verification.",
                    "score": 1,
                    "author": "Lemonegro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its pretty common gig at universities to be able to take classes for free when you work full time. If you're just working a student job it doesn't apply.",
                            "score": 2,
                            "author": "naxareth"
                        },
                        {
                            "level": 2,
                            "comment": "I can confirm that if you work full-time for IIT you can get your masters for free.  I don't know about undergrad.  There are limits like how many hours/semester you can take.  \n\nI worked part-time, but many of my bosses took classes on the side.",
                            "score": 1,
                            "author": "PostPostModernism"
                        },
                        {
                            "level": 2,
                            "comment": "Check with the school. You have to be working for IIT to get that deal. A friend worked in the main building and she got reduced or free tuition. ",
                            "score": 1,
                            "author": "PakistaniAmerican"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Uhm, for notes, it's all personal preference. You should probably do what you are most comfortable with. That being said, I use paper because I find it difficult to do math on a laptop.\n\nFor teachers, if you're an MMAE major, feel free to ask away, as I'll know a little bit about teachers. Otherwise, [Rate My Professors](http://www.ratemyprofessors.com/) is pretty helpful for finding which teachers are good or not. I've found it to be pretty accurate.\n\nYou can get most things from the Roosevelt Green line stop (1 stop north on the El). There's a Target and a Jewel in view of the platform, so you're good to go.\n\nAlso, for clubs, just do something, don't sit in your room and play videogames all day, or do nothing but study (but studying is important). You need to have fun, or else you're probably going to hate it. Make friends, disregard females, all that shit, but don't fail your classes.",
            "score": 4,
            "author": "Loop_Within_A_Loop"
        },
        {
            "level": 0,
            "comment": "Noteswise, Ive only had a few teachers who would let us use a laptop to take notes, just so you know, though that might only be in the Architecture dept. ",
            "score": 2,
            "author": "archimeises"
        },
        {
            "level": 0,
            "comment": "First off, welcome to IIT!\n\nAs someone already said, Rate My Professors is a pretty good resource when it comes to choosing professors. I tend to try and take professors that are known for giving out really difficult homework because it helps you really get the hang of things and do well on the exams. While on the subject of classes, always do your homework even if it isn't graded, and always go to class. There will always be a few students who will brag about how they don't need to go to class, but they are a very small minority.\n\nAs for notes, I like to use Evernote for all of my classes except math (I use pen and paper for math. It's easier that way). Evernote is a cloud-based note taking application for Windows, Mac, Android, iOS, and any web browser. Your notes are synced in the cloud so you can look at them anywhere. I found that taking notes on my laptop generally got me in hot water with profs, but if I took them on the Evernote app on my iPad, they were generally okay with that. It's a little harder to screw around on an iPad and not get caught then a laptop.\n\nAs for groceries and stuff like that, Jewel and Target are your best options. Both are less than a 5 minute walk away from the Roosevelt L stop, which is just one stop north on the green line that runs through campus. Jewel has good prices on food, and Target has good prices on anything else!\n\nI don't really know of any bad clubs on campus, so just do what you love. WAY too many people just spend all their time in their rooms here. You'll have a lot better of a time at IIT if you get involved. I'm biased, but I urge you to look into Greek Life if you are even somewhat interested. Greek Life here at IIT is very different than anywhere else, and really doesn't fit any of the Greek stereotypes. It's a great way to form lifelong friendships and get help with everything you need. And even if you aren't interested in Greek Life, try to go to as many rush events as you can during your first week here. They are all free, and are a great way to meet new people while having fun. I'm a member of Triangle Fraternity, and we're doing everything from midnight capture the flag to laser tag to live-action angry birds, and it's all open to everyone. All the fraternities are doing stuff like this.\n\nAnd my final tip is just to hold nothing back. Put all you can into doing well in your classes, and put all you can into having a good time outside of class. It sounds cliche, but these next four years can be the best in your life if you're just willing to try new things and hold nothing back!",
            "score": 2,
            "author": "Intercamino"
        },
        {
            "level": 0,
            "comment": "Notes:  Take 'em on paper if they require complicated symbols or lots of math.  Laptops are fine if your notes are just text.  Be prepared with a charged battery, though.  You'll also look like a jerk if you watch youtube videos in class.\n\nGroceries:  Target or Jewel-Osco up on Roosevelt, which are super easy to get to on the Red or Green line or the #29 bus.\n\nClubs:  I like to pretend that 33rd St. Productions is pretty cool (shameless plug).  We do improv and put on crazy theatre productions and are quite chill.  It's also fun to do a radio show on WIIT and build crazy stuff with Illinois Tech Robotics.  Go to UB events, they're free and always interesting and well-attended.  Check out the Student Involvement Fair on 8/24 from 4-7pm in the MTCC.  Every student organization will have a table with lots of information there.",
            "score": 2,
            "author": "wombatgal"
        },
        {
            "level": 0,
            "comment": "What's your major, if your an architecture major i'd be more than happy to swing by and offer what little i know(3 years worth, starting year 4 shortly) ",
            "score": 2,
            "author": "jebbers_ohoulihan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Comp Sci, sorry, but thanks for the offer!\n\nStill, feel free to contribute any advice you may have - there might be a future architecture student looking at this page as well!",
                    "score": 1,
                    "author": "hyper-horse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For groceries I would recommend Halstead Foods (34th and Halstead) they have good prices and if you can get there on a Friday there is usually a lot of stuff on sale.",
            "score": 2,
            "author": "shadowkiller",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cermac Foods (31st and halstead) is the great in price and quality produce and meats but it requires a car (or 20min walk both ways). Never been to Halstead foods...",
                    "score": 2,
                    "author": "idontalwaysupvote"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Welcome to IIT, I am a recent Aerospace grad now working in the Transmission Line Engineering. As far as note taking goes I used pencil/paper for the first year took zero notes because I was always zoned out. I started using a computer and open office. they have a version of latex to make equations in your notes I thought it worked really well sense I type faster than I can write. Just be sure to NEVER open Reddit in class or it all goes to hell. \nAs far as enjoying life on campus go out. Especially during the first week. I met about 80% of the people I hung out with in school during the first day, including my fiance. This is the best time to meet people as they are out and about with nothing to do and want to meet people. After the first week join a club, something pertaining to your field is best, look into Greek life. It isn't for everyone but it is a great way to have fun, and it usually cheaper than living in the dorms. \nOther than that make sure you leave your room and have fun, IIT can feel like a terrible place sometimes but there is always something to do you just have to look a bit harder here than you would at other schools.",
            "score": 2,
            "author": "idontalwaysupvote"
        },
        {
            "level": 0,
            "comment": "For note taking I found that I took my notes in my psych classes on a computer and notes in my CS classes in a notebook, probably because I got so used to drawing memory diagrams but for some reason that worked for me. \n\nFor convenient groceries go to Roosevelt and hit up jewel or target, for better groceries go to Cermack Foods on 31st and Halsted, the prices are cheaper and the produce is better. That said learn to cook, sure its easy to go to the commons and its a bit of a bitch to cook when you're in the dorms but you will love yourself for it later in life. \n\nGet to know Matt Bauer, you said you're a CS major so this should happen anyway. He is essentially the greatest pair of red tape scissors on campus and an amazing resource. He is one of the reasons I got into the PhD program I did. The rest of the CS faculty is either really good or really hard to understand but I would say more the former than the latter.\n\nFor clubs, if you into music I would say check out WIIT, the station runs a very free form format and is not hard to get into at all. If you're into ted.com there is a group of students that organizes TEDxIIT. I will also parrot what other people have said in checking out the Greek system, full disclosure I am Greek. I joined on a whim my freshmen year and it was one of the best decisions of my life.\n\nI will also agree with people that say get of campus every once and a while but don't just go to the north side all the time. Get to know Bridgeport, its definitely not a night life district but its one of the most interesting little known neighborhoods in the city, and its great to live in when you get around to moving out of the dorms.",
            "score": 2,
            "author": "naxareth"
        },
        {
            "level": 0,
            "comment": "Let us know how the first few weeks are for ya!",
            "score": 2,
            "author": "cwegs88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ha! I'll be sure to update!",
                    "score": 1,
                    "author": "hyper-horse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "get off campus... ",
            "score": 1,
            "author": "thingacct"
        },
        {
            "level": 0,
            "comment": "Heh. hehe. hehehe. **heheheahahahahahHAHAHAHHAHAHAHAHAHHAHAHAHAHAHAH**",
            "score": -6,
            "author": "skifrk29"
        }
    ]
}