{
    "id": "u2qby7",
    "score": 5,
    "title": "Info about IIT as an undergrad",
    "author": "Thedudecubed",
    "date": 1649856507.0,
    "url": "https://www.reddit.com/r/IIT/comments/u2qby7",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a current high school senior and I was accepted into the architectural engineering program here. IIT is going to be in the top colleges for decisions so I really wan to know what it’s like there. \n\nWhat are some of the biggest positives and negatives IIT has?\n\nWhat is student life like at IIT?\n\nHow tough are classes and how easy is it to make friends?\n\nAny information is appreciated and welcome.",
    "comments": [
        {
            "level": 0,
            "comment": "positives:\n- small\n\nnegatives: \n- small\n\nstudent life: yes\n\nclasses: honestly depends on who you ask\nmaking friends: pretty easy, try joining a club and/or befriending your roommate and neighbors",
            "score": 5,
            "author": "ImplosiveTech"
        },
        {
            "level": 0,
            "comment": "Making friends here is fairly easy if you’re willing to be outgoing for a moment, but quite difficult if you’re asocial or very shy. It’s quite the introverted campus.    \nStudent life isn’t entirely dead, but if a thriving student life is a must-have for you then IIT probably isn’t the best option.",
            "score": 4,
            "author": "Wingedwing"
        },
        {
            "level": 0,
            "comment": "Food is mediocre at best. If you are used to eating good food, be warned",
            "score": 3,
            "author": "Critical_Exchange347"
        },
        {
            "level": 0,
            "comment": "Architecture is like the only program worth going there for. It's going to suck at times and architecture will try to break you, but if architecture is what you want to do it's a good school",
            "score": 3,
            "author": "Zefphyrz"
        },
        {
            "level": 0,
            "comment": "My wife did the architectural engineering program here and I did aerospace engineering. The school is good if they provide you with scholarship money. I don't recommend going at sticker price. \n\n\nEngineering is a tough track but CAE is one of the easier departments. There's social life if you can find it. At least when I was there there's a good number of things to do on weekends around campus and in the city. Make friends at other city schools like UIC or DePaul  to expand your options if that's what you're looking for.. Overall I thought they prep you well for the profession and give you opportunities for internships and research. A good amount of my classmates were able to secure good paying work out of school. \n\nDownside is it's a relatively unknown school nationally so it doesn't carry any prestige if you plan to work out of town or outside engineering.",
            "score": 2,
            "author": "lostmessage256"
        }
    ]
}