{
    "id": "13mijny",
    "score": 1,
    "title": "Can a major requirement also fulfill an upper division general ed requirement?",
    "author": "[deleted]",
    "date": 1684559081.0,
    "url": "https://www.reddit.com/r/csun/comments/13mijny",
    "media_urls": [],
    "other_urls": [],
    "postText": "My advisor told me I could, but she didn’t seem that trustworthy, so i’m just gonna take what she said with a grain of salt. It would be cool if I could kill two birds with one stone.",
    "comments": [
        {
            "level": 0,
            "comment": "Well,  if it is on the list.  For me, COMP 310 is required in my major and in an upper division GE.  It counts as both for me.",
            "score": 5,
            "author": "wjrasmussen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! This is exactly the answer I was looking for! This may be a dumb question, but if I take all my requirements (upper division and major), and still need some units to graduate, I can just take random classes, right?",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i was able to knock out COMS 323 as one of my lower and upper division classes since it was an option for 2 different sections that were required for me to complete according to my DPR. 2 birds one stone situation. So check your DPR and the prerequisites needed for the classes and you should be good",
            "score": 1,
            "author": "Logical_School_3815",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for your response! I’m coming in as a COMS major! Do you have any advice for the classes?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d taken 323 in person with Joseph Ayala, it was a very enjoyable and easy class, I got a 99. I took 356 with Hengimeh Rabizadeh online and it was a bit more challenging but still very doable, i got an 84.  \n\nI’m a business management major for context. Those were the only 2 coms classes required for me, but they were both definitelyyyyy much much much easier classes compared to the rest i’ve taken so far during my stay at CSUN. Wish all of them were like that",
                            "score": 1,
                            "author": "Logical_School_3815"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was able to take GWS 370 for my upper division Social Sciences and it covered one of my major core courses! For criminology &amp; Justice studies",
            "score": 1,
            "author": "ButterscotchSalty166"
        },
        {
            "level": 0,
            "comment": "It would but I personally don’t recommend it if you’re only looking for either credit in the major or just GE credit in general.\n\nI’m a journalism major and if I took JOUR 365, 371 or 372 then they fulfill major requirements (all three are elective course choices) and GE requirements. In all honesty, my best advice for upper division GE is to stick to classes that are outside of your major department. But if you want to take the classes you can but make sure that it’s for credit in the major only and not for GE credit.",
            "score": 1,
            "author": "anonymouswriter2021",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not sure if you explained it in your response, but can you explain why you wouldn’t recommend it? (i’m dyslexic, so comprehension is a bit of a struggle for me)",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem! The reason why I don't recommend doing this is that if a certain class that you're taking is not only a major requirement (either upper division or just an elective class) but is also fulfilling a general education requirement, then there's a chance that the said class could only fulfill the general education credit, like fulfilling the upper division general education D - Social Sciences and/or F - Comparative Cultural Studies and not for the major requirement credit like the upper division core work or an elective requirement, which makes things a bit difficult for some students as they may be looking for coursework that fulfills both general education credit and major requirements credit.\n\nI hope that explains things a bit better.",
                            "score": 1,
                            "author": "anonymouswriter2021",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see. Did this happen to you, where a course was listed as both a major requirement and a udge in your dpr, but ended up only fulfilling the udge requirement?",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It has in fact happened, yes. My advisor even told me to try and avoid taking the classes.",
                                            "score": 1,
                                            "author": "anonymouswriter2021"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}