{
    "id": "13tk1jw",
    "score": 4,
    "title": "Would you recommend PERS101 with Homa Esfarjani for someone who doesn't know know any farsi or arabic?",
    "author": "Battery_Eater_",
    "date": 1685226419.0,
    "url": "https://www.reddit.com/r/csun/comments/13tk1jw",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Overall, it's actually an OK class from what I've heard. Supposedly, she is very old school with teaching (I heard her worksheets come from the 90s), but she is very willing to help especially if you don't speak farsi and aren't Iranian. Just be prepared to do worksheets that you will most likely print out and be prepared to have your writing judged a bit since she expects things in a certain way. \n\nThe class is mostly native speakers anyway who just can't really read/write farsi, only speak it. Classmates would be a good resource for \"lesser\" issues that seem too novice to bring up with the prof outside of her class/office hours.\n\nA friend who didn't know farsi and wasn't Iranian took the class and they got a B with few issues stemming from the teaching of the material. The teaching wasn't that bad, they themselves just struggled a bit grasping the language, this is learning a new language after all. As long as you ride it out, prof esfarjani isnt as bad as others may have you believe. Come in, learn, and ask questions.",
            "score": 2,
            "author": "JM1066"
        },
        {
            "level": 0,
            "comment": "i had her class tbh it’ll be kinda difficult if you have no understanding of the language however if you’re classmates are nice and willing to help you out , you’ll be fine . she can be kinda rude sometimes tho",
            "score": 1,
            "author": "runner_chick190"
        },
        {
            "level": 0,
            "comment": "I took that class when it was online only during covid. If it's in person, I would recommend it. But if it is online, I would not recommend it.\n\n 90% of the students in the class were native speakers, but I had no experience with the language. Professor Esfarjani is very nice but can be hard to understand. Taking it online sucked but I'm sure that if it had been in person I would have enjoyed it.\n\nMake sure you really want to do it though, Farsi is a very difficult language. The homework will take a lot of time to do, every week. I have also taken Russian(also starting from nothing) and Farsi was significantly harder for me.",
            "score": 1,
            "author": "SquirrellySquirrelYT"
        }
    ]
}