{
    "id": "13vy1xt",
    "score": 5,
    "title": "How is the Mechanical Engineering Undergrad Program?",
    "author": "matdabean",
    "date": 1685471439.0,
    "url": "https://www.reddit.com/r/csun/comments/13vy1xt",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm planning to transfer to CSUN from a community college, are there any mechanical engineering majors that can tell me anything about the program? What should I expect out of the program? Any advice would be useful, thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "You're gonna need materials, mse 227. Take it with aline avanessian - she's fantastic. Avoid Lisa Reiner at all costs, she is a goddamn idiot",
            "score": 2,
            "author": "Dr_CSS",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seconded. Miss Avanessian is the best. She also teaches a Manufacturing class. If she shows up as an option, always choose her. \n\nYour other option will be Dr B. Bavarian. He's okay. If you show him you're serious about passing you'll pass and do the work you'll pass. His teaching methods are okay but sometimes hard to pick up on.",
                    "score": 2,
                    "author": "heartshapedcrater"
                },
                {
                    "level": 1,
                    "comment": "Thanks for the heads up,I'm taking the  MSE227 at my community college this summer.  Any other professors I should avoid at all costs?",
                    "score": 1,
                    "author": "matdabean",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did EE so I can only speak for overlap classes:\n\nTake Jack Ou for ece 240 and soraya roosta 240L\n\nAvoid somnath and Franco. Berhe is a mess but will give u an A if you try and submit all reports. \n\nYou'll need a Matlab class, me309: I took tarn, he's a conservative with Andrew Jackson+Jesus posters all over but he's very fair. In our class he knew everybody cheated but didn't discipline and gave us all a fair shot at the final, so I did the in-class coding exercises live with him and had him troubleshoot my code, then I simply studied that for the easiest ME final of all time",
                            "score": 1,
                            "author": "Dr_CSS"
                        }
                    ]
                }
            ]
        }
    ]
}