{
    "id": "13yz9z7",
    "score": 3,
    "title": "Financial aid summer",
    "author": "CautiousBread2038",
    "date": 1685762823.0,
    "url": "https://www.reddit.com/r/csun/comments/13yz9z7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone got their fafsa for summer classes? I heard some people have and I haven’t! Should I be concerned? bc I am hahahaha",
    "comments": [
        {
            "level": 0,
            "comment": "I haven’t heard anything either . Already tried contacting financial aid through email but they take forever to respond",
            "score": 4,
            "author": "chriscruzzz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just emailed them last night, I’m going to try calling on Monday too",
                    "score": 1,
                    "author": "CautiousBread2038"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me either :( I haven’t even got an email for my aid eligibility",
                    "score": 0,
                    "author": "CautiousBread2038"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got my aid, but I have not gotten my SPRINT classes eligibility yet though. They said late June or July if I remember.",
            "score": 1,
            "author": "Billybeb"
        },
        {
            "level": 0,
            "comment": "I received my aid also! For 2 classes almost everything covered except $400. (Compared to the over 3k not bad)",
            "score": 1,
            "author": "elie_97_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did they send an aid eligibility to your csun email? And you automatically received it because you applied for aid last semester and enrolled in two summer classes right?",
                    "score": 1,
                    "author": "CautiousBread2038",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes so i didn’t have to apply for anything extra they just used my 2023 FAFSA to calculate aid, I received the email titled “FINANCIAL AID: YOUR FALL 2022 &amp; SPRING 2023 AWARD HAS BEEN REVISED”. And after login I noticed I had received summer aid..If you received the temporary enrollment protection email you should be fine until you receive the money!",
                            "score": 2,
                            "author": "elie_97_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agh, thank you so much for your help! I feel so much better!!!!",
                                    "score": 2,
                                    "author": "CautiousBread2038"
                                },
                                {
                                    "level": 3,
                                    "comment": "Do you know what kind of aid it is? Is this taken out of the Pell Grant total allowance or is it a different grant?",
                                    "score": 2,
                                    "author": "CottonCandyLollipops",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hey I’m a graduate student so I’m ineligible for the pell grant.. so I received the state university grant! I checked my undergrad aid (since I took summer then also) and yes it was taken out of my Pell!",
                                            "score": 2,
                                            "author": "elie_97_"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}