{
    "id": "14877wf",
    "score": 8,
    "title": "How long does it take for them to decide your building after the roommate selection is over?",
    "author": "DemonSlayerArian",
    "date": 1686633400.0,
    "url": "https://www.reddit.com/r/csun/comments/14877wf",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I asked them about this and they said to expect it by the end of June",
            "score": 6,
            "author": "salamiandcheeseoof"
        },
        {
            "level": 0,
            "comment": "Probably a day or two. Best to call though. Notice that they been a bit slow lately with making updates,",
            "score": 4,
            "author": "Electronic-Machine74"
        },
        {
            "level": 0,
            "comment": "Wait you get randomly assigned your building?",
            "score": 2,
            "author": "limbojade",
            "replies": [
                {
                    "level": 1,
                    "comment": "I already got a building assigned for the LLC, however I’m waiting on the room. I guess it depends on the student and living community maybe",
                    "score": 5,
                    "author": "Electronic-Machine74",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ohhhhh ok. I’m not in an LLC so maybe I get to choose the building. Do you know if they assign random roommates if you’re missing one person out of four? One of ours dropped out last minute and we only have 3 people now",
                            "score": 3,
                            "author": "limbojade",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think they just randomize in case there’s missing roommates. I only saw one person who accepted my request. I’m still waiting on the room selection. I think they add people to the room if there’s spaces if they weren’t able to choose one.",
                                    "score": 1,
                                    "author": "Electronic-Machine74"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you signed up for an LLC, do you automatically get the llc?",
                            "score": 1,
                            "author": "DemonSlayerArian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you signed the application on time to avoid being on the waiting list",
                                    "score": 1,
                                    "author": "Electronic-Machine74",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh ok. Thank you :D",
                                            "score": 2,
                                            "author": "DemonSlayerArian"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did not even know that the building was already available. I can't find it😩😭",
            "score": 2,
            "author": "thatwarden"
        }
    ]
}