{
    "id": "dwanj0",
    "score": 69,
    "title": "And you guys thought Limebikes were annoying.",
    "author": "XylchAllcross",
    "date": 1573743618.0,
    "url": "https://www.reddit.com/r/csun/comments/dwanj0",
    "media_urls": [
        "https://i.redd.it/2vhc66p82oy31.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "If you have the app I believe you should be able to report the scooter being parked in a bad place.  At least you could with Lime bikes.  I don't know about TukTuk only because the app refuses to open for me.  I've had an overall bad experience with these scooters.",
            "score": 11,
            "author": "TISparta217",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why the hell did csun choose the shittiest scooter company to partner with.",
                    "score": 14,
                    "author": "monkeyburrito411",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "CSUN likes using out tuition money on companies like these to save money and use it for something to their benefit",
                            "score": 16,
                            "author": "ineedaberich"
                        },
                        {
                            "level": 2,
                            "comment": "I've never even seen these outside of CSUN",
                            "score": 5,
                            "author": "sandwichrage"
                        },
                        {
                            "level": 2,
                            "comment": "The school has nothing to do with the scooter company’s. Their actually trying to stop them from comming on campus. The company’s park them on the border of the school and people ride them in. \n\nFor a time campus police was collecting them when on campus and corralling them at the police station. But that was too tedious because of the catch and release situation.",
                            "score": 2,
                            "author": "TapBrocolli"
                        },
                        {
                            "level": 2,
                            "comment": "Probably cuz lime was pissed off with how the bikes were treated so they took what they could get",
                            "score": 1,
                            "author": "Magoner"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Seriously, I tried using one of those. I opened the app, loaded my account with $5 balance, and then tried to activate a scooter that was apparently parked in a bad area. I tried to start the scooter, but it wouldn't run because the area it was parked it was not allowed by the app. Somehow it was there already.\n\nBasically it charged me $2.00 to tell me I can't move the scooter 🤣",
                    "score": 7,
                    "author": "Kuntrol",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "SAME DUDE.  They didn't refund me they just reimbursed me into my account.  Total BS",
                            "score": 5,
                            "author": "TISparta217"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But there are birds all around the campus perimeter.",
                    "score": 1,
                    "author": "keurix"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I miss the lime bikes",
            "score": 8,
            "author": "JessieJ577"
        },
        {
            "level": 0,
            "comment": "Tuition dollars right there.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "One time I saw a lime bike in the pool at housing",
            "score": 1,
            "author": "Doubletounginggod"
        }
    ]
}