{
    "id": "dzpz5d",
    "score": 69,
    "title": "Diane is finally retiring! Time to celebrate folks",
    "author": "ershak7",
    "date": 1574370413.0,
    "url": "https://www.reddit.com/r/csun/comments/dzpz5d",
    "media_urls": [
        "https://i.redd.it/b0ho3my0u3041.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Oh no :/ who’s going to answer the phone when we call the school now?",
            "score": 52,
            "author": "MildyIntercepting",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol",
                    "score": 1,
                    "author": "ershak7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can someone fill me in the loop",
            "score": 17,
            "author": "Green__Tangerine",
            "replies": [
                {
                    "level": 1,
                    "comment": "#NotMyPresident",
                    "score": 8,
                    "author": "PoetJustice"
                },
                {
                    "level": 1,
                    "comment": "I forgot that most everyone on this sub is a freshman who migrated this fall.",
                    "score": -2,
                    "author": "tryintofly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm a senior and still don't understand why people don't like her.",
                            "score": 18,
                            "author": "Mdxxx"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm running for president now. I'll give out free donuts each morning. However I will increase tuition cost by 5% for each student",
            "score": 29,
            "author": "Krispy370",
            "replies": [
                {
                    "level": 1,
                    "comment": "So basically Diane Harrison with donuts? Deal",
                    "score": 17,
                    "author": "PoetJustice"
                },
                {
                    "level": 1,
                    "comment": "Seems like an even trade",
                    "score": 5,
                    "author": "zoomh3x"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://sundial.csun.edu/53018/news/renovations-to-president-harrisons-office-and-home-cost-over-350000/\n\nhttps://sundial.csun.edu/49718/news/csun-census-reveals-over-enrollment-campus-to-face-at-least-2-million-penalty/\n&gt;In Fall 2011, CSUN exceeded its target enrollment by 6.3 percent, which led to the CSU threat of a $7 million penalty. CSUs were allowed a penalty pardon if over-enrolled by 3 percent, but according to CSUN’s Spring 2012 census, released Feb. 17, CSUN, is currently over this target by 1.4 percent.\n\nhttps://sundial.csun.edu/44300/opinions/csun%e2%80%99s-4-year-graduation-rate-too-low/\n&gt;CSUN’s four-year graduation rate is roughly 14 percent. The average six-year graduation rate is between 41 and 48 percent and the average 8-year graduation rate is 49 percent.\n\nThose are some snippets from while I was there. I hope things are better now, and if not, maybe somebody new can improve them.",
            "score": 14,
            "author": "Coldbeam"
        },
        {
            "level": 0,
            "comment": "I remember someone at graduation flipped her off instead of shaking her hand",
            "score": 14,
            "author": "jballn11",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember that too:\n\nhttps://youtu.be/wyEp3BC8z6E?t=5952\n\nThat was rude and unnecessary.",
                    "score": 23,
                    "author": "strawberryflvr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yikes",
                            "score": 6,
                            "author": "Clint_Beastw0od",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn, I feel bad for her now. Hope the girl who gives her middle-finger gets the karma for what she did!",
                                    "score": 1,
                                    "author": "IllegalAlcoholic"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It was unnecessary for Diane though to ruin the next person's handshake/moment by reacting to it during that. Then she keeps staring after the person who flipped her off to make her displeasure known.",
                            "score": 1,
                            "author": "tryintofly",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's obvious that you're going to find fault in everything that she does, and you're entitled to your feelings, but this just goes to show that any leadership position is complicated and it's impossible to please everyone. I think she had the best interest of the students, faculty, and school at heart given the hands she was dealt. And I think she kept her poise considerably well given the abruptness of that sucker punch equivalent of a gesture.",
                                    "score": 6,
                                    "author": "strawberryflvr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't know why you're ascribing all that to me; I don't care about Diane, I graduated. The point is that, however abrupt it may have been to her, she still ruined the next person's moment instead of brushing it off for their sake.",
                                            "score": -1,
                                            "author": "tryintofly",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't you think you're holding her to an unreasonable standard? She's a person and got flipped off on a day of celebration. I think she can take a minute.",
                                                    "score": 1,
                                                    "author": "Yatty33",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "But that next person is stuck with that forever at their moment of graduation; I think Diane had a responsibility to not make it about herself and plow through, yes. It's like a priest fucking up the wedding due to needing \"a minute.\" She has to be held to a higher standard because it's not her moment, it's theirs.",
                                                            "score": -4,
                                                            "author": "tryintofly",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This is a non-issue to any reasonable person.",
                                                                    "score": 2,
                                                                    "author": "Yatty33",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Sorry to be contrary, but then it should be a non-issue to Diane. She can toughen up and not worry about a minor slight at an event that's not about her. If the next person had no problem with it I'd retract my comments, but no I don't give two shits how it made Diane feel unless it was her own graduation.",
                                                                            "score": -5,
                                                                            "author": "tryintofly"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't get people are hating on her. Alumni giving is indeed higher than ever during her tenure by on average 10 million a year during her tenure.\n\nhttps://csunshinetoday.csun.edu/university-news/csun-alumni-and-friends-set-new-giving-record/\n\nPlus, research funding is also higher, it is around 35 million on average. CSUN recently also got 3 million from NASA.\n\nhttps://www.google.com/amp/s/www.nbclosangeles.com/news/local/CSUN-Receives-3-Million-from-NASA-to-Study-Artificial-Intelligence-563643431.html%3famp=y\n\nAlso, graduation rates have been rising at CSUN, especially the 6 year rate. The 6 year rate is now around 55% compared to 45% a few years ago, the 4 year rate is pretty stuck around 14 percent. But people have been taking a higher course load in recent years so that will likely move up faster soon.\n\nhttps://www.csun.edu/counts/graduation-rates.php\n\nSo what did she do so wrong?",
            "score": 9,
            "author": "SuperTowel076",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know what she did wrong. My interactions with her when she first started were top notch. She invited some school veterans to a meet and greet and actually knew about the team I was leading at the time. She seemed to give a shit, but it's been a while since then.",
                    "score": 6,
                    "author": "Yatty33"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Celebrate for what exactly? I don’t think she was a terrible person.",
            "score": 22,
            "author": "young-pappyjr",
            "replies": [
                {
                    "level": 1,
                    "comment": "She made us take the damn Title 9 training each semester, but did nothing when actual sexual assaults happened besides abdicating all responsibility.",
                    "score": 11,
                    "author": "tryintofly"
                },
                {
                    "level": 1,
                    "comment": "She screwed over alot of professors and students",
                    "score": 24,
                    "author": "WinkleBear000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How so, care to explain? I genuinely don’t know about this.",
                            "score": 17,
                            "author": "Lopig5"
                        },
                        {
                            "level": 2,
                            "comment": "Wasn’t she involved misreporting CSU funds? Although that might have been the chancellor. I do remember CSUN being named.",
                            "score": 20,
                            "author": "jeeenx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I actually heard about that too, charging more and more a year for tuition and parking when a very small portion of it is actually to help the school, something within those lines? Correct me if I'm wrong. I can't find the article",
                                    "score": 14,
                                    "author": "ineedaberich"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No she didn't.",
                            "score": -11,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are you talking about when she abolished the requirement of comparative culture GEs for future freshmen?",
                                            "score": 2,
                                            "author": "young-pappyjr",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lol, she didn't have a choice. Besides, who gives a shit about those ge classes?",
                                                    "score": 10,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Honestly. I’m just here to learn about my major. I couldn’t care less about “safe spaces” and learning every gender pro noun. \n\nThe fact that I have to spend money to take these courses which are completely irrelevant to my future career is just outlandish.",
                                                            "score": 17,
                                                            "author": "young-pappyjr",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don't care much about genders and their pronouns. I like to think of it like this:\n\nEx: If I see you in public and I assume based on you appearance that you are a male, I will respond with maybe a \"Hey man.\" It is not like I am psychic to understand that you consider yourself a goddamn Frying Pan or some shit.",
                                                                    "score": 1,
                                                                    "author": "TheGuardianWhoStalks",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yes, and most trans or gender non-conforming people would agree with you there. If they correct you and ask you to use affirming pronouns then you should from there but for quick interactions 99.9% it's fine. I don't know what this has to do with a cluster of these courses as it really is just politeness and is only covered on surface or in depth on a tiny amount of courses anyways.",
                                                                            "score": 1,
                                                                            "author": "vertyped",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It really is",
                                                                                    "score": 1,
                                                                                    "author": "TheGuardianWhoStalks"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Same! Such a waste of money. It’s forced indoctrination.",
                                                                    "score": 0,
                                                                    "author": "daviipup"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah i was thinking that too; That pissed off a lott of people lol",
                                                    "score": 0,
                                                    "author": "Procrasturbator5"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You never had to interview her for a news story when all the student protests were going down",
                    "score": 9,
                    "author": "NearbyCourage"
                },
                {
                    "level": 1,
                    "comment": "She’s terrible",
                    "score": 5,
                    "author": "PoetJustice"
                },
                {
                    "level": 1,
                    "comment": "I don't know her personality, and she is not a terrible person. But CSUN is dysfunctional.  Many can't add classes because there are not enough classes to add so they can't graduate on-time. Some of the professors are useless and they can't even speak proper English but they're still there despite all the reviews because I think the president couldn't manage well. How many classes have you taken that you felt you literally learned nothing despite thousands spent?",
                    "score": 0,
                    "author": "ershak7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The classes are an issue because state funding has been too low since the financial crisis. If anything, the CSU bears responsibility for that since they are responsible for budget negotiation.\n\nI have not had the issue with any professors not speaking proper English. Almost all professor I have had, had doctorates from the UCs, Stanford, or other elite U.S. universities. Some have an accent, but they are always understandable. I took one accounting class with someone who ratemyprofessor says had a horrible accent and was super hard. She was totally fine (I am not a native speaker so I would have noticed if it wasn't) but half failed the class simply because they were too lazy to do the work or could simply not deal with the level at university. Apparently they take it out by writing bad reviews.\n\nSo I feel you are really over exaggerating here.",
                            "score": 10,
                            "author": "SuperTowel076",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So you're saying that you're smart and we are lazy?\n\nI'll name them here:\n\nDat Dao Nguyen\n\nRichard Ye\n\nYue Zhang\n\nShantaram Vasikarla\n\nThese are all that I know! God knows how many more are there. And Shantaram Vasikarla was an easy A, so the grade is not an issue here. Doctorates from elite universities mean nothing. Some people are not made to be teachers. No matter how smart they are. So I feel you are lucky that you haven't experienced shitty professors yet.",
                                    "score": 2,
                                    "author": "ershak7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Dat Dao Nguyen\n\nLmao glad someone said it, I have him too and it's hilariously bad at how no one in our classroom can understand his accent.  Not to mention, he does not speak with confidence or outwardly.  He mumbles quite a bit.  It was so bad, during class I had to facetime my girlfriend and point the phone towards him, cuz she couldn't believe it either.",
                                            "score": 3,
                                            "author": "CharlesDingus27"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That is clearly not what I was saying, I'm just saying my experience was like that.",
                                            "score": 1,
                                            "author": "SuperTowel076"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}