{
    "id": "gvj9cd",
    "score": 4,
    "title": "Borrower’s defense claim",
    "author": "Steviep1992",
    "date": 1591143250.0,
    "url": "https://www.reddit.com/r/devry/comments/gvj9cd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello all! I am curious on if anyone else filled a Borrower’s defense claim against DeVry? Long story short I filed mine back in 2017 and have yet to receive a response. I check online a couple times a week and look up if there is any news regarding DeVry or Borrower’s defense claims in general. \n\nAnd after graduating years ago I was only able to find a QA job with an insurance company in New Jersey. Not to blame 100% of my failed interviews on DeVry. But having that name on my resume isn’t exactly doing me any justice. \nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I'm in the same boat. Graduating from DeVry felt like a booby prize. The worst part is that since DeVry is not WASC accredited, the credits don't transfer to any other schools, so if I wanted to get a bachelor's degree, it would only be from DeVry. $40k more and another useless piece of paper? No thanks. Graduating from DeVry is the dumbest thing I ever did.",
            "score": 2,
            "author": "z7zark7z",
            "replies": [
                {
                    "level": 1,
                    "comment": "I too am in the same boat. My borrowers defense application sat in limbo for 4 years before being denied at the end of July 2020. I'm currently in the middle of refilling.",
                    "score": 2,
                    "author": "Mkutz_14"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And since filing borrower's defense, I haven't heard a peep.",
            "score": 2,
            "author": "z7zark7z"
        },
        {
            "level": 0,
            "comment": "I'm in the same boat as you. I was identified in the FTC lawsuit and filed a borrowers defense claim in March 2017. My claim is still pending",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same as everyone... I've seen on here denied devry ones but they  weren't in the ftc settlement....",
                    "score": 2,
                    "author": "romaniq",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was in the FTC settlement, and I still got denied. I think they are just denying everyone to meet the Sweet vs Devos deadline",
                            "score": 3,
                            "author": "onyourmarc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What claim did you state if you don't mind? Summarize...",
                                    "score": 2,
                                    "author": "romaniq",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Borrower defense",
                                            "score": 2,
                                            "author": "onyourmarc",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As in what Devry did wrong and you being harmed?",
                                                    "score": 1,
                                                    "author": "romaniq"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " Anyone have catalogs from 2006? That is when I started there and left. I  never used those courses for anything. I had to start my degree from  scratch. I have requested my transcripts from them so i will submit  that. Anything else you guys recommend to submit or that will help my  case to get these loans dismissed? I keep getting phone calls from an  automated system saying that my loans may qualify for a loan dismissal,  is this legit? Can anyone confirm? Thank you all! \n\n&amp;#x200B;\n\nP.S Do you guys still have to make payments to your loans while this is being reviewed?",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}