{
    "id": "1073hm5",
    "score": 3,
    "title": "Anyone got offer letter or acceptance for game design in Conestoga?, if so how long will it takes to get that?",
    "author": "Olonikon",
    "date": 1673235329.0,
    "url": "https://www.reddit.com/r/Conestoga/comments/1073hm5",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Yes, I got it last year. The process of getting an offer for game design program is a bit different. After you apply for the program, you will get a mail from the program coordinator for portfolio review interview. Once, you are done with the interview then you ll get an offer letter. This whole process took me around 1.5 months.",
            "score": 1,
            "author": "kunj89",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh thanks for the information bro, I've applied for this course on Nov 25, and till date I haven't got any mail from Conestoga, except for a mail where I need to correct my address in the application.",
                    "score": 1,
                    "author": "Olonikon"
                },
                {
                    "level": 1,
                    "comment": "Hey, I've just received the link for portfolio presentation. Could you give me some pointers?",
                    "score": 1,
                    "author": "Distinct_Ad636",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey , all you need to do in portfolio review is to explain your portfolio, just go through your portfolio and explain your thought process while you making the portfolio.",
                            "score": 1,
                            "author": "Olonikon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey, I've got Letter of Acceptance and I've accepted it. I need to pay the fees and apply for visa.",
                                    "score": 1,
                                    "author": "Distinct_Ad636",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did you get the Loa? If yes, did you find accomodation?",
                                            "score": 1,
                                            "author": "Distinct_Ad636"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}