{
    "id": "dcx3zm",
    "score": 9,
    "title": "Does the SET program have a good reputation?",
    "author": "sadqat",
    "date": 1570136345.0,
    "url": "https://www.reddit.com/r/Conestoga/comments/dcx3zm",
    "media_urls": [],
    "other_urls": [],
    "postText": "*(Software Engineering Technology)*  \nI've heard many great things about the SET program at Conestoga, but with uWaterloo just down the road, it seems like SET graduates would be in the shadow of those graduating from UW in terms employability and skillset. Is this true? \n\nDo local employers prefer uni grads when it comes to coop placement and employment? Are SET graduates recognized as and capable of becoming competent developers able to work on the same interesting and challenging projects that any other aspiring developer would? What are the major pros and cons of each of these two pathways?\n\nI know a lot of this depends on the individual, but individual differences aside, many job postings state that a degree is required; is the SET graduate able to break into the industry despite this supposed obstacle?\n\nThanks so much for any insight!!  \nMind my skeptical tone, just trying to clear up any potential misconceptions.",
    "comments": [
        {
            "level": 0,
            "comment": "My company hires mostly Conestoga co-ops, a couple SET specific as well.\nI'm also a SET grad, no one I graduated with has ever really had any issues getting interviews and at that point it's really how well you interview personally.\nAs for the \"degree requirement\", my first two positions out of SET technically required a degree. What the faculty in SET, and the alumni, say is that job requirements are just a wishlist. If you're the most competent applicant with a college diploma, you'll still sometimes get chosen over uni grads. I say sometimes, because there are some companies (eg. Google) who legitimately won't even look at co-ops/grads who have no degree. That said, most of the companies in KW recognize the talent in SET.",
            "score": 4,
            "author": "DoomCircus",
            "replies": [
                {
                    "level": 1,
                    "comment": "I disagree about top companies dismissing college diplomas. I've gotten interviews at Facebook and Apple as SET grad. Got rejected  lol.. but made it to on sites. But apart from that, I do agree with everything you said. The world is your oyster. Don't let some b.s. reviews that non-degree students no being able to find jobs hold you back.",
                    "score": 3,
                    "author": "dddthroway292929292",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To follow up on the above, we do have grads employed at Google and Apple.  Not Facebook yet, though.  And our experience has shown that we are very well known and regarded in this area.\n\nSource: Hey, I'm the Year 1 Coordinator.",
                            "score": 3,
                            "author": "i_yac",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Off topic, but a quick question. What's the rationale for learning C/C++ as the first/main language of the program? Many schools have a different approach. Is the program heavily focused on underlying hardware and lower-level programming?",
                                    "score": 1,
                                    "author": "sadqat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, that’s exactly it.",
                                            "score": 1,
                                            "author": "i_yac",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What other languages are heavily taught/used in the program? Everywhere I read, Python, JS, and Java are the most popular languages of the day--are these touched upon? Or is the approach rather to develop the skills and knowledge necessary to pick up those or other languages fairly quickly if need be? Thanks again Carlo :)",
                                                    "score": 1,
                                                    "author": "sadqat",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "We start with C as an intro language and then do C++.  From there, you can learn any language.  Truly.  So, we don't actually teach Python but students use it anyway (because you can easily pick it up). We do use JS but, again, it's easily picked up.  We used to have an entire course in Java but we didn't really need it (because ... it's easy to pick up) so we got rid of that course.  It's still used for Android programming but there's no need to teach it.  So, yes, you can pick up anything after you're done Year 1.",
                                                            "score": 1,
                                                            "author": "i_yac"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Oh, and unrelated, but when would you say is the latest application date for the Sept 2020 intake? I know it's not a hard deadline, so just wanted to clarify.",
                                                    "score": 1,
                                                    "author": "sadqat",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It completely depends on how many people apply.  Some years, we would be full at the end of March.  Other years, mid-April.  If you wait until May, chances are that you'll be out of luck.",
                                                            "score": 1,
                                                            "author": "i_yac"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You're one of the few I don't bother to mention lol.",
                            "score": 1,
                            "author": "DoomCircus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I graduated from the 2 year SET program 15 years ago (at that time there was only a 2 year option). Choosing SET at Conestoga, was honestly one of the best decisions of my life. My education was half the time as a University degree. SET gave me a great foundation to build upon, and I was able to take that into each job after graduating, learning while also earning a paycheck.",
            "score": 3,
            "author": "edelachev"
        },
        {
            "level": 0,
            "comment": "I'm currently in SET and with the restructuring that just happened I think it's one of the best software programs in Ontario colleges.  Obviously we don't do as much theoreticals but we have a large code portfolio by the time we graduate.  All my friends go co ops with no more trouble than is normal and many were chosen over Uni kids. Many probably got denied because uni kids but what can you do. \n\nAnd its cheaper.   So much cheaper than UW.",
            "score": 1,
            "author": "JDOG0616",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey I'm from India and I'm also planning to start my studies at Conestoga but I'm but confused between 3y Computer Programming and Analysis course and 3y Software Engineering Technology course, which one will u suggest as u are a student of Conestoga. Also if i want to pursue for degree what are the pathway options after SET.",
                    "score": 2,
                    "author": "i-CARNAGE-i",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the simplest terms:  Software Engineering Technology teaches you to be the boss of someone who graduated from Computer Programming and Analysis.",
                            "score": 3,
                            "author": "JDOG0616",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bro now there is no benifit of this answer. I was planning for Sep 2022 intake and admissions for that intake is already closed for SET (international student). Now either i have to do CPA or postpone my plan to Jan 2023 which is very difficult.🥲",
                                    "score": 1,
                                    "author": "i-CARNAGE-i"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Could you tell me more about your coop experience? How was the process of applying? Does Conestoga have a good internal job listing to apply from? What kinds of positions are common? Thanks!",
                    "score": 1,
                    "author": "sadqat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was not in co op but many of my friends were/are \n\nConestoga has a list of jobs for co op given to everyone in co op, so you are going up against all of your peers.   All of these jobs have been vetted by Conestoga and are designed for students with little to no actual development experience.  I would recommend talking to a Prof if you want more information.",
                            "score": 1,
                            "author": "JDOG0616"
                        }
                    ]
                }
            ]
        }
    ]
}