{
    "id": "weye5p",
    "score": 5,
    "title": "I work at the College Residence! AMA",
    "author": "Meloncholyhussy",
    "date": 1659505865.0,
    "url": "https://www.reddit.com/r/Conestoga/comments/weye5p",
    "media_urls": [],
    "other_urls": [],
    "postText": "Title says it all! I’m here to answer any questions you have about living in the Conestoga College Residence since we don’t have our own subreddit!\n\nAll questions welcome, even if you think your question is silly or stupid, I promise you theres someone else who has the same one and is too scared to ask!",
    "comments": [
        {
            "level": 0,
            "comment": "I am an upcoming international student. I am waiting for my study permit for Sept 2022 intake. I will be going to Doon Campus.  \n\n\nQ1) Does Campus matter? Like Doon is better than Waterloo or vice versa.  \nQ2) How to get an on-campus job?\n\nQ3) Are there too many South Asian students in Post grad? ( I am a Indian myself, but wanna connect and make friends with students of other nationality also )",
            "score": 3,
            "author": "mahin_m20",
            "replies": [
                {
                    "level": 1,
                    "comment": "1. personally i dont believe campus really matters, as Doon is the original and main campus it has much more to it than the other ones. it mostly depends on your course. any event that happens at the doon campus all Conestoga students are welcome to joining.\n\n2. most places require you to apply online in the area. meaning if you wanted to apply at a tim hortons on campus you will need to go to their website and apply for their conestoga college location.\n\n3. we get students from everywhere! Conestoga is an amazingly diverse College!",
                    "score": 4,
                    "author": "Meloncholyhussy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the reply !\nI am hoping to get an experience of life time.",
                            "score": 1,
                            "author": "mahin_m20"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; we get students from everywhere! Conestoga is an amazingly diverse College!\n\nDepends on the program, really, the engineering/web dev ones tend to be dominated by international students. I'd say about 70% of international students are South Asian.",
                            "score": 1,
                            "author": "retroguy02"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How staying at Residence is different from staying outside?\n Are students allowed to work until late hours?\nHow much does a student pay for the stay in single and double occupancy rooms?\nHow far is doon campus from the residence?\nThanks!",
            "score": 1,
            "author": "IndependenceDirect90",
            "replies": [
                {
                    "level": 1,
                    "comment": "staying in residence allows you to stay close to your studies, easily meet social groups in the same program as you, and feel safe in your home with front desk staff and security conveniently right across the road.\nthe front doors to the residence are open 24/7 meaning you can come and go whenever you please without worrying! \nas of right now every room in the residence supports 2 students, our 2-bedroom suites (bedrooms have separate rooms inside with a shared washroom and kitchen for the 2 students) is $8000 for the 8 months of academic year. the open concept (hotel set up with a half wall division) is $7200 for the 8 months.\nResidence is right across the road! we have a shuttle that will take you to doon and the fountain street campus but its only about a 5-10 minute walk depending on where on campus youre looking to get to.",
                    "score": 2,
                    "author": "Meloncholyhussy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm going to the Ingersoll campus in September for full time studies. The options are pretty bleak in terms of housing. What housing solutions are available to students in my similar situation?",
            "score": 1,
            "author": "Abztract",
            "replies": [
                {
                    "level": 1,
                    "comment": "we always suggest the website places4students.com its not completely affiliated with the school but it helps students find off campus student housing in many areas. you can also always try things like facebook marketplace or kijiji using key words like ‘student’ and ‘rent’ set for the area and might get lucky there :)",
                    "score": 1,
                    "author": "Meloncholyhussy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it hard to get an on campus job? I am in Cambridge. Are there enough in campus jobs there ? How's the competition for that ?",
            "score": 1,
            "author": "SarinKiShyra",
            "replies": [
                {
                    "level": 1,
                    "comment": "in my honest opinion, its in your best interest to not only look on campus but also at part time off campus, most campuses only have 1-3 places to work at where as off campus you have the whole city",
                    "score": 1,
                    "author": "Meloncholyhussy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am planning to do on campus job in addition to my part time job off campus.",
                            "score": 2,
                            "author": "SarinKiShyra",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same here. Do you got any other leads?",
                                    "score": 1,
                                    "author": "mahin_m20"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How does residence deal with people who like to drink and / or party? What rules exist and how are they enforced?",
            "score": 1,
            "author": "SopwithB2177",
            "replies": [
                {
                    "level": 1,
                    "comment": "we have quiet hours between 11PM and 6AM and 24/7 consideration hours. if anything happens the front desk staff and RA’s will give the students warnings, if the noise persists Security gets called and thats never fun. \n\nyou can ‘party’ as long as you are respectable with the noise, keeping alcohol in the rooms, no smoking in the rooms and obviously not getting too drunk",
                    "score": 1,
                    "author": "Meloncholyhussy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How does the cooking situation work? I know there is no meal plan so are people able to cook in their rooms?",
            "score": 1,
            "author": "Big-Cap9114",
            "replies": [
                {
                    "level": 1,
                    "comment": "each room comes with a microwave! students are also allowed to bring in any kinds of appliances as long as they have a safety shut off and no flame! \n\nwe also have a communal kitchen on the first floor that has a few stoves, anyone can use the kitchen whenever as long as students clean up after themselves :)",
                    "score": 1,
                    "author": "Meloncholyhussy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi, I'm an international student and I'll be arriving late December since my program starts in January.\n\nWill I be able to move into residence prior to orientation or at the start of orientation?",
            "score": 1,
            "author": "Representative-Net16"
        },
        {
            "level": 0,
            "comment": "Can you inform about residence of waterloo campus for postgraduate students?",
            "score": 1,
            "author": "No_Function94"
        }
    ]
}