{
    "id": "10xvmez",
    "score": 10593,
    "title": "An anyone explain to me✋",
    "author": "Hackshell1",
    "date": 1675951696.0,
    "url": "https://www.reddit.com/r/funnysigns/comments/10xvmez",
    "media_urls": [
        "https://i.redd.it/j2a9e4nuo7ha1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "From the days before mobile phones. Every pub would have a landline, pub I worked at knew never to confirm or deny if anyone was in until they'd asked who was calling and then asked that person if they were there",
            "score": 760,
            "author": "probablynotreallife",
            "replies": [
                {
                    "level": 1,
                    "comment": "I miss those days...",
                    "score": 197,
                    "author": "spa_angled",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. It seems that ironically we became less connected to other people when mobile phones and social media took over.",
                            "score": 184,
                            "author": "probablynotreallife",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When I started grad school, AT&amp;T and T-Mobile had zero service in the town, and Verizon was limited. There were only two bars in town, so everyone just went out without a particular plan and found people to hang out with.\n\nIn my third year, AT&amp;T built a tower, and Verizon got a repeater in a local church. As a result, people didn't show up until the people they already knew were there. It kind of started to suck if your friends were busy.",
                                    "score": 117,
                                    "author": "sat_ops",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's a really well-written anecdote and absolutely how things have gone but, boy, am I even more sad after reading it! I'm going to have a little cry now, maybe turn my phone off for a while. (I'll most definitely not turn my phone off for a while because I'm so fucking addicted to trying to feel less lonely)",
                                            "score": 58,
                                            "author": "probablynotreallife",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Turn the phone off, go to the bar and listen to Piano Man by Billy Joel.",
                                                    "score": 11,
                                                    "author": "Ewetootwo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’ll just sit at the bar and put bread in his jar.",
                                                            "score": 3,
                                                            "author": "tiagojpg",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’m less cyber lonely hearing that, friend 😎",
                                                                    "score": 4,
                                                                    "author": "Ewetootwo"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And say \"man, what are you doing here?\"",
                                                                    "score": 3,
                                                                    "author": "Snoo-99235",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "*I came looking for booty.*",
                                                                            "score": 2,
                                                                            "author": "Booty_Warrior_bot"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "🎵laaa, la la, la la laaaaa ….🎵",
                                                                            "score": 1,
                                                                            "author": "Ewetootwo"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Geez I feel that kinda ruins the experience",
                                            "score": 1,
                                            "author": "Able_Impression_4934"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The philosopher Hiedegger warned back in the mid 20th century that technology will just alienate us all rather than bring us together.",
                                    "score": 11,
                                    "author": "fusemybutt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well I’ll put that on my Plato and consider it. One shouldn’t aHume he was right though. Don’t get all Wiggensteined about this segue… I Kant thing of anymore on this damn IPHONE!",
                                            "score": 2,
                                            "author": "Ewetootwo"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yep, the check in on friends phone call is maybe the biggest loss of this era. A call is much more personal and meaningful than Facebook comments or likes and text messages. The problem is that we already see what our friends share on Facebook and this takes away the key opener for a phone call, \"what have you been up to?\"  By knowing too much, we know too little. \n\nI also miss making plans and meeting people at a certain time and place.  If you didn't make plans beforehand, you won't be going out and meeting those friends that night.",
                                    "score": 11,
                                    "author": "WorthPrudent3028",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's crazy, isn't?! I can't use Facebook as it flares up my mental illnesses, people know this but are still completely averse to talking about things and get visibly upset with me for not knowing about things they've posted about. It's really upsetting how antisocial social media has made people.",
                                            "score": 8,
                                            "author": "probablynotreallife"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "For the average joe, this is quite possibly the case but for those of us who live rural and/have disabilities, SM has opened a world of folks and knowledge. I can talk to someone across the world about sewing historical garments on an antique sewing machine or watch a video on how to use and maintain said sewing machine. It’s amazing! Before Reddit and to a limited degree of use Insta, I had great difficulty hunting down books on my hobbies or finding specific sites online, etc but no direct connections with anyone in those communities. \n\nSo, yes, less connected but for some, more connected than ever!",
                                    "score": 7,
                                    "author": "Ididitfordalolz"
                                },
                                {
                                    "level": 3,
                                    "comment": "He said unironically in response to a comment about literally people lying about where they are to hide from other people.",
                                    "score": 0,
                                    "author": "StormContent8203",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "While being \"anti-social by being on social media\" as he would likely put it.",
                                            "score": 2,
                                            "author": "GeneraIFlores"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If everyone is connected then nobody is connected",
                                    "score": 0,
                                    "author": "Halloran_da_GOAT",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No, thats not how that works. If I connect all of my wires to my speaker system/tv/pc/whatever that doesn't mean nothing is connected. It literally means all connections are connected. People are connected in different ways than you remember and prefer, doesn't invalidate those connections.",
                                            "score": 2,
                                            "author": "GeneraIFlores",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ffs it’s not that serious lmao go outside",
                                                    "score": 0,
                                                    "author": "Halloran_da_GOAT"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It still happens where people are regulars, but now it's \"Bob isn't answering his phone. I know he's there. I can see him through the window. Put him on.\"",
                            "score": 6,
                            "author": "WorthPrudent3028"
                        },
                        {
                            "level": 2,
                            "comment": "Me too.   \nNow days, I get S..t if I don't take my phone aka 'my electronic leash' with me when I leave the house.   \n'Battery almost down to zero, doesn't matter take it with you... you have a charger in the car USE IT.'",
                            "score": 3,
                            "author": "cherry2525",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can I borrow your car?",
                                    "score": 1,
                                    "author": "Ewetootwo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can you drive a 6 speed stick shift (manual transmission)",
                                            "score": 1,
                                            "author": "cherry2525",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You bet bro and and double clutch the big rigs too. Growing up if you couldn’t drive stick and peel rubber you’re dating the ugly girls. Park on the steepest hill, nurse that clutch with a little gas then peel baby once she engages 😎",
                                                    "score": 2,
                                                    "author": "Ewetootwo"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Mobile phones suck 99% of the time.\nExcept when I get stranded somewhere.",
                            "score": 3,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "I used to go to a bar in Bullhead Az that had a list like this. You actually had to put your fingers up to signal whoch answer,  and then pay the bartender for him to give the answer",
                            "score": 2,
                            "author": "That-Grape-5491"
                        },
                        {
                            "level": 2,
                            "comment": "Good ol' days 👨🏻‍🦳👨🏻‍🦳",
                            "score": 2,
                            "author": "Kakashi___Hatake___"
                        },
                        {
                            "level": 2,
                            "comment": "Just don’t take a phone with you. Now you’re living off the grid like my dad who’s out for smokes.",
                            "score": 1,
                            "author": "altcastle"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My brother-in-law was slammed at work, missed a few days at the bar and the bar owner left a message on his answering machine asking if he was okay.",
                    "score": 17,
                    "author": "AustinTreeLover",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What a bar tender 💙",
                            "score": 6,
                            "author": "Ewetootwo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Like Bart calling Moe and asking for funny names lmao",
                    "score": 16,
                    "author": "RodLawyerr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can still prank call my guy",
                            "score": 3,
                            "author": "GeneraIFlores",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nah bro it's illegal, you dont want to get swatted because of that.",
                                    "score": 0,
                                    "author": "RodLawyerr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What kind of Simpsons style prank calls are you doing that could end in being swatted!?!?",
                                            "score": 3,
                                            "author": "Hidden_Samsquanche",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[The beer shaking prank probably](https://youtu.be/25SPhNpWIhk)",
                                                    "score": 3,
                                                    "author": "RodLawyerr"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What prank call is gunna get you swatted? And  swatting someone, aka sending police to someone's home under false pretenses, is a serious crime",
                                            "score": 1,
                                            "author": "GeneraIFlores"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": " Is Amanda there?",
                            "score": 3,
                            "author": "Zooph",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Amanda who?",
                                    "score": 2,
                                    "author": "Garizondyly"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did you ever hand someone the TV remote and tell them it was their wife on the phone?",
                    "score": 8,
                    "author": "Jo_Doc2505"
                },
                {
                    "level": 1,
                    "comment": "That was the rule; Bar None.",
                    "score": 5,
                    "author": "Ewetootwo"
                },
                {
                    "level": 1,
                    "comment": "I remember when I was a kid, my dad and uncle used to frequent a local pub. The bartender had my aunt's phone number and would call her to come pick them up sometimes. Sometimes she would just drop them off at home herself if they stayed till closing.\n\nWorking at that bar was also the first real job I ever had.",
                    "score": 3,
                    "author": "mh985"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That scene from Cheers!\n\nPhone rings....\n\nCarla - \"Who isn't here?\"\n\nWhole bar shouts \"ME!\"",
            "score": 287,
            "author": "Supersonic-Zafonic",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wanna go where everyone  knows my name!",
                    "score": 17,
                    "author": "ZealousidealObject9"
                },
                {
                    "level": 1,
                    "comment": "Yeah, love Cheers.",
                    "score": 5,
                    "author": "RubendeBursa"
                },
                {
                    "level": 1,
                    "comment": "[Yarn](https://getyarn.io/yarn-clip/c9fed296-3a3a-4ac8-8041-e7b870ec602f)",
                    "score": 1,
                    "author": "PlNG"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mike Roch! Has anyone seen Mike Roch around here lately?",
            "score": 64,
            "author": "Duryeric",
            "replies": [
                {
                    "level": 1,
                    "comment": "I read the \"ch\" in the German pronunciation for some reason (which is just H), and I had to stare at this comment for 20 seconds until I got it",
                    "score": 25,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It took me too many attempts to get it with the english pronunciation",
                            "score": 7,
                            "author": "SpicySaladd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It probably would have read more naturally as \"Mike Rotch\"",
                                    "score": 5,
                                    "author": "Super_Honky"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I read it as “k” lmfao",
                            "score": 1,
                            "author": "TheMelonSystem"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or Mike Hunt, I hear they’re real close!",
                    "score": 7,
                    "author": "HailCthulhu-IGuess",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was at a restaurant where a waitress went table to table looking for Mike Hunt, I never laughed so hard 😂",
                            "score": 4,
                            "author": "Diane1967",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Omg! I couldn’t even imagine lmao I got a prank call as a kid on our landline and couldn’t figure out why my mom was legit hysterically laughing over me asking “mom who’s Mike Hunt? Do we know him or something??” Lmaoooo",
                                    "score": 2,
                                    "author": "HailCthulhu-IGuess"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I. P. Freely!",
                    "score": 5,
                    "author": "Vellatra",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hugh Jass",
                            "score": 2,
                            "author": "big_fetus_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I need to find Amanda Hugginkiss!",
                                    "score": 1,
                                    "author": "Vellatra"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Amanda hugankiss. Come on I’m looking for Amanda hugankiss!",
                    "score": 3,
                    "author": "Fantastic-Turnip-364"
                },
                {
                    "level": 1,
                    "comment": "Amanda Huginkiss",
                    "score": 2,
                    "author": "Duryeric"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why is \"not here\" less expensive than \"just missed him?\" That's a way better lie than like the next two above because those tell her that you were there. All I'm saying is the first one should be third",
            "score": 208,
            "author": "Marsrover112",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the reasoning behind that is ‘just missed him’ might better deter the partner from searching for him at the bar. Saying ‘ain’t here’ would be anyones excuse and the partner might suspect that. ‘Missed him’ Confirms their suspicions but throws them off the trail. \n\n…or maybe I’m just thinking too much into it.",
                    "score": 151,
                    "author": "No_Dot_7415",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's how I thought of it so I think you and I are on the same page",
                            "score": 19,
                            "author": "girlenteringtheworld",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But then why is never heard of him the most expensive. It seems similar to he's hot here",
                                    "score": 8,
                                    "author": "torgiant",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Imo it’s very different.\n\n“Not here” implies that the bartender knows this dude, he’s been here before, he just isn’t here now. But honestly it’s what people believe the least.\n\n“Never heard of him” means that the bartender doesn’t know this dude, which means he has never been to this bar before. So, if the wife goes out and searches for him, she will put this bar on the low priority list and unlikely to go there.",
                                            "score": 4,
                                            "author": "I-luv-cats"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "i think it’s $1 more to prove to the spouse that the bartender is a reliable witness.",
                            "score": 12,
                            "author": "raven_kindness"
                        },
                        {
                            "level": 2,
                            "comment": "I guess that makes some sense but she might also get all detective and start looking from the bar",
                            "score": 3,
                            "author": "Marsrover112"
                        },
                        {
                            "level": 2,
                            "comment": "That's how I thought of it so I think you and I are on the same page",
                            "score": 4,
                            "author": "girlenteringtheworld"
                        },
                        {
                            "level": 2,
                            "comment": "Which is exactly what a woman would think. This bar sounds amazing for thinking that deep.",
                            "score": 2,
                            "author": "MacMittenz7"
                        },
                        {
                            "level": 2,
                            "comment": "I think it means he just ran off with a miss,",
                            "score": 1,
                            "author": "Ewetootwo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's all for humor and I doubt it was analyzed as much as would be involved for actual pricing for services. So, the order wouldn't matter -- the time thinking about it would be better spent laughing or telling lies at the bar.",
                    "score": 1,
                    "author": "WonderBubba"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We used to have a pay phone at work. It was fine until a woman called for a man who wasn’t there at the time. Being helpful, our coworker said, “He’s out of the office right now, but I can let him know you called. Is this his girlfriend or his wife?”\n\nDude didn’t understand why she went ballistic.",
            "score": 27,
            "author": "redunculas",
            "replies": [
                {
                    "level": 1,
                    "comment": "This sounds like the perfect set up for a standalone joke.",
                    "score": 5,
                    "author": "lorenzomofo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Someday I’ll have enough karma to post my own jokes…\n\n&lt;sigh&gt;",
                            "score": 2,
                            "author": "redunculas"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I actually had that happen. I called the bar to see if my now ex husband was there and heard the bartender say, “do you want me to say you aren’t here?“ and heard him say yes. There was another time when he said he was working late at the hospital but they called me and said he needed to come in an emergency. And the final one was he named a doctor he said he visited occasionally and our child had an emergency so I called and asked if he was there. The woman said it was an apartment complex but his girlfriend lived there. I was young but not stupid. His bags were packed and on the porch when he came back.",
            "score": 17,
            "author": "Malibucat48"
        },
        {
            "level": 0,
            "comment": "Not from an alcoholic family I take it?  This is one you should be grateful you don’t know.",
            "score": 38,
            "author": "Icy-Butterscotch5540",
            "replies": [
                {
                    "level": 1,
                    "comment": "My thoughts. Lying about drinking is so adorable. /s",
                    "score": 22,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah having an alcoholic husband who will always lie about drinking if he has feasible deniability, these jokes just don’t hit for me lol.",
                            "score": 6,
                            "author": "BreadNegotiation"
                        },
                        {
                            "level": 2,
                            "comment": "Sigh",
                            "score": 0,
                            "author": "thejohnmc963"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ah, a far simpler time.",
            "score": 26,
            "author": "Bancroft80"
        },
        {
            "level": 0,
            "comment": "I was a bartender at golf club in NH 1970s so no cell phones.  The regulars and instructors were there at 6:00 AM doing shots, played rounds of golf then came back and drank and played high stakes poker more until closing but if I wanted a good tip I was expected to lie to their wives and girl friends when they called asking for their men.   I'd walk away with as much as $150 in tips on a Tuesday night in 1977.  Not a bad take.  At least the boys were just playing cards not messing with hoes.",
            "score": 23,
            "author": "SeaworthinessOne2114",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm curious was the lie that they weren't there still or something like they weren't drinking much and just having a respectable chat? If they've left but not made it home that surely puts them even more in the dog house",
                    "score": 3,
                    "author": "Eeedeen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I find it sad that someone didn't get this",
            "score": 61,
            "author": "Boring_Oil_3506",
            "replies": [
                {
                    "level": 1,
                    "comment": "IT just set up my new desk phone at work this week and I realized that it's the first time in 15 years I've had access to a land line.",
                    "score": 25,
                    "author": "sarahrott",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'll do you one better: that phone is absolutely not actually a landline. It's just a  VoIP phone that works over the internet. True POTS phones are pretty rare in anyplace that isn't way out in the sticks, and even then, odds are that the POTS line/s are providing internet with DSL so the phone is VoIP.",
                            "score": 5,
                            "author": "Z4KJ0N3S"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There was a bar in Chapel Hill, NC named \"He's Not Here\" so that was how they always answered the phone...",
            "score": 11,
            "author": "1_Marauder",
            "replies": [
                {
                    "level": 1,
                    "comment": "Brilliant! Then hang up :)",
                    "score": 5,
                    "author": "loneranger07"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've known my grandfather's first name as bert my entire life\n\nBut I found out when I was older that his name is not Bert and he start going by it so his drinking buddies would all say no when his family called the bar asking for him\n\nIt also explained why we called his son uncle junior when the uncle's name wasn't bert(they share a first name)",
            "score": 4,
            "author": "Flossthief"
        },
        {
            "level": 0,
            "comment": "Moe has increased the rates...",
            "score": 4,
            "author": "t3h_pupp3t"
        },
        {
            "level": 0,
            "comment": "The straights are not ok",
            "score": 3,
            "author": "Terra_throwaway"
        },
        {
            "level": 0,
            "comment": "These are all stupid cuz you still have to go home and explain yourself",
            "score": 9,
            "author": "TaylorBrentGW"
        },
        {
            "level": 0,
            "comment": "Reminds me of the guy who came to a phone repair shop and the repair man found a note inside with 200 dollars saying \"please don't fix my phone, my wife will kill me\".",
            "score": 7,
            "author": "Silverstreamdacat"
        },
        {
            "level": 0,
            "comment": "This references the time before cellphones. Every bar had a landline. A wife would call looking for her husband. Depending on what the husband paid, the bartender would answer with one of those lies so the patron wouldn't have to deal with her.",
            "score": 7,
            "author": "souleaterevans626"
        },
        {
            "level": 0,
            "comment": "r/arethestraightsok",
            "score": 14,
            "author": "Joey_The_Bean_14",
            "replies": [
                {
                    "level": 1,
                    "comment": "r/boomershumor wife bad",
                    "score": 5,
                    "author": "metalheadface"
                }
            ]
        },
        {
            "level": 0,
            "comment": " **An anyone explain to me**   \n\n\n\"wife bad\" boomer humor",
            "score": 6,
            "author": "Katapotomus"
        },
        {
            "level": 0,
            "comment": "I feel like 1 dollar would work better than 2 or 3 because the wife would still be upset if answered with 2 or 3 but idk",
            "score": 3,
            "author": "Jediguy7609"
        },
        {
            "level": 0,
            "comment": "My mum set up this system with a bar my grandad used to visit, my mum would call them when my grandmother went to go find him and they would tell my grandad he’d need to meet her half way, his “I was at the post office” always worked somehow",
            "score": 6,
            "author": "_Denzo"
        },
        {
            "level": 0,
            "comment": "If your wife calls the bar looking for you, $1 &amp; $5 need to be switched.",
            "score": 7,
            "author": "Guardian5985"
        },
        {
            "level": 0,
            "comment": "I remember the bar I hung out in added $15 not to tell your wife about your girlfriend",
            "score": 4,
            "author": "Chipchop666"
        },
        {
            "level": 0,
            "comment": "Boomer humor",
            "score": 5,
            "author": "500CatsTypingStuff"
        },
        {
            "level": 0,
            "comment": "The rugby club version would be ‘they havent got back from away game yet’ - even if they were playing at home",
            "score": 4,
            "author": "hilly1986"
        },
        {
            "level": 0,
            "comment": "r/BoomerHumor",
            "score": 4,
            "author": "youfailedthiscity"
        },
        {
            "level": 0,
            "comment": "Boy, this brings back memories. Not necessarily fond memories, just memories.",
            "score": 2,
            "author": "Commercial_Board6680"
        },
        {
            "level": 0,
            "comment": "$6.00  “ He’s gay isn’t he?”\n$7.00.   “ He said he went to his A&amp;A meeting.”\n$8.00.  “ He’s having a drink with your mother.”\n$9.00.  “ He just turned down sex with Dua Lipa”\n$100000.00 “ shhh, don’t say I said anything but he just said he had to go buy you a big mf@&amp;$ ing Diamond ring because you NEVER check up on him!”",
            "score": 2,
            "author": "Ewetootwo"
        },
        {
            "level": 0,
            "comment": "Mfs weren't lying 💀, the str@!ghts are not okay, they're fr acting like being a responsible partner is the worst thing ever or like their partner is going to get mad at them for going out once 💀, like bro just do the bare minimum of being a normal partner is not that hard ffs",
            "score": 2,
            "author": "Admirable_Box_7822"
        },
        {
            "level": 0,
            "comment": "Wife bad. Funnies.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That may have worked before cell phones but not now. Cute though.",
            "score": 2,
            "author": "Several_Emphasis_434"
        },
        {
            "level": 0,
            "comment": "Back in the day when the guys were home from the war a lot of them never went to the VA or the psychiatrist they went to the local bar or the VFA, or Legion. They had one phone and the bartender answered .  Wives knew where their husbands were but they couldn't leave to find them, most had kids (boomer here) and the kids got sent to look when they were old enough. Local garage had the same crowd working on cars and talking it out.",
            "score": 3,
            "author": "Ancient_Professor_18"
        },
        {
            "level": 0,
            "comment": "LMAO I was like seven years old (1979) and calling the local bar’s landline asking for my dad. At the request of my mom. SMH Such a healthy relationship. 😅🤣",
            "score": 2,
            "author": "Mmmartini"
        },
        {
            "level": 0,
            "comment": "The sanctity of marriage.",
            "score": 2,
            "author": "he_is_not_a_shrimp"
        },
        {
            "level": 0,
            "comment": "Ah yes it’s funny to hate your wife",
            "score": 1,
            "author": "peanutbitter95",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, and this is making fun of people who drink so much that they have to lie to cover it up. Alcoholism is hilarious. /s",
                    "score": 4,
                    "author": "morefetus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "r/wooosh",
                            "score": 1,
                            "author": "thejohnmc963"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Me thinks u missed the joke.",
                    "score": 0,
                    "author": "eathquake"
                },
                {
                    "level": 1,
                    "comment": "r/wooooosh",
                    "score": -1,
                    "author": "thejohnmc963",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "r/arethestraightsok",
            "score": 2,
            "author": "K1ER4"
        },
        {
            "level": 0,
            "comment": "r/BoomersHumor \n\nThe basic premise of boomer humor is “wife bad”.\n\nIn the generations since, people actually like their spouses, or leave unhealthy relationships.",
            "score": -2,
            "author": "AthleticNerd_",
            "replies": [
                {
                    "level": 1,
                    "comment": "At least they have humour",
                    "score": -1,
                    "author": "TheOldMercenary"
                },
                {
                    "level": 1,
                    "comment": "And at what cost. Now we have a bunch single moms, incels, school sh**ters, gender dysmorphia, trump supporters, extreme empaths, homeless people and Ted cruz",
                    "score": -14,
                    "author": "chernobyl-nightclub",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yay politics on an insanely non political post.",
                            "score": 6,
                            "author": "bbro444"
                        },
                        {
                            "level": 2,
                            "comment": "All these have existed for the last 40 years. Single moms? Yep. Incels absolutely. Trumpers? He has been around. Homeless people? Absolutely. Thank god no Cruz.",
                            "score": 3,
                            "author": "thejohnmc963"
                        },
                        {
                            "level": 2,
                            "comment": "Yay politics on an insanely non political post.",
                            "score": -1,
                            "author": "bbro444"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A tiny bar that eventually closed near me was called A Likely Story. \nMan do I miss the old pub days :(",
            "score": 1,
            "author": "thegeneraldisarray"
        },
        {
            "level": 0,
            "comment": "My local bar get wife calls on their landline constantly.",
            "score": 1,
            "author": "wat_in_barnation"
        },
        {
            "level": 0,
            "comment": "Ankle bracelet says otherwise...",
            "score": 1,
            "author": "ExcitementRelative33"
        },
        {
            "level": 0,
            "comment": "Wtf is the post title supposed to mean?",
            "score": 1,
            "author": "Astr0Cr33per"
        },
        {
            "level": 0,
            "comment": "Ah yes, another \"partner bad\". Seriously, why people marry if they hate each other so much?",
            "score": 1,
            "author": "KurohNeko"
        },
        {
            "level": 0,
            "comment": "🙄&lt;It’s a price list you paid the bartender to bullshit  your wife when she called looking for you….😂",
            "score": 1,
            "author": "Randell1970"
        },
        {
            "level": 0,
            "comment": "It's called a joke.",
            "score": 0,
            "author": "Owlftr13"
        },
        {
            "level": 0,
            "comment": "\"Nope, not here\" should be on the third place if you ask me\n\nBut if he said he's going to that pub, maybe it makes sense in that case\n\nAlso, if you are gonna have a control freak wife, don't marry her. Simple as 🍺",
            "score": -2,
            "author": "serialkiller_mne",
            "replies": [
                {
                    "level": 1,
                    "comment": "Asking someone to lie to your wife: typical alcoholic behavior. Also, calling your wife “controlling” because you drink so much that you have to lie to cover it up: typical alcoholic behavior.",
                    "score": 2,
                    "author": "morefetus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "100% this. Should say “a sign to help people destroy their lives from alcoholism”",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "God what a Debbie Downer",
                                    "score": 1,
                                    "author": "thejohnmc963",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sorry you can’t handle reality 🤷‍♀️",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sorry you don’t have a sense of humor 🍆",
                                                    "score": 1,
                                                    "author": "thejohnmc963",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Glad you’ve been blessed to not have alcoholism impact your life",
                                                            "score": -1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I have much experience with alcoholism and drug addiction in my family. but I don’t feel the need to insert it in a humorous sub about a FUNNY SIGN .",
                                                                    "score": 2,
                                                                    "author": "thejohnmc963",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It’s weird that you don’t recognize lying about drinking is a huge red flag towards alcoholism and normalizing it like this is not funny",
                                                                            "score": 1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Please stop. I know the difference between humor and reality.",
                                                                                    "score": 1,
                                                                                    "author": "thejohnmc963",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "$10 - He's in the backroom with our waitress",
            "score": 0,
            "author": "Thin_Locksmith6805"
        },
        {
            "level": 0,
            "comment": "Why would someone called the bar.",
            "score": -1,
            "author": "LightAnubis"
        },
        {
            "level": 0,
            "comment": "Damn, now i feel old...",
            "score": 1,
            "author": "justtoletyouknowit"
        },
        {
            "level": 0,
            "comment": "*sees old meme rolls eyes* reads title!",
            "score": 1,
            "author": "SlumberousSnorlax"
        },
        {
            "level": 0,
            "comment": "Yep, I've seen similar sign.",
            "score": 1,
            "author": "Samnppa"
        },
        {
            "level": 0,
            "comment": "$3 just seems like a rip off",
            "score": 1,
            "author": "hdofu"
        },
        {
            "level": 0,
            "comment": "Was this at a bar in Salt Lake City, UT by chance??",
            "score": 1,
            "author": "Junior-Account6835"
        },
        {
            "level": 0,
            "comment": "\"Moe's Tavern\"",
            "score": 1,
            "author": "Dave_FortniteATX"
        },
        {
            "level": 0,
            "comment": "Like Moe on the Simpsons. If Homer prepaid for a listed excuse, that's what Moe would say if Marge called while he was there.",
            "score": 1,
            "author": "CardiganCranberries"
        },
        {
            "level": 0,
            "comment": "I'd love it if there was a 10 dollar option and a 50 dollar option and a 9 dollar option.",
            "score": 1,
            "author": "concept_I"
        },
        {
            "level": 0,
            "comment": "![gif](giphy|GrUhLU9q3nyRG|downsized)",
            "score": 1,
            "author": "GronkisGronkisGronk"
        },
        {
            "level": 0,
            "comment": "r/arethestraightsok",
            "score": 1,
            "author": "TheMelonSystem"
        },
        {
            "level": 0,
            "comment": "clears throat...\n\n&amp;#x200B;\n\nback in the 1900's...",
            "score": 1,
            "author": "askaboutmy____"
        },
        {
            "level": 0,
            "comment": "My dad used to yell out, \"He just left with his wife!\" This was back in the 70's/80's. Not cool.",
            "score": 1,
            "author": "Strange-Height-8825"
        },
        {
            "level": 0,
            "comment": "And on the back it’s just 6 bucks for telling her “Oh you haven’t heard? He passed away” just for a lil ✨pizazz✨",
            "score": 1,
            "author": "MoshisukushiSloth"
        },
        {
            "level": 0,
            "comment": "r/arethestraightsok",
            "score": 1,
            "author": "Earthbender32"
        },
        {
            "level": 0,
            "comment": "r/ArethestraightsOK",
            "score": 1,
            "author": "alphasigmaligma"
        },
        {
            "level": 0,
            "comment": "Lol snitches get stitches",
            "score": 1,
            "author": "Comfortable_Hawk1615"
        },
        {
            "level": 0,
            "comment": "Me wondering what could possibly be confusing about this sign and then realizing 90% of the people on here probably didn't exist before cell phones: 👴",
            "score": 1,
            "author": "Spraynpray89"
        },
        {
            "level": 0,
            "comment": "Pretty self explanatory 😂",
            "score": -3,
            "author": "belladebella563"
        },
        {
            "level": 0,
            "comment": "OMG",
            "score": -2,
            "author": "hello__cake"
        },
        {
            "level": 0,
            "comment": "Very funny!",
            "score": -2,
            "author": "jujotheconquerer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol, escape from wife. Cuz wives, am I right?",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let's start with learning English",
            "score": -2,
            "author": "2s0ds"
        },
        {
            "level": 0,
            "comment": "Clearly not old enough to know, prolly not old enough to be in a bar.",
            "score": -2,
            "author": "Crazy_Hick_in_NH"
        },
        {
            "level": 0,
            "comment": "Every hometown bar should hang that sign.",
            "score": -2,
            "author": "timbknight"
        },
        {
            "level": 0,
            "comment": "I miss those days.",
            "score": -1,
            "author": "Vaderiv"
        },
        {
            "level": 0,
            "comment": "This could also be for cheating husbands. Actual story:\n\nWoman called the bar landline I worked at and asked if her husband had been there the night before. He had, but I told her I couldn’t disclose that info. She started weeping and asked if he was there with another woman. \n\nI said “I’ve never heard of that guy, he’s never been here”. The guy paid me to say that. More than $5 though.",
            "score": -1,
            "author": "iwanttheworldnow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well you’re trash",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re suggesting I break bartender/patron confidentiality? That’s a serious breach",
                            "score": 1,
                            "author": "iwanttheworldnow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not saying I hope you get cheated on, am saying I hope you never get to find out",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not here should’ve been more than just missed him",
            "score": 0,
            "author": "Wolfheron325"
        },
        {
            "level": 0,
            "comment": "And the 10$ one for being arrested for 2 years during a fight?",
            "score": 0,
            "author": "BSS_realIife"
        },
        {
            "level": 0,
            "comment": "those are cheap lies",
            "score": 0,
            "author": "onlinelink2"
        },
        {
            "level": 0,
            "comment": "My favorite bar joke was only possible before Caller ID and cell phones:\n\nA calls the bar, and asks the bartender if Joe Mehoff is there.\n\nThe bartender yells to the crowd, \"Joe Mehoff, Joe Mehoff- telephone.\" Puts the handset on the bar.\n\nThe bartender picks up the handset and says, \"Sorry, no Joe Mehoff in the bar.\"\n\nA says, \"Damn, I really need to get hold of him or his brother. His brother's name is Jack.\"\n\nBartender is getting annoyed but says, \"Hold on!\" and yells to the patrons, \"Jack Mehoff!, Jack Mehoff!-tele....\" \n\nThe crowd roars with laughter.",
            "score": 0,
            "author": "WonderBubba"
        }
    ]
}