{
    "id": "yyexcx",
    "score": 15458,
    "title": "truck signs...",
    "author": "TheTeeny23",
    "date": 1668759755.0,
    "url": "https://www.reddit.com/r/funnysigns/comments/yyexcx",
    "media_urls": [
        "https://i.redd.it/8bc6cj4z5o0a1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Not a fan of teen drivers? Stop multiplying.",
            "score": 286,
            "author": "OfteStoffer",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 51,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A lot of temperature controlled trailers have this design, since it reflects sunlight instead of absorbing it and makes it easier to keep the inside cool (theoretically). As someone who hauled frozen stuff for a long time, believe me, you don't want ice cream melting in the trailer. That's how you wind up hauling a load of ants.",
                            "score": 34,
                            "author": "Trivale",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What is this? Mass transit for ants?!?",
                                    "score": 10,
                                    "author": "UWontAgreeWithMe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It needs to be at least… 6 times this big!",
                                            "score": 2,
                                            "author": "willowgrl"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don’t like old drivers? \n\n*disappear your grandma*",
                    "score": 15,
                    "author": "Pussy4LunchDick4Dins"
                },
                {
                    "level": 1,
                    "comment": "Happy cake day",
                    "score": 3,
                    "author": "Fuit3"
                },
                {
                    "level": 1,
                    "comment": "Not a fan of old drivers? Start dividing.",
                    "score": 10,
                    "author": "TheFluffiestFur"
                },
                {
                    "level": 1,
                    "comment": "What about teenage truckers? Best of both worlds.\n\nhttps://www.kuow.org/stories/the-driver-of-the-big-rig-one-lane-over-might-soon-be-one-of-these-teenagers",
                    "score": 3,
                    "author": "Alex0082",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Take out teenage and old drivers at once!",
                            "score": 3,
                            "author": "Bonkodad"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have no problem with trucks.  I do have a problem with truck drivers that insist on trying to pass another truck driver that is going 2mph slower than he is, and both going less than the speed of the rest of the traffic.  I've heard that called \"Elephant racing\".",
            "score": 174,
            "author": "Buck_Thorn",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not the only times truck drivers like that upset me, but also they sometimes try to get into my lane without even noticing I'm there. I know they can't see me, but they also know their sight is limited, why not be smarter about it instead of causing me to brake and reduce my speed to yours? \n\nIn general, they sometimes act like \"this is my job, so the road is my office, I own it\". Not just them, but taxi drivers, bus drivers... It's not about the vehicles, but drivers being awful. (And ofc there are plenty who drive well, and don't deserve to be shitted upon.)",
                    "score": 39,
                    "author": "GeePedicy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You try driving a truck and tell me how easy it is to change lane on a busy highway and how almost no one leaves space. Where I live, city buses do have a priority. Not defending taxi drivers lol",
                            "score": 13,
                            "author": "yuki_pb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dude, I don't say they shouldn't switch lanes, just plan ahead, give me signals instead of just driving into me, taking me off the road. Sometimes they just start moving into my lane on the moment. Jesus Christ, especially them should know that other drivers are unpredictable. Some of them really don't feel like professionals, when it's literally their profession.\n\nCity buses, in some areas have their own lanes. Most of the time idiot private drivers don't go on them, but when they do even I get mad at them. \n\nI'm not saying we should be rude to them or we, private drivers, should have a higher priority, but we all need to be more focused, to plan ahead our moves, signal to others, ~~put aside the phone \"Mr Important\"~~... Regardless of the vehicle you drive.",
                                    "score": 6,
                                    "author": "GeePedicy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You are totally right, everyone should signal ahead. Sorry I’ve just seen cars not letting trucks merge or change lane when they needed to take an exit.",
                                            "score": 2,
                                            "author": "yuki_pb",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It definitely happens. And assuming they didn't need to take a dangerous wild brake or anything risky, you're perfectly right. Yet again, we should all try to be better drivers.",
                                                    "score": 2,
                                                    "author": "GeePedicy"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; don't deserve to be **shitted** upon.\n\n*shat",
                            "score": 1,
                            "author": "SunSaw",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Uh.. should it be \"shat on\", not upon? Idk, I sometimes write what sounds right at a moment and later... \\*squints eyes at myself\\*",
                                    "score": 2,
                                    "author": "GeePedicy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Depends on how pedantical you want to be.",
                                            "score": 1,
                                            "author": "SunSaw",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Anyone else believe it’s just “shit on” and not either of the other options?",
                                                    "score": 3,
                                                    "author": "International-Cat896"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They get a nice slowdown during the upcoming hill.",
                    "score": 3,
                    "author": "Thaflash_la"
                },
                {
                    "level": 1,
                    "comment": "My problem is with truck drivers who do 20 mph below the speed limit in the passing lane, which they aren't supposed to be in to begin with.",
                    "score": 2,
                    "author": "DieHardRennie"
                },
                {
                    "level": 1,
                    "comment": "Last weekend I had the pleasure of having a trucker pull out in front of me to pass at least 20 other trucks (20 is when I quit counting). 70 mph zone, he courteously was running 68. There’s no f’in way he didn’t see me approaching in the left lane, could’ve easily waited 10 seconds for me to pass him. It only took him 25 miles to overtake the other trucks, but at least he backed up traffic on a rural interstate for no reason.",
                    "score": 2,
                    "author": "Randy_Character",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Losing momentum at 78,000 lbs is the worst thing for a truck driver, stfu and let him pass. Takes 20-30 seconds at most",
                    "score": -4,
                    "author": "BaldingJordanian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No it doesn't usually take 20-30 seconds for them to pass.  Sometimes it takes them many miles and a hell of a lot more than 30 seconds.\n\nNo, I will not stfu about it.  I drove truck for 5 years and know that you only pass when you can pass quickly.  Driving 2 mph faster than the guy next to you is not passing.\n\nI'm not talking about those situations.  I have no problem with 30 seconds.  I'm talking about 10-15 minutes when nobody can pass.  Miles.  \n\nIts not just me, either.  Here are just 3 out of many results from Google:\n\nhttps://www.gulfsouthlaw.com/blog/2020/november/the-elephant-race-explained/\n\nhttps://www.woodlawfirm-tx.com/blog/2021/september/the-truth-about-18-wheeler-elephant-races/\n\nhttps://frankgiunta.com/what-does-an-elephant-race-mean-for-truck-drivers/",
                            "score": 16,
                            "author": "Buck_Thorn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "2mph more means you’re passing 75 feet of truck at 2mph… literally gonna take you 30 seconds",
                                    "score": 2,
                                    "author": "BaldingJordanian",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But it's more like... 2mph faster for a few seconds, even speed for a few seconds, 2mph slower for a few seconds... In an endless cycle until there's a line of 50 cars behind til he finally decides to pass.",
                                            "score": 4,
                                            "author": "GroinShotz"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Don't tell me you've never driven behind one of those elephant races.  Maybe my example was a bad one, but the reality is that you can be stuck for miles.",
                                            "score": 7,
                                            "author": "Buck_Thorn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Baldingjordanian knows what you mean and he is being a dick because he is a truck driver and thinks everyone else should shut up and deal with it\n\nHe is the ass in the passing lane arguing semantics \n\nYou won’t change his mind\n\nDon’t waste your time\n\nAI will put them out of work in our lifetime",
                                                    "score": 4,
                                                    "author": "mrgreen1226"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I have, as a trucker and as a civilian, it takes max 30 seconds. It’s not that bad at all.",
                                                    "score": -5,
                                                    "author": "BaldingJordanian",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": -4,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Say that when you don’t have anything in your store and can’t get your furniture or alcohol or anything… they’re most definitely higher ranks than a normal person. Deal with it. Just like farm products such as corn. Can’t get that without the truckers &amp; farmers.  Humble yourself.",
                                                                    "score": 0,
                                                                    "author": "007_xTk0",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You are not \"higher ranked\" than a \"normal person\" what the fuck where does this ego even fucking come from holy shit.",
                                                                            "score": 2,
                                                                            "author": "ThortheThodThutcher",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Okay okay let me ask you this where In the thread did I ever claim to be a truck driver?",
                                                                                    "score": 1,
                                                                                    "author": "007_xTk0",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": -4,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "“Buddy” bro you’re literally just gonna kill more jobs that a lot of people depend on. And the only people using self driving trucks will be the bigger corporations. Also will love to see how many get hacked and moved to other locations for easier stealing 🤩",
                                                                                    "score": 4,
                                                                                    "author": "007_xTk0",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I expect more from truck drivers. I usually get it. A person doesn't remember all the regular truck situations that happen every day, but will remember that one time the truck moved over without signaling as you're boxed in by another car on the other side. Or any number if \"holy fuck I nearly died\" moments.",
                                                                                    "score": 1,
                                                                                    "author": "PubicGalaxies"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If it's actually 30 seconds, and then they get back in their lane, nbd. What pisses everyone else off is the truckers who have a 69.54 mph limiter trying to pass the truck with a 69.31 mph limiter. Oh noes, you have to modulate the pedal instead of flooring it, the horror.\n\nThere ought to be a retrofit adaptive cruise control system. Seems like a solvable problem.",
                            "score": 4,
                            "author": "spacetug",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tbf, the slower truck should just slow down an mph or two for ten seconds... It's not all to blame on the truck trying to pass.  But it is frustrating for everyone behind them.",
                                    "score": 3,
                                    "author": "GroinShotz"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, your delayed by what 3 maby 4 minutes?\nMeanwhile the driver is paid by the mile and he's stuck behind a what amounts to a 2 dollar an hour pay cut that might be on that strech for hours.\nRelax and enjoy a audio book or somthing",
                    "score": -5,
                    "author": "I_hate_the_app",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He should wait until there's no hill and no cars trying to pass.  We've all been stuck behind an \"elephant race\" that lasted a hell of a lot more than 3 or 4 minutes.  There are even some states where they will ticket a truck for doing that.",
                            "score": 5,
                            "author": "Buck_Thorn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's always another hill or more cars trying to pass, and when your halfway through the pass there's always gonna be some jerkoff who's flashing his lights in offense that some inconsiderate jerk is daring to make him travel the speed limit for an extra 2 or 3 mins.",
                                    "score": 0,
                                    "author": "I_hate_the_app",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not talking about 2-3 minute situations here.  That is not what an \"elephant race\" is.  That is simply passing another truck.  Its just as bad when cars do it... I'm sure you know what I'm talking about there. If you are in the passing lane... fucking pass, dammit!  If you can't pass, you don't belong there.",
                                            "score": 3,
                                            "author": "Buck_Thorn"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s called “cost of doing business”. Forcing someone else to pay for your “cost of doing business” whether it be time, money, cleanup, or damage is called an “externality”. Trucks slowing down other drivers is the same economically as us getting a broken windshield because a truck drove out of a gravel yard without covering their load correctly.",
                            "score": 1,
                            "author": "whatkylewhat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol what? Not even remotely close.",
                                    "score": 2,
                                    "author": "I_hate_the_app",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s insulting to elephants",
                    "score": 1,
                    "author": "Anti-charizard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He’s in the left lane. That’s what I don’t like.\n\nNo one hates truckers except trucking company executives. And election cycle qultists.",
            "score": 35,
            "author": "scroopynoopersdid911",
            "replies": [
                {
                    "level": 1,
                    "comment": "One thousand percent.",
                    "score": 1,
                    "author": "emp-sup-bry"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Post this in r/fuckcars and watch them spaz out.",
            "score": 6,
            "author": "Timely_Sink4678"
        },
        {
            "level": 0,
            "comment": "If it only was that easy, you also have to stop everybody else buying stuff too.\n\nOr you just accept that trucks exists, like a normal person would.",
            "score": 64,
            "author": "Massive-Row-9771",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;If it only was that easy, you also have to stop everybody else buying stuff too.\n\nAh yes, the Prime Directive Paradox. \n\n\nPicard: \"We do nothing to interfere with undeveloped civilizations.\"\n\nFerengi: \"Cool story, we're just going to be exploiting some undeveloped civilizations while you're doing nothing.\"\n\nOtherwise, how vigilant would you have to be to actively stop every protester with a spaceship in the entire federation from reaching any of the multitude of undeveloped civilizations to let them know aliens exist?",
                    "score": 2,
                    "author": "mochacho",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't get it. Like at all and I read through it a couple of times.\n\nWho's Picard here? The sign?\n\nThe truck the Ferengi?\n\nThe stuff the spaceship?\n\nAnd I been called underdeveloped through all my early teens, so I must be the primitive civilization, I guess.",
                            "score": 4,
                            "author": "Massive-Row-9771",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The comparison they're making is not that literal. The point is that you can't always avoid a specific outcome by simply holding yourself accountable to rigid principles, because others' behavior will also affect the outcome and not everyone will hold themselves to the same principles.\n\nThe Prime Directive doesn't prevent interference with pre-warp civilizations because non-Federation societies who don't follow the PD will still interfere if they want to.\n\nIndividually choosing not to buy anything won't prevent trucks from being necessary, because other people who don't share your principles will still buy things and need trucks.",
                                    "score": 3,
                                    "author": "Vanilla_Chinchilla96",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ok, thanks for explaining that.\n\nI'm not a huge Star Trek girl, so I might be totally in the wrong here.\n\nBut in the Star Trek case they would just need some Intergalactic organization between the major civilizations to solve that problem. Easy peasy, paradox solved!\n\n\nLike if we make international regulations on CO2 emissions for transport, we would get significantly less trucks on the road.",
                                            "score": 1,
                                            "author": "Massive-Row-9771",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're right, and that's what the Federation is in Star Trek. But, similar to the problem we have in the world right now - how do you get EVERY country to agree to that? Even if the entire UN were completely on board with those regulations, not every country is part of the UN. And even if everyone agrees on paper, how do you enforce it when someone decides to cut corners? All it really takes is one sufficiently powerful country to decide they can get away with it, and the whole plan falls apart. And at some point, someone is going to decide that there's money to be made in not following the rules.\n\nEssentially - any plan that requires unanimity to work, can't work, because unanimity on a large scale is simply not realistic.\n\nThat's the idea anyway. It's a bit pessimistic lol.",
                                                    "score": 6,
                                                    "author": "Vanilla_Chinchilla96"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's also a dumb fucking argument. \n\nIf people stop buying shit you lose your job and now you're just a high school dropout with a worthless CDL. Maybe instead of thinking your shipment of useless consumer goods are the most important thing on the road and fucking up traffic flow on the interstate you can stay in your lane and stop being an asshole. \n\nFuck truckers. And fuck this attitude they have. \n\nSigned, every single person in the Midwest.",
                    "score": -5,
                    "author": "MeatsuitMechanicus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "mate, shut the fuck up. i live in australia but it cant be too fucken different to the point of them all being useless cunts that are assholes. i spend a lot of time on the road, around road trains, lorries, heavy rigids, box trucks, you name it. all have their fair share of cunts but that doesnt mean all are. all jobs have fuckwits, and im sure whatever field youre in you are seen as one to",
                            "score": 19,
                            "author": "a_small_loli",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You often see videos of truckers breaking or turning to avoid some idiot car that's a traffic hazzard.\n\nDoing so is often risky for the truck, while just keep driving and hit the car would be a lot safer for the trucker.\n\nI think most truckers would act like that and that's pretty noble of them.",
                                    "score": 8,
                                    "author": "Massive-Row-9771",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is a big part of the reason I got out of trucking. I'd have to drive for 11 hours a day and people who spend 18 minutes a day on the freeway want to pretend they know what lane I need to be in, how fast I need to go, and how much of my time and effort I should be giving them to make their commutes to their soulless jobs .3 seconds faster. Fuck that shit. The time right after Covid lockdowns started was great. I could do my job without worrying about some cockwad passing 30 feet in front of me and slamming on the brakes to make a right turn. All this bullshit about how I need to be in the right lane at all times, except if they're trying to merge on to the highway at 32 mph, then I need to get over and give them room! God forbid I have to exit on the left in traffic - I need to stay in the right lane to appease the king of the cocklords, then hope and pray 497 of his identical nutslapping turd clones have it in their hearts to back off a bit and let me get over. Fuck that job, but not because of the job its self, because of people who make up 1001 rules for driving that you're expected to pick up via mental telepathy and know by heart.",
                                            "score": 1,
                                            "author": "Trivale"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You should be banned for lack of courtesy, and - this might be hard to follow - things are DIFFERENT in the USA than wherever you live.",
                                    "score": 0,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Hey mate I don't give a fuck about you or your life or your opinion so maybe shove it up your ass.",
                                    "score": -12,
                                    "author": "MeatsuitMechanicus",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "People don’t actually respect truckers limited capabilities on the road. Things like stopping are more work and then the blind spots are awful. You have people ride a trucker’s ass and that’s significantly more dangerous to do behind a semi than behind a sedan, but people do it because they have to get everywhere as fast as possible no matter the risk. If you were a trucker you’d quickly resent other drivers too because they put their own life at risk every day.\n\nFor clarity, I’m not a trucker. I’ve driven box trucks for employers, though, and those aren’t nearly as bad as semis in regards to blind spots but they still have blind spots and due to very unsafe drivers of regular cars you can absolutely still kill someone while acting in good faith and that fact is stressful.",
                            "score": 3,
                            "author": "tayroarsmash",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It seems to me the guy driving the super dangerous vehicle with lots of limitations shouldn't be trying to pass other very dangerous vehicles with lots of limitations. Youn don't get to be a privileged driver on the road and have everyone else bow to your desires and also get the same privileges as a car that's capable of going three times faster than you. \n\nBut truckers are a lot like cyclists. They want all of the privilege of being treated with the respect that they feel that they deserve, but they also want none of the responsibility that comes with it. \n\nYou drive a vehicle that requires five times the amount of stopping distance as a regular car. Maybe you don't need to (try) to go 75 miles an hour.  But no that's not how they want it. They want to be able to go as fast as they want to be able to go and they want everyone else to watch out for them even though they have more blind spots than a man with one fucking eyeball. It's all all responsibility to watch out for them and give them as much room as we can but they're allowed to just be total pieces of shit and fuck up the traffic flow of entire interstate systems. Those poor fucking truckers. Nobody ever thinks about them.",
                                    "score": 1,
                                    "author": "MeatsuitMechanicus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree that trucks should stay the fuck out of the passing lane. That’s a completely unforced dangerous maneuver, especially when trying to pass another truck. Truck drivers do engage in dangerous behavior. I guess my point is that cars unknowingly put themselves at risk the way they drive around trucks and that’s highly stressful so I cut them some slack on resenting other drivers. There’s no excuse for a trucker to also engage in dangerous driving, though.",
                                            "score": 2,
                                            "author": "tayroarsmash",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And that's my main point. Everybody drives too goddamn vindictively and it isn't helping. Even truckers don't like to be behind other truckers which is why there's such a problem with them leapfrogging each other. So why they want to be so fucking indignant about the fact that people who are capable of going much faster than them do not want to be stuck behind them is beyond me. \n\nEverybody drives with too much goddamn ego so you have 100,000 people all trying to fuck each other over because they got fucked over 5 miles ago and you're not getting in front of me because I don't want you to and you're not going faster than me because I'm already going fast enough. It's just a bunch of bullshit.",
                                                    "score": 4,
                                                    "author": "MeatsuitMechanicus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah it sorta terrifies me. I still get on the high way and feel safe but I’m a very cautious driver now because my mom was driving in a car that crashed and she went for 70 to 0 in about 2 seconds. She lived but if she did that ten years ago medicine would not have been able to save her. The seatbelt severed her large intestine in multiple places. Her ankle shatttered where her foot was on the break. She was in a very safely rated car and she had every advantage to surviving money could buy in 2020. It fundamentally changed her life. The physics of suddenly stopping when you’re traveling at highway speeds will ruin you.",
                                                            "score": 2,
                                                            "author": "tayroarsmash",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So what you're saying is is I should be hogging the left lane and making sudden lane changes and cutting across six lanes of traffic to get to the exit I should have been prepared for 3 miles ago?",
                                                                    "score": 3,
                                                                    "author": "MeatsuitMechanicus",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Absolutely. It’s the only way to drive.",
                                                                            "score": 1,
                                                                            "author": "tayroarsmash"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I can't believe so many people / drivers do this all the time and fuck everything. Instead of just thinking, whoops I guess I'll hit the next exit so I don't endanger everyone's lives, they panic and act like morons.",
                                                                            "score": 1,
                                                                            "author": "PubicGalaxies"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Most truckers you hear about in the news are pretty awful.\n\nBut all the truckers I know are good people.\n\nMaybe you should try talking to one before you judge them all.",
                            "score": 5,
                            "author": "Massive-Row-9771",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I spent a year living out of various truck stops, rest stops, Walmart parking lots, etc. while traveling for work. I was in 46 of the 50 states that year. Truckers were by far the most selfish, entitled fuck heads I’ve ever met. They have some god complex that they have THE MOST IMPORTANT JOB on the planet. \n\nHead on over to r/truckers and see them all brag about blocking in RV and vans that are in THIER spots in rest stops/Walmarts. Bragging about pinning in vans and turning their reefers on over night just to disturb people sleeping. Their entitled assholes that think the whole road belongs to them. Fuck em.",
                                    "score": 2,
                                    "author": "standuptj",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You have more experience than me then, so maybe you're right and I just been lucky to meet good ones.\n\nI have to point out that I'm not American so we might have different types of people working as truckers.",
                                            "score": 2,
                                            "author": "Massive-Row-9771",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ahhh yes... American truckers are probably different than most other countries.  \n\nFor one, most Americans feel entitled to something period... It's a fact of life here.  \n\nTruckers (on the road) are usually more so, because they are driving for their work (I assume) and feel their payload is more important than anyone else on the road.  Also probably feel people should look out for them... Because they will most likely kill you if you collide with them... (Which is why I usually give them a respectful distance.)",
                                                    "score": 1,
                                                    "author": "GroinShotz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think it's somewhat justified for truckers to feel that way, atleast to some extent. It's much more difficult and expensive for them to adjust to personal vehicles than it's for us to adjust to them, everyone should follow the traffic rules of course. But it takes much more fuel for a truck than a car to break and accelerate constantly.\n\n\nOn the sea (atleast in my country) you always yield for a \"working boat\", a boat who's skipper is on the job, for example a passager ship, a commercial fisher, coast guard etc.\n\n\nTruckers should of course not act like asshole and completely not give a shit about anybody else.\n\n\nEdit: Oh I just remembered American truckers like to throw bottles of pee everywhere, that doesn't happen here. So maybe the US ones are a separate breed.",
                                                            "score": 1,
                                                            "author": "Massive-Row-9771"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You do understand the those reefer motors start and stop on their own when the trailer is being refridgerated? Like your fridge at home, there is a thermostat calling for heating or cooling as need to keep that arguala fresh and green for your salad tonight. And every driver can't wait to turn that noisy thing off when the trailer is empty.\n\nSource: Long ago when I was MUCH younger, I drove over the road and pulled my share of reefers.\n\nAre there asshole truck drivers? Yep there sure are. I met my share of them when I drove. On the other hand, they number a lot less than all the asshole cunt car drivers on the road during rush hour every day. You just happen to be one of those cunt car drivers during rush hour.",
                                            "score": 3,
                                            "author": "bluewing",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Loving your comments. Getting a little agro about this guy you're replying to who you really know nothing about, though. He could be blind.",
                                                    "score": 1,
                                                    "author": "PubicGalaxies"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Buddy, I live in what is basically a glorified shipping hub of a city about 50% of the vehicles I see on the road on a daily basis are semis. I'm not just basing this off of a couple isolated incidents.",
                                    "score": -3,
                                    "author": "MeatsuitMechanicus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah yes they are the assholes, not you yelling at everyone on the internet about them lol.",
                                            "score": 1,
                                            "author": "zazz1337",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh wow! Today I learned that a single post on Reddit is the entire internet.",
                                                    "score": 2,
                                                    "author": "MeatsuitMechanicus",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Exactly. As I said elsewhere, no one remembers all the daily regular \"encounters\" with trucks / lorries on the road.",
                                    "score": 1,
                                    "author": "PubicGalaxies"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Truck Driver for 9 years. I agree with you. Truckers are some of the worst and entitled people on the planet.",
                            "score": 1,
                            "author": "imworkingonit2020"
                        },
                        {
                            "level": 2,
                            "comment": "Almost like it's a joke or something.",
                            "score": 1,
                            "author": "RenaKunisaki",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You know the device you used to post was on a truck at some point right?   You’re welcome. Signed a mid west trucker.",
                            "score": 0,
                            "author": "Bonkodad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And you know if we didn't buy the device you'd be some dumb fuck in the unemployment line right? So maybe you should be just as thankful to consumers as you are to yourself. You stupid piece of shit. \n\nLike how can such a simple concept go right over your stupid ass head? Without consumers, truck drivers are fucking meaningless.  So maybe instead of getting into a pissing match about who matters more, you should just stay in the fucking lane you're supposed to be in.",
                                    "score": -1,
                                    "author": "MeatsuitMechanicus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "On the contrary- I graduated with a degree in mechanical engineering and was gainfully employed with Ford Motor Company for 16 years.  They gave me an obscene buy out and instead of watching Jerry Springer all day I decided to see this beautiful county of ours. Getting paid to do it mind you.   Consumers and truck drivers are a symbiotic relationship, can’t have one without the other.   So maybe go off the grid, grow crops hunt for your food and give up your tech so your not employing another driver.",
                                            "score": 3,
                                            "author": "Bonkodad",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[ Removed by Reddit ]",
                                                    "score": 0,
                                                    "author": "MeatsuitMechanicus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Don’t advocate suicide, man. Like I know you’re not serious and being hyperbolic and you’re probably not going to drive someone to suicide but you have no idea what someone else is going through and it’s just needlessly cruel. You’re acting way out of pocket. You’re on the internet and I understand that you’re probably not viewing the people you’re saying this stuff to as actual human beings. But you are talking to actual human beings and this is wrong.",
                                                            "score": 2,
                                                            "author": "tayroarsmash",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OK, I stopped buying shit.  Trucks still everywhere.  Was this a scam?",
            "score": 16,
            "author": "matterson22070",
            "replies": [
                {
                    "level": 1,
                    "comment": "They're just driving empty trucks around now.",
                    "score": 2,
                    "author": "concept_I"
                }
            ]
        },
        {
            "level": 0,
            "comment": "r/technicallythetruth",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Caution! Snide Burns",
            "score": 4,
            "author": "Xcitation"
        },
        {
            "level": 0,
            "comment": "This could be on r/glitchinthematrix because it doesn't look like he is carrying anything.",
            "score": 3,
            "author": "draconus72",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Same goes for not liking China.",
            "score": 6,
            "author": "Direct_Big_5436"
        },
        {
            "level": 0,
            "comment": "are there people who don't like trucks?",
            "score": 9,
            "author": "NoTomatoeshere",
            "replies": [
                {
                    "level": 1,
                    "comment": "When they're cruising in the left lane like this one, yes.",
                    "score": 9,
                    "author": "Possibly_a_Firetruck"
                },
                {
                    "level": 1,
                    "comment": "I guess it's because trucks often drive below the speed limit and can be tricky to overtake. Also, emissions.",
                    "score": 18,
                    "author": "mangoed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They often drive in lanes they aren't legally allowed to in California",
                            "score": 8,
                            "author": "BatteryAcid67"
                        },
                        {
                            "level": 2,
                            "comment": "They fucking block the passing lane for miles and miles.\n\nTrucks shouldn't be allowed in the left lane.",
                            "score": 13,
                            "author": "HOT_SRIRACHA_BITCH",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For example, the truck in this post.",
                                    "score": 7,
                                    "author": "Snuhmeh"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, I'm no longer in the industry, but [this argument](https://www.pilotonline.com/government/local/article_b8b8717d-7d40-5728-9e9e-04d0bfcd342d.html) was still going on when I was. \n\nFor reference [this is the route](https://www.google.com/maps/dir/Norfolk+International+Terminals,+Terminal+Blvd,+Norfolk,+VA/Portsmouth+Marine+Terminal,+2000+Seaboard+Ave,+Portsmouth,+VA+23707/@36.8868039,-76.3154779,11z/data=!4m8!4m7!1m2!1m1!1s0x89ba999cdb9f79d7:0x8db688a812f9a6cd!1m2!1m1!1s0x89ba9885c59b1d0d:0x259226810a0ebd2e!3e0) they would normally take, if you turn on the option to bypass tolls you'll see, roughly, the route they (are/were) forced to take during the off times.",
                    "score": 3,
                    "author": "13AccentVA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Holy, 7 miles vs. almost 34 miles...",
                            "score": 1,
                            "author": "I_am_photo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I sincerely didn’t know I was supposed to have strong opinions on trucks",
                    "score": 2,
                    "author": "ntrpik"
                },
                {
                    "level": 1,
                    "comment": "Yes they should be replaced with rail",
                    "score": 1,
                    "author": "TheDeityRyan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Again. We have the leading freight rail system. Rail doesn’t generally work for &lt;500 mile moves or time sensitive freight. It also needs a way to get to the rail yard (drayage) which is also a truck.",
                            "score": 3,
                            "author": "tnick771"
                        },
                        {
                            "level": 2,
                            "comment": "Ah yeah just build rail road tracks up to every business in the country. \n\n/s",
                            "score": 5,
                            "author": "nlevine1988",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or, and this is controversial I know, continue expanding rail freight and passenger options so that trucks are only needed for the last leg of the haul.\n\nNot everything has to be flippin' one or the other.",
                                    "score": 9,
                                    "author": "LeastCoordinatedJedi"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No, we didn't. Maybe some industrial facilities switched from train deliver to truck. But your local grocery store never had a train pulling up out back. Trains are great for a lot of things but not all fright deliver makes sense for a train.",
                                            "score": 2,
                                            "author": "nlevine1988",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;But your local grocery store never had a train pulling up out back.\n\nHahahaha!\n\nYes! Yes, they did! Lots of them actually. Do you know why the strip mall was invented? It wasn't parking lots, it was the train platform mounted right on the back! Do you know why a truck platform is designed to be just as tall as a train platform even though it isn't necessary mechanically?",
                                                    "score": -2,
                                                    "author": "Bonerunknown",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wait so you think local deliveries should be executed by rail?\n\nI also think you’re referencing the old west style towns which is equally mind blowing.",
                                                            "score": 2,
                                                            "author": "tnick771",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;Wait so you think local deliveries should be executed by rail?\n\nNo, I think infrastructure should be designed with efficiency in mind. Continue with the wheel and spoke method, just more wheel and less spoke. \n\n&gt;I also think you’re referencing the old west style towns which is equally mind-blowing.\n\nI'm from Nova Scotia, trains were pulling up to strip malls as recently as the 70's, I do not know anything about 19th-century western American infrastructure.",
                                                                    "score": 3,
                                                                    "author": "Bonerunknown",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Your knowledge of domestic freight management is limited to malls in Nova Scotia. The US freight infrastructure is fantastic. Most thoroughfare you see on the roads in metropolitan areas are already consolidated truckloads or LTL loads created at mixing centers. Most of the items you see in a truck were on a train at one point. It’s more efficient to accept a full delivery  of a 53’ truck than to unload part of a train at a store.",
                                                                            "score": 5,
                                                                            "author": "tnick771",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Both railroads and tractor-trailers are essential components of shipping in the US. Rail is more efficient, while trucking is more flexible.",
                                                                                    "score": 5,
                                                                                    "author": "gwaydms",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Come back to this thread in 10 years when the price of gas causes the price of goods to sky rocket to crisis levels.\n\n&gt;Your knowledge of domestic freight management is limited to malls in Nova Scotia.\n\nI'm sure nobody anywhere else on earth mixed freight with commercial infrastructure.",
                                                                                    "score": 1,
                                                                                    "author": "Bonerunknown",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lol imagine having a rail spur going into every business that currently gets truck delivers it'd be chaos",
                                                                    "score": 1,
                                                                    "author": "nlevine1988",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You would only need one per commercial park, not per business. \n\nHave you never heard of cross-country trucking? No one cares about local freight, its the dependence on long-distance. Any job that can't be completed with a box truck should be completed with a train.",
                                                                            "score": 1,
                                                                            "author": "Bonerunknown"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Maybe the shared platform height is because rail freight and truck freight is part of an integrated system where by freight trains and trucking each plays an important roll in delivering cargo.",
                                                            "score": 1,
                                                            "author": "nlevine1988",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's a really long way to say \"trucks were designed to use train platforms\" also known as exactly what I said. \n\nThanks for spelling it out for yourself.",
                                                                    "score": 2,
                                                                    "author": "Bonerunknown"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "OTR truck driver here. I actually agree with you for OTR deliveries, but it’s pretty much impossible. The scale that truck freight operates at vs truck freight makes it largely a non-starter. \n\nIt’s not uncommon for 14 pallets of material to need to be sent from WI to UT. A single train car can hold 56 pallets. So, you’d need to coordinate around 4 businesses all going from roughly the same place to roughly the same destination at the same time. Just to fill one rail car.\n\nThat also ignores the issue of how do we get those 14 pallets from the shipper to the rail car in the first place. There are plenty of factories that are hundreds of miles from the nearest rail line and there are plenty that are in the middle of cities where we’d have to demolish buildings to run the rail line in the first place.\n\nFor local deliveries it’s worse. Imagine running a rail spur to your local target. At least for mine you’d have to tear up both roads and houses.\n\nNow you might be thinking why not just centralize the factories? Ignoring the economic and environmental cost of moving 10’s of thousands of businesses. The biggest ongoing issue would be labor. Getting people to and from that centralized industrial site would be a logistical nightmare. The obvious answer is again trains, but now you’d need additional sets of tracks for passenger rail and you’d likely be increasing commute times for employees beyond the current frustration of getting stuck behind a semi on the interstate anyway.\n\nEven if we did all of that there would still be edge cases were trucks are needed because a rail line can’t be laid in the first place.\n\nDon’t blame the trucks. Blame the automotive industry that spent decades tearing out easily accessible public transportation from our cities and making sure it didn’t come back. Forcing everyone into suburban hell.",
                            "score": 0,
                            "author": "MostlyFinished",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You've put a lot of thought into this. I'm loving it.",
                                    "score": 1,
                                    "author": "PubicGalaxies"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are people who don't like cars. And there are people who want to go back to a simpler way of life.",
                    "score": 1,
                    "author": "GladCucumber2855"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like trucks. What I don't like is trucks behaving shitty in traffic.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I don't know anyone who doesn't like truckers.  Are there really enough trucker haters out there to warrant a sign?  It just seems really weird.",
            "score": 2,
            "author": "Mountain-Ad-6594"
        },
        {
            "level": 0,
            "comment": "Wow, I wouldn’t laugh at that if I was a 2nd grader.",
            "score": 2,
            "author": "SashOfTopatoes"
        },
        {
            "level": 0,
            "comment": "Lol that was funny. We love trucks. we j don't like stupid truck drivers.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I don't mind trucks. What bothers me is when truck drivers take miles to pass and block traffic. If you can't pass, slow back down, pull to the right and let the cars pass on the left. Then continue your battle with your fellow road warrior.",
            "score": 2,
            "author": "BeKind_BeTheChange"
        },
        {
            "level": 0,
            "comment": "Maybe he should get out of the passing lane",
            "score": 2,
            "author": "majorahzmask"
        },
        {
            "level": 0,
            "comment": "HAHA XD.... Still tho, the fast lane isn't the place for you, get your slow ass over.",
            "score": 2,
            "author": "ghostninja-"
        },
        {
            "level": 0,
            "comment": "What I want is a proper logistics system that uses freight trains for long distances distribution so only local carriers have to be on the road. \n\nSeriously. Big automotive killed rail systems that were beneficial.",
            "score": 2,
            "author": "10_Virtues"
        },
        {
            "level": 0,
            "comment": "What I want is a proper logistics system that uses freight trains for long distances distribution so only local carriers have to be on the road. \n\nSeriously. Big automotive killed rail systems that were beneficial.",
            "score": 2,
            "author": "10_Virtues"
        },
        {
            "level": 0,
            "comment": "People don’t realize that trucking is vital to our lives. I great appreciate truckers and all the work and hours they put in on the road to keep society running.",
            "score": 2,
            "author": "nintendomech"
        },
        {
            "level": 0,
            "comment": "It's true.\n\nHowever, I think we can do better. I think we can expand rail and get these monsters off the road and cut CO2 emissions in the process.",
            "score": 2,
            "author": "GraciesDad92"
        },
        {
            "level": 0,
            "comment": "Or invest in better infrastructure?",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I dont mind trucks. They just need to never be in a passing lane like the idiot driver in the truck.\n\nNobody to his right, left hand drive, forcing undertaking in his blind spot.\n\nSemis arent the problem, its truck drivers trying to go fast",
            "score": 7,
            "author": "tiki_tiki_tumbo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah truckers will go apeshit of you don't give them a football field of space on every side but will happily fuck up the traffic flow of an entire interstate.",
                    "score": 7,
                    "author": "MeatsuitMechanicus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My favorite is when they refuse to not absolutely floor their accelerator because they're governed at 65.9mph and the truck in front of them, doing the same thing, is governed at 65.2mph.  \n\nThen they get into a pissing match on passing for the next 40 fucking miles because they're driving in hilly areas and and the \"faster\" truck is hauling more shit so they lose their momentum passing on the hill.  Then they fall back and get stuck behind mister slow ass.  Then they repeat it and cut off the 2 mile long backlog of cars trying to pass these shitheads traveling 65 in a 70 on a 2 lane highway.\n\nMaybe just stay behind him you shithead.",
                            "score": 7,
                            "author": "b0w3n",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah it turns out giving any ex meth addict the CDL and a 50,000 lb vehicle doesn't make him a good driver.",
                                    "score": 2,
                                    "author": "MeatsuitMechanicus"
                                },
                                {
                                    "level": 3,
                                    "comment": "This is legitimate.",
                                    "score": 2,
                                    "author": "PubicGalaxies"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't like murder? Stop going outside!",
            "score": 2,
            "author": "SoupeGoate22"
        },
        {
            "level": 0,
            "comment": "Ekonomiks",
            "score": 1,
            "author": "HollabackWriter"
        },
        {
            "level": 0,
            "comment": "Is this how Steve Austin travels?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh hell yeah!",
                    "score": 1,
                    "author": "Chi-zuru"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stone Cold Express indeed.",
            "score": 1,
            "author": "Doctor_Flamingo"
        },
        {
            "level": 0,
            "comment": "I don’t mind trucks. School buses on the other hand get on my nerves lol",
            "score": 1,
            "author": "-Fried-",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Unrelated to the sign, shiny metal vehicles are terrible for the people behind them when it’s really sunny out.",
            "score": 1,
            "author": "BiasPsyduck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Live in AZ. It's never been a problem.",
                    "score": 2,
                    "author": "PubicGalaxies"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll tell you what I'm not a fan of, trucks in the left fucking lane. Get out of the way! That's the law breaking lane!",
            "score": 1,
            "author": "Direct-Chipmunk-3259"
        },
        {
            "level": 0,
            "comment": "Weird persecution fetish this driver has.",
            "score": 1,
            "author": "dieinafirenazi"
        },
        {
            "level": 0,
            "comment": "Something tells me he thought that one up all by himself...",
            "score": 1,
            "author": "Prior-Chip-6909"
        },
        {
            "level": 0,
            "comment": "I left work this morning to a let’s go Brandon large on the back of a semi. No company anything anywhere on it.",
            "score": 1,
            "author": "SucksTryAgain"
        },
        {
            "level": 0,
            "comment": "Yeah, I hate fresh fruit!",
            "score": 1,
            "author": "JMCatron"
        },
        {
            "level": 0,
            "comment": "I don’t mind trucks at all.  It’s the drivers that camp out in the left lane not passing anyone that I don’t care for.",
            "score": 1,
            "author": "Constant_Use_330"
        },
        {
            "level": 0,
            "comment": "Trucks are not necessarily the problem.\n\nBad truck drivers are.\n\nI used to drive a 24 foot box truck around for deliveries, and the guy who trained me told me, \"Follow the trucks; those guys are professionals and they know what they're doing.\"\n\nAt the time, he was right.\n\nNow, though, I think the need for many more drivers, combined with companies squeezing the shit out of the drivers by demanding more and paying less...\n\n,,,it means we have a bunch of underqualified and over-stressed people doing dumb and annoying and dangerous shit while at the wheel of giant machines speeding down an over-leveraged highway.\n\nNot good.",
            "score": 1,
            "author": "fikis"
        },
        {
            "level": 0,
            "comment": "It's not the trucks, it's the assholes driving them that we don't like.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Is the back of the truck reflective or not",
            "score": 1,
            "author": "LA_KittenmanF3"
        },
        {
            "level": 0,
            "comment": "\"Tired of trucks making our roads so much more dangerous? Suck it! Money, bitches!\"",
            "score": 1,
            "author": "Electricalbigaloo7"
        },
        {
            "level": 0,
            "comment": "Stone cold indeed",
            "score": 1,
            "author": "ur-socks-sir"
        },
        {
            "level": 0,
            "comment": "Why is he in the left hand lane?! There is no one in the right. Move over!!!",
            "score": 1,
            "author": "voodoolord16"
        },
        {
            "level": 0,
            "comment": "Stone Cold Steve Austin definitely owns this trucking company",
            "score": 1,
            "author": "thataveragedude1"
        },
        {
            "level": 0,
            "comment": "Right don’t like truck u don’t eat",
            "score": 1,
            "author": "Electrickman"
        },
        {
            "level": 0,
            "comment": "Complaining about something? Stop complaining about it.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is not an excuse for reckless and dangerous driving to arrive from A to B on time. You don't own the road.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I have to remind myself of this every time a truck annoys me.",
            "score": 1,
            "author": "Pontif1cate"
        },
        {
            "level": 0,
            "comment": "Somebody should print out the \"that's not how any of this works\" meme and paste it right next to it",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "They better have a good reason for being on the left lane. I’d inevitably want to pass this guy and passing on the right is dangerous",
            "score": 1,
            "author": "Plupert"
        },
        {
            "level": 0,
            "comment": "I like trucks just fine. I just don't like the occasional asshole truck driver that insists on going slowly in the passing lane. It's just dangerous",
            "score": 1,
            "author": "watchescarsandav"
        },
        {
            "level": 0,
            "comment": "Careful, don't let capitalism hear you",
            "score": 1,
            "author": "armageddon_boi"
        },
        {
            "level": 0,
            "comment": "It’s not the trucks that are the problem, it’s the lack of good truck drivers",
            "score": 1,
            "author": "Geaux13Saints"
        },
        {
            "level": 0,
            "comment": "It's true though. \n\n\nTruckers get so.much grief for doing the job.",
            "score": 1,
            "author": "sohma2501"
        },
        {
            "level": 0,
            "comment": "I don't buy shit. I make my own.",
            "score": 1,
            "author": "ecchho"
        },
        {
            "level": 0,
            "comment": "“stop needing things”",
            "score": 1,
            "author": "alamallama"
        },
        {
            "level": 0,
            "comment": "Problem is actually with the steering wheel actuator here. Get your truck out of the left-hand lane, buddy!",
            "score": 1,
            "author": "ElenaEscaped"
        },
        {
            "level": 0,
            "comment": "I just think we can have a mixed logistics system with rail that also double as passenger transport as well. Either way, trucks are usually not a problem until \"traffic\" develops, and that's mostly the result of legitimately bad and inattentive personal car drivers.",
            "score": 1,
            "author": "ErikkShone"
        },
        {
            "level": 0,
            "comment": "My man",
            "score": 1,
            "author": "SlippinJimmy07"
        },
        {
            "level": 0,
            "comment": "Left lane is for passing",
            "score": 1,
            "author": "chicagowin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe that’s what is happening.",
                    "score": 1,
                    "author": "justagigilo123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doubtful",
                            "score": 1,
                            "author": "chicagowin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ain't that the shit.",
            "score": 1,
            "author": "akgt94"
        },
        {
            "level": 0,
            "comment": "That's why I pass them",
            "score": 1,
            "author": "jimmyl_82104"
        },
        {
            "level": 0,
            "comment": "Never heard anyone say they don’t like trucks",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Surprised there's a company that would allow profanity on their company trucks.",
            "score": 1,
            "author": "PubicGalaxies"
        },
        {
            "level": 0,
            "comment": "Without trucks how will most items will be shipped?",
            "score": 1,
            "author": "Internetboy5434"
        },
        {
            "level": 0,
            "comment": "This should be on r/fuckcars",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "well he is right",
            "score": 1,
            "author": "KOMPOSITORR"
        },
        {
            "level": 0,
            "comment": "How 'bout, don't drive like an asshole and we will buy more stuff? Because if we stop, you may not have a job.",
            "score": 1,
            "author": "StandStillLaddie"
        },
        {
            "level": 0,
            "comment": "OMG YESSSSSS AMEN 🙏🏻👍🏻",
            "score": 1,
            "author": "LauraNYC11"
        },
        {
            "level": 0,
            "comment": "I wish there was a separate road for work trucks and shit.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "How come no one notices truck is transparent",
            "score": 1,
            "author": "Vetchd"
        },
        {
            "level": 0,
            "comment": "As the prick camps in the left lane...",
            "score": 1,
            "author": "Workaccountnodata"
        },
        {
            "level": 0,
            "comment": "Get out of the fucking passing lane.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I bet that mirror like finish on that trailer is just fun to look at when the sun hits it.",
            "score": 1,
            "author": "D-Laz"
        }
    ]
}