{
    "id": "zsrvb0",
    "score": 11949,
    "title": "The ultimate funny sign... Underwater! I wonder what's in that cave.",
    "author": "Joe-_-King",
    "date": 1671730588.0,
    "url": "https://www.reddit.com/r/funnysigns/comments/zsrvb0",
    "media_urls": [
        "https://i.redd.it/d86wjd4tjh7a1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This is just scary\n\nEdit: r/scarysigns exists",
            "score": 812,
            "author": "O-mega_",
            "replies": [
                {
                    "level": 1,
                    "comment": "This pic has been posted there so, so, so many times",
                    "score": 203,
                    "author": "MrGritty17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is a standardized warning sign posted in many caves to implore divers not to get themselves killed which they will most likely do if they go deeper into that cave without proper and rigorous training to become a certified cave diver. We're not talking about a PADI/SSI specialty course. It involves literally finding your way out of a cave with your SCUBA mask blacked out after being rolled around in order to disorient you. It is very serious business.",
                            "score": 124,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cannot be reiterated enough. But the Dunning-Krueger effect is alive and well, ensuring a fresh supply of 'brave' corpses.",
                                    "score": 66,
                                    "author": "RootsRockVeggie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is that the effect where people believe \"It could never happen to me\"?",
                                            "score": 19,
                                            "author": "sh4d0wm4n2018",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No it's the effect where they know just a little but not enough to know that there is SOOOO much that they don't know to where they MASSIVELY overestimate their knowledge and capabilities",
                                                    "score": 48,
                                                    "author": "TheIronSoldier2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I worked at a gun shop and range.  I saw it first hand a lot, “experts” spouting false stuff about everything",
                                                            "score": 12,
                                                            "author": "Jugg3rn6ut",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "One summary I’ve heard for this effect is more\nto the tune of, [“The person who thinks they are the smartest in the room is actually the dumbest”](https://www.deanyeong.com/article/dunning-kruger-effect)",
                                                    "score": 10,
                                                    "author": "youhavenosoul"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I saw this sign in Hawaii and it probably saved my life. Me and my partner avoided the caves. A week later some navy guys died in that same cave. It’s funny that in my diving class, they never pointed out how fucking dangerous this stuff is. And when you’re young, you feel immortal.",
                                    "score": 44,
                                    "author": "M1sterMeeeseeeks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ever since I first heard of these signs I wondered if they actually worked. Glad to hear you stayed safe!",
                                            "score": 12,
                                            "author": "MoonlightOnSunflower",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Its the thought that if the sign saved just one life then its worth it",
                                                    "score": 6,
                                                    "author": "Photograph_Fluffy"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "PADI Open Water course materials definitely cover how caves and other overhead environments are extremely dangerous and require special training.",
                                            "score": 7,
                                            "author": "fdar",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Jesus, just hearing the training for cave diving freaks me out. I cannot comprehend that people do that shit for fun. Terrifying!",
                                    "score": 11,
                                    "author": "MobileButcher"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Isn't this devils den in Florida? Or are these signs just all over\n\nSeen 3 divers get puked out in Florida springs in my life so people definitely ignore them. One was like 60 miles from where he went missing.",
                            "score": 74,
                            "author": "bannannamo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was thinking the same thing! I heard there’s sign just like this all over that entrance to that cave. And the bodies are still down there cause they can’t get them out.",
                                    "score": 42,
                                    "author": "Bubbly_Celebration_3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The emu farm next door that owns the place was a high-school buddy's dad. That's where we would go to drink beers at night when we hung out hahah. I know the signs well.",
                                            "score": 19,
                                            "author": "bannannamo",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They're everywhere. MrBallen did a bunch of videos that are something like \"Places people went where they shouldn't have\" or something like that and a lot of them are about cave divers.",
                                    "score": 15,
                                    "author": "Ok_Bluejay_5365",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah a lot of caves look the same too. This just looks reeeaal familiar but devils den has been gated off for years due to suction currents. Right behind the sign that sits on a very similar stand.",
                                            "score": 7,
                                            "author": "bannannamo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He says stuff like there being a lot of silt that people kick up and then don't know where they are, tunnels being long so you lose oxygen, and false tunnels coming back so you think that you're leaving and then get stuck in a dead end",
                                                    "score": 3,
                                                    "author": "Ok_Bluejay_5365",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "places you can't go and people who went anyways\n\nHis channel is addictive",
                                            "score": 8,
                                            "author": "HypnoticRoots"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "His channel is good but if you are interested in cave diving specific content watch dive talk",
                                            "score": 3,
                                            "author": "Sorros",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, it's a sign from Devils Den. Basically telling people not to go beyond the point UNLESS of specific training. There's a video I saw of this on YouTube.",
                                    "score": 15,
                                    "author": "PeanutSam03",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah there's massive currents in the aquifer. The Alachua sink is notorious for taking divers, it can suddenly drain as well.",
                                            "score": 12,
                                            "author": "bannannamo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How does a cave just suddenly drain?",
                                                    "score": 5,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Currents change. That sink is out near Paynes Prarie which is a wetlands or a Prarie depending on the flow. I've seen it bone dry for years and full of water for years. \n\nSome cave currents in the aquifer can be like 10+ mph",
                                                            "score": 14,
                                                            "author": "bannannamo",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Well that's just absolutely horrifying.",
                                                                    "score": 9,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah I was swimming in high springs, far far away, when I diver showed up missing from the sink in blue springs. It was a few weeks later but he moved like 40+ miles",
                                                                            "score": 12,
                                                                            "author": "bannannamo"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "wow, that is crazy",
                                                                    "score": 5,
                                                                    "author": "Sorry_Nobody1552"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not to mention if you touch the walls, it explodes a cloud of blinding siltation",
                                                    "score": 5,
                                                    "author": "sexpanther50"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The signs are all over the place",
                                    "score": 3,
                                    "author": "Th3Shad0wz"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"They are definitely hiding something in this cave, gonna check what is in it...\"",
                            "score": 25,
                            "author": "ThorDansLaCroix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Death is in there",
                                    "score": 13,
                                    "author": "RH00794",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Death made the sign to draw people in.",
                                            "score": 3,
                                            "author": "Zalym"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How many goddamn times does this need to be reposted?!",
                            "score": 12,
                            "author": "Read_ity",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just until there are no longer new people who come across it for the first time and want to share it with other people who haven't seen it yet.",
                                    "score": 38,
                                    "author": "ElderScarletBlossom",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Crazy how r/oddlyterrifying is full of shit that isn't terrifying, but r/funnsigns upvotes something that's not funny and is kinda terrifying.",
                    "score": 35,
                    "author": "Not_MrNice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They are both symptoms of the same problem. People just scrolling the front page and upvoting posts they liked regardless of whether they make sense in that sub or not. The larger the sub gets the more it happens.",
                            "score": 9,
                            "author": "judokalinker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh wow… a version of the above photo is one of the stickied examples of that sub.",
                    "score": 7,
                    "author": "EverquestWasTheBest"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not funny. Terrifying.\n\nCave diving is unironically one of the most dangerous things a human can engage in. The problem is that the cave looks open, beautiful, safe, inviting. But when you swim through, your fins kick up the fine silt that settles on the cave floor. Soon the water behind you is completely opaque, and you don’t even know it. By the time you notice, it’s too late. In a cave only a few meters deep, it’s still absolutely possible to get disoriented, lost, unable to find top or bottom. Then you are in a panicked terror for the next hour or so, until you suffocate to death.\n\nHappens all the time.",
            "score": 562,
            "author": "erogally",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not to mention the tragic stories in this particular cave. One couple got turned around in the silt and ended up not being able to find their way out. The brother of the female diver found her and her spouses bodies holding each other.",
                    "score": 248,
                    "author": "Pstone89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jesus thats tragic",
                            "score": 85,
                            "author": "MrPartyPancake",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait till you hear the stories of Mountain climbers",
                                    "score": 5,
                                    "author": "Michmachinev10",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Go on…",
                                            "score": 5,
                                            "author": "ShaggysGTI"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh my gosh that’s tragic",
                            "score": 45,
                            "author": "Lazyoat"
                        },
                        {
                            "level": 2,
                            "comment": "Holy shit. That's so sad. Unbelievable.",
                            "score": 28,
                            "author": "Hunt-Apprehensive"
                        },
                        {
                            "level": 2,
                            "comment": "(There is many caves with this sign fyi…)",
                            "score": 12,
                            "author": "Suit_Responsible"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I belong to a local grotto that helps map unexplored sections of caves in the region and I am very aware of the dangers of caving.  \n\nI watched a documentary recently about a guy who got stuck *upside down* in a part of the Nutty Putty Cave [what he assumed was] “The Birth Canal”.  \n\nI forgot to add:  It also turned out that he’d mistaken where he thought he was on the map and ended up in a section that got narrower and narrower as opposed to narrow, followed by a large opening, which caused him to become stuck.\n\nAfter lengthy attempts to rescue the guy, not only did he die but they also had to leave his body where it is because they just could not figure out how to extract him.  They’d even brought a doctor on-site to help determine the best course of action because being upside down for a prolonged period of time is lethal, as clearly demonstrated in this case.\n\nFrom what I remember, they’ve finally closed to the cave, but not after years of warnings to do so because of just how dangerous that cave is.\n\nShitty source, but here’s a link to the story that I found after a hasty Google search: [here](https://www.dailystar.co.uk/news/weird-news/the-worst-death-imaginable-spelunker-22880796?int_source=amp_continue_reading&amp;int_medium=amp&amp;int_campaign=continue_reading_button#amp-readmore-target)\n\nEDIT: \n\nWhen I think of this tragedy every so often, I imagine his body being found thousands of years from now, not unlike how we find Neanderthals and the like nowadays, and when this guy’s body is discovered, I imagine future humans theorizing about his death, it possibly being a religious sacrifice or a murder or a sacred burial or something.  That’s assuming we survive as a species, of course.  :)",
                    "score": 59,
                    "author": "EverquestWasTheBest",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He thought he was in the birth canal, he was actually in another section of the cave.  He exhaled to squeeze a bit further and it was a done deal when he inhaled. They couldn't rescue him without breaking his legs. If they did that the rescuers speculated he'd go into shock and pass out. Then they'd have to pull him through the cave unconscious.  But it was too difficult to do with just yourself. Impossible with an unconscious body you need to pull a long.",
                            "score": 32,
                            "author": "Doc_Apex",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right!",
                                    "score": 3,
                                    "author": "EverquestWasTheBest"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh god I remember that. What a terrible story",
                            "score": 10,
                            "author": "erogally"
                        },
                        {
                            "level": 2,
                            "comment": "And this wasn’t even a cave diving if I recall correctly.. even less hazardous than cave diving",
                            "score": 5,
                            "author": "joethafunky"
                        },
                        {
                            "level": 2,
                            "comment": "I was waiting for someone to bring up Nutty Putty cave. Absolutely tragic and horrifying. What gets me is the fact that the unconscious body fell further into the cave. The couldn't even get a T.O.D. and he wasn't necessarily deceased. They just had to call it a day and later cemented over the cave. What an awful situation.",
                            "score": 6,
                            "author": "three-sense"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Then you are in a panicked terror for the next hour or so, until you suffocate to death.\n\nThe average amount of time from a simple unremarkable accident to fatal unrecoverable situation in cave diving is around 60 seconds.\n\nThe NSS used to publish a catalog of every caving accident and misstep in America every year with analysis about what went wrong. And detailed thoughts about what could have gone differently. About one fatality per year out of thousands of detailed reports.\n\nThere was a tiny cave diving section in the back of the book. Under 1% as many participants but there were maybe half a dozen reports per year. 100% fatalities. What could have gone differently was not going cave diving.",
                    "score": 38,
                    "author": "UtahBrian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish they still did that. The FAA basically does the same thing with aircraft crashes. The living learn a lot from the people who aren't any longer. Knowledge is power.",
                            "score": 18,
                            "author": "OverallManagement824"
                        },
                        {
                            "level": 2,
                            "comment": "In dangerous activities the safety rules are written in blood.",
                            "score": 7,
                            "author": "gogozrx"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is the least of your worries too\n\nEven well prepared and experienced cave divers can get absolutely fucked over simply because cave diving almost always makes literally every part of regular diving harder and/or more dangerous, and adds more dangers and difficulties as well.\n\nFrom gas mixtures to labyrinths to depth to the fact that instead of open water above you it’s sheer fucking rock, it’s a suicidal sport, and this is coming from a certified diver and amateur spelunker. Shit normally doesn’t scare me, but that shit scares me.",
                    "score": 30,
                    "author": "Walshy231231"
                },
                {
                    "level": 1,
                    "comment": "I would never willingly enter an underwater cave.\n\nI spent years working underwater on boats (inverted, horizontal) in shallow water and harvesting urchins (pretty normal) which both generate lots of silt and basically blackout conditions.\n\nWorst case, I was 200 or so feet horizontal and less than 20 feet down. Scared the shit out of me just about every time.",
                    "score": 22,
                    "author": "Capybara_Chill_00",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I had a friend at school whose father was a cave diver. He survived diving for many years and my friend wasn't left an orphan ... But all the father's dive buddies left orphans and that was what made him finally give up.",
                    "score": 14,
                    "author": "Palanquin_IR"
                },
                {
                    "level": 1,
                    "comment": "That’s terrifying. I was sitting here thinking I could go in no problem",
                    "score": 11,
                    "author": "deeterman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cave diving is probably one of the most dangerous things a human can do, without the training, equipment, and experience it can easily be adeath sentence to go into an underwater cave any further than a few yards, and you are extremely lucky if you can go all the way in and get back out. Sky diving and space walking are much safer, hell even going to Mars would probably be safer than an untrained scuba diver going into a cave.",
                            "score": 14,
                            "author": "SohndesRheins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re not wrong. Where regular scuba training is avoiding problems, cave training is pretty much all about solving different problems that will likely be encountered. Keep in mind there are entire levels of training/experience between recreational scuba and the start of cave training",
                                    "score": 7,
                                    "author": "johnnyheavens"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There is a story told during my training at ginnie springs of a submariner that went cave diving he died,  his buddies also came to see where he died and they died, they dang near had to cancel sea trails for the year due to the loss of staff.  The training for enclosed / overhead diving is interesting and you learn a lot but mostly you learn to respect your limits and redundancy in equipment.",
                            "score": 11,
                            "author": "PetraphobicDruid",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Which is exactly why these signs were created and then placed at every cave entrance",
                            "score": 5,
                            "author": "johnnyheavens"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks for the explanation! Do you know if there is a safe way to avoid stirring up the silt so you can safely dive, or is it a guaranteed part of cave diving that you're going to murk up the waters? Just curious, I'm too afraid to even get waist deep in the ocean, so not looking for advice haha",
                    "score": 18,
                    "author": "bustacean",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There sure is! I don’t fully understand it myself, but allegedly there are very specific methods of swimming, along with tools that are used. There are indeed some excellently skilled, mostly amateur, cave divers out there.\n\nBtw, knowing a little bit more about all this makes the story of those children who were rescued from that flooded cave in Thailand like 100 times crazier",
                            "score": 27,
                            "author": "erogally",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Turbid waters, lots of divers moving in and out.  I could see why they were terrified to bring untrained teens out through the soupy water.  Trained divers know, trust the rope, its the only thing in the cave you can trust.  Some kid that has been cold, and scared for two weeks is not a stable person.  Amazing they did it with 0 accidents.",
                                    "score": 23,
                                    "author": "Iamatworkgoaway",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "One of the rescue divers died, kids wouldn't have stood a chance.",
                                            "score": 18,
                                            "author": "midlifewtf"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Step 1: Keep Elon as far the fuck away as possible",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "How can someone be \"extremely skilled\"  and \"mostly amateur\"? This sounds like a porn title.",
                                    "score": 8,
                                    "author": "FuckItImLoggingIn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They are very good at it, but aren’t payed to do it",
                                            "score": 11,
                                            "author": "Mirthgiver",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; but aren’t *paid* to do\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                                    "score": 11,
                                                    "author": "Paid-Not-Payed-Bot",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "One I would watch for sure. You know what, fuck it I’m logging in.",
                                            "score": 3,
                                            "author": "AfterMany7239"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Depends on the specifics of the cave.\n\nHaving awareness of the possible problem helps. Having a line that leads you back towards the opening and KNOWING how to safely dive with a line helps. Having actual training in navigating diving with zero visibility by help of a line helps. Having the right equipment helps. Knowing how to perform common equipment-adjustments without visibility helps.\n\nBasically what the sign says: you need cave equipment AND cave training. Most divers have neither.\n\nEven if you know all of this, and have practiced all of this; it's still a lot more dangerous than normal diving.",
                            "score": 9,
                            "author": "Poly_and_RA"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  Do you know if there is a safe way to avoid stirring up the silt so you can safely dive\n\nNot wearing fins helps, but any movement is going to stir it up to a degree....panicked movements, particularly.  \n\nCave diving is slow and methodical for good reasons.",
                            "score": 6,
                            "author": "ARobertNotABob",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Technical / cave / wreck divers do use fins, but their fins are very short and they use a different technique to use them - a frog-leg kick. I’ve described it above in another post.",
                                    "score": 8,
                                    "author": "xdrolemit"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am pretty sure I snorkeled to this exact sign or one just like it. It's at one of the biggest cave diving areas in Mexico. The sign is placed where you should stop if you are snorkeling. There are plenty of relatively safe routes. Hundreds do it everday. Like you can see this sign then see a tour group right behind it.",
                            "score": 5,
                            "author": "ihc_hotshot"
                        },
                        {
                            "level": 2,
                            "comment": "Technical divers and pretty much all the cave and wreck divers are taught a frog-leg kick where you bend your knees in almost 90° and you kick with your ankles. That’s in comparison to regular recreational scuba divers that just keep their legs straight and kick from their hips. The frog-leg kick is purposely used for a better control, less mud stirring and less damage to the place you’re diving in.\n\nE: typos",
                            "score": 5,
                            "author": "xdrolemit"
                        },
                        {
                            "level": 2,
                            "comment": "Basically you have to maintain your buoyancy perfectly to stay off the bottom, use special kicking techniques to stir up a minimum of water, and not touch anything. There are some caves that are tight enough you just can't avoid it though and sections will be zero visibility, only recommended for people with plenty of experience.",
                            "score": 4,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "You tie a line to entrance to the cave that you can use to return to the entrance. Popular caves my have a permanent line attached that people may follow or branch off from.\n\nHere’s a video on kicking technique that will help prevent stirring silt https://youtu.be/U5wliityRuU",
                            "score": 5,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Yup, if you’re familiar with the breast stroke in sport swimming, thats the type of kick you use to minimize kicking up silt. Kinda like a frog, very softly.",
                            "score": 4,
                            "author": "Apocalypsezz"
                        },
                        {
                            "level": 2,
                            "comment": "Some silt will settle pretty fast - others might linger (like clay silt will just hang out forever). It’s pretty guaranteed you’ll muck up some, but it isn’t always a full blinding silt out. \n\nPlus, most tourist caves in FLorida and Mexico have permanent line installed with directional markers so you can always find the nearest exit. You should always know where the line is - but that’s where training comes in. One drill while training involves having a blackout mask put on, being disoriented away from the line, then finding your way back to the line, blindfolded, and find your way towards the exit. \n\nBut things like that are why the sign says not to do it without training and equipment. There’s a lot more to it than that in terms of proper training and planning, but I share it more to highlight why training is necessary to properly execute a cave dive.",
                            "score": 3,
                            "author": "attax"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Funny until one get stuck in a tight opening and left to die cuz nobody or nothing could extract you.",
                    "score": 5,
                    "author": "OwlWitty"
                },
                {
                    "level": 1,
                    "comment": "You just scared TF outta me!",
                    "score": 2,
                    "author": "thiswayart"
                },
                {
                    "level": 1,
                    "comment": "I loved Jill Heinerths book, into the planet. Cave diving is the most deadly “sport”",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Don't forget brackish water, where fresh and salt waters mix, and the visibility gets all wobbly, like being extremely drunk. Then throw in flashlight failures, generalized claustrophobia, and getting poked by stalactites...",
                    "score": 5,
                    "author": "SouthBaySmith",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I understand that! It happens more than we know",
                    "score": 3,
                    "author": "Commercial-Door8425"
                },
                {
                    "level": 1,
                    "comment": "I want to be a cave diver. Part of your training to be a cave diver involves learning how NOT to kick up silt. \n\nAlso, there’s a reason that guide lines exist along with a LOT of cave diving procedure.",
                    "score": 3,
                    "author": "iwanttobeacavediver",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;there’s a reason that guide lines exist along with a LOT of cave diving procedure.\n\nThere's also a reason that there aren't many of us old cave divers.",
                            "score": 3,
                            "author": "por_que_no",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There’s also a thing that happens when you have both salt and fresh water that makes it look like you are no-longer under water when you still are.",
                    "score": 3,
                    "author": "IrreverentHippie"
                },
                {
                    "level": 1,
                    "comment": "Pick *one*\n\n1.) An underwater cave \n\n2.) Something that looks open, beautiful, safe, inviting",
                    "score": 3,
                    "author": "the_rabid_kitty",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What’s in the cave? Foolish dead divers, that’s what.",
            "score": 126,
            "author": "okcdnb",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actually, yes. I watched a docuvideo on this cave (I recognize the sign) and I don’t believe they were able to retrieve every body lost down there due to the danger",
                    "score": 66,
                    "author": "PaintedLady1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This and very similar signs are in caves across the world\n\nCave diving is ridiculously dangerous even compared to other forms of “extreme” diving, and divers’ deaths followed by underwater signs and gates is fairly commonplace",
                            "score": 19,
                            "author": "Walshy231231"
                        },
                        {
                            "level": 2,
                            "comment": "I once watched a video about a diver who went to retrieve the body of a dead friend who died while cave diving. The diver died trying to retrieve the dead body. \n\nJust a senseless loss of life. I remember the diver's name was Deon.",
                            "score": 7,
                            "author": "zzzrecruit"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This sign is from Chac Mool / Kukulkan cenote in Playa del Carmen in Mexico. If you’re a certified scuba diver, you can go there. It’s actually quite a pretty cenote for scuba diving.",
                    "score": 8,
                    "author": "xdrolemit",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Check out MrBallen on YouTube.  He has numerous videos where people ignore signs like this and end up dying.",
            "score": 59,
            "author": "Sjelan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep they’re great videos! I’m almost certain I remember this exact sign from one of his videos",
                    "score": 14,
                    "author": "PaintedLady1"
                },
                {
                    "level": 1,
                    "comment": "I would love to follow your recommendation, but the clickbait titles and mandatory \"red arrow\" in every one of his thumbnails immediately turned me off. Is that just for show? Is his content good?",
                    "score": 7,
                    "author": "0000000000000007",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He’s good. Former Navy Seal. Best storyteller out there. He also adds some humor here and there.",
                            "score": 14,
                            "author": "Critical-Part8283",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "he's a good story teller, however he exaggerates the legitimacy of a lot of his stories. his old videos where he did 'places you can't go but people went anyways' were interesting and fairly accurate, but he's also used reddit stories as his source while acting as though its a verified true story and doesn't seem to do much research on the supernatural stories",
                            "score": 8,
                            "author": "voideyedcat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I get it, the pic is kinda funny, but as a diver, I take it very seriously.  This is a photo of a sign underwater in a cavern.  I have been in the cavern and seen the sign.  Its purpose is to remind me that I am not qualified to go further as a diver.  \n\nThere are real deaths connected to the sign.",
            "score": 163,
            "author": "KewellUserName",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah idk how tf this is funny. As a diver this may not be the scariest, but is probably one of the most solemn things you could find.\n\nThis is like laughing at a grave, and chances are it IS laughing at a grave, considering rescue divers often can’t get the body/bodies out.",
                    "score": 36,
                    "author": "Walshy231231",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not only that but many rescue divers die trying to retrieve bodies.",
                            "score": 10,
                            "author": "100S_OF_BALLS"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not funny at all. Those signs might as well be grave markers. They really should start putting death tallies on those signs so even people that disregard it and die can be used to warn future idiots.",
                    "score": 8,
                    "author": "hallwaypoirear"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Advanced Open Water Diver here.  I can say with 100% certainty there are corpses in there.",
            "score": 43,
            "author": "FlipMick",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah idk how this is funny\n\nIt’s laughing at a grave",
                    "score": 16,
                    "author": "Walshy231231"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really don't get how a sign telling you divers die in caves without training is a \"funny sign\" but okay..",
            "score": 156,
            "author": "t3ddan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Chances are there are dead divers still in that section of cave, unable to be recovered due to the dangers posed to the rescue divers.\n\nThis is literally laughing at a grave",
                    "score": 11,
                    "author": "Walshy231231"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude I don't find this funny at all. You have any idea what happens to dead bodies that get stuck underwater for long periods of time? Or what the process of removing those bodies looks like?",
            "score": 25,
            "author": "fancy-kitten",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ugh.. please don't remind me. -rescue diver",
                    "score": 23,
                    "author": "Fugly_Sloth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the work you do, bud. I’m from Long Island, and one of my childhood friends was the daughter of a diver who recovered bodies from the wreck of TWA 800 back in 1996. He was a solid dude but the stuff he saw down there affected him for the rest of his life.",
                            "score": 16,
                            "author": "EnterTheNarrowGate99"
                        },
                        {
                            "level": 2,
                            "comment": "The curious side of me wants to know details, the nervous side of me does not lol. \n\nThanks for what you do, seriously. Rescue diving takes some serious bravery of steel. I know I couldn't.",
                            "score": 16,
                            "author": "SunflowerFreckles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bravery doesn't even come close to what's needed to face this kind of torture. You need an iron stomach.  \n\n\nOriginally, I became a rescue diver for selfish reasons. I wanted to learn the skills needed to save myself (knowing what to do, what not to do, how to avoid dangerous scenarios, etc). I have ALWAYS had a fascination with caves and caverns, above and below water. I recognized early on how dangerous they really are and how quickly life and death are split like a pea. Underwater is quicker. Because, well, we can't breathe water. It is an agonizing and painful death to drown while panicked.  \n\n\nIn rescue diving, and some recreational diving circles, redundancy is taught can save your life. But not always. The worst part about some of these cave drownings, the evidence shows they died most likely because their flashlight went dark. Without a backup light, and not being properly prepared for cave or cavern exploration, absolute darkness is terrifying, and run out of air simply because they couldn't see or feel their way out quick enough.  \n\n\nI don't do rescue dives anymore. Mostly due to changing health reasons.",
                                    "score": 7,
                                    "author": "Fugly_Sloth"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This isn’t funny, it’s a pretty damn serious sign. Respect the water and respect professional divers.",
            "score": 22,
            "author": "_SquareSphere"
        },
        {
            "level": 0,
            "comment": "Caves are dangerous.\n\nDiving is dangerous.\n\nCave diving is the dangers of these two multiplied by each other.",
            "score": 20,
            "author": "Skalla_Resco"
        },
        {
            "level": 0,
            "comment": "How the fuck is that funny?",
            "score": 17,
            "author": "Tysons_Face"
        },
        {
            "level": 0,
            "comment": "Wouldn't call this funny. Caves are pretty dangerous for divers.",
            "score": 18,
            "author": "rtmesuper"
        },
        {
            "level": 0,
            "comment": "How is this funny?",
            "score": 49,
            "author": "TheNobleCannibal",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Bodies. That’s what is in the cave. Oh, and free scuba gear also.",
            "score": 15,
            "author": "mynaneisjustguy"
        },
        {
            "level": 0,
            "comment": "Funny? No.\n\nI had never realized how dangerous cave diving is. Then I started listening to Mr. Ballen.\n\nCue a new ultimate fear - now it is open water and underwater cave diving.",
            "score": 15,
            "author": "existingfish",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you like ballen, you should check out Divetalk. They are expert divers that talk about all the diving accidents and their own experience. They even cover some of ballen's videos.",
                    "score": 8,
                    "author": "pandorum8888"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's in the cave? The corpses of a bunch of people who wondered \"What's in the cave?\" and let their curiosity get the best of them.",
            "score": 12,
            "author": "SpeedBright3671",
            "replies": []
        },
        {
            "level": 0,
            "comment": "MUTHERFUCKER **IF** YOU COME PAST THIS SIGN. **YOU.ARE.FUCKED**",
            "score": 10,
            "author": "andio76",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's pretty straightforward. If people ignore it that's on them.",
                    "score": 6,
                    "author": "pandorum8888"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mr. Ballen does a great podcast about this place. Reaffirmed why I don't scuba dive or fuck with water over 10, ESPECIALLY not in caves.\n\nHEED THE SIGN",
            "score": 10,
            "author": "Darkflyer726",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi, sorry I’m just curious but what does “water over 10” mean?",
                    "score": 3,
                    "author": "MysticHentron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "10' ***  means 10 feet in the US. So about 2.5 meters?\n\nI don't like deep water",
                            "score": 4,
                            "author": "Darkflyer726",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ahh gotcha. Yeah if I were to ever put on scuba gear I would STRICTLY stay in the reef lmao",
                                    "score": 4,
                                    "author": "MysticHentron",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is deadly serious.  Many people have died in this cave.\n\nIIRC, until recently it has been completely sealed up.",
            "score": 31,
            "author": "CaptainHunt",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Zoinks!!! I’m outta here!",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "What in this cave? Obviously it’s something worth dying for. Nice try Sign!! *proceeds past sign*… *dies*",
            "score": 9,
            "author": "Weary_Swordfish_7105",
            "replies": [
                {
                    "level": 1,
                    "comment": "literally lmfao like everyone’s saying “well now i wanna go in” go ahead dumbass lmfao see if you come out with or without training, chances are very slim. 💀",
                    "score": 7,
                    "author": "OrdinaryAd8655",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dumbasses removing themselves from the gene pool should be encouraged.",
                            "score": 5,
                            "author": "Ad4mCB",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "here here! i second this.",
                                    "score": 4,
                                    "author": "OrdinaryAd8655"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bodies. Over 300 of them apparently.",
            "score": 8,
            "author": "Mooshitup"
        },
        {
            "level": 0,
            "comment": "Death is in that cave if you don't know what you're doing. Cave diving is about as dangerous as it gets in the SCUBA world. Hell even professional cave divers die every year. I love the videos they shoot though.",
            "score": 7,
            "author": "Catman762"
        },
        {
            "level": 0,
            "comment": "I believe there is at least one dead body in there. He died after not being able to find his way out and it has been deemed too dangerous to try to retrieve him.",
            "score": 8,
            "author": "SirFlannel"
        },
        {
            "level": 0,
            "comment": "Chilling just to think of how many lives that single sign saved.",
            "score": 8,
            "author": "The_Cometeer"
        },
        {
            "level": 0,
            "comment": "What's in there? No way to the surface if one of a hundred things goes wrong.\n\nSource: Scuba diver with specialised courses in Wreck and Deep diving. Wanna know why I've never done the Cave Diving course? Don't have a death wish.",
            "score": 8,
            "author": "cruiserman_80"
        },
        {
            "level": 0,
            "comment": "What’s in there?  Disorientation, complete blackness if your light goes out, one-inch visibility if your fins stir up sediment on the bottom, loss of all sense of direction and which way is up or down or the way out, rising fear turning into abject panic just before your horrific choking death as your air runs out and you tear off your mask and claw your fingernails off on the cold stone walls trying to dig your way out in one final futile attempt at self-preservation.\n\nThat’s what’s in there.",
            "score": 8,
            "author": "Tedroe77",
            "replies": [
                {
                    "level": 1,
                    "comment": "That definitely sums it up. Drowning is a horrible way to go. There was a diver who chose to stab himself in the chest rather than drown when he realized he wasn't getting out.",
                    "score": 3,
                    "author": "pandorum8888"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[MrBallen Eagle’s Nest](https://youtu.be/U9en1PDgpAI)\n\nEdit: story starts around 6:02",
            "score": 5,
            "author": "MrAssMcMan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm a decently experienced scuba diver, not a professional but I have friends that are. When the folks I know who are master divers say things like \"fuck cave diving I will never do that shit\" I listen. \n\nI don't want to die underwater.",
            "score": 5,
            "author": "SpiritOne"
        },
        {
            "level": 0,
            "comment": "  \nThe sign is put up to tell casual scuba divers to turn around and go back.  Cave divers who have studied maps and are aware of the conditions can proceed, but everyone else needs to go back.   \n\nAt a certain depth, you need an equipment called a rebreather and a special mix of air to go further.  This causes nitrogen to build up in your blood.  as you leave the cave, you need to make long stops to give your blood time to decompress so the oxygen can safely leave.  These stops can take many, many long hours.  If you go down without the rebreather and the nitrox, first, you get all goofy heady and then you die.  \n\nIf you spent time down in scuba gear and your blood started to compress, you wouldn't have enough time to decompress on your regular air and you can die of the bends, when the nitrogen separates too quickly in the blood and forms large bubbles.  \n\nBesides problems with the air, some caves are just too dangerous.  Rock collapses and strong water currents can be unsafe.",
            "score": 7,
            "author": "Intelligent_Stop5564"
        },
        {
            "level": 0,
            "comment": "Not funny at all. Caves can often be deep. Feeding into the affects of nitrogen narcosis. People think they can glance in and be fine and go to far and drown. Get caught up in restrictions. Drown. Not have have enough gas. Tri mix or staged. Fuck you can get silted by just using a OC system. Please don't dive caves unless you are trained. Source cave certified diver.",
            "score": 6,
            "author": "CUMRONK"
        },
        {
            "level": 0,
            "comment": "Used to do some caving back in the day. Some folks in that circle also did cave diving, and each one could name several people they knew who died doing it. Definitely no joke.",
            "score": 5,
            "author": "CoreComplex"
        },
        {
            "level": 0,
            "comment": "There is something hidden in this cave. Trust me I've played many rpg back in the 90s",
            "score": 14,
            "author": "tomauswustrow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sure, but you need to be high enough level to find it or else you’ll just corpse back there",
                    "score": 6,
                    "author": "jintana",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This went from \"haha funny sign\" to \"holy shit don't fuck underwater caves\".  Some pretty eye opening comments in here.",
            "score": 6,
            "author": "BboyIImpact"
        },
        {
            "level": 0,
            "comment": "If I get to the point where I can read this sign, then something has already gone drastically wrong.",
            "score": 5,
            "author": "Turbulent_Albatross9"
        },
        {
            "level": 0,
            "comment": "This is not really funny at all though",
            "score": 5,
            "author": "gigi2945"
        },
        {
            "level": 0,
            "comment": "If I saw that while scuba diving at the bottom of the ocean I think I would actually poo myself",
            "score": 4,
            "author": "RayPetersonn"
        },
        {
            "level": 0,
            "comment": "this is not funny in any way",
            "score": 6,
            "author": "chestpainsallnight"
        },
        {
            "level": 0,
            "comment": "This is not a funny sign. This is a sign warning people that beyond that point, the odds are anything but in their favor.",
            "score": 5,
            "author": "CourtZealousideal494"
        },
        {
            "level": 0,
            "comment": "I used to do cave exploring and those signes me serious business because they are there for a reason. By judging with that one under water the person who put it there went through a lot of trouble putting it there because it actually does get dangerous. Reminder take cave signs like these serious even the most experienced people listen to those signs because they will know its dangerous only the fools go past those points.",
            "score": 4,
            "author": "Taylor_The_Kitsune"
        },
        {
            "level": 0,
            "comment": "I do not see what is funny, that genuinely warns of an actual very real danger",
            "score": 5,
            "author": "awesometim0"
        },
        {
            "level": 0,
            "comment": "r/lostredditors",
            "score": 13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Same sign at Morrison springs. Too many novice divers still think they can cave dive",
            "score": 4,
            "author": "RomaAngel"
        },
        {
            "level": 0,
            "comment": "Water",
            "score": 3,
            "author": "Ishigami_dead",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dead bodies feeding the fish. That's what in the caves. The fish are going to eat you face and hands first as that is what is exposed the most.",
            "score": 4,
            "author": "CmdrSelfEvident",
            "replies": [
                {
                    "level": 1,
                    "comment": "yep. and then your bones will sit there, on the floor of the cave, forever &amp; ever.",
                    "score": 5,
                    "author": "OrdinaryAd8655"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This sign is in a cave in Mexico.  The funny part is it is written in English.",
            "score": 3,
            "author": "NemeshisuEM",
            "replies": [
                {
                    "level": 1,
                    "comment": "The sign is in quite a few different caves as it turns out. My dad and older brother are both recreational cave divers and have seen 3 (including one in Mexico) There most recent sighting was in Florida ( Devils Den ) another one at Eagle's Nest Sinkhole: also in Florida.",
                    "score": 7,
                    "author": "Noahman90"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Treasure. Go and report back but before you go let me get your info for a life insurance policy on you.",
            "score": 4,
            "author": "MeAndMy3BestFriends"
        },
        {
            "level": 0,
            "comment": "I've been to that sign (or one that looks exactly like it).  In Mexico at a cenote dive called \"Dos Ojos\" (two eyes, since there are two surface opening that you can dive between).   Between the two cenote access points there is a cable to follow through the darker areas.  This sign is posted where the cenote goes back into many hundreds of feet of dead end caves and connecting passages that are very easy to get lost in.  \nIf I can find it I'll post a picture of me behind this sign.  It's from 2000 or 2001 so it will take me a while.",
            "score": 4,
            "author": "shiny_brine",
            "replies": []
        },
        {
            "level": 0,
            "comment": "No. I think they are being dead serious.",
            "score": 3,
            "author": "WolfSong1929"
        },
        {
            "level": 0,
            "comment": "YOU CAN'T TELL MEEE WHAT TO DO!! I'm going in there!!\n\nOn the 18th of Nopever, when I'm out in TOO MUCH WATER, doing something I'd NEVER do, like diving.",
            "score": 4,
            "author": "Designer-Mirror-7995"
        },
        {
            "level": 0,
            "comment": "Many have died in this location. One place I wouldn’t wanna visit.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Dead bodies. That’s what’s in the cave. Did you not read the sign?!",
            "score": 4,
            "author": "CleverMsCarter"
        },
        {
            "level": 0,
            "comment": "There's a simple sign 2 miles into a hike at the entrance to a beach. Said something along the lines of \"Danger! Do not swim! Lives Lost:\" with tick marks..there were a dozens.",
            "score": 5,
            "author": "WittyMime"
        },
        {
            "level": 0,
            "comment": "Why is this on funny signs? It’s not funny, it’s terrifying.",
            "score": 3,
            "author": "KatieROTS"
        },
        {
            "level": 0,
            "comment": "There used to be a sign near the top of Yosemite falls trail that said: \n“Do not climb over the railing. If you go over the railing you will fall and you will die, there is no coming back. Do not climbing over the railing.",
            "score": 4,
            "author": "Konstant_kurage"
        },
        {
            "level": 0,
            "comment": "r/lostredditors\n\nEDIT: This is by no means a funny sign, people like you laugh at this sign while cave diving. The only difference is they are dead, you are (presumably) are not. This is a sign that is talked about on Dive Talk on YouTube many people have died because they willingly ignored this sign.\n\nI can admit that the reaper is a bit much. -_-",
            "score": 4,
            "author": "ARedPandaZ"
        },
        {
            "level": 0,
            "comment": "The silt is what kills ya. I mean, *technically* the drowning is what kills ya, but silt makes you blind, and that makes even some seasoned divers panic.",
            "score": 3,
            "author": "Yah_Mule"
        },
        {
            "level": 0,
            "comment": "As an illustrator the opportunity to illustrate for signs like this would be fascinating, because it’s the one time you’re SUPPOSED to drum up fear and avoidance. \n\nI would love to see how haunting people could make this signage with just the black-and-white (no greyscale) color scheme.",
            "score": 5,
            "author": "GreenStrawbebby"
        },
        {
            "level": 0,
            "comment": "Tbh it's not that funny, it's sad.\n\nIt's only like that because it's *trying* to convey the truth, cave diving is soo dangerous and it's just tryna save lives.",
            "score": 4,
            "author": "-STARBOUND-"
        },
        {
            "level": 0,
            "comment": "Corpses",
            "score": 4,
            "author": "onizuka_master"
        },
        {
            "level": 0,
            "comment": "The illustration is metal AF",
            "score": 7,
            "author": "MuckRaker83",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Probably just could collapse or gets narrow and people can get stuck and die. Wouldn’t be the first time it’s happened in a cave. It’s people who think signs like this are funny who would do it and die 🙄",
            "score": 3,
            "author": "tpeandjelly727",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There's nothing in the cave but near certain death. Hence, you know, the sign.",
            "score": 3,
            "author": "gilded_lady"
        },
        {
            "level": 0,
            "comment": "They’re serious",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Not funny. This sign is trying to keep people from dying due to getting stuck in the caves.",
            "score": 3,
            "author": "Poopybut58"
        },
        {
            "level": 0,
            "comment": "Where funny?",
            "score": 3,
            "author": "Just_Goose95"
        },
        {
            "level": 0,
            "comment": "Just send a ROV or an RC submarine.",
            "score": 3,
            "author": "CHESE_WEGD"
        },
        {
            "level": 0,
            "comment": "Dead bodies",
            "score": 3,
            "author": "Sorandy13"
        },
        {
            "level": 0,
            "comment": "...A noteable lack of breathable air.",
            "score": 3,
            "author": "Troy-Dilitant"
        },
        {
            "level": 0,
            "comment": "I don't care what's in that cave. I'm not going. Haha",
            "score": 3,
            "author": "zerodarkpizza"
        },
        {
            "level": 0,
            "comment": "What is funny about this sign?",
            "score": 3,
            "author": "ijustlikethecolors"
        },
        {
            "level": 0,
            "comment": "Dead people that didn't read the sign I assume. \n\nCave diving is for real super dangerous even with training.",
            "score": 3,
            "author": "Shoo-Man-Fu"
        },
        {
            "level": 0,
            "comment": "Nothing funny about this.",
            "score": 3,
            "author": "thesativasam"
        },
        {
            "level": 0,
            "comment": "So that’s where DB Cooper hid his money",
            "score": 3,
            "author": "ThePeriduan"
        },
        {
            "level": 0,
            "comment": "Death, that’s what is in the cave",
            "score": 3,
            "author": "Responsible-Beat-746"
        },
        {
            "level": 0,
            "comment": "Go check out dive talk on YouTube if you want a good history of this sign, and the many tragic deaths that have occurred. It's wild.",
            "score": 3,
            "author": "mooseyjew",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not to be that guy, but... whats funny about this sign? Genuinely asking because I didn't even crack a smile. Is there a joke here? A misconception? I don't get it",
            "score": 3,
            "author": "cadypants"
        },
        {
            "level": 0,
            "comment": "Yeah, as others have said, this one’s 100% serious. Many divers have been lost to caves like that.",
            "score": 3,
            "author": "theswissghostrealtor"
        },
        {
            "level": 0,
            "comment": "As a genuinely curious person, can someone explain what they find funny about this sign?",
            "score": 3,
            "author": "AlecTr1ck"
        },
        {
            "level": 0,
            "comment": "This is clearly the kind of sign you put as a last barrier so people don't find your treasure.",
            "score": 3,
            "author": "Illustrious_Mind964"
        },
        {
            "level": 0,
            "comment": "Didn’t know the simulation had out of bounds zones",
            "score": 3,
            "author": "xxxhotpocketz"
        },
        {
            "level": 0,
            "comment": "Cave diving: fuck around, find out.\n\nIn scuba cave and wreck diving, silt outs can be instantly deadly. When the silt kicks up there is no dive light strong enough to see; you are just shining a super bright light in a wall of dirt. And the crazy thing is it can be from your bubbles hitting the ceiling, so even if your fin kicks and buoyancy are dialed it the environment will screw you.\n\nNEVER let go of the guide line! Or better yet, NEVER EVER go in caves until you have thorough training from a pro.\n\nI’ve been in a serious siltout in my career and it was exactly like what others have said— it’s a black out mask drill inside an underwater cave. Scary AF. And this is with 2300+ dives experience….. and caving still is no joke.",
            "score": 3,
            "author": "jaxmikhov"
        }
    ]
}