{
    "id": "cxoz1h",
    "score": 11,
    "title": "Students at Carleton",
    "author": "acuttts",
    "date": 1567209465.0,
    "url": "https://www.reddit.com/r/CarletonCollege/comments/cxoz1h",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a senior in highschool. I think I like Carleton a lot and really want to go here. I have pretty bad SAT scores but the rest of my application is pretty good. My main question is are students at Carleton nice? Is it a place where people are happy? I've been reading the reddit threads and it seems so nice here. So yeah... also what is it like in winter?",
    "comments": [
        {
            "level": 0,
            "comment": "The students at Carleton are so genuinely nice it’s almost scary. We are super non/competitive and are very supportive and super kind to each other!\n\nAlso it’s very very cold up here in the winter, but it is manageable. You just need to buy good winter gear (LL Bean and Patagonia are both great)!\n\nIf you can come visit you should definitely check it out! You can see for yourself how nice we are.\n\n\nEdit: confused seasons somehow",
            "score": 9,
            "author": "support_create",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think you meant winter in the 2nd pgraph haha",
                    "score": 3,
                    "author": "chinnychenchen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You ever hear of Minnesota Nice? It's a real thing haha. People in town will smile at you and ask how you are like you've known for many years despite being a total stranger. And Carleton seems to find students who are like that as well (mostly). \n\nAnd winter isn't bad at all. It's cold, no doubt about it. But layering is your friend. And the summers actually get very hot and humid (I'm from LA and MN is worse). But the heat doesn't last long. \n\nLet me know if you have questions about anything!",
            "score": 7,
            "author": "bust3ralex",
            "replies": [
                {
                    "level": 1,
                    "comment": "I found people at Carleton to generally be nice, but that's not what Minnesota nice means. Or well it does, but you are missing part of it.\n\nMinnesota nice also means being nice to people to their face to avoid confrontation while not being nice behind their back.\n\nBut yes, I found most people to be nice as far as I could tell, and not very competitive given how many people were used to being one of the smartest in the room in highschool.",
                    "score": 6,
                    "author": "grepper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can see that being the definition of Minnesota Nice. Personally, that's not how I've interpreted it as or have used it. But I may need to change my ways; thank you for letting me know!\n\nAnd I definitely agree with your last paragraph",
                            "score": 1,
                            "author": "bust3ralex"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "UPDATE: THEY TOOK ME!!!!  I HONESTLY CAN'T BELIVE IT",
            "score": 3,
            "author": "acuttts"
        },
        {
            "level": 0,
            "comment": "just want to chime in that in my experience “carleton nice” is definitely real—it’s hard to describe how almost aggressively friendly people are. (of course, not everyone is nice all the time; there will always be people who suck sometimes no matter where)\n\na few stories to highlight: i have probably a hundred examples like this but these are what has stuck with me\n\ni’m not from minnesota, so the general friendliness here was a shock at first. in a ten minute walk across campus, i would be greeted/smiled at/waved to by like 7-9 people. there were bio partners from freshman year that i never had another substantial conversation with but we would always nod or say hi in passing, even years later. on days when i wanted to be a hermit, i found it annoying, but in general it was actually very lovely. \n\nthe janitors/facilities people who work at carleton are some of the absolute friendliest, kindest people in the world. one term i had a huge paper and was camping out in the library most nights working on it, always in the same place. i got to know one of the facilities workers who vacuumed that floor and we would chat a little bit whenever he came by. one night he must have sensed i was extra stressed because he brought me a granola bar and reminded me to get some sleep. i was touched that he would notice and think of my well-being \n\nonce i decided to get a jump on my homework before going out on a friday evening. i had to watch a movie that was reserved at the library. when i asked the student desk worker to help me find it, he spent a good 15 minutes looking around and helping me, but it was nowhere to be found so i left. a few hours later i was at a concert on campus and this same kid comes up to me breathlessly excited because he had kept looking and found the DVD after i left. this total stranger (joyfully!) approached me after hours just to let me know he’d found what i was looking for\n\none summer i was moving all my stuff across campus and it was sweltering hot. i was pushing a cart and had several very heavy boxes and suitcases. i had just a few hours off of work to move and was completely miserable with worry that i wouldn’t finish in time. a student i had never even met before drove past and then stopped to ask if i wanted any help. it took us half the time and i made it back to work with plenty of time to spare\n\nas a first year i was anxious about my writing, and one night before a deadline i dropped by the writing center for help. there weren’t any openings that night, but the consultant told me to stay just in case there was a no-show. i did, but to my dismay, everyone came for their appointments. but this consultant, a very busy senior, offered to stay after her shift—past midnight—to read it over for me. it ended up being really helpful and i was so amazed by her willingness to help me out even when she wasn’t getting paid for it\n\nsometimes there were these dramatic “nice” moments, but arguably, the small, everyday gestures made the biggest difference in giving me the sense i was part of an actual community. things like, sitting down to lunch with a group i didn’t know all that well and everyone actually introducing themselves and smiling at me. or someone holding the door open even if i was still awkwardly far away, just to be nice",
            "score": 4,
            "author": "yonicwave"
        },
        {
            "level": 0,
            "comment": "also, not having greek life and being as small as it is, there are just not enough people to have a super rigid social system or hierarchy. maybe this was just me, but even though there were definitely different social circles and friend groups, it never felt like any one group was at the top of a pyramid or that anyone was “too cool” or “too popular” to talk to. there were people i hung out with and people i didn’t, but there weren’t people i felt like *i couldn’t* hang out with because of social status. things felt really fluid and unpretentious in that way, which i’ve come to appreciate so much. i felt like i could basically go up to anyone and have a pleasant conversation, which was the polar opposite of my high school, where friend groups where very set in stone and cliquey.",
            "score": 1,
            "author": "yonicwave"
        }
    ]
}