{
    "id": "j7lit3",
    "score": 8,
    "title": "Carleton College Discord Server?",
    "author": "Jayden12945",
    "date": 1602191181.0,
    "url": "https://www.reddit.com/r/CarletonCollege/comments/j7lit3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey y'all! I'm a prospective student looking to come to possibly this college and a few others. I've been joining servers, and I haven't found one for this college yet (I accidentally found Carleton *University*'s gaming Discord, that's the closest I've gotten). So yeah, I'm basically looking for a community to meet you guys. I may stop by the campus sometime soon as well (I'm working on planning that out right now) so knowing someone over there may help a lot!",
    "comments": [
        {
            "level": 0,
            "comment": "There's no official Discord server for Carleton (that I know of).  I think admissions is working on other platforms specifically for prospies but those aren't as anonymous as Reddit or Discord.\n\nTo be honest, this sub is a pretty active community (though admittedly quite small).  Carls are pretty good at responding to questions here and I've gotten pm'd a few times with questions and have always made it an active effort to be a resource.  \n\nHope your visit to campus goes well!  Just know that you won't be able to get into any of the buildings and you'll have to be wearing a mask.  Beyond that, feel free to ask any person you see for their opinion; Carls are pretty good at welcoming prospies",
            "score": 7,
            "author": "bust3ralex",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your comment was removed because your account does not meet the karma requirement (10 karma) for this subreddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CarletonCollege) if you have any questions or concerns.*",
                            "score": 1,
                            "author": "AutoModerator"
                        }
                    ]
                }
            ]
        }
    ]
}