{
    "id": "ja19rx",
    "score": 3,
    "title": "How bad is the physical education requirement?",
    "author": "AustinTheNerd3",
    "date": 1602542437.0,
    "url": "https://www.reddit.com/r/CarletonCollege/comments/ja19rx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a prospective student, but the big thing that always turns me off a school is when it has physical education requirements. The good thing looking though the website is that there are some interesting classes. Could I really just do some club tennis, take a fencing class (something I already wanted to do), maybe bowling, and some random class and call it good?",
    "comments": [
        {
            "level": 0,
            "comment": "I've never seen anyone have trouble with the physical education requirement. I did Russaeborics, Winter Sports, and Hockey twice. Had a good time goofing about. I'm sure you'll find something you'll like, go out your comfort zone and take something weird.",
            "score": 10,
            "author": "LaserElite"
        },
        {
            "level": 0,
            "comment": "Honestly, the PE requirement ended up being one of the most important things at that school for me- it got me to take Contact Improv (shout out to Jane Shockley) which changed my life. I think they are something to be taken advantage of instead of worried about!",
            "score": 5,
            "author": "CryogenicMan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know this is a super old thread, but I was really wondering: What is contact improv?",
                    "score": 3,
                    "author": "_bear_force_one_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Contact Improv is a form of somatic practice and social dance that involves using your anatomical structure with other people to balance together, do lifts, and move around. It’s about a deep awareness of your body and the ability to read other people’s bodies through touch.",
                            "score": 3,
                            "author": "CryogenicMan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've never heard of that before. That's really interesting!",
                                    "score": 2,
                                    "author": "_bear_force_one_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, it's not so bad! Unfortunately bowling doesn't count (but you really should still come to bowling club, it's very fun), but the classes are great to get them, especially one of the options like bouldering which was super enjoyable. If you're someone who would consider trying club tennis anyway it really shouldn't be much of a big deal.",
            "score": 3,
            "author": "Flameserpent"
        },
        {
            "level": 0,
            "comment": "Yep, that’s all you have to do! Take four terms of PE (not just four PE classes all at once in your senior spring) and you’re all set. I took karate and had great fun; I have friends who really enjoyed their dance classes and it seems like you’re already excited about some of the other options!",
            "score": 2,
            "author": "FTLGOD"
        },
        {
            "level": 0,
            "comment": "So I actually haven’t started my PE requirement yet (oops...) but my friends say it’s actually pretty flexible! One is taking a Zoom yoga class right now that doesn’t even require cameras.",
            "score": 2,
            "author": "bleachboysbaby"
        },
        {
            "level": 0,
            "comment": "I did modern dance and yoga and played a club sport! It’s absolutely not intense, and it can be really refreshing.",
            "score": 2,
            "author": "awesomeisbubbles"
        },
        {
            "level": 0,
            "comment": "Honestly, I hate sports but I've enjoyed most of my PE classes.  You can 100% take any PE class (just do one per term) and you'll get it.  Pro tip- try social dance, it's actually a ton of fun and it's usually taught by other students!  They were super nice to me when I had knee issues and ended up sitting out like half the classes.",
            "score": 2,
            "author": "m7star2000",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your comment was removed because your account does not meet the karma requirement (10 karma) for this subreddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CarletonCollege) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "highly recommend taking tai chi or one of the student taught PE classes like intro frisbee. very laid back and not at all stressful for those of us who are not sporty",
            "score": 2,
            "author": "yonicwave"
        },
        {
            "level": 0,
            "comment": "I took swimming (which I did in high school but didn't end up doing varsity swimming in college so this was a great option for me), plus social dance, modern dance, rock climbing, and ballet at various times.  I really enjoyed all of them, honestly.",
            "score": 1,
            "author": "AMHeart"
        }
    ]
}