{
    "id": "kco6lp",
    "score": 20,
    "title": "New Student, From outta state.",
    "author": "roserozayy",
    "date": 1607911445.0,
    "url": "https://www.reddit.com/r/CarletonCollege/comments/kco6lp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone my sister received a scholarship from Carleton, we’re from houston to so this is a far departure for her but we’re excited. I had a couple of questions for some current students or alumni‘s.\n\n1. I read that no vehicles we’re allowed, since she’s moving so far I was hoping she could keep a little car errands and emergencies.\n2. She’s graduating high school with an associates degree so would she considered a first year student?\n3. I guess this goes with the earlier question but with housing can she request a private room or get one.\n4. How is the campus life? I’m her brother and I went to college here in tx and enjoyed it I’m a little excited for her to experience it but I’m nervous that’s she’s going so far so I wanted to know.\n\nAnd thanks to anyone who replies!",
    "comments": [
        {
            "level": 0,
            "comment": "Hey, ‘13 grad here so my info could be a bit out of date. \n\n1. Cars were pretty discouraged. There was a program for hourly rentals of cars for general use that was pretty reasonable iirc. You can apply for a parking permit and I feel like there were different tiers based on the reason you had the car. \n\n2. Carleton does not accept credits from very many other colleges, and AP course credits were dodgy too. So that associate’s is probably not going to apply. Obviously it would be a case by case basis but as a general rule, it’s a 4 year school. I knew a couple people who did it in 3 and they had to apply to graduate early and pretty much all they did was homework, no extra curriculars. Admissions office could give you specific info for this. \n\n3. There are VERY few singles on campus and campus housing is required. If there was a medical reason she needed a single I’m sure they can do something but otherwise there will be roommates. Making friends is hard enough not sure why you wouldn’t want some company?? \n\n4. This is a little too general, but there’s activities most nights and clubs and a shitload of homework to do — library is always bumpin.",
            "score": 4,
            "author": "awesomeisbubbles",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi thanks for responding and replying to your response to question 2, when I was living on campus I had my own room but there was 4 of us sharing a livingroom and two bathrooms. So I was wondering if y’all had something like that. \nI was hoping that Carleton would accept her degree because she worked so hard and this was the end goal for her.",
                    "score": 1,
                    "author": "roserozayy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some of the upperclassman dorms have suites like you’re describing, but most are the standard one room, two people dorm",
                            "score": 2,
                            "author": "bleachboysbaby",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay! And I guess she’ll have to see if they would accept her degree.",
                                    "score": 1,
                                    "author": "roserozayy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Unfortunately like the other poster said, Carleton is pretty much a 4 year deal. According to [this](https://apps.carleton.edu/campus/registrar/catalog/current/priorcreditpolicy/) page, the most we accept is 36 credits, which is the equivalent of 6 classes at Carleton",
                                            "score": 4,
                                            "author": "bleachboysbaby"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey! Happy to hear she’s considering Carleton! \n\n1) No first years cannot have a car on campus. However we have a taxi service and a shuttle as well as typically (not this year because COVID) a car rental company. So she will be able to get around for errands for sure.\n2) She will be considered a first year. Only a max of about 30 credits (or 5 classes) could be accepted pre-matriculation, and those usually aren’t for associate’s degrees. People who come into Carleton take four years to leave, probably about 95% of the time. And those who don’t, it takes them a term or two longer, rarely a full year, and very rarely taking only 3 years to graduate, as that’s just not the structure. \n3) Unless she has a documented disability where she requires a private room, she will be placed in a room with one or two roommates her freshman year. You won’t be able to get around it, and it’s generally a great match most of the time and even when not it goes well. Also with this, dorms do not have private bathrooms (except for upper classmen-heavy dorms) so don’t expect that either.\n4) Campus life is great! We actually have a lot of people from Houston every year thanks to Posse, which also provides a great community for them. People are super nice and genuine here, and it’s been a great time. It of course varies by person whether you love it or not, but I definitely do. There’s a big emphasis on community here too.\n\nAlso good to note is only about 1/3 of the class (probably close to 1/5) of each year is from MN, Carleton is a very out of state-heavy school. I and most of my friends are not from MN, so she shouldn’t feel weird at all about being out of state, as most of us are (or even not from the US)!",
            "score": 3,
            "author": "support_create",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi and thanks for your response! She’s actually a received the scholarship from posse! And wow the car rule is a first and a little weird. And I just had my own room and loved it, I still had roommates that shared a living room and bathrooms.",
                    "score": 3,
                    "author": "roserozayy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The way dorms work here is pretty different, so I doubt she would have a setup like that until senior year. And the car thing is mainly because we have very limited parking (think maybe 300 spots and 2000 students) and you really really don’t need a car since it’s a small town. For reference, I go into town about twice a week for medical appointments and do not have a car. Also that rule is only for first years. She can apply to get a parking permit starting her sophomore year",
                            "score": 1,
                            "author": "support_create",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s still weird I went to school in a small town and as long as you paid for a parking pass you was good but I guess everywhere is a little bit different.",
                                    "score": 2,
                                    "author": "roserozayy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s not unusual at all for freshman to not be allowed cars",
                                            "score": 1,
                                            "author": "Auntie-Noodle"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did they change their policies or something? I had a car all four years",
            "score": 2,
            "author": "CarletonMDs",
            "replies": [
                {
                    "level": 1,
                    "comment": "They changed the rule for this school year because they were running out of enough spots. They had to give students extra spots in the Rec center lot last year and sometimes I had some trouble finding a spot",
                    "score": 2,
                    "author": "catpOtatO_"
                }
            ]
        }
    ]
}