{
    "id": "ntz839",
    "score": 19,
    "title": "What do you like to do for fun on a weekend night on campus?",
    "author": "yvngblasianite",
    "date": 1623024134.0,
    "url": "https://www.reddit.com/r/CarletonCollege/comments/ntz839",
    "media_urls": [],
    "other_urls": [],
    "postText": "Pre covid you could most always find me at some random off campus house, mostly Porch or Goat, and next year I am excited to repeat that debauchery.  Either that or cheefing hella in the beautiful  Carleton Cowling Arboretum. \n\nWhat do y'all enjoy doing to relieve the stress forced upon you by  a Carleton education? What  will you do  to celebrate the ending of finals tomorrow?",
    "comments": [
        {
            "level": 0,
            "comment": "Smoking pot in the arb lmao",
            "score": 17,
            "author": "Epicmuffinz"
        },
        {
            "level": 0,
            "comment": "Eat an absurd amount of chicken tenders at Sayles. If I were still there, get lost in the Arb more, fun times.",
            "score": 10,
            "author": "LaserElite"
        },
        {
            "level": 0,
            "comment": "Karaoke and horror movies in memo lounge with peps equipment",
            "score": 10,
            "author": "bust3ralex"
        },
        {
            "level": 0,
            "comment": "p0rxh",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It depends on the season. My friends and I in winter loved sledding and ice skating. We would also watch movies and play pool.  It's really what you make of it",
            "score": 3,
            "author": "Flamingo_Necessary",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your comment needs to be approved before publishing because your account does not meet the karma requirement (10 karma) for this subreddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CarletonCollege) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator"
                }
            ]
        }
    ]
}