{
    "id": "rkh9c8",
    "score": 13,
    "title": "How is Carleton’s Geology Program?",
    "author": "Bashslash",
    "date": 1639984061.0,
    "url": "https://www.reddit.com/r/CarletonCollege/comments/rkh9c8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Looking at other LAC’s, their geology programs don’t really seem that extensive and don’t really go beyond just like types of geology (ie. Petro or mineralogy). Looking for any specific experiences regarding it, like if there’s other schools involved in the major or specific programs or classes for research",
    "comments": [
        {
            "level": 0,
            "comment": "Geo major here. Carleton’s geology program is considered to be one of the best out there for good reason. There’s a decent range of classes, and while some can be tough, you’ll find what you’re good at. Get to know the professors- they’re all great people and teachers IMHO and will help you out if you ask. There are research opportunities if that’s what you want to do. I don’t know how familiar you are with comps, but the geo comps often involves research over summer or winter break with grant funding from your advisor. There are also study abroad opportunities, most notably in New Zealand.\n\nAs far as the major, the actual requirements are pretty minimal- 6 upper level geo classes, physics, chem, and two math classes. If you’re serious about it, you’ll end up taking way more than that.\n\nAll in all, I highly recommend the geology program. Of course you don’t have to commit to the major right off the bat, but try to take intro and a couple 200s your first year to get a feel for the major and for the sub-disciplines and professors you like. Geology is really an umbrella term for many related disciplines, and while I like taking as many classes as possible, you’ll find yourself drawn to some more than others. \n\nLet me know if you have any more questions!",
            "score": 20,
            "author": "fish_and_chisps",
            "replies": [
                {
                    "level": 1,
                    "comment": "The geology program being good is a common thing I’m hearing so that’s good to hear, any specific programs that catch your eye? Or study opportunities",
                    "score": 1,
                    "author": "Bashslash"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m not a Geo major, but I have learned that Carleton is literally one of the top schools for Geology in the entire U.S. If you go into the field of Geology, EVERYONE knows and respects Carleton. The profs are super high quality, the rate of geo majors getting into grad programs are sky high, and even non-geo majors enjoy the classes immensely. As others have said, I highly recommend Carleton if you’re considering geology!",
            "score": 3,
            "author": "support_create",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gonna ask you some stray questions then\n\nAnything about the school spirit or the general student community? Really value a close knit community with decent sports/has some stray stuff in choir programs (other interests I have besides geology).\nHow distinct is the campus compared to the surroundings? I’m aware it’s near Minneapolis, but how isolated is the campus?\nHow do the administration honestly address race/cultural issues and how do students hold them accountable?\nHow are clubs?\nHow preppy is the school?",
                    "score": 1,
                    "author": "Bashslash"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not a geo major but i took an  geo class  this fall. The proffesors KNOW what they are doing and are amazing. The geology department is probably the most \"slept on\" department in the school. Some facts about Carleton geo is that 1% of all geologists in the field got their degree from Carleton. Think about that! Carleton is such a small school but is punching above it's weight. Also geo majors are the highest paying job out of undegrad of any of the majors. Finally, Minnesota has a very rich geological history so you can really studying rocks in your backyard. Highly recomend Carleton. You should email admissions and ask to get put in touch with students in the geo department. They are probably the friendliest.",
            "score": 2,
            "author": "Alternative_Bendd"
        },
        {
            "level": 0,
            "comment": "Historically it’s graduated more women majors than any other Geology program in the country - don’t know if that’s still the case, but it speaks to the strength and inclusivity of the program. Carleton is also one of the best colleges at preparing students for graduate work, so if your career trajectory indicates more than a BA, it puts you in a great position.",
            "score": 3,
            "author": "Dubiousnessity"
        }
    ]
}