{
    "id": "trxhyj",
    "score": 7,
    "title": "Benefits of a small school?",
    "author": "hope-dream",
    "date": 1648611802.0,
    "url": "https://www.reddit.com/r/CarletonCollege/comments/trxhyj",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m deciding between a Big 10, midsize R1, and Carleton. Night and day :) Wondering if you like Carleton’s small size and why?",
    "comments": [
        {
            "level": 0,
            "comment": "Tons of benefits:\n\n1. Faculty know your name, actively teaching every class themselves, care about teaching, and in many cases invite undergrads to participate in their research.\n2. A strong sense of community. Everyone is right there on campus. People have chosen to be there rather than gone with the default options, so they are invested there. You will regularly run across people you know from classes etc. giving a chance for lots of friendships to naturally develop.\n3. Paradoxically with Carleton’s small size there are usually too many things to do. This is because of the high levels of engagement and the fact that people don’t just kinda wander off on the weekends.\n4. No fraternities. Unless you are really into Greek life this is a big positive because it keeps campus life from being overly cliquish and party centric. Not to say there aren’t parties at Carleton — there are lots. But social life is not solely frat style blowouts.\n5. Standing out post graduation. You would be one of thousands graduating from bigger schools, and it might be hard to distinguish yourself. Many (not all, for sure, but many) employers and every grad school in the country will sit up if they see Carleton because they know that you can’t coast through it.\n\nI could go on but those are some benefits off the top of my head.",
            "score": 14,
            "author": "zoinkability",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with all of this but it’s super important to think about points of reference as well. I came to carleton from New York City and it’s been a hard transition. If you’re used to a small, quiet town, where all the restaurants besides dominos close before 8pm, then I wouldn’t worry at all and going to a small school is only going to make your experience better. But, if you are used to diverse food options, nightlife, and a town with more than one street to shop on, then you may want to weigh your options. I definitely find that I’m on one extreme of the spectrum, so don’t let this scare you, but the one unanimous criticism of Carleton and Northfield is the food is not the best and the limited options in town exacerbates that.",
                    "score": 7,
                    "author": "drforlife12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, for sure. Those are probably the biggest drawbacks to Carleton or likely any small-town school like Grinnell, Oberlin etc. Even a bunch of big 10 schools are basically big schools in a small town without a real city experience. If someone is looking for a city experience for college they probably should limit their search to urban campuses.\n\nIf OP wants an urban-ish experience at a small school, some options would be Macalester, Swarthmore, Reed, and Pomona. Having talked with a bunch of alums of these schools, though, I would say that there is a real tradeoff, where many of the students scatter into the city for their social life, so you don't get nearly as much of a strong on-campus life.",
                            "score": 9,
                            "author": "zoinkability"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "One often overlooked aspect is how much easier it is to navigate the bureaucratic side of college at a smaller school vs a bigger one. It's not a flashy or fun category, but it can have significant impact on your daily life, especially when issues pop up. At Carleton, if you have a problem you can pretty much waltz into an office and talk face to face with someone about it. There's one library and all library resources are there and easy to find; there's one housing office, one registrar in charge of class registration, etc. At a big ten school, there may numerically be more resources on campus, but you will have to do a lot more legwork of first identifying what resources exist, where they physically are on campus, puzzling out who you need to get ahold of to talk to about it, and then actually reaching them to solve the problem. Plus, at a bigger school there may be more resources overall, but also more people competing to access and use those resources.\n\nFor example, my sibling went to an R1 and had a problem with her roommate that urgently required a change of room, and it took several weeks of persistent calling, waiting and frustration to get her connected with someone who could make the change so she could actually leave. She felt like she was getting the runaround and everyone told her she needed to call someone else. Ultimately I think my mom had to call and be sort of aggressive before it happened because single rooms were in short supply on campus. \n\nA question to ask yourself is how independent are you? Are you someone who will go the extra mile to seek out resources when you're having a issue? Will you be super proactive in finding resources if they aren't immediately available to you? Some people are suited to the \"sink or swim\" vibe of a huge school and others (like me) will do better with more visible resources and support. \n\nThe one other thing I'll say is socially, while the dining options are more limited at a smaller school, only having 2 dining halls and the student center mean that you will almost always be eating with friends, or bump into someone you know to eat with. And when you are stressed out with lots of homework that is a HUGE way of releasing stress. I was surprised to learn when I spoke with friends from R1s that they all ate lunch alone or with one person more often than not. Some people would not mind that at all, but I met a ton of interesting and fun people over meals at the dining hall over the years, and wouldn't trade it for the world. Would it have been nice to have more dining options? Sure, but to me the trade off was really worth it and I think it contributed to a feeling of community.",
            "score": 7,
            "author": "yonicwave"
        },
        {
            "level": 0,
            "comment": "It really worked for me at creating that hogwarts effect. Just going about your day you see so many people you know and can say hi to. You meet someone new and you’re basically guaranteed to have mutual friends. I get that that could feel a little claustrophobic for some people, though",
            "score": 4,
            "author": "Epicmuffinz"
        },
        {
            "level": 0,
            "comment": "Thank you all, this is such great feedback 🙏🏼",
            "score": 2,
            "author": "hope-dream"
        },
        {
            "level": 0,
            "comment": "what big 10 school?",
            "score": 1,
            "author": "tygoldstein",
            "replies": [
                {
                    "level": 1,
                    "comment": "Michigan",
                    "score": 1,
                    "author": "hope-dream",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My sister is a sophomore at Michigan and I am going to Carleton next year for baseball. We went to a 4,000 kid Midwest high school and have very different personalities so I might be able help. Are you a junior?",
                            "score": 1,
                            "author": "Difficult-Gain-1774",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Senior, admitted student. How do you think personality influenced your decision?",
                                    "score": 1,
                                    "author": "hope-dream",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "She’s always been someone to put herself out there (she’s in a sorority) and socialize a ton while I’ve always one to build more meaningful connections. I think I would’ve done fine at a big school because there will always be a group that’s more laid back but i would be around more cliquey people which I’m tired of. I like being around extroverts usually more than other introverts and Carleton still has a lot of extroverts. I just needed something less cliquey",
                                            "score": 3,
                                            "author": "Difficult-Gain-1774"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}