{
    "id": "vussae",
    "score": 8,
    "title": "Help With College List",
    "author": "Select-Molasses9630",
    "date": 1657338336.0,
    "url": "https://www.reddit.com/r/CarletonCollege/comments/vussae",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone! I'm here because I am thinking about applying to Carleton for this upcoming admission cycle. I currently have 20 colleges on my list and am trying to narrow it down to around 10-12. I have limited knowledge of Carleton and would like to hear from current students about their time there. If possible, could some people give me an honest pro and con list on the different aspects of the college? You can discuss anything — weather, academics, social life, athletics, or dining. I am planning on registering for information sessions but would like the information not given at info sessions. Thank you so much for your help!",
    "comments": [
        {
            "level": 0,
            "comment": "I'll preface this by saying I loved my time at Carleton, but many small things left a bad taste in my mouth. I still encourage people to visit and go there, and I think most people can thrive there. I came out of it a better person, but good lord it took a lot of effort. Gonna do 5 each of pros and cons here. \n\nPros:\n\n* Good food! Despite what people say, I've been to a fair number of college and university cafeterias at this point, and Carleton is absolutely above average\n* At a small school, you get to have meaningful connections with professors and students in your major department. This did not happen for me in grad school at a large university--it was almost expected at Carleton. This is by far my favorite thing about Carleton. I live in Minneapolis now and I intend to visit and grab a drink with one of my favorite profs later this month\n* Big community events like Spring Concert, Late Night Breakfast, Rotblatt, and small ones like bagels at the library, convocations, and career center events really improve the college experience and are good breaks from studying--some rowdy, some productive, all fun.\n* Niche fascinating classes that you would only see at a liberal arts school. A music capstone on Motown, a geology class on the history of earthquakes and their human impact, and a deep dive into poetry by World War I soldiers were among my favorites\n* Small campus. You don't need a car, you don't even really NEED a bike, it's truly 15 minutes for an average walk across all of campus. \n\nCons:\n\n* Elitism. If you are low income or non-white, it's a hard place to be, no matter how inclusive they broadcast they are. Wealthy white students have a lot of learning to do, and my god there are a lot of them. There are thankfully student clubs and programs (TRIO, multicultural and foreign student clubs) to help you find community\n* It's challenging! This can be a pro at times, depending on your mindset, but I was near the top of my class in high school and Carleton hit me like a fucking freight train\n* nearly-mandatory dorm life. It's fun freshman year. It gets old by junior year. I was so lucky to live off campus my senior year\n* Strange schedule. I grew to like the trimester system, but my first year i was off-schedule with my high school friends and did not get to connect much with them.\n* Administration drops the ball on a lot of things, including sweeping sexual misconduct under the rug and failing to support marginalized groups. You'll find this is a problem at most institutions though--it's unfortunate.",
            "score": 7,
            "author": "IMP1017",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was extremely thorough! The only con I see out of these is the diversity and administration not caring for students. I think that will change because of the Roe v. Wade issue. the trimester system is the same as the safety I automatically get into so I cant be phased by that. I am definitely going to put it on my college list. I already applied to the fly-in program so we will see! Thank you so much!",
                    "score": 4,
                    "author": "Select-Molasses9630",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're welcome! I'd be willing to bet a lot of schools right now are in limbo because of Roe. I do think Carleton admin is signaling things pretty well post-Roe and I don't know anything about the current president, so it's possible the admin will shape up in the coming years. I personally think Carleton has an elevated level of responsibility when it comes to sexual misconduct because of it being a largely dorm-centric residential college, and they didn't always clear that bar. I also know that the student health center and the Gender and Sexuality Center were great comforts for people when I was there.\n\nBest of luck in the application process!",
                            "score": 1,
                            "author": "IMP1017"
                        }
                    ]
                }
            ]
        }
    ]
}