{
    "id": "10sspvn",
    "score": 14,
    "title": "Is 2 hrs on high, then 4-6 on low a thing?",
    "author": "dmbf",
    "date": 1675452151.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/10sspvn",
    "media_urls": [],
    "other_urls": [],
    "postText": "Making pork loin right now. The recipe said 8-10 hrs on low or 4 on high, but I forgot to start it until 10a. Would 2 hrs on high then 4-6 on low have similar results?\n\nWe have little kids and like to be done eating around 6-6:30, so we can get them to bed on time. If it weren’t for them, I’d just eat later.\n\nEdit: thanks all. I went for it and it turned out, um, well my family liked it. Haha. But it was the a good temp when it came out. That’ll probably be my go to method. \n\nFirst slow cooker meal that’s not soup or chili done!",
    "comments": [
        {
            "level": 0,
            "comment": "I have a crockpot that has a setting that does exactly this - two hours on high, then switches itself to low until it's turned off.  I use it a lot with good success.",
            "score": 16,
            "author": "missfishhooks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great. Thanks. I thought it sounded logical but I figured cooking something twice as hot for half the time sounds logical until people are corrected, haha.",
                    "score": 3,
                    "author": "dmbf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes. As a matter of fact I usually start it on high until all the ingredients are hot, and then drop them temp down to low.",
            "score": 7,
            "author": "EddieRyanDC"
        },
        {
            "level": 0,
            "comment": "I’ve done this before, especially if something haven’t quite thawed. A little on high, before switching to low.",
            "score": 3,
            "author": "thelaststarebender"
        },
        {
            "level": 0,
            "comment": "You can do the reverse, high temp at the end and get similar results.",
            "score": 3,
            "author": "ZuesLeftNut"
        },
        {
            "level": 0,
            "comment": "I’ve done the same thing, seems to work fine",
            "score": 4,
            "author": "123-for-me"
        }
    ]
}