{
    "id": "10unrxh",
    "score": 58,
    "title": "Beef vegetable and barley soup (recipe in comments)",
    "author": "Serene_brownmouse144",
    "date": 1675631790.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/10unrxh",
    "media_urls": [
        "https://i.redd.it/2z4hwo2yrfga1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Recipe:\n\n* 2 lbs beef stew meat trimmed of fat and cut into smaller pieces (I do not brown but you can if you like.  I have found if you slow cook this enough, the meat is tender and falls apart).\n* 2 32oz boxes of beef broth/stock\n* 1 pkg Wylers/Bear Creek beef veg soup starter (I think there is extra stock in these and thickeners)\n* 3 large carrots, peeled and quartered\n* 1/2 onion diced\n* 2 stalks celery diced\n* 4 small russet potatoes peeled and cut into bite size pieces\n* 1 cup barley (these help thicken and add a lot of body)  Fair warning, you might want to use 1/2 cup barley.  1 cup makes it almost a stew.  But our family likes thicker soups.\n\nCut everything up and throw in crockpot.  Cook on low for 8 hrs or high for 4 hours.",
            "score": 3,
            "author": "Serene_brownmouse144",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t want to knock what like, or your recipe, but the browning isn’t to help cook the meat, it’s just for the flavor. But I get not having to deal with another pot to wash, is why I switched from slow cookers to dutch ovens.",
                    "score": 4,
                    "author": "PonderFish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is also perfect in a dutch oven!  \n\nI do this one in the slow cooker if I have a whole day to wait on it.",
                            "score": 2,
                            "author": "Serene_brownmouse144"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No spices or flavorings?",
                    "score": 3,
                    "author": "Stillcant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Guessing the soup starter has a spice mix in it, op can you confirm if it was flavorful? I have never tried bear creek products. But this looks nice and easy, going to try it.",
                            "score": 2,
                            "author": "Crimson-Forever"
                        },
                        {
                            "level": 2,
                            "comment": "The soup starter already has seasonings and salt.  So there is no need to add additional salt.\n\nI DID add black pepper because we love black pepper.\n\nI usually add a bay leaf or two when I made soups but there is no need with this base soup starter packet.",
                            "score": 1,
                            "author": "Serene_brownmouse144"
                        }
                    ]
                }
            ]
        }
    ]
}