{
    "id": "11cytp7",
    "score": 8,
    "title": "Rubber foot is broken",
    "author": "WAFLcurious",
    "date": 1677460713.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/11cytp7",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have broken off one of the rubber feet from my slow cooker. This is the third one I have done that to over the years.  Well, the second I’ve done. I had help with the third. 😜  It happens when I carry it in my car. I try to slide it on the carpeting and the foot catches and breaks, leaving part inside. The cooker still works fine but I have to keep track of that little rubber piece to put under it each time. \n\nHas anyone else had this happen?  Has anyone found a glue that will work to reattach it?  I’m worried about the glue being safe with the heat it is subjected to. \n\nThanks.",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; I’m worried about the glue being safe with the heat it is subjected to.\n\nYou could use an automotive silicon sealant/bond. Stuff like JB Weld Red is made to withstand high heat.",
            "score": 10,
            "author": "WonderJouster",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the suggestion.  I’ll check into that.",
                    "score": 2,
                    "author": "WAFLcurious"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Once you fix the feet, you might consider purring your slow cooker in a cardboard box when you transport it.",
            "score": 8,
            "author": "kgiann",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah. Good idea. I have just been more careful about when I set it in there so I don’t try to move it without lifting it first. It’s so awkward, especially when full and heavy. My only concern with using cardboard is that it might slip around on it.\n\nEdit: I see now you suggested putting it into a cardboard box, not setting it on cardboard. That would eliminate slipping. Maybe I can find a low sided box that I can set the box in the car then put the cooker inside of it. That could work!  Thanks again.",
                    "score": 2,
                    "author": "WAFLcurious",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Put a towel down first. It keeps the slow cooker in place and is ready in case there's a spill.",
                            "score": 2,
                            "author": "kgiann",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Another great suggestion. Thanks again.",
                                    "score": 2,
                                    "author": "WAFLcurious",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're welcome",
                                            "score": 1,
                                            "author": "kgiann"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you can go to Costco or Sams Club they have boxes that have two high sides and two low sides. Lots of different products come in them and all sorts or shapes. They are terrible for actually toting anything home in but work great for transporting a crockpot! I use them to take mine to potluck all the time and you can just discard and get a new one if you do have a spill. They are extra heavy cardboard. You don't even need a membership to walk in the back way \"need to talk to customer service about a membership\" then just walking up to where they have all the discarded boxes to grab",
                            "score": 2,
                            "author": "DressingQuestion",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I grab the ones with four low sides to tote home the rotisserie chickens. I’ll have to check next time and see if the slow cooker will fit. Thanks.",
                                    "score": 1,
                                    "author": "WAFLcurious"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Remove the other feet and go with something like this:   Suzaboki 6 Pcs Silicone Trivets - Fondue Mats, Silicone Pot Mats for Hot Pots and Pans,https://a.co/d/7EPSemt",
            "score": 3,
            "author": "Shoddy-Ingenuity7056",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks. That looks like it might be handy for any number of occasions. And less expensive than the glues suggested which I seem to not have in my supplies.",
                    "score": 1,
                    "author": "WAFLcurious"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Permatex from the auto parts store would be a good bet. Make sure you clean both surfaces well and let dry before glueing.",
            "score": 2,
            "author": "bblickle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks. I’ll check into that.",
                    "score": 1,
                    "author": "WAFLcurious"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How were they previously attached, and have you looked online for replacement feet?  \n\nI have a \\~50-year-old KitchenAid mixer whose feet I recently replaced because the original ones' rubber got old/degraded enough to start leaving black streaks on my counter.  The feet were held on by screws through the center, and replacements (white, even) were an easy web search away.",
            "score": 2,
            "author": "Bibliovoria",
            "replies": [
                {
                    "level": 1,
                    "comment": "They are rubber pieces, cylindrical (I assume because I can’t see the interior portion) but with a narrower section in the middle. Apparently they are pushed through the small hole until the narrower section locks it in place. But the narrower section is apparently weak. \n\nI have not tried to find replacement feet online simply because slow cookers are so cheap (at least the ones I buy) that I assumed it would be less expensive to buy a new one unless I can glue the foot in place. That would not be the case with your Kitchen-aid, of course.",
                    "score": 1,
                    "author": "WAFLcurious",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair 'nuff!  I just did a quick search for \"replacement slow cooker feet\" and saw several variations that were under $7 for a set of four, so depending on your model (and your desire to replace your crock pot anyhow!) it might be worth a check.",
                            "score": 2,
                            "author": "Bibliovoria"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "LOL I was scrolling fast and thought this was an r/AskDocs post and had to go back to figure out how someone has a rubber foot.  Sorry about your slow cooker though",
            "score": 2,
            "author": "DressingQuestion",
            "replies": [
                {
                    "level": 1,
                    "comment": "🤣",
                    "score": 1,
                    "author": "WAFLcurious"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This isn't a permanent solution, but I'm also missing a rubber foot and I just put two shims together under where the foot is missing. It just makes the pot level. But that's what works for me.",
            "score": 2,
            "author": "all_the_freezies"
        },
        {
            "level": 0,
            "comment": "Sugru, it's a moldable polymer that dries upon air contact.  It's amazing.",
            "score": 2,
            "author": "No_Studio_7605",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Sugru\n\nI second this. Sugru is wonderful stuff, and it's safe around kitchen stuff. You can repair broken pot handles, make custom hooks, all kinds of things.",
                    "score": 2,
                    "author": "The_Original_JLaw"
                }
            ]
        }
    ]
}