{
    "id": "11ee7uh",
    "score": 8,
    "title": "A few beginner questions…",
    "author": "pesver27",
    "date": 1677604752.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/11ee7uh",
    "media_urls": [],
    "other_urls": [],
    "postText": "I always love making stews and curries and prefer meat melt-in-the-mouth (who doesn’t though). Wouldn’t mind trying soup also. And other things I usually eat like bolognese and pulled pork. I want to get a slow cooker but have a few questions before I do…\n\n- I don’t want to prepare in the morning. I just won’t have time. I’ve seen slow cookers with programmable timers, would this be a solution? So you put all the ingredients in the night before, set the thing to start the cooking process at a set time. I know I can also leave the pot in the fridge with all the ingredients in and then turn it on in the morning, but then I’m guessing I can’t sear meat?\n- Which leads me to: is searing the meat all that important? Again, some models allow this (either directly in the unit or take the pot out and do it on the hob).\n- If I turn on in the morning, and it doesn’t have a self-timer-off function, I’m guessing it will just continue cooking? How much of a big deal is this? If so, I’m guessing it’s important to get a model which either turns off on a timer or switches to ‘keep warm’?\n\nThanks for your help :)",
    "comments": [
        {
            "level": 0,
            "comment": "Only one way to find out for sure and to your liking.  Experiment.  Try and learn from experiences. I would caution against leaving meat out for long periods of time, raw or cooked.",
            "score": 2,
            "author": "CaptainWollaston"
        },
        {
            "level": 0,
            "comment": "I sear my meat before adding to the crockpot.  Even with a crockpot you can overcook and make dry meat so it’s recommended to sear for best flavor.",
            "score": 1,
            "author": "Southernpalegirl"
        },
        {
            "level": 0,
            "comment": "I do my veggies the night before and put it in the fridge overnight. I don't sear my meat generally, so I stick it in a container with marinade overnight. In the morning I dump the meat into the pot, turn on the heat, and go.",
            "score": 1,
            "author": "blackday44"
        },
        {
            "level": 0,
            "comment": "You do not need a super expensive crock pot with super timers and all that. Crock pots are basically to keep food to cook food below about 200°.\n\nI use the Crock-Pot liners so I don't have to do huge cleanups. The night before I fill the liner with the vegetables and the broth. I use a twist tie to close it and put it in a bowl in the fridge. In the morning you put the bag into the crock pot and then you add the meat on top.  Make sure it's plugged in turn it on low and come back in 8 hours and dinner's done.\n\nAlmost all of the pulled pork recipes can be converted to crock pots.  Mix up the liquid the night before and leave it in the fridge. Prep the meat the night before which is to cut off some of the fat cap, because I use the cheapest pork I can find.  If the recipe calls for marinating overnight then do it otherwise just put it in the Crock-Pot first thing in the morning. I personally cook my pulled pork closer to 10 to 12 hours but that's because I wanted to just dissolve in my mouth.",
            "score": 1,
            "author": "sarcasticclown007"
        },
        {
            "level": 0,
            "comment": "Prepare in the morning?  Who has time for that?  Hah.  I prepare in the evening and put everything in the crockpot.  I then take the ceramic portion of the crockpot out with the food in it and put the whole thing in the fridge.  In the morning I put it in it’s heating element and plug in. \n\nDisclaimer:  I’m a newbie as well.",
            "score": 1,
            "author": "KaptainKompost"
        }
    ]
}