{
    "id": "11ekkm4",
    "score": 9,
    "title": "Snow day, had my wife throw 6lbs of chicken breasts in on low for the day. Recipes please!",
    "author": "gl21133",
    "date": 1677619860.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/11ekkm4",
    "media_urls": [],
    "other_urls": [],
    "postText": "I typically go with sandwiches or tacos but I’d love to hear any creative ideas for the pile of shredded chicken I’m about to have.",
    "comments": [
        {
            "level": 0,
            "comment": "Add your favorite BBQ sauce to chicken in slow cooker. Take some large bake potatoes and bake well, then top with chicken, sour cream, green onions cheddar cheese and anything else that floats your boat.",
            "score": 9,
            "author": "Dexxx2"
        },
        {
            "level": 0,
            "comment": "At the beginning of the pandemic, I got 14 pounds of   skinless/boneless chicken breasts for $9. I got home and found out I did not have the freezer space for all of it. I made chicken salad and chicken curry with what I could not freeze.",
            "score": 3,
            "author": "HonnyBrown",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those were the days.",
                    "score": 2,
                    "author": "cantfindfido",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And all the deep freezers were sold out.",
                            "score": 1,
                            "author": "HonnyBrown"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Chinese Chicken salad is always the winner around here for shredded chicken. Personally I would portion it out into meal sized portions and freeze in ziploc bag. Can take out last minute and pour some teriyaki, bbq, salsa over and defrost in fridge. You have a last minute rice bowl ingredient. Can also add frozen to cold leftover rice and make chicken fried rice. Can't go wrong with frozen shredded cooked chick on stand by in the freezer.",
            "score": 3,
            "author": "DressingQuestion"
        },
        {
            "level": 0,
            "comment": "I throw in Mexican spices and use in tacos, bbq sauce for sliders, Thai peanut sauce in veggie bowls, creamy pear dressing in wraps, or on top of salads with choic of dressing. Stir fry with veg and soy sauce or teriyaki. You can keep the chicken plain and add store bought or homemade marinades, dressings, vinaigrette’s, aiolis, sauces, etc to make whatever type of flavor profile is sounding yummy",
            "score": 3,
            "author": "fantasticwasteoftime"
        },
        {
            "level": 0,
            "comment": "Make a nice chicken gravy with the stock and add shredded chicken to it. Eat this on biscuits.",
            "score": 2,
            "author": "No_Neighborhood4850"
        },
        {
            "level": 0,
            "comment": "Pot pie!",
            "score": 2,
            "author": "jbs818"
        },
        {
            "level": 0,
            "comment": "Make up a pot of noodles. Drain them and mix in any veg you have and a bunch of the chicken. Put in a baking dish, top with bread crumbs, cheese, whatever. Cover and bake for about 40 minutes. Take the cover off and brown the top part. Let cool a bit and serve. Or you could make up a couple of these and freeze them with out baking to take out later for a nice quick hot meal. \n\nCould also do this with potatoes or rice instead.",
            "score": 2,
            "author": "okokokoyeahright"
        },
        {
            "level": 0,
            "comment": "Add a can of cream of chicken and a can of cheese soup.  When it’s done, move to keep warm and shred it. The sauce will start to thicken as it cools.  Add a handful of shredded cheddar and some steamed broccoli (carrots and cauliflower if desired too) and serve over egg noodles.",
            "score": 2,
            "author": "BrokenTrojan1536"
        },
        {
            "level": 0,
            "comment": "Chicken quesadillas\n\nChicken salad\n\nChicken lettuce cheddar cheese ranch wraps\n\nChicken bbq sauce on a roll\n\nChicken w/ Mac and cheese\n\nChicken with gravy over rice\n\nHmm that’s all I’ve got off the top of my head",
            "score": 2,
            "author": "jessarin"
        },
        {
            "level": 0,
            "comment": "White chicken chili, chicken corn chowder, chicken tetrazzini",
            "score": 1,
            "author": "AproposofAll"
        }
    ]
}