{
    "id": "11er8ic",
    "score": 63,
    "title": "Six hour pot roast! Six hours is all it took to get this roast to be mouth watering delicious. Knives were not needed here, it was able to shred apart with a fork. Will post my full recipe in the comments.",
    "author": "Dizzy-Asparagus2818",
    "date": 1677636585.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/11er8ic",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Start off with seasoning the meat with salt, pepper, and smoked paprika.  Add your favorite, I used grapeseed, oil to a pan and bring to a medium heat.  Brown all sides of the roast.  Remove the roast and place in a crockpot.  Add in a diced onion and some red wine to the same skillet.  When the onions begin to caramelize add in some minced garlic.  Heat for a few more minutes then add the onion and garlic to the top of the roast in the crockpot.  Add in your favorite seasonings such as thyme, oregano, rosemary, and basil.  I don't measure, just make sure to add enough.  Pour some beef stock (not broth) on the side of the crockpot, don't pour it directly over the meat.  Add enough stock so it reaches the top of the roast but doesn't completely submerge it.  Add some worcestershire sauce.  Add in the potatoes, carrots, and celery on top.  Close the lid, set it on low, try to forget about it for the next six hours.",
            "score": 18,
            "author": "Dizzy-Asparagus2818"
        },
        {
            "level": 0,
            "comment": "Good job, hope it was as delicious as it looks. I can almost taste it....",
            "score": 5,
            "author": "WalleyeFishingFool"
        },
        {
            "level": 0,
            "comment": "Yum! Thanks for the recipe. Do you know how many lbs the roast was?",
            "score": 4,
            "author": "ABeld96",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was a 3.3 pound chuck roast",
                    "score": 4,
                    "author": "Dizzy-Asparagus2818"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great description OP, I’m definitely copying!  Looks savory.",
            "score": 3,
            "author": "ohnowralph"
        },
        {
            "level": 0,
            "comment": "That's a nice piece of chuck.",
            "score": 2,
            "author": "thingonething"
        },
        {
            "level": 0,
            "comment": "What size of crock?",
            "score": 1,
            "author": "BrokenTrojan1536",
            "replies": [
                {
                    "level": 1,
                    "comment": "six quart",
                    "score": 1,
                    "author": "Dizzy-Asparagus2818",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok thanks",
                            "score": 1,
                            "author": "BrokenTrojan1536"
                        }
                    ]
                }
            ]
        }
    ]
}