{
    "id": "11g7bkc",
    "score": 184,
    "title": "Vegan Lentil Crockpot Tacos",
    "author": "spockgiirl",
    "date": 1677775288.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/11g7bkc",
    "media_urls": [
        "https://i.redd.it/rw44cafotcla1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The base recipe I used - https://thenaturalnurturer.com/vegan-slow-cooker-lentil-tacos/\n\nI left out the coconut aminos (don't have) and the vinegar(didn't know why this was listed).\n\nI added a can of black beans, a can of corn, three green peppers, two jalapeños and double the onion. Instead of the separate spices, I added a tablespoon and a half of taco seasoning.\n\nIt's super similar to my normal crockpot taco recipe, where I just throw in chicken thighs or cheap beef.\n\nHonestly I'm super impressed. It's tasty, filling and super cheap. I de-veganed it with cheese (and sour cream for my husband), but it could easily stay vegan if you didn't need those things (we do).\n\nThrow on some lettuce, homemade pico, radish and hot sauce of choice - it's a super solid recipe. We doubled the recipe and have been eating it all week and it's holding up really well.",
            "score": 17,
            "author": "spockgiirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've used vegan mayo in burritos and such, instead of sour cream. It adds a creamy flavor and texture, and with all the other flavours it's not noticeably different to me.",
                    "score": 3,
                    "author": "Teacosyhats"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not vegan but I'd try this. Does it actually taste like a beef taco?",
            "score": 5,
            "author": "KingStronghand",
            "replies": [
                {
                    "level": 1,
                    "comment": "Something people get wrong with veggies or meat substitutes is saying or assuming they’ll “taste like meat”. They never will, and you’ll have a better time enjoying the flavors for what they are.",
                    "score": 21,
                    "author": "Erbodyloveserbody"
                },
                {
                    "level": 1,
                    "comment": "Not vegan either. We normally use chicken thighs (or super cheap beef), and honestly it's pretty much the same minus the meat texture. It soaks in all of the flavors from the veggies and seasoning in the same way.",
                    "score": 9,
                    "author": "spockgiirl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks good. :)",
            "score": 4,
            "author": "CoffeeB4Talkie"
        },
        {
            "level": 0,
            "comment": "I’d try it",
            "score": 5,
            "author": "AwarenessTop225"
        },
        {
            "level": 0,
            "comment": "This sounds great. Love the additions. Definitely trying this soon",
            "score": 2,
            "author": "mckeen1982"
        },
        {
            "level": 0,
            "comment": "Looks yummy!",
            "score": 2,
            "author": "thingonething"
        }
    ]
}