{
    "id": "11lh4l2",
    "score": 2,
    "title": "Is it safe to cook chicken on low?",
    "author": "pammademedothis",
    "date": 1678236312.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/11lh4l2",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am new to this, but I tried a recipe that involves frozen raw chicken. I set it for 5 hours and just went to check on it 2 hours later. The chicken was now thawed but still raw. I looked and I had the slow cooker set to low! I just upped it to high, but can anyone tell me if it will be safe to eat? Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "*It looks like you're asking about Food Safety.*\n\nOnly you are aware of all the factors involved in this situation. No one in this subreddit is qualified to give you advice about eating food that's left unattended, undercooked, etc. \"If in doubt, toss it out.\" Food poisoning is a serious issue - it's particularly dangerous to older adults, children, pregnant women or people with compromised immune systems.\n\nHere are some resources available to you to determine whether it would be safe or not to consume your meal:\n\n* https://www.reddit.com/r/slowcooking/wiki/index#wiki_food_safety_tips\n* https://www.foodsafety.gov/\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/slowcooking) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "If im cooking low I'll do 6-8 hours or high for 3-5 hours- tahts for frozen chicken thighs bone in",
            "score": 5,
            "author": "Mysterious-Sense-185"
        },
        {
            "level": 0,
            "comment": "https://www.fsis.usda.gov/food-safety/safe-food-handling-and-preparation/food-safety-basics/danger-zone-40f-140f",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It is safe to cook on low, it just takes longer.  But I wouldn't cook from frozen without cutting the meat into smaller pieces, so that they spend less time thawing, and can move on to actually cooking.  Also cooking in liquid will help the thawing go more quickly by improving heat transfer from the cooker to the meat.\n\nTL;DR - it's safe to cook on low, but meat should be cut into smaller pieces and should be cooked in liquid.",
            "score": 2,
            "author": "kgober"
        }
    ]
}