{
    "id": "11tq7cg",
    "score": 886,
    "title": "I think I may have overfilled it!",
    "author": "Kahnza",
    "date": 1679057432.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/11tq7cg",
    "media_urls": [
        "https://i.redd.it/bzvh7zqs7coa1.jpg"
    ],
    "other_urls": [],
    "postText": "10.25lbs",
    "comments": [
        {
            "level": 0,
            "comment": "I once put a pork shoulder in that caused the lid to pop up a little.  Had to put something on top to weigh it down.  Eventually it cooked down and fit fine.",
            "score": 228,
            "author": "EarlGrey_Picard",
            "replies": [
                {
                    "level": 1,
                    "comment": "Magic!",
                    "score": 31,
                    "author": "thankyoufatmember"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It'll cook down and make room.",
            "score": 247,
            "author": "ripple_in_stillwater",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I'm hoping I can throw some onion in later. Maybe some mushrooms too. I'll have to see how much room I get in a few hours.",
                    "score": 65,
                    "author": "Kahnza",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought this said “how MUSH room” for a sec 😂",
                            "score": 58,
                            "author": "Healthy-Ad-1842"
                        },
                        {
                            "level": 2,
                            "comment": "It's been 15 hours since you replied, got a pic of the final results?",
                            "score": 7,
                            "author": "strangetrip666",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No I got busy with other things and forgot. I don't usually take pictures of food so I wasn't thinking about it. It filled 4, 5 cup containers and weighed about 5.6lbs.",
                                    "score": 3,
                                    "author": "Kahnza",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I feel you there. I don't snap too many pics of my food either",
                                            "score": 1,
                                            "author": "strangetrip666"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve done this many times and once it cooks down a bit on the bottom after an hour or two, I just flip the meat.",
            "score": 22,
            "author": "evrythingdenied"
        },
        {
            "level": 0,
            "comment": "Bone-in pork shoulder was on sale for $1.88lb and I couldn't help myself. It's 10.25lbs. Had to trim it a bit to get it all in there. I'll keep an eye on it so the juices don't get out of control. Set it to High for 10 hours.\n\nI maybe should have gotten an 8.5lb one instead! 🤣\n\n&amp;#x200B;\n\nedit: and all I did was put a bit under a teaspoon of salt on the top. I was gonna put onions and mushrooms in there too, but they won't fit. Maybe I can add them later when it starts to settle down.",
            "score": 74,
            "author": "Kahnza",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’ll be fine. There are some people on this subreddit that fill theirs to the brim with soup. Stay far away from those folks. They’re dancing with the devil.",
                    "score": 85,
                    "author": "BadcaseofDTB",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am one of those people lol",
                            "score": 21,
                            "author": "sybertagii"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cut it in half next time",
                    "score": 5,
                    "author": "SlobMarley13"
                },
                {
                    "level": 1,
                    "comment": "Make sure there's two inches of clearance from the inner ridge to the liquid line and you'll be good.",
                    "score": 2,
                    "author": "EmEmPeriwinkle"
                },
                {
                    "level": 1,
                    "comment": "Why high? Wouldn’t low be enough for 10 hrs?",
                    "score": 1,
                    "author": "ChildhoodNo5117",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "High gets it up to temp faster. I switched it to low at the 5 hour mark.",
                            "score": 1,
                            "author": "Kahnza",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oohh never thought about doing that. Nice!",
                                    "score": 2,
                                    "author": "ChildhoodNo5117"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good now do it again",
            "score": 12,
            "author": "Responsible-Desk4145",
            "replies": [
                {
                    "level": 1,
                    "comment": "[\\*insert Gooby meme here\\*](https://youtu.be/e2r4oaRiqfc?t=21)",
                    "score": 4,
                    "author": "Kahnza"
                }
            ]
        },
        {
            "level": 0,
            "comment": "mine is currently stuffed to the brim with a 5 pound corned beef and veggies, I have faith it'll cook down. As long as the lid is securely down you should be good!",
            "score": 10,
            "author": "Artemistical",
            "replies": [
                {
                    "level": 1,
                    "comment": "What time is dinner? I'll bring some fresh rye.*\n\n*edit: bread. But maybe also some Canadian Club.",
                    "score": 4,
                    "author": "CherryCherry5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks like we're gonna need a bigger boat, friend.",
            "score": 8,
            "author": "00austin"
        },
        {
            "level": 0,
            "comment": "Alright, so after cooking, I got \\~5.6lbs of meat out of a 10.25lb chunk of meat. Less than I was hoping for. I was hoping for more like 7. But I guess thats what happens when there is a lot of fat and water in there. Even so, it's still \\~70% cheaper by weight than the prepackaged sandwich meat I can get at my grocery store. And it's not processed and filled with other chemicals and preservatives. With the added bonus of stinking up the hallway in my apartment building. 😎",
            "score": 7,
            "author": "Kahnza"
        },
        {
            "level": 0,
            "comment": "Send pics when it’s finished cooking!!",
            "score": 7,
            "author": "NoSyllabub1535"
        },
        {
            "level": 0,
            "comment": "I dont know if it’s overfilled but it’s definitely under seasoned!",
            "score": 59,
            "author": "TortoiseHawk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pork fat rules! And it's delicious. The meat will get portioned out when done and used in a variety of other things. So I don't want to season it, or it may not work as well in certain things to my taste.",
                    "score": 51,
                    "author": "Kahnza",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don’t need to season it with something crazy that won’t work in other dishes. Even just basic salt, pepper, garlic goes an extremely long way. I’d throw some paprika/pepper and sugar onto pork as well. \n\nWill make it taste infinitely better and you can still use the meat elsewhere.",
                            "score": 25,
                            "author": "junkit33"
                        },
                        {
                            "level": 2,
                            "comment": "What sort of things can you do with the pork?",
                            "score": 1,
                            "author": "LadderWonderful2450",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Anything you want that involves putting it in your mouth.  😆\n\nI mostly do things like wraps, sandwiches, burritos, or as a little snack. I don't do anything elaborate.",
                                    "score": 11,
                                    "author": "Kahnza"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm not a fan of pork butt, it's too fatty for me.  But my adult daughter LOVES IT.  Got one a few weeks ago because the store had it on sale for 99c/lb but even the smallest one was just way too much for the two of us",
                            "score": 1,
                            "author": "CaRiSsA504",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I bought 2 a couple weeks ago for $0.99 a lb too, we cut some into slices like pork chops and left a couple large pieces to use for bbq pulled pork, then froze it all.  We also cut off some of the excessive chunks of fat before freezing, it turned out great.",
                                    "score": 2,
                                    "author": "123-for-me"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I fill mine so that the lid is cracked, and it still ends up all fitting once everything starts cooking down.",
            "score": 5,
            "author": "romulan267"
        },
        {
            "level": 0,
            "comment": "Season your meat",
            "score": 11,
            "author": "N_Pitou",
            "replies": [
                {
                    "level": 1,
                    "comment": "For real, some sazon / adobo /cajun /soul seasoning or at least dry rub some salt / black pepper with maybe garlic and/or onion powder.",
                    "score": 7,
                    "author": "maywellflower"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She'll be right mate",
            "score": 3,
            "author": "Sierratango98"
        },
        {
            "level": 0,
            "comment": "Naw it's good.",
            "score": 3,
            "author": "CantaloupeCamper"
        },
        {
            "level": 0,
            "comment": "Done that more than once.   Just check on it in a bit to make sure you don't need to take some liquid out.",
            "score": 3,
            "author": "Cinisajoy2",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just removed a cup of water/fat. It was getting up to the rubber seal on the lid! 😬",
                    "score": 4,
                    "author": "Kahnza"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’ll cook down",
            "score": 3,
            "author": "ThatsMrsY2u"
        },
        {
            "level": 0,
            "comment": "Always wanted a huge slow cooker.  Like 20 -25 quarts for meal prepping stuff.  Alot of times you can't fit veggies very well after a bigger chunk of meat.  Those turkey cookers might work but not sure how slow it is and they have thin walls.",
            "score": 3,
            "author": "Klashus"
        },
        {
            "level": 0,
            "comment": "I thought I overfilled mine too but it shrunk down and I turned it around and it came out delicious.",
            "score": 3,
            "author": "honeyMully333"
        },
        {
            "level": 0,
            "comment": "Try searing it next time. It'll give more flavor out and reduce the size a bit.",
            "score": 7,
            "author": "kvassbro",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't have a pan big enough for that LOL\n\nI've never done that though. I lightly season it, then use the meat in other things like burritos, tacos, wraps, stew,  etc.",
                    "score": 7,
                    "author": "Kahnza",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Since you say you are going to add the meat to other things, cut it up into chunks, sear the chunks, and then add to your cooker.  Also gives you the benefit of being able to season the meat better.",
                            "score": 5,
                            "author": "barn9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was thinking about taking \\~5 cups of the meat, shredding it, and making carnitas. I've got a 12\" cast iron skillet on standby!",
                                    "score": 2,
                                    "author": "Kahnza"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think you should latch the lid. Those are just meant for transportation to a pot luck or something, not while it's cooking. I've seen posts of people's lids cracking under the pressure (if the vent hole gets plugged... which yours is close to getting plugged... though usually it's the plastic bags for \"easy clean up\" that do it).",
            "score": 14,
            "author": "smart41689",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not latched. Notice the metal part is stowed up top.",
                    "score": 8,
                    "author": "Kahnza"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol put all you ingredients in and cover it with foil when it cooks down then the lid should fit again and you should be able to latch it.",
            "score": 2,
            "author": "Lost-Jeweler5881",
            "replies": [
                {
                    "level": 1,
                    "comment": "Foil inside the pot/lid? Or on top of the lid?",
                    "score": 1,
                    "author": "DragonflyBee1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cover up the top of the meat/ingredients in the crockpot with the foil and make a seal all the way around so all the heat stays inside and the meat cooks down. When it cooks down far enough then you can take off the foil and the lid will fit.",
                            "score": 1,
                            "author": "Lost-Jeweler5881"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"If it fits, it ships\" or something along those lines.  Looks Grrrrrrreaaaat!",
            "score": 2,
            "author": "waywardson23"
        },
        {
            "level": 0,
            "comment": "Man I don't know what I was thinking, I did this last time I went to make carnitas, I knew I did it, so I just immediately grabbed my other slow cooker and cut it in half and transferred it; I knew I was doing it as I was putting it in there, so I don't know why I didn't start out cutting it in half but, oh well.\n\nSometimes I just make things harder on myself or maybe hindsight really is 20/20? A horse a piece? I don't know.\n\n**I see I'm in good company, and yes, actually I was thinking perhaps it would cook down, but once I put it in there it was clear to me that it was not going to cook down that much and the cut was much bigger and in fairness, I didn't pick it from the store, I ordered it and when it arrived, it was a fair bit bigger than expected. Still, should have started off with cutting it in half but oh well ... Now I've also bored you with the drawn out explanation.",
            "score": 2,
            "author": "WhoaHeyAdrian"
        },
        {
            "level": 0,
            "comment": "Pretty sure you could squeeze in a few spices or something…. Just saying. But kinda curious how unseasoned pork turns out, like aunt Helen’s ham of yore.",
            "score": 2,
            "author": "texfields",
            "replies": [
                {
                    "level": 1,
                    "comment": "It tastes amazing. Pork shoulder has a LOT of flavor by itself. I did manage to fit in a tray of sliced mushrooms for the last 2 hours. They soaked up a lot of that pork flavor. \n\nI just don't understand people that say pork doesn't have much flavor. Maybe their taste buds are different? Because to me, pork shoulder has a lot of flavor on it's own. But something like a pork loin/chops doesn't have nearly as much flavor. The amount of fat in a cut of meat, and where that cut comes from makes a huge difference. Pork shoulder is very fatty.",
                    "score": 2,
                    "author": "Kahnza"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My slow cooker recommends filling it only 3/4.",
            "score": 3,
            "author": "FormicaDinette33"
        },
        {
            "level": 0,
            "comment": "Perfect, looks good to me",
            "score": 2,
            "author": "GuidetoRealGrilling"
        },
        {
            "level": 0,
            "comment": "You do know you need to add seasoning for it to have taste. (I don’t mean just salt and pepper)",
            "score": -1,
            "author": "JesusLazalde123",
            "replies": [
                {
                    "level": 1,
                    "comment": "The meat gets added to other things with seasoning",
                    "score": 2,
                    "author": "Kahnza"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Heat your liquid up on the stove first or it’ll take a loooooong time to get up to temp in the crock.",
            "score": -1,
            "author": "Thick_Kaleidoscope35",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is no liquid added. The first time I ever did this I added water because I thought it would dry out otherwise. It just turned into a soup and it seemed like flavor was lost.",
                    "score": 8,
                    "author": "Kahnza",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Water is not flavor, try broth, a bottle of beer, etc., something that enhances or adds flavor.",
                            "score": 5,
                            "author": "barn9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unfortunately, there is too much meat in there to add anything. I just had to remove a cup of water/fat to keep it from overflowing. The liquid level was up to the rubber seal part of the lid.\n\n&amp;#x200B;\n\nNext time I will buy a smaller piece of meat.",
                                    "score": 3,
                                    "author": "Kahnza",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don't pass up a bargain on meat, if you have to, cut it in half and save or freeze for later.",
                                            "score": 3,
                                            "author": "barn9",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah a lot of this is going to get frozen. Probably gonna last me a month, maybe more.",
                                                    "score": 2,
                                                    "author": "Kahnza"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ah. Ok",
                            "score": 3,
                            "author": "Thick_Kaleidoscope35"
                        },
                        {
                            "level": 2,
                            "comment": "I always add a cup or so of apple juice to mine",
                            "score": 1,
                            "author": "412raven"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I usually add a cup of broth to keep it wet at the bottom to prevent it from sticking 🤷‍♀️",
                    "score": 5,
                    "author": "ChibiVix3n"
                },
                {
                    "level": 1,
                    "comment": "Good advice!",
                    "score": 2,
                    "author": "anonnomiss627"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I overfilled mine today with corned beef, red potatoes, and carrots. Needed weight to keep it down at first.",
            "score": 1,
            "author": "thebigk71"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -16,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice reply 😳",
                    "score": 8,
                    "author": "ddpete"
                },
                {
                    "level": 1,
                    "comment": "What sub are we in, again?",
                    "score": 3,
                    "author": "waywardson23"
                }
            ]
        },
        {
            "level": 0,
            "comment": "With 2 hours left, I was able to remove the bone. Broke it up a bit and added an entire tray of sliced up mushrooms. Those little sponges are gonna soak up so much pork flavor its gonna be ridiculous.",
            "score": 1,
            "author": "Kahnza"
        },
        {
            "level": 0,
            "comment": "I use Tim foil to cover it if the lid does not fit 😂",
            "score": 1,
            "author": "Important-Cobbler-5"
        },
        {
            "level": 0,
            "comment": "It should shrink.",
            "score": 1,
            "author": "Crazyfreakyworld"
        },
        {
            "level": 0,
            "comment": "As long as you can seal the lid on, it’s fine. Scoop out some liquid as it shrinks",
            "score": 1,
            "author": "muttster17"
        },
        {
            "level": 0,
            "comment": "I'll sink down. No worries.",
            "score": 1,
            "author": "norfaust"
        },
        {
            "level": 0,
            "comment": "I wish the vent looked less like an eye",
            "score": 1,
            "author": "Massive_Fudge3066"
        },
        {
            "level": 0,
            "comment": "This is why i bought a 10 qt, never have to wonder if it will fit again.",
            "score": 1,
            "author": "StanleyYahtzee"
        },
        {
            "level": 0,
            "comment": "Just preemptively cover the whole thing in Flex Tape. When you hear it start cracking; it's done.",
            "score": -1,
            "author": "Devoidus"
        },
        {
            "level": 0,
            "comment": "That's what he said.",
            "score": -1,
            "author": "whatthepfluke"
        }
    ]
}