{
    "id": "11wyacd",
    "score": 13,
    "title": "I want to use shredded rotisserie chicken in my taco soup. At what point should I add the chicken?",
    "author": "BVRJLJ",
    "date": 1679351279.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/11wyacd",
    "media_urls": [],
    "other_urls": [],
    "postText": "I want to use rotisserie chicken in my taco soup. Since it is already cooked, at what point should I add it to my crockpot? I don't want it to be tough and overcooked. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Very last, right before you’re ready to serve so it can get warmed up and mixed in. I’ve added it too soon too many times and it shreds to bits and gets dry so this is how I do it now.",
            "score": 18,
            "author": "Flat_Ad_9993",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is great to know. Thank you so much for your help! \nDo you season your chicken before you put it in?",
                    "score": 5,
                    "author": "BVRJLJ",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep! I’ll cut it up into bite sized pieces and toss it in some seasoning. Most of it comes off when you toss it in but it still helps keep some flavor. Sometimes I have to adjust seasoning after I’ve added it but I just try a bite with the chicken to see.",
                            "score": 5,
                            "author": "Flat_Ad_9993",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is good to know. Thank you for all of your advice!",
                                    "score": 2,
                                    "author": "BVRJLJ",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Of course, happy to help. Enjoy!",
                                            "score": 3,
                                            "author": "Flat_Ad_9993"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I add it in the last 10 minutes.  Sounds counterintuitive, but adding to the soup too early will dry out the chicken!",
            "score": 6,
            "author": "Eogh21",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 2,
                    "author": "BVRJLJ"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even in the bottom of the bowl is ok. That chicken is cooked (often overcooked already even) you don’t want to cook it anymore.",
            "score": 4,
            "author": "bblickle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 2,
                    "author": "BVRJLJ"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like idea of shredded chicken as a topping",
            "score": 3,
            "author": "[deleted]"
        }
    ]
}