{
    "id": "124o7s2",
    "score": 37,
    "title": "Any tips on slowcooking chicken thighs?",
    "author": "BigHeadDeadass",
    "date": 1680008896.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/124o7s2",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have a chicken thigh recipe I wanna try out but I've never slow-cooked them and just had a couple of questions. Like should I add a thin layer of chicken stock or duck fat so they don't get stuck to the bottom? Should I get some thighs with skin on them and sear the skin so it's crispy? And should I get bone-in for flavor? Any tips would be appreciated, and recipes too if you'd like!",
    "comments": [
        {
            "level": 0,
            "comment": "If you plan on slow cooking thighs after a seat- you won’t have crispy skin. If will be flabby and soft. \n\nThighs have a lot of fat so you shouldn’t need to grease the bottom of your vessel.",
            "score": 41,
            "author": "krumbs2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve found pulled the proteins out and dropping them in a 350°F + pan to seer is the only way. Then drop it back in before you serve.",
                    "score": 3,
                    "author": "someonesgranpa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, air fryer would be good for this too.",
                            "score": 5,
                            "author": "BennySkateboard"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I usually add some vegetables if there are not any in the recipe.  Add some thickly sliced potatoes or carrots to the bottom of the crock pot then place the meat on top.",
            "score": 9,
            "author": "msbottlehead"
        },
        {
            "level": 0,
            "comment": "I have started cooking chicken for much less time in the crockpot, and I’ve been really happy. For thighs I’ve been doing about 4 hours on low, and they are perfect. Still easy to shred, but the meat doesn’t get to the point where it’s fall apart and dry at the same time. Same 4h for drumsticks.  Wings about 2-3 hours (and then broil for a few min each side).",
            "score": 3,
            "author": "Foreign-Figure8797",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the way to go. So many recipes call for way too long of a cook time for chicken",
                    "score": 2,
                    "author": "lovezero"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I followed this recipe https://www.themagicalslowcooker.com/lemon-pepper-chicken-thighs and it turned out amazing. Very tender, and just a bit of crunch in the skin. I did broil it for a few mins after.",
            "score": 2,
            "author": "PeggyOlson225"
        },
        {
            "level": 0,
            "comment": "If you get skin-on, you’ll want to fry or broil AFTER cooking for crisp skin.  Also, if you’re adding it to broth with rice or other ingredients, trim the the excess skin - you know the flappy thick parts - because it will make your dish very greasy.   You won’t need extra fat.  Avoid slow cooking boneless skinless because they just shrink up into a dry ball of yuk.",
            "score": 9,
            "author": "KeepCalmAndBaseball",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Avoid slow cooking boneless skinless because they just shrink up into a dry ball of yuk.\n\nThis has not been my experience. I find that thighs stay tender thru slow cooking whereas breasts become hard and dry. Although if thighs are overcooked they can disintegrate into a fibrous mess.",
                    "score": 15,
                    "author": "DubiousMax",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same. I trim the skin off and put thighs on top of onions. mushrooms, sweet potatoes and/or carrots.  Sprinkle herbs on top of chicken thighs. Cook on low",
                            "score": 4,
                            "author": "Sir3Kpet"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sear the thighs on medium high heat until the skin is brown. Use the trinity of celery, carrots, and onions chopped and add whatever spices float your boat. Place in pan with skin up. Fill with any stock, bullion is fine up to just below the top of the skin. Temperature depends on how slow you want to go as long as they reach 165/74 degrees internally",
            "score": 4,
            "author": "VulgarVinyasa"
        },
        {
            "level": 0,
            "comment": "I did chicken thighs last night. Sprayed the crock with pam and that was it. They turn out super tender cooked on low for 6 hours. I did mine with cream of mushroom and it was so good.",
            "score": 2,
            "author": "Little_Season3410"
        },
        {
            "level": 0,
            "comment": "I recently made this in slow cooker...https://www.inspiredtaste.net/36368/slow-cooker-lemon-chicken-thighs/ was the first time I've cooked chicken thighs as I've been vegetarian for 30 years. I didn't bother with the lemon gravy and it was really easy. Served on rice with some peas. I obviously couldn't taste it but husband said it was really good and 8 month old baby wolfed down some of it blended up. I was paranoid that there wasn't any liquid put into the slow cooker but it's not long before liquid comes out of the chicken.",
            "score": 2,
            "author": "33783071"
        },
        {
            "level": 0,
            "comment": "Easy brown sugar/garlic glazed chicken thighs is my usual go to. Bone in, skin on. \n2tablespons of minced garlic, 4 thighs, 1/2 teaspoon of salt, 1/4 teaspoon pepper and 1/3 cup of brown sugar. No liquid. Cook low and slow.",
            "score": 1,
            "author": "Hannersk"
        },
        {
            "level": 0,
            "comment": "I’d smoke, bake, or air fry.   What are you looking to do?  Chicken thighs are great for making chicken paprikash in a slow cooker.  Pretty easy to do and is an excellent Hungarian dish.",
            "score": 1,
            "author": "BrokenTrojan1536"
        }
    ]
}