{
    "id": "12b91jr",
    "score": 11,
    "title": "Accidentally submerged exterior in water. Ever safe to use again?",
    "author": "leaveitinutah",
    "date": 1680582870.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/12b91jr",
    "media_urls": [],
    "other_urls": [],
    "postText": "UPDATE—thanks for the comments! Decided to just buy a new one—crockpots are relatively cheap and I’m no electrician. Thanks for weighing in. :)\n\nTitle says it: I did a dumb thing tonight while trying to clean a bit of burnt food out of the exterior layer of my crockpot: I filled the bottom of it with soapy water for 3-4 minutes to soak. When the directions say not to submerge, I always figured as long as I kept the cord and controls out of water, I’d be okay. But of course, water started seeping out the bottom of the container a couple minutes into the soak, and I spent the next fifteen minutes frantically scrubbing at it with paper towels to get water out of every crevice I could. \n\nSo, my question is: have I ruined it? What are the chances I barbecue myself next time I plug it in? Is there a way to totally deconstruct and put this thing back together to get every speck of water out, or is this a “chuck it and buy a new slow cooker” situation? \n\nThanks in advance. TLDR; don’t clean your slow cooker when you’re tired late at night and not thinking straight.",
    "comments": [
        {
            "level": 0,
            "comment": "*It looks like you're asking about Food Safety.*\n\nOnly you are aware of all the factors involved in this situation. No one in this subreddit is qualified to give you advice about eating food that's left unattended, undercooked, etc. \"If in doubt, toss it out.\" Food poisoning is a serious issue - it's particularly dangerous to older adults, children, pregnant women or people with compromised immune systems.\n\nHere are some resources available to you to determine whether it would be safe or not to consume your meal:\n\n* https://www.reddit.com/r/slowcooking/wiki/index#wiki_food_safety_tips\n* https://www.foodsafety.gov/\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/slowcooking) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Nah I've done this and my slow cooker is fine. Just let it dry out fully before using it again, I took the bottom off mine to make sure it was fully dry (the bottom was just a protector plate thing held on with 4 screws). If your house doesn't have surge protector built in (and I mean what houses these days don't?) then get a power strip with one to test it when it's dry. I didn't bother, mine has been scrubbed out that way multiple times and I just leave it to dry for a few days or so before using it again",
            "score": 4,
            "author": "bugscuz"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a great idea—I’ll do that.",
                    "score": 2,
                    "author": "leaveitinutah"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Buy a model exactly like yours and keep the insert and lid.\n\nI’ve broken way too many inserts and lids to count.",
            "score": 2,
            "author": "The_Only_Dick_Cheney"
        },
        {
            "level": 0,
            "comment": "Here's the thing: \n\nIt will almost certainly be ok if you dry it out before plugging it in, but...what's the worst that could happen if you're wrong? \n\nYou could burn your house down with people in it.  Do you feel confident disassembling the unit and inspecting it? \n\nI'd say not worth the risk, even though it is probably perfectly fine.",
            "score": 6,
            "author": "wirelesstrainer"
        },
        {
            "level": 0,
            "comment": "Disassemble it completely and let everything dry. Otherwise do not plug in.",
            "score": 3,
            "author": "kvassbro"
        },
        {
            "level": 0,
            "comment": "I'd chuck it. We've all done something similar, don't be too hard on yourself. 😊",
            "score": 2,
            "author": "Party_Razzmatazz8329"
        }
    ]
}