{
    "id": "12ea0m3",
    "score": 11,
    "title": "Recipes that are good eaten unheated?",
    "author": "stoobah",
    "date": 1680842463.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/12ea0m3",
    "media_urls": [],
    "other_urls": [],
    "postText": "About 80% of my diet is crock pot stews and chilis, but there's always a long line for the microwave at work and I'd rather just wrap something in a tortilla and eat it as is.\n\nAny suggestions for things I can take to work without having to heat up? Pulled pork in a wrap or on a bun is nice but some variety wouldn't hurt.\n\nEdit: specifically big batch stuff I can prepare many servings of in advance. In a crock pot. I start work early and don't want to fuss about or assemble anything in the morning.",
    "comments": [
        {
            "level": 0,
            "comment": "Cold chicken, salads, sandwiches. Or you could get a thermos and put your stews and chilis in there and it will still be warm at lunch time. Tou can also pack burrito fillings in a thermos, soups and anything warm.",
            "score": 16,
            "author": "ToastMmmmmmm",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like the idea of a big pot of burrito filling. Do you have suggestions for a good recipe?",
                    "score": 5,
                    "author": "stoobah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.themagicalslowcooker.com/slow-cooker-one-pot-chicken-burrito-filling/\n\nhttps://www.spendwithpennies.com/slow-cooker-burritos/\n\nhttps://www.pillsbury.com/recipes/slow-cooker-mexican-pork-burrito-bowls/e8ce1245-84b3-4e32-8c83-2b3b639ee990",
                            "score": 6,
                            "author": "ToastMmmmmmm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks, that looks pretty good. Do you know if burritos freeze alright? I'll assemble them the night before if not, but that would certainly be convenient.",
                                    "score": 2,
                                    "author": "stoobah",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes they freeze great, actually. Wrap in a damp paper towel and nuke 45-60 secs on each side, stick it into your thermos and it’ll be hot at lunch time.",
                                            "score": 7,
                                            "author": "ToastMmmmmmm"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I add in corn too…",
                                    "score": 2,
                                    "author": "O2B2gether"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Honestly think simple here couple chicken breasts ajar of salsa and some random extra veggies and your set for a burrito",
                            "score": 2,
                            "author": "Critical_Mastodon462"
                        },
                        {
                            "level": 2,
                            "comment": "Also, I got a crockpot lunch warmer, perfect for reheating left overs while I work morning away.\n\nBut on to your question:\n\nMy go to summer lunch is hummus with vegetables. Per cold soups like vichyssoise and cucumber with a vegetable hummus wrap or sandwich. The potato soup and dried chickpeas are made in my slow cooker.\n\nOr I make bean and grain like farro, barley or wheatberry salads with cold soups, or savory smoothies. I'll take a vichyssoise like base and drop some spinach in it. I make my beans except kidney beans from dried in my slow cooker. Yes, yes, I *know* it takes 30 seconds in an instant pot but if I'm not there to release it right away they turn to mush. Okay for hummus or soup purees but sometimes I just want a whole bean.\n\nI don't soak my dried chickpeas or other beans,  I just drop about a a cup of dried beans in the insert, add about 3-4 cups cold water. If making straight hummus and I care, I'll put about 1/4to 1/2 tsp baking soda in it so  the outer chickpea skin falls off. Most time though I'm batch cooking beans so I don't do this. Cook on high about two- 3 hours. Always comes out perfect. \n\nAlso,  I've made frittatas or savory bread puddings without meat in my slow cooker. Most of the time that can be eaten room temp.",
                            "score": 2,
                            "author": "Icy-Establishment298"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a little off topic but have you looked into those plug in warmers? I got one for my wife when she has to work during lock down and was trying not to leave her office. We got it off Amazon and it’s working three years later.",
            "score": 9,
            "author": "Last-Cold-8236"
        },
        {
            "level": 0,
            "comment": "Cold ratatouille, seasoned with olive oil, balsamic vinegar and basil, is fantastic on bread.",
            "score": 4,
            "author": "-Jakiv-",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sounds really nice, actually. Would you recommend a sandwich or a single slice on the bottom to keep fingers clean?",
                    "score": 1,
                    "author": "stoobah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I prefer on a slice of bread or in a flatbread (like pita), very pleasant in summer",
                            "score": 1,
                            "author": "-Jakiv-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Chicken cooked with praprika, ground coriander, ground cumin, chicken stock and water in the crock pot. Then shredded and eaten on a wrap",
            "score": 2,
            "author": "Impossible_Soil_2799",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would it need some flour near the end to thicken enough to put in a wrap?",
                    "score": 1,
                    "author": "stoobah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I haven’t done that before as I’ve used it to just make soft, shredded meat. But if you wanted it thicker with a bit of sauce then yep I’d add some flour after it’s shredded then thicken. You could also add a can of tinned tomatoes at the start as well :) I might try this next time actually, sounds tasty!",
                            "score": 2,
                            "author": "Impossible_Soil_2799"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe I'm the odd one here, but the things you're eating now can be eaten cold and are still good. Stew, Curry and chilli are usualy gotos for me along with pasta bakes/lasagna when I batch cook each week for work\n\nChilli/Curry if made a bit thicker also makes a great wrap filling by itself or mixed with rice, especially if you're considering pulled pork anyway.\nCold baked pasta isn't that dissimilar to a pasta salad anyway And can be nice with some leafy greens or veggies\n\nGranted some people do have to so some major mental gymnastics to consider eating things cold, and some just can't face it which is fair. Never been an issue for me, mind you I also eat this stuff for breakfast at work as I'm a postal worker and it's a good filling meal to see me through to the end of my shift.\n \n\nSpeaking of pulled pork, a Ham joint also works as a good filling for sandwiches of you cook it the same way with maybe some alcoholic cider or apple juice depending on your preference in there. Tastes good mixed with mustard afterwards or just in a wrap with some crunchy greens a fruity chutney and some good vintage cheese.",
            "score": 2,
            "author": "From-The-Depths",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really like the idea of just adding rice until the stuff I cook anyway is thick enough to put it a wrap. That's a great suggestion, thank you.",
                    "score": 2,
                    "author": "stoobah"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pasta salads are good cold\nCottage cheese salad\nBuffalo Chicken wraps\nSalads\nTaco dip\nCold cut sandwiches\nPotato salad\nVeggie pizza\nI like cold chicken wings (no sauce)",
            "score": 1,
            "author": "Rum4TheRoad"
        },
        {
            "level": 0,
            "comment": "Chicken thighs with either buffalo sauce, bbq sauce, or a jar of salsa. Cook then shred the chicken. You can make sandwiches, wraps, salads, or rice bowls.\n\nI personally don’t mind spaghetti and meat sauce cold. Not sure how weird that is lol. You can find some great meat sauce slow cooker recipes.",
            "score": 1,
            "author": "Vexation"
        },
        {
            "level": 0,
            "comment": "Garden vegetables wrap with cream cheese is my go to.",
            "score": 1,
            "author": "Sorryimlatefordinner"
        },
        {
            "level": 0,
            "comment": "There’s tons of bento lunch recipes on Pinterest",
            "score": 1,
            "author": "Coffeelover39"
        },
        {
            "level": 0,
            "comment": "Chicken Cesar wrap is one of my go tos. When I don't have lunch at work I'll just go to the local grocery and get a bag of Cesar salad, wraps, and some precooked chicken. If I want to get fancy I'll go for smoked salmon or precooked shrimp if they have it.",
            "score": 1,
            "author": "A_SNAPPIN_Turla"
        },
        {
            "level": 0,
            "comment": "The Ratatouille is really good cold.  Can eat with some cheese and crackers.  https://www.food.com/amp/recipe/ratatouille-in-the-crock-pot-52757",
            "score": 1,
            "author": "elisakiss"
        },
        {
            "level": 0,
            "comment": "Steak :)",
            "score": 1,
            "author": "PlagueCini",
            "replies": [
                {
                    "level": 1,
                    "comment": "To expand, I think a lot of meats tend to be good cold. Usually something that’s lean, since the fat turns into a bit of a weird texture. But stew/pot roast, or any meat-focused meal that has vegetables or starches is typically pretty good cold, as long as it’s not a thick or fat-based sauce.",
                    "score": 1,
                    "author": "PlagueCini"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sandwiches,   the key to a great sandwich is to have the meat/bread alone,  and any vegetables and sauces in their own container.  Just put it together right before you eat and it wont be soggy.",
            "score": 1,
            "author": "TigerPoppy"
        },
        {
            "level": 0,
            "comment": "Pizza!",
            "score": 1,
            "author": "Just_Ryan11"
        },
        {
            "level": 0,
            "comment": "What about getting one of those small desktop crockpots to reheat as is? Not sure if you’re allowed that at your work or not but it’s an idea.",
            "score": 1,
            "author": "Intelligent-Panda-33"
        },
        {
            "level": 0,
            "comment": "Salads with shredded meat.",
            "score": 1,
            "author": "Cayke_Cooky"
        },
        {
            "level": 0,
            "comment": "Veggie sandwiches are the bomb. Cut your veg, put it in your lunchbox with some bread and condiments, make it on the spot.",
            "score": 1,
            "author": "theblackesteyedpea"
        },
        {
            "level": 0,
            "comment": "Super basic, but I bring ham, Swiss, Dijon mustard, and apricot jam to keep in the work fridge. I lawyer it and roll it up- eat it like a burrito. Super tasty, high protein, and no microwave wait.",
            "score": 1,
            "author": "Known-Read"
        },
        {
            "level": 0,
            "comment": "Chicken salsa, just put it in a tortilla with your desired toppings.",
            "score": 1,
            "author": "123-for-me"
        },
        {
            "level": 0,
            "comment": "Borscht with a huge dab of sour cream &amp; chunk of bread is equally delicious hot or cold!",
            "score": 1,
            "author": "mochi_titties"
        },
        {
            "level": 0,
            "comment": "Salad with protein\n\nTuna or chicken salad with crackers or wrap\n\nMaybe ask your work to get another microwave.   They are not expensive.",
            "score": 0,
            "author": "1955photo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you have a suggestion for how to make tuna salad in a crock pot? It sounds interesting.",
                    "score": 1,
                    "author": "stoobah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don't cook tuna salad.  Use canned tuna and eat it cold.\n\nEveryone makes it a little different.  I use chunk light in water canned tuna, not albacore.   A 3 ounce can is good.    Drain most of the liquid off the tuna.  Hard boil a couple of eggs and chop them.  Throw in a generous glob of sweet pickle relish.  Stir in enough mayonnaise to stick it together.  Sometimes I add finely chopped onions. \n\nLook up recipes and choose one where you like the ingredients and try it.\n\nYou can also make ham salad,egg salad, and chicken salad, although those are quite different from tuna salad.",
                            "score": 1,
                            "author": "1955photo"
                        }
                    ]
                }
            ]
        }
    ]
}