{
    "id": "12gnh5j",
    "score": 1448,
    "title": "Nothing Says Easter Lunch Like Slow Cooker Lasagna!",
    "author": "BobsYourUnc",
    "date": 1681056359.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/12gnh5j",
    "media_urls": [
        "https://i.redd.it/jp3heuymbxsa1.png"
    ],
    "other_urls": [
        "https://www.thewickednoodle.com/slow-cooker-lasagna-ricotta-cheese/"
    ],
    "postText": "Recipe: https://www.thewickednoodle.com/slow-cooker-lasagna-ricotta-cheese/\n\nSlow cooker lasagnas are favorite holiday meals for my family. They can be prepped a day ahead and kept in the fridge until it is time to cook. Then, just kick it on in the morning and it's ready for lunch! Add some garlic cheese bread and boom ...happiness.\n\nAlways a family favorite here.",
    "comments": [
        {
            "level": 0,
            "comment": "You don’t get them crispy noodle edges here.",
            "score": 22,
            "author": "Cutter70",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have been told that if I do not add the half cup of water along the edge and let cook for an extra 45 min, the the edges do crisp up. I have never tried it though.",
                    "score": 9,
                    "author": "BobsYourUnc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve made many lasagne over the years, but now I will only make the one from SeriousEats or the one in the Carmine’s cookbook, from the restaurant in NYC.  Give it a try and do not substitute anything.  Yes there are a couple sauces in each and yes, please let them sit for at least an hour after they come out of the oven.  Both are delicious.",
                            "score": 4,
                            "author": "Cutter70",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are many lasagne recipes on serious eats. Mind sharing which one you recommend?",
                                    "score": 9,
                                    "author": "imakemyownroux"
                                },
                                {
                                    "level": 3,
                                    "comment": "Which one on serious eats?",
                                    "score": 3,
                                    "author": "justlikeinmydreams"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've always wondered about doing lasagne in a slow cooker. How does it compare?",
            "score": 84,
            "author": "Suspicious_Tap_1919",
            "replies": [
                {
                    "level": 1,
                    "comment": "I doubt that you will ever get your Italian Grandmother's approval on this recipe, but I do often hear it's \"better than Olive Garden.\"",
                    "score": 110,
                    "author": "BobsYourUnc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm sure it's delicious!! Olive Garden isn't a high bar though 😂",
                            "score": 60,
                            "author": "Lame_usernames_left",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey, I take what I can get when it comes to compliments. 😁",
                                    "score": 68,
                                    "author": "BobsYourUnc"
                                },
                                {
                                    "level": 3,
                                    "comment": "What did the Garden ever do to you?",
                                    "score": 14,
                                    "author": "SaintBeckett",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The food is pretty shit but I've paid $20 for worse. I'll take the salad and bread sticks.",
                                            "score": 22,
                                            "author": "elscallr"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As someone raised on authentic Italian food, I can answer this. \"The garden\" went beyond Americanization and completely bastardized our food to the point that it's offensive to call their dishes Italian food. The only thing they got correct is the fresh table side grated cheese",
                                            "score": 7,
                                            "author": "fuqit21",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's beyond lame because\n\na) the shitty baked ziti at your local pizza hole is better and cheaper\n\nb) you can make literally any item on Olive Garden's menu *better than they do* for under $5\n\nI try really hard not to be judgmental, but as soon as a person tells me they think Olive Garden is good my brain instantly jumps to judgemental thoughts lol",
                                                    "score": 15,
                                                    "author": "djsedna",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "under 5$?  not anymore.....",
                                                            "score": 7,
                                                            "author": "oongah"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "i agree, go down the street to carabas if you want decent chain rest. italian",
                                                            "score": 3,
                                                            "author": "febreeze_it_away"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "High enough.",
                                    "score": 2,
                                    "author": "1stEleven"
                                },
                                {
                                    "level": 3,
                                    "comment": "Literally took the words out of my thumbs",
                                    "score": 1,
                                    "author": "fuqit21"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I did it recently and turned my lasagna hating SO into a lasagna lover, it's genuinely amazing",
                    "score": 19,
                    "author": "Resident-Embarrassed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm concerned that your SO hates lasagna.. Who hates lasagna?!",
                            "score": 31,
                            "author": "smurf_senator",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I do. Well… I am fairly ambivalent. Much to the chagrin of my SO, who absolutely loves lasagna. \n\nI have bad acid reflux/GERD, so tomato-anything is rough. I’m also lactose intolerant, and ricotta is one of the higher lactose cheeses….\n\nSo I *can* eat it, but it generally causes enough misery in my GI tract that I avoid it.",
                                    "score": 6,
                                    "author": "goldensunshine429"
                                },
                                {
                                    "level": 3,
                                    "comment": "I do. It's a consistency thing. Lot of sogginess with ground meat and sauce and cheese/grease, layers of pasta that soak it all up I like corner pieces that have more crunch/better ratio of cooked pasta to sauce.",
                                    "score": 1,
                                    "author": "wannaknowmyname"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've made this a lot for the single entry grade sailors who don't get home cooked food at the on base club. There are never leftovers. Bunch of hungry dudes in early twenties/late teens say it's good lol. All they have in the barracks is ramen.",
                    "score": 13,
                    "author": "EmEmPeriwinkle"
                },
                {
                    "level": 1,
                    "comment": "It compares well to making it the traditional way since you cook the meat and add jarred sauce to it but the noodles are used uncooked. The noodles don't get mushy and are cooked nicely, it was one of the things i worried about. If your sauce has too much extra liquid it'll make things a little messy when scooping out. I usually put the crock in the oven for 35 or 45 minutes to crisp the cheese on top. I try to get 4 layers of meat, pasta and cheese which will last me for a week of leftovers. I also have to say no matter how it's made all lasagna gives me heartburn but it's so worth it.",
                    "score": 4,
                    "author": "Wicked_Kitsune"
                },
                {
                    "level": 1,
                    "comment": "I tried it once (cNt even remember the recipe I used) but the flavor was definitely their lol but kinda turned to a \"lasagna soup\"\n\nFrom what I recall I pre-cooked my lasagna.  And the ground beef. And layered it like a lasagna. But yea it kinda became \"slop\" haha but tasted delish af....I'm a huge fan of lasagna.  From what I was later told I shouldn't have pre cooked the lasagna.....ither people said use \"regular\" dry lasagna but don't boil it prior...kimda.makes.sense. cause with the tomato sauce etc it would help cook down the pasta?",
                    "score": 2,
                    "author": "DizzyCommunication92",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If I’m at the point where I’m putting in the effort for lasagne layers I want the real thing instead of making it in the slow cooker. \n\nI’d rather have a baked ziti or tortellini soup than a half-assed lasagne.",
                            "score": 4,
                            "author": "heirloom_beans"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": " I'm usually a \"from scratch\" cook but I recently broke my foot so my husband was doing the cooking for awhile. I found a crockpot lasagna recipe for him, it was super easy to put together and it turned out almost as good as my scratch made lasagna. I will say tho it doesn't get that baked crust on top but it was easy and quick for him to prepare.",
                    "score": 2,
                    "author": "AlaskanBiologist"
                },
                {
                    "level": 1,
                    "comment": "If you’re not picky it will be edible on par with a store bought frozen lasagna. If you’re expecting a good lasagna you will be extremely disappointed. \n\nSo it really depends on your own personal barometer for decent Italian food.",
                    "score": 6,
                    "author": "junkit33",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "welcome to Subjective Ville !!",
                            "score": 3,
                            "author": "oongah"
                        },
                        {
                            "level": 2,
                            "comment": "All I see here is \"I can't cook or season properly please save me\".",
                            "score": 1,
                            "author": "Cakeo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve done lasagna 3 times in the slow cooker. The first time it came out perfectly. The other two times it was terrible, burnt mostly and just didn’t turn out the same. I’m not sure exactly how I did the first one to be so perfect.",
            "score": 8,
            "author": "AgentMercury108",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dont you hate that for any recipe? I think you meticulously follow the recipe the first time and then kinda phone it in afterwords, skimping on ingredients and adding your own etc.",
                    "score": 7,
                    "author": "Fudge89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am often guilty of this. Especially, if it is something I make a lot. Or something that I have to alter the  recipe to feed more people.",
                            "score": 1,
                            "author": "BobsYourUnc"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love slow cooker lasagna. It’s probably my most favourite meal to be cooked in the slow cooker.",
            "score": 5,
            "author": "CoastalParadise",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is definitely a favorite around here. Lasagna and taco soup are always battling for the top spot on the menu",
                    "score": 3,
                    "author": "BobsYourUnc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can I get the taco soup recipe as well,this looks so good man.",
                            "score": 2,
                            "author": "Crazy-Mango-7378",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Here you go ... enjoy! https://thegiftedgabber.com/easy-taco-soup/",
                                    "score": 3,
                                    "author": "BobsYourUnc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you very much",
                                            "score": 2,
                                            "author": "Crazy-Mango-7378",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're welcome! Let me know how it turns out.",
                                                    "score": 2,
                                                    "author": "BobsYourUnc"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "*what is this witchcraft mine eyes see before me!?*",
            "score": 7,
            "author": "dreamer_0f_dreams",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ancient wisdom from the Stregheria practitioners of olde.",
                    "score": 2,
                    "author": "BobsYourUnc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What Nonna doesn't know, doesn't hurt her. Just be sure to throw the empty jars of Ragu in the neighbors 's trash.",
                                    "score": 2,
                                    "author": "BobsYourUnc"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meat + ricotta + mozzarella + sauce, all have a lot of moisture.\n\nThen, cooking sealed in a slow cooker ... doesn't it get soggy?",
            "score": 5,
            "author": "SoUpInYa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not at all. The ground beef is drained excessively and there are three noodle layers. The noodles seem to soak up most of the moisture and it is enough to soften them without them turning to mush.",
                    "score": 3,
                    "author": "BobsYourUnc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want to make that.\n\nBut I don't know what Italian sausage is supposed to be.",
            "score": 3,
            "author": "1stEleven",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's just a pork sausage with red pepper and fennel. It is not hard requirement, but does add a nice zing to the dish.",
                    "score": 8,
                    "author": "BobsYourUnc"
                },
                {
                    "level": 1,
                    "comment": "I just use pork mince",
                    "score": 1,
                    "author": "chaostrulyreigns"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am intrigued! Would be cool to see a piece when cut.",
            "score": 10,
            "author": "Party_Razzmatazz8329",
            "replies": [
                {
                    "level": 1,
                    "comment": "Full disclosure. You rarely get a Pintrest ready slice out of the slow cooker. But it is tasty.",
                    "score": 25,
                    "author": "BobsYourUnc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be honestly a lot of the Pinterest worthy piece are cut and served cold if not almost frozen to get the perfect shape and image",
                            "score": 6,
                            "author": "glittersparklythings",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lasagna is better out of the fridge the second day anyway though 🤤",
                                    "score": 2,
                                    "author": "djsedna"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Fair enough 😊",
                            "score": 2,
                            "author": "Party_Razzmatazz8329"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This looks good, but for Easter it's gotta be ham. Spiral Ham, slow cooker ham, scalloped potatoes and chucked ham, home cooked sliced ham sammich on buttered bread hold the mayo... But you dish does look very good....",
            "score": 38,
            "author": "WalleyeFishingFool",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lets meet in the middle and have a ham lasagne?",
                    "score": 18,
                    "author": "Dave4lexKing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now is the ham replacing the noodles in a keto scenario?",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't give them ideas 🤣",
                                    "score": 3,
                                    "author": "glittersparklythings",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean ... there is this: [Ham &amp; Cheese Lasagna ](https://www.tasteofhome.com/recipes/ham-n-cheese-lasagna/) 😆",
                                            "score": 3,
                                            "author": "BobsYourUnc",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can totally see this with Alfredo, spinach and smoked gouda. Yum",
                                                    "score": 4,
                                                    "author": "Boofofus"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The middle it be.... Can I still have a ham sammich with it?",
                            "score": 4,
                            "author": "WalleyeFishingFool"
                        },
                        {
                            "level": 2,
                            "comment": " We had ham and lasagna. I've never made it in a slow cooker but I will say that no cook lasagna noodles are a game changer.",
                            "score": 1,
                            "author": "LouSkuntte"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Add to that asparagus and fruit salad! Classic Easter meal. Although my Mom used to do leg of lamb on occasion.",
                    "score": 3,
                    "author": "Prvrbs356",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Growing up, fruit salad was always part of holiday meals. So was ambrosia salad.",
                            "score": 4,
                            "author": "BobsYourUnc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Love ambrosia! And, jello salads!🤣. So 50's",
                                    "score": 3,
                                    "author": "Prvrbs356",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now I am feeling nostalgic. Will have to make some ambrosia salad!",
                                            "score": 2,
                                            "author": "BobsYourUnc",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I miss my Grandma's home made cannoli and ravioli....and salads....and",
                                                    "score": 4,
                                                    "author": "oongah"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "...Am I the only one who cooks a turkey for Easter?",
                    "score": 1,
                    "author": "IAMA_Plumber-AMA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes you are....",
                            "score": 2,
                            "author": "WalleyeFishingFool",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sweet. I'll just keep on doing that then.",
                                    "score": 2,
                                    "author": "IAMA_Plumber-AMA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes Ma'am and be doing by that.... Going for the wish bone.... And yes it works...",
                                            "score": 2,
                                            "author": "WalleyeFishingFool"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This looks so good",
            "score": 3,
            "author": "Worldview-Queen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks. It was a hit!",
                    "score": 1,
                    "author": "BobsYourUnc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always see crock pot lasagna recipes but I’m always skeptical. You might’ve just sold me on it",
            "score": 3,
            "author": "LexIsTheAsshole",
            "replies": [
                {
                    "level": 1,
                    "comment": "Everyone here enjoyed it today. It's definitely worth a try!",
                    "score": 1,
                    "author": "BobsYourUnc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ooooohhh, gonna have to try this in my casserole crockpot!",
            "score": 2,
            "author": "pittipat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Casserole crockpot? Tell me more.",
                    "score": 1,
                    "author": "BobsYourUnc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Voila!] (https://www.amazon.com/Crock-Pot-3-5-Quart-Casserole-Manual-Charcoal/dp/B00KD346MW/ref=sr_1_2?keywords=crockpot%2Bcasserole%2Bslow%2Bcooker%2B9x13&amp;qid=1681074561&amp;sprefix=crockpot%2Bcass%2Caps%2C474&amp;sr=8-2&amp;th=1)",
                            "score": 3,
                            "author": "pittipat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nice! I may have to add this to the wish list!",
                                    "score": 3,
                                    "author": "BobsYourUnc"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does the cheese get crispy on the edges? Seems like there would be too much moisture and I can't tell from the picture.",
            "score": 2,
            "author": "Smeeklekins",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not the way it is prepared here. The Family are not fans of crispy edges. So, I add a half cup of water along the edges.\n\nI have been told that if I do not add the half cup of water along the edge and let cook for an extra 45 min, the the edges do crisp up. I have never tried it though.",
                    "score": 3,
                    "author": "BobsYourUnc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never thought about doing lasagna in a slow cooker",
            "score": 2,
            "author": "FortyTwoBrainCells"
        },
        {
            "level": 0,
            "comment": "Happy Easter!!!",
            "score": 2,
            "author": "danr246"
        },
        {
            "level": 0,
            "comment": "I did not know this was a thing, yum",
            "score": 2,
            "author": "Dylan_onfire"
        },
        {
            "level": 0,
            "comment": "I know this is a slow cooker version but anyone know if I could make it faster in an instantpot?",
            "score": 2,
            "author": "Malipuppers"
        },
        {
            "level": 0,
            "comment": "To Amp up your red meat sauce for lasagna or spaghetti, try this: Saute chopped Baby Bella mushrooms in butter. Add to sauce with some of the juice. Adds a whole other layer of flavor. And, I use Jar pasta sauce as my base. Whatever is on sale. Add onions, garlic, brown sugar to taste. I'm not a big fan of tomato sauce, so I try to doctor it up to get rid of the tin can taste.",
            "score": 2,
            "author": "Prvrbs356",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds good. I will try that the next time I make it. Thanks for the tip!",
                    "score": 1,
                    "author": "BobsYourUnc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're welcome Boss! I also add sauted baby bellas to my homemade Chicken Noodle Soup. (Mushrooms cooked separately and added in). When my daughter was little she said to me, \"I like Auntie JoJo's Chicken soup better\".🤣. (Outta the mouths of babes). I asked my sister what she did that made hers better.  She said she added a can of tomato sauce. Yep, that small tip was the game changer. And it wasn't overkill on the \"tin can taste\". My personal tip on CNS, LOTS of garlic! Like 7 cloves.",
                            "score": 1,
                            "author": "Prvrbs356",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; LOTS of garlic.\n\nImproves just about any recipe.",
                                    "score": 1,
                                    "author": "BobsYourUnc"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I never thought of doing this, thank you! :)",
            "score": 2,
            "author": "xoagray",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're welcome. Enjoy!",
                    "score": 2,
                    "author": "BobsYourUnc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Put a French dip recipe from this very subreddit in the slow cooker before I went off to sing for the high mass!",
            "score": 3,
            "author": "Spam203"
        },
        {
            "level": 0,
            "comment": "Lasagna is the one pasta dish I'll do in a cooker. Thick lasagna noodles on a 4 hour high does work without becoming mush. Go a bit wetter than on the sauce. Also happens to be the only noodle for chicken noodle soup where your leftovers aren't mush the next day.",
            "score": 2,
            "author": "atlgeo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lasagna noodles for chicken noodle soup. Nice tip! I will give it a try.",
                    "score": 2,
                    "author": "BobsYourUnc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m keto and want to literally dip my pussy in this",
            "score": 2,
            "author": "rude-canadian",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's one way to enjoy this. Just let it cool first.",
                    "score": 1,
                    "author": "BobsYourUnc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You sure about that?",
            "score": 0,
            "author": "dumbdumb407"
        },
        {
            "level": 0,
            "comment": "there’s like.. a billion things that say Easter better than a show-cooker lasagna, wtf are you talking about??",
            "score": -3,
            "author": "iheartnickleback"
        },
        {
            "level": 0,
            "comment": "I don’t get it, you put cooked meat, raw pasta, cheese and sauce in a slow cooker and cook it for hours? Why? Pasta takes like 10 minutes to boil.",
            "score": 1,
            "author": "tejanonuevo",
            "replies": [
                {
                    "level": 1,
                    "comment": "My take on that would be because boiling lasagna noodles is a PITA. It's also nice to get it all prepared and in crockpot, forget about it, get the horrendous mess cleaned up and be ready for your guests. Speaking for myself,  I like to get as much done ahead of time as I can. Myself,  I make it the day ahead. I've never attempted lasagna in the crockpot.",
                    "score": 2,
                    "author": "Prvrbs356"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm Italian.  Apparently before I was born all the relatives had ravioli every holiday also. In addition to traditional meats.",
            "score": -2,
            "author": "Prvrbs356"
        },
        {
            "level": 0,
            "comment": "Oh, I use the one in the cookbook, with the béchamel sauce.  I had never gone online for that recipe.",
            "score": 1,
            "author": "Cutter70"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mozzarella and Ricotta.",
                    "score": 1,
                    "author": "BobsYourUnc"
                }
            ]
        }
    ]
}