{
    "id": "12psvuz",
    "score": 344,
    "title": "Mississippi pork loin with a buch of potatoes. My approximation if a recipe in the comments",
    "author": "Electronic_Orange624",
    "date": 1681758075.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/12psvuz",
    "media_urls": [
        "https://i.redd.it/4kczvaz6ajua1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Will be done in about 6 hours on low.  Will post the final results then.\n\nI took a 2 lb pork loin and slathered some beef better than boullion on it.  Packet of liptons onion soup.  Half packet of ranch powder.  Pepperoncini and juice.  Half stick butter. I probably have more potatoes than pork but oh well, I love potatoes",
            "score": 22,
            "author": "Electronic_Orange624",
            "replies": [
                {
                    "level": 1,
                    "comment": "This may be a stupid question (I'm new to using slow cookers), but do you also need to add any liquid to this?\n\nThe photo looks good, I'm excited to see the results.",
                    "score": 7,
                    "author": "physicalzero",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " Not OP, but when I make it (sub potatoes for onions) I never have to add water. I add in mushrooms about an hour or two before it is done as well which helps.",
                            "score": 14,
                            "author": "4stringsoffury"
                        },
                        {
                            "level": 2,
                            "comment": "I added juice from the pepperoncini jar.  Probably about 1/4 cup.  I haven't used pork in the slow cooker much so I'm not sure how much liquid will release from that.  This is an experiment, really, based on the Mississippi pot roast recipes.",
                            "score": 12,
                            "author": "Electronic_Orange624"
                        },
                        {
                            "level": 2,
                            "comment": "Most meat will make its own broth but keep a eye on it just so you can judge for yourself for the next time.",
                            "score": 3,
                            "author": "BethsMagickMoment"
                        },
                        {
                            "level": 2,
                            "comment": "The liquid comes from the pepperoncini juice and the meat (beef) itself, you have to trust the process so its a bit of a nail-biter, but I have done it a few times and its always fine -- including the one time my son dumped all of the pepperoncini juice in the pot, lol.\n\nThe juice/gravy is usually not running or thin so if you add more water you run the risk of thinning out the liquid.\n\nTrust the process but have Dominos on speed dial ... lol jk",
                            "score": 3,
                            "author": "SevereDependent"
                        },
                        {
                            "level": 2,
                            "comment": "some moisture. even a couple teaspoons of water. im slow cooking right now, cant just be dry as bone",
                            "score": 3,
                            "author": "Defiant-Doughnut-178",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree with DD. Need some liquid.  I have never used butter though which I do love. I feel there is enough fat already in there. The good thing about this recipe it’s hard to screw up and can except many substitutions. I love this subreddit.",
                                    "score": 2,
                                    "author": "Smackysan"
                                },
                                {
                                    "level": 3,
                                    "comment": "Um I put meat in all the time with no liquid. Especially pork and potatoes, let’s off a lot of liquid",
                                    "score": 5,
                                    "author": "BSBitch47",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Correction, fats, mushrooms, moisture containing items will clearly release the said 2 teaspoons of liquid. Try putting potatoes in by themselves then lmk chef. Thought it was self explanatory.",
                                            "score": -18,
                                            "author": "Defiant-Doughnut-178"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice to see people using different meats with this recipe! I love doing Chuck roast, but I generally only do it when they go on sale because they are close to 30 dollars. I’ve made it with chicken and it’s amazing.",
            "score": 11,
            "author": "Burritobabyy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did chicken a few months ago and loved it.",
                    "score": 4,
                    "author": "Electronic_Orange624"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It may be salty unless u have the reduced sodium BTB. I’ve made that mistake so I just wanted to mention it esp with the onion soup mix",
            "score": 6,
            "author": "BSBitch47",
            "replies": [
                {
                    "level": 1,
                    "comment": "if they have a lot of potatoes, they may be ok...  iirc, potatoes will soak up a lot of salt.",
                    "score": 7,
                    "author": "gogozrx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is what I'm hoping for.  I've used the soup mix for stews in the past and they don't turn out salty when I put potato in with the stew meat.  The BTB on the meat is a test.",
                            "score": 5,
                            "author": "Electronic_Orange624"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interested in how this turns out. A pork loin in a slow cooker seems like a bad idea.",
            "score": 6,
            "author": "mojogirl_",
            "replies": [
                {
                    "level": 1,
                    "comment": "O no. They can be delicious. Even if they’re small. Just gotta go low and slow",
                    "score": 6,
                    "author": "BSBitch47"
                },
                {
                    "level": 1,
                    "comment": "Just did one yesterday first time trying this recipe too! 3 lb pork loin, 1 packet of ranch, 1 packet of au jus, stick of butter, 7 pepperoncinis and that was it. Came out amazing, eating leftovers right now with plain white rice. I wanted to do a chuck roast but couldn't pull myself to pay that price. The pork loin was I think $9 or $10 at Aldi\n\nEdit: Found the receipt. 3.34 lb pork loin for $6.98. lmao",
                    "score": 4,
                    "author": "whiskeyBubbl"
                },
                {
                    "level": 1,
                    "comment": "This right here. Terrible cut for this recipe/cooking technique",
                    "score": 2,
                    "author": "bringbackswordduels"
                },
                {
                    "level": 1,
                    "comment": "Right. Not enough fat. A pork butt/shoulder would probably be a better choice here. But I am rooting for OP, I hope it's great.",
                    "score": 2,
                    "author": "growling_owl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is.  I posted the results a bit ago",
                            "score": 5,
                            "author": "Electronic_Orange624"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Isn’t loin a bit too lean to cook for that long?",
            "score": 2,
            "author": "rattalouie",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was done by the 5 hour mark.  Tasted good to me",
                    "score": 1,
                    "author": "Electronic_Orange624"
                }
            ]
        },
        {
            "level": 0,
            "comment": "those potatoes are likely going to be mush, no?",
            "score": 1,
            "author": "ForeverInaDaze",
            "replies": [
                {
                    "level": 1,
                    "comment": "Naw. Honestly I’d say the mistake was putting them on top. All my carrots and spuds go beneath the meat.",
                    "score": 2,
                    "author": "ChawulsBawkley",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some potatoes are underneath. And I just checked and rhere is so much jus in the pot now,",
                            "score": 3,
                            "author": "Electronic_Orange624",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Eyyyy nice! I’m sure it’s gonna turn out awesome.",
                                    "score": 1,
                                    "author": "ChawulsBawkley",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It did.  Posting the results now",
                                            "score": 2,
                                            "author": "Electronic_Orange624",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Saw the results. Potatoes look amazing and so does the pork. Good job",
                                                    "score": 1,
                                                    "author": "ForeverInaDaze"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "whenever I've done the beef mississippi roast, the added potatoes tend to take on a creamy consistency. Yeah, they'll still fall apart, but right at that 8 hour mark, they're godlike.",
                    "score": 1,
                    "author": "AutumnInNewLondon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "😮‍💨😮‍💨 another day another 5 times I see the same mid roast. Hope you enjoyed it though!",
            "score": -1,
            "author": "zKuza"
        },
        {
            "level": 0,
            "comment": "How do you get your potatoes to soften?  I love making stew in my slow cooker, but the potatoes and carrots don't ever get as soft as I'd like.",
            "score": 1,
            "author": "RustedAxe88",
            "replies": [
                {
                    "level": 1,
                    "comment": "They just do",
                    "score": 1,
                    "author": "Electronic_Orange624"
                }
            ]
        },
        {
            "level": 0,
            "comment": "👀",
            "score": 1,
            "author": "prodigalgun"
        },
        {
            "level": 0,
            "comment": "I really wish I didn't see so many of these posts. \n\nPosting something that A LOT of people make isn't innovative.\n\nI'm on the subreddit to get ideas. The regurgitation of popular recipes just isn't interesting.",
            "score": -30,
            "author": "candornotsmoke",
            "replies": [
                {
                    "level": 1,
                    "comment": "If something isn't interesting then just scroll down and find something more interesting.",
                    "score": 13,
                    "author": "Electronic_Orange624"
                },
                {
                    "level": 1,
                    "comment": "I'm on this subreddit to both support cooks who are proud of their culinary journey and find new ideas.\n\nThat's just me, though.",
                    "score": 18,
                    "author": "BadcaseofDTB"
                },
                {
                    "level": 1,
                    "comment": "OP adapted the Mississippi roast recipe and made something slightly different. Tbh it sounds pretty good and I kinda want to try it.",
                    "score": 18,
                    "author": "the-dandy-man"
                },
                {
                    "level": 1,
                    "comment": "A really good way to ensure you keep seeing things you don’t want to see is to engage with the posts you don’t like.",
                    "score": 9,
                    "author": "OneHandedPaperHanger"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or people who comment, “my family and I didn’t like it so try it this way” and post it in the comments instead of making their own post about it.",
                            "score": 1,
                            "author": "BSBitch47"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Then leave this sub. It’s really that simple💁🏻‍♀️",
                    "score": 3,
                    "author": "BSBitch47"
                },
                {
                    "level": 1,
                    "comment": "&gt;I'm on the subreddit to get ideas.\n\nWhy should internet strangers care about what you want? Go look for recipes literally anywhere else. You have internet access which means you can use Google. You can buy cookbooks or check them out at the library. The world doesn't revolve around you just because you feel entitled to that.",
                    "score": 3,
                    "author": "StormyBlueLotus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I posted it in a separate post.",
                    "score": 1,
                    "author": "Electronic_Orange624",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh okay, I didn’t see it thank you!",
                            "score": 1,
                            "author": "wOwOkAYee"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I finally tried the Mississippi pot roast and my family really didn’t care for it nor did I. \n\n Try it with a couple of Bay Leaves and if you are making it with a Beef Roast add some Old Bay seasoning. Just sprinkle it on the meat to marinate for a couple of hours and then cover it with water and let it cook.\n\n I cook it on high for a good hour and then turn it to low and just let it cook. Mine always falls apart and so tender.\n\n If you want veggies just add them a couple of hours before serving. Turn the cooker up to high so the veggies get done. Especially the carrots and potatoes!\n\n I seen so many Mississippi Pot Roast recipes but I was surprised how salty mine was and I followed a recipe exactly.\n I am going to try it again but next time I think I’ll use one with the Montreal Steak Seasoning instead of the Hidden Ranch just to see how it tastes! Never know until you try it out I guess.",
            "score": 0,
            "author": "BethsMagickMoment",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh if you are looking for a good place to find recipes, check out Tasty.com.\n I have found some really great ones. Also videos and best of all, it’s free!",
                    "score": 1,
                    "author": "BethsMagickMoment"
                }
            ]
        }
    ]
}