{
    "id": "139xspn",
    "score": 5,
    "title": "How long and at what temp to reheat frozen chicken?",
    "author": "eatmoremeatnow",
    "date": 1683397279.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/139xspn",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello,\n\nWe are having a Cinco De Mayo party today (yes a day late) and I have some previously slow-cooked chicken and veggie taco stuff that is currently in the freezer. It was good but we made too much about a month ago so froze it for the party.\n\nAnyway, I can't decide on how long it will take to thaw it and bring it up to temperature. I don't know if it should be at warm or low (possibly high for a couple hours).\n\nAny advice?",
    "comments": [
        {
            "level": 0,
            "comment": "*It looks like you're asking about Food Safety.*\n\nOnly you are aware of all the factors involved in this situation. No one in this subreddit is qualified to give you advice about eating food that's left unattended, undercooked, etc. \"If in doubt, toss it out.\" Food poisoning is a serious issue - it's particularly dangerous to older adults, children, pregnant women or people with compromised immune systems.\n\nHere are some resources available to you to determine whether it would be safe or not to consume your meal:\n\n* https://www.reddit.com/r/slowcooking/wiki/index#wiki_food_safety_tips\n* https://www.foodsafety.gov/\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/slowcooking) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "In case this ever helps people we ended up having to microwave it for a while to get it out of the glassware as it was very frozen. \n\nWe put it on low for about 4 hours and it was good when we ate it. \n\nI will finish the rest off in leftovers tomorrow.",
            "score": 1,
            "author": "eatmoremeatnow"
        }
    ]
}