{
    "id": "139zaak",
    "score": 1030,
    "title": "Jambalaya!",
    "author": "ElvisOnTheToilet",
    "date": 1683400603.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/139zaak",
    "media_urls": [],
    "other_urls": [],
    "postText": "Fist time making it. Definitely a few tweaks to make for next time, but overall wasn’t too bad!",
    "comments": [
        {
            "level": 0,
            "comment": "From a fellow cajun, best jumbalaya has drier rice by frying it. When the pot is too small or you have too much gravy the rice becomes too soggy. Use something a little larger than what you’re cooking because the surface area will crisp that rice a little and makes all the difference! Learned from experience",
            "score": 101,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I saw “jambalaya” and then saw the crockpot a small part of my soul died lol",
                    "score": 21,
                    "author": "MAK3AWiiSH"
                },
                {
                    "level": 1,
                    "comment": "From Cajun South. 100% agree. We applaud the effort though.",
                    "score": 6,
                    "author": "Competitive_Fig_6668"
                },
                {
                    "level": 1,
                    "comment": "Oh I see! Thank you, I’ll put that in my notes",
                    "score": 19,
                    "author": "ElvisOnTheToilet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also, just an idea as well, toast the rice in oil before adding it. It's more of a spanish technique, but it should help you in that front!",
                            "score": 15,
                            "author": "Shilamizane",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "100%, makes a hell of a difference. I always fry the rice off.",
                                    "score": 3,
                                    "author": "On_The_Blindside"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Similar to how you toast arborio before making risotto!",
                    "score": 1,
                    "author": "mamapapapuppa"
                },
                {
                    "level": 1,
                    "comment": "I realise I always make mine too soggy! Would you have a recipe your recommend because crispy rice sounds amazing?",
                    "score": 1,
                    "author": "palpies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t have a recipe just memory from my parents making it. But to obtain the crispy rice a few things I learned is 1. Cook more rice than you think you need because if you don’t have enough and you mix the gravy and rice there’s no amount of cooking that will crisp them they will be over saturated. 2. Like I mentioned before use a pot with a large bottom surface area, if there’s too much rice the bottom traps moisture and you can turn it continuously but it only helps so much. 3. When my rice is finished cooking I immediately remove it from rice cooker and spread it out on a baking tray so that the excess water evaporates. Mushy rice from the get-go will only get mushier.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No soup for you!",
            "score": 45,
            "author": "historycat95",
            "replies": [
                {
                    "level": 1,
                    "comment": "You want bread?",
                    "score": 8,
                    "author": "RosebudWhip",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "$3.00!!!",
                            "score": 5,
                            "author": "TheJane_Dough"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m telling you, while I prepped this, made it, ate it, each time I said it in my head or aloud, I said it just like Newman. *sniff* Jambalayaaa!",
                    "score": 32,
                    "author": "ElvisOnTheToilet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In my mind’s eye I saw that scene and heard his voice 🍲",
                            "score": 8,
                            "author": "NefariousShe"
                        },
                        {
                            "level": 2,
                            "comment": "I eat jambalaya often, and lemme tell you, I have to say it every time",
                            "score": 4,
                            "author": "InspectorFadGadget"
                        },
                        {
                            "level": 2,
                            "comment": "I'm not exaggerating when I tell you, probably like 90% of the time when I get takeout, doesn't even matter what kind, I'll stick my face in the bag a la Newman, and exclaim JAMBALAYAAA! and prance away giggling.",
                            "score": 3,
                            "author": "regularlow6222"
                        },
                        {
                            "level": 2,
                            "comment": "HA",
                            "score": 1,
                            "author": "Lets_Make_A_bad_DEAL"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm from south Louisiana. I know my Cajun v Creole cooking.\n\nCreole is New Orleans style that includes tomatoes many times. \n\nCajun is more rustic and you NEVER use tomatoes unless you want to be shunned and cursed. \n\nFirst,  chop and measure everything. \n\nSecond,  cook a few pieces of bacon.  Eat the bacon,  but,  save some of the grease in the pot.\n\nAdd your rice and cook until lightly golden.  Remove rice. \n\nAdd your chopped veggies until slightly golden. \nDo not cook the garlic at the same time.  Too long cooking the garlic makes it bitter. A few minutes is fine. \n\nBrown your meats.\n\nPlace all ingredients in the pot or slow cooker.\n\nThen,  either cook in your slow cooker or finish on the stove. \n\nI make \"sweep the kitchen\" jambalaya. \nCrab, shrimp, ham,  chicken, and sausage.  Use the amounts of each that you'd like. \n\nJambalaya is hard to mess up.",
            "score": 23,
            "author": "SnooMacaroons7893",
            "replies": [
                {
                    "level": 1,
                    "comment": "SAME! I never make creole jambalaya 😅 Also from southern Louisiana and it's always been a big-ass pot of chicken and sausage jambalaya cooked outside on the porch lol. I hadn't even HEARD of people putting in tomatoes until I was an adult! I was horrified 😂",
                    "score": 5,
                    "author": "Helpful-Focus-6424",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm from Lafayette, but,  have relatives in New Orleans. It's a BIG fight at family reunions over tomatoes v no tomatoes! 😀\n\nBoth are good,  but,  I prefer no tomatoes\n\nI miss buying my meats there.  The Meatatory, Scott's Best Stop, Rouses, etc. \n\nIf you're near Arnaudville, please go eat at The Little Big Cup for me.",
                            "score": 3,
                            "author": "SnooMacaroons7893",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I live up in Tennessee now 😭 but I do miss it so so much",
                                    "score": 3,
                                    "author": "Helpful-Focus-6424",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We don't realize how great the food is in Louisiana, even at a gas station buffet,  until we leave.  \n\nAt least you're still in the south. I love Tennessee.",
                                            "score": 3,
                                            "author": "SnooMacaroons7893",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's gorgeous, but I miss the seafood",
                                                    "score": 3,
                                                    "author": "Helpful-Focus-6424",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I understand. I've got family there.  Nashville. Maryville. Franklin.\n\nLovely,  friendly people.",
                                                            "score": 3,
                                                            "author": "SnooMacaroons7893"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can’t forget the tony’s!",
                    "score": 2,
                    "author": "its_ben_real",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No,  sir! Can't leave out the Tony's or Cavender's Greek seasoning.",
                            "score": 1,
                            "author": "SnooMacaroons7893"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What spices and when to throw them in?",
                    "score": 1,
                    "author": "highlighter416",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What are you wanting to make?",
                            "score": 1,
                            "author": "SnooMacaroons7893"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What's your gumbo advice then?",
                    "score": 1,
                    "author": "flarefire2112",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To make it often! 😁\n\nLet me know what type you want to make.  I'll help you. \n\nMy favorite is smoked turkey gumbo in Thanksgiving weekend.",
                            "score": 1,
                            "author": "SnooMacaroons7893"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a cajun, the squishy rice wounded me... but tbf that jambalaya is more creole than cajun. \n\nPro tips: chicken thighs are juicier and almost impossible to overcook, plus cheaper. If you're going to do the creole way, please use the trinity. Chicken and sausage is *the* best combo, and shrimp is common in creole jambalaya, just sort of not all at once if ya feel me. Please god please do not put cornstarch in your jambalaya. Google roux. It will change your life, and it's the base to A LOT of dishes, cajun and otherwise. Sauté your veggies and meats (other than shrimp). You get more flavor that way, and once you're done you can throw your rice in to toast. THEN add liquid. The best jambalaya has a sacrificial layer of rice that's burned to the bottom of the pot. It's basically the barrier between the heat source and all the perfectly fluffy rice throughout the rest of it. It's important to note that jambalaya is not a soup, so it should cook more like a big-ass pot of rice than a soup. I could probably go on and on, but that's the basics that I think could help you a bit.",
            "score": 27,
            "author": "Helpful-Focus-6424",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for those tips. To clarify i didn’t use any cornstarch, that was just part of the recipe I found. But glad I didn’t, I will use your knowledge.",
                    "score": 7,
                    "author": "ElvisOnTheToilet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Absolutely! I'm happy to help!",
                            "score": 1,
                            "author": "Helpful-Focus-6424"
                        },
                        {
                            "level": 2,
                            "comment": "Perfect Cajun jambalaya requires a calculator.\n\nhttps://www.nola.com/entertainment_life/eat-drink/the-jambalaya-calculator-could-only-exist-in-louisiana/article_dd6265d7-99dc-5516-84f0-4ad47f53ca05.html",
                            "score": 1,
                            "author": "H_I_McDunnough"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don't suppose you have a vegetarian jambalaya recipe?",
                    "score": 2,
                    "author": "420xMLGxNOSCOPEx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Vegetarian and cajun doesn’t go all that well together, most of the flavor of the dishes come from the meats. You could try standard meat substitutes, but I’ve never heard of a vegetarian cajun dish.",
                            "score": 6,
                            "author": "Always_Confused4",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah damn I did worry about that. Thank you for the info ☺️",
                                    "score": 1,
                                    "author": "420xMLGxNOSCOPEx"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It can be modified, but yeah cajun and creole food is *poor people food* these recipes were passed down through generations of people who lived off of what was available to them, and a lot of that includes at least seafood. My dad makes his jambalaya with a lot of mushrooms, so you could start there! There are mushrooms that can substitute chicken and seafood, just whatever you like. I would sub chicken stock for veggie stock, and don't forget to season the hell out of it. The mushrooms should make it very umami and satisfying imo",
                            "score": 5,
                            "author": "Helpful-Focus-6424",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Throw some Djon Djon in there. Haitian variety of mushroom, SUPER tasty. Often used in rice to bring it flavour, that's how potent it is.",
                                    "score": 2,
                                    "author": "TheVog"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Vegetarian and Cajun may not be the classic combo, but you can definitely make some good substitutes. If you do eat fish, a seafood route is still classic and delicious. Otherwise, I like using beans and mushrooms as the base for mine typically. Sautéed mushrooms with onion in some Cajun spices (Slap Ya Mama for a great low-sodium option or Tony Cachere’s for the usual go-to, plus some smoked paprika that gives it a real meatiness). Even tofu with the right spices can be a good substitute in these dishes.",
                            "score": 2,
                            "author": "youpeesmeoff"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My cat just fully eyed up that sausage slice. Looks like it would make the full feel famished. Beautiful food!",
            "score": 5,
            "author": "foxvipus"
        },
        {
            "level": 0,
            "comment": "Hiya folks. I’d like to clarify two things. 1. The pics don’t look as appetizing as it did irl. 2. I just started cooking this year, I don’t know what I’m doing, this was actually the first time I ever cooked rice in any sort of way. It was delicious, thank you to the kind people with positive words. And to the people downvoting all over the place, you can go suck an andouille.",
            "score": 18,
            "author": "ElvisOnTheToilet",
            "replies": [
                {
                    "level": 1,
                    "comment": "As long as the rice is soft. You ever seen some of the uncle Roger videos?",
                    "score": 3,
                    "author": "Zalieda"
                },
                {
                    "level": 1,
                    "comment": "You're doing great. Rice is a fickle mistress until you really master it",
                    "score": 3,
                    "author": "Helpful-Focus-6424"
                },
                {
                    "level": 1,
                    "comment": "They can suck a ratatouille! 😭😭😭🤣🤣🤣",
                    "score": 2,
                    "author": "TheMrsQueenB"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Goodbye Joe me gotta go me oh my oh",
            "score": 9,
            "author": "allstar64",
            "replies": [
                {
                    "level": 1,
                    "comment": "son of a gun will have big fun on that bayou",
                    "score": 4,
                    "author": "gtmc5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "2 chicken breasts\n1 lb shrimp 20ish count\n1 lb or package of andouille sausage\n1 1/2 cups uncooked white rice\n1 can of diced tomatoes (28oz)\n1 large onion\n1 of each bell pepper, green red and yellow\n2 cups chicken broth\n1/2 teaspoon dried thyme\n2 teaspoon oregano\n1 tablespoon Cajon seasoning (add to taste)\n1 teaspoon cayenne pepper (add to taste, decoding on your spice level\n1 tablespoon minced garlic\nCornstarch if needed for thickening\n\nDice peppers, dice onion, slice sausage, cut chicken into 1 in pieces, throw it all in with the spices and broth and tomatoes. Stir to combine, cook on low for 4 hours.\nAdd rice, cook for 30-45 minutes or until rice is just before perfect (since it will continue cooking, so it won’t be overdone)\nAdd shrimp, cook for 20 minutes.\nCan add parsley on top to serve",
            "score": 15,
            "author": "ElvisOnTheToilet",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;2 chicken breasts\n\n&gt;1 lb shrimp 20ish count\n\n&gt;1 lb or package of andouille sausage\n\n&gt;1 1/2 cups uncooked white rice\n\n&gt;1 can of diced tomatoes (28oz)\n\n&gt;1 large onion\n\n&gt;1 of each bell pepper, green red and yellow\n\n&gt;2 cups chicken broth\n\n&gt;1/2 teaspoon dried thyme\n\n&gt;2 teaspoon oregano\n\n&gt;1 tablespoon Cajon seasoning (add to taste)\n\n&gt;1 teaspoon cayenne pepper (add to taste, decoding on your spice level\n\n&gt;1 tablespoon minced garlic\n\n&gt;Cornstarch if needed for thickening\n&gt;\n\n&gt;Dice peppers, dice onion, slice sausage, cut chicken into 1 in pieces, throw it all in with the spices and broth and tomatoes. Stir to combine, cook on low for 4 hours.\n\n&gt;Add rice, cook for 30-45 minutes or until rice is just before perfect (since it will continue cooking, so it won’t be overdone)\n\n&gt;Add shrimp, cook for 20 minutes.\n\n&gt;Can add parsley on top to serve\n\nThanks for the recipe!",
                    "score": 23,
                    "author": "mesalikes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank YOU for making it legible!",
                            "score": 2,
                            "author": "skoffs"
                        },
                        {
                            "level": 2,
                            "comment": "Cajun not Cajon",
                            "score": 1,
                            "author": "HumanTargetVIII",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sorry, that's SIC",
                                    "score": 1,
                                    "author": "mesalikes"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for the reformatting",
                            "score": 1,
                            "author": "abirkhead"
                        },
                        {
                            "level": 2,
                            "comment": "Don't forget the okra.",
                            "score": -3,
                            "author": "Yum_MrStallone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s for gumbo, not jambalaya",
                                    "score": 1,
                                    "author": "Girthw0rm",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It can be in both. That's listed in many recipes, but I grew up eating them in both.",
                                            "score": 1,
                                            "author": "Yum_MrStallone",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean, you *can* put anything in any dish. Okra isn’t generally an ingredient in most jambalayas though.",
                                                    "score": 1,
                                                    "author": "Girthw0rm"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That andouille is key!!!",
                    "score": 2,
                    "author": "ernestpeewhirl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a huge lover of everything NOLA I used to make Jambalaya like this, but it never tasted right to me compared to some authentic Cajun restaurants.\n\nThe other commenter nailed it, make a roux. It's the most important thing, even more than the rice layer (which I've done but it's not worth it compared to the roux).\n\nTry this next time, and also enjoy the human that is chep Toups.\n\nhttps://youtu.be/9ytqP64AVkk",
            "score": 5,
            "author": "RealNasty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ahem, *do both*",
                    "score": 1,
                    "author": "Helpful-Focus-6424",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How?",
                            "score": 1,
                            "author": "RealNasty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The layer forms from just letting it go unstirred until the rice is fluffy and steamed. Cajun jambalaya does not use a roux, so you wouldn't need to worry about it there, but for creole jambalaya you would make the roux, add the veggies, then the meats, the rice, and lastly your liquids. Then you cook it untouched until it's done. That's where your layer comes from.",
                                    "score": 2,
                                    "author": "Helpful-Focus-6424"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did anybody else read this in Newman's voice?",
            "score": 2,
            "author": "PhogMachine"
        },
        {
            "level": 0,
            "comment": "I made jambalaya last night, too. Agree with the other poster, master a fabulous roux. I make a big batch in winter and freeze in portions. If I make too much, I freeze and give to family and friends. I don’t use shrimp for jambalaya, but I do for gumbo and the roux is perfect for both.",
            "score": 2,
            "author": "TheMrsQueenB",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh - and what everyone said about crispier rice is true.",
                    "score": 1,
                    "author": "TheMrsQueenB"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks like a good first attempt! It's only gonna get better with practice!",
            "score": 2,
            "author": "ilikemydawgs"
        },
        {
            "level": 0,
            "comment": "I made gumbo for the first time a couple we2ks ago. My next move is jambalaya.",
            "score": 2,
            "author": "FishnPlants"
        },
        {
            "level": 0,
            "comment": "Jambalaya and chili: The two slow cooker dishes most likely to start a shitstorm in the comments.",
            "score": 2,
            "author": "OldManRiff",
            "replies": [
                {
                    "level": 1,
                    "comment": "Holy shit man, you ain’t kiddin!",
                    "score": 2,
                    "author": "ElvisOnTheToilet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't read the word \"Jambalaya\" without hearing it in Newman's voice...\n\nIt looks good. Bon appetit.",
            "score": 2,
            "author": "amordragon"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "God people on Reddit are the literal worst.",
                            "score": 2,
                            "author": "Pikawoohoo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you have a recipe you followed? How closely did you follow it and what tweaks would you make?",
            "score": 5,
            "author": "Scumwaffle",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just added my recipe as a comment, revised for how I would do next time. I took two recipes I found and combined them. One said to add three tablespoons of Cajun seasonings, and that made it way too salty. It also said to cook the rice 2 hours, but it was completely done after one hour, so my rice was a bit overdone in the end. I’m still new to cooking so I’m leaning that I have to take each recipe with a grain of salt (pun intended).",
                    "score": 7,
                    "author": "ElvisOnTheToilet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right on and thank you. That looks delicious and it sounds pretty simple to make. I use zatarans mix as a base to make a very similar jambalaya on the stove. I'd like to be able to make it from scratch and your recipe sounds like a good place to start.",
                            "score": 3,
                            "author": "Scumwaffle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I used zatarans as well! You doing it on the stove might be a better idea since it will eliminate the possibility of overcooking it.",
                                    "score": 1,
                                    "author": "ElvisOnTheToilet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I cook my zatarans jambalaya in the rice cooker and it turns out perfect every time...damnit now I'm hungry! Lol",
                                            "score": 2,
                                            "author": "Wicked_Kitsune"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’d also love a recipe! 😊",
                    "score": 1,
                    "author": "rorscachsraven"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I must make it again!!",
            "score": 2,
            "author": "crochetmead"
        },
        {
            "level": 0,
            "comment": "Newman!!",
            "score": 2,
            "author": "Aweeeeeeeee"
        },
        {
            "level": 0,
            "comment": "I just make mine on the stove from the Zatarains box",
            "score": 2,
            "author": "WRAD240"
        },
        {
            "level": 0,
            "comment": "Jambalaya!\n\nPorque mi vida yo la prefiero vivir así",
            "score": 1,
            "author": "Illustrious_Dot_3225"
        },
        {
            "level": 0,
            "comment": "I have the same bowls!!",
            "score": 1,
            "author": "kayb3e",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dollar Tree babyyyy!",
                    "score": 1,
                    "author": "ElvisOnTheToilet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cheapo here, came to say the same thing😝",
                            "score": 2,
                            "author": "nokplz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I need it",
            "score": 1,
            "author": "metalhammer69"
        },
        {
            "level": 0,
            "comment": "Dear god man Don’t serve the this south of Kentucky you may get shot.,",
            "score": 0,
            "author": "CampaignLost",
            "replies": [
                {
                    "level": 1,
                    "comment": "What the hell does the south of Kentucky care about jambalaya? I'm from southern Louisiana and I've lived in southern Kentucky and those people barely even eat rice... tf?",
                    "score": 2,
                    "author": "Helpful-Focus-6424"
                }
            ]
        },
        {
            "level": 0,
            "comment": "🎶Way down south they make the Jambalaya!🎶",
            "score": 1,
            "author": "Stately_Gentleman",
            "replies": [
                {
                    "level": 1,
                    "comment": "^🎵Don't ^forget ^about ^the ^shrimp!🎵",
                    "score": 2,
                    "author": "draculajones"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know that I would absolutely love that if I could handle spice",
            "score": 1,
            "author": "Consistent_Ad9548"
        },
        {
            "level": 0,
            "comment": "\"You're 78, sir.\"\n\n\"You really think I'm that old??\"\n\n\"Jambalaya!\"",
            "score": 1,
            "author": "Pikawoohoo"
        },
        {
            "level": 0,
            "comment": "Alastor would be proud.",
            "score": 1,
            "author": "Environmental-Win836"
        },
        {
            "level": 0,
            "comment": "https://youtu.be/ryNxl-lpOME",
            "score": 1,
            "author": "socialphobic1"
        },
        {
            "level": 0,
            "comment": "https://youtu.be/ryNxl-lpOME",
            "score": 1,
            "author": "socialphobic1"
        },
        {
            "level": 0,
            "comment": "No recipe?",
            "score": 1,
            "author": "Disastrous-Aspect569"
        },
        {
            "level": 0,
            "comment": "https://media.tenor.com/5-tCgi7usAMAAAAM/newman-jambalaya.gif",
            "score": 1,
            "author": "CLECOL"
        },
        {
            "level": 0,
            "comment": "I said it like Newman",
            "score": 1,
            "author": "Lets_Make_A_bad_DEAL"
        },
        {
            "level": 0,
            "comment": "Stupid question from a noob here but do I need to thaw the shrimp first??",
            "score": 1,
            "author": "SeaCow_216",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, thaw shrimp first. I detailed/deveined them before I threw them in as well",
                    "score": 1,
                    "author": "ElvisOnTheToilet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks",
                            "score": 1,
                            "author": "SeaCow_216"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look, this could've been awful looking Jambalaya and I still would've liked it, but that looks damn good.\nThis humble (not so) Cajun approves.",
            "score": -2,
            "author": "LoreKeeperOfGwer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much, it wasn’t bad for a guy that can barely crack an egg. Haha!",
                    "score": 0,
                    "author": "ElvisOnTheToilet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "no",
            "score": -1,
            "author": "rubyrue123"
        }
    ]
}