{
    "id": "13rsx3y",
    "score": 512,
    "title": "Shredded Chicken Tacos",
    "author": "chilly_chickpeas",
    "date": 1685047761.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/13rsx3y",
    "media_urls": [],
    "other_urls": [],
    "postText": "This is the easiest slow cooker meal I have ever made. And it was really tasty! Recipe in comments.",
    "comments": [
        {
            "level": 0,
            "comment": "I got this recipe from Tasty. \n\n3- boneless skinless chicken breasts (salt and pepper)\n1- 16oz jar of Salsa (I used mild Chi Chis)\n1- packet of taco seasoning \n2- limes, juices\nCilantro- optional\n\nAdd all ingredients to slow cooker. I cooked on high for 4 hours, switched to low for 1 hour. Remove the chicken, shred with two forks, add back to slow cooker and mix everything together. I served this with lettuce, tomato, avocado, sour cream and cheese, white rice on the side. It was a perfect meal after a busy day.",
            "score": 41,
            "author": "chilly_chickpeas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the recipe. I'm going to try it Saturday!",
                    "score": 5,
                    "author": "ffffffffffffffffftf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re welcome!",
                            "score": 3,
                            "author": "chilly_chickpeas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I made it today, and the only downside is that there are NO LEFTOVERS.  Thanks again for sharing this. It's easy and a crowd  pleaser. I'm going to make it often.",
                                    "score": 2,
                                    "author": "ffffffffffffffffftf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You’re so welcome!! I’m glad everyone enjoyed it!",
                                            "score": 1,
                                            "author": "chilly_chickpeas"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I make this too. Instead of salsa I use mild or hot rotel, the kids don’t like too spicy, it is so good!!",
                    "score": 4,
                    "author": "hair_in_a_biscuit"
                },
                {
                    "level": 1,
                    "comment": "Mine ALWAYS turn out soggy, waterlogged, and tasteless. And I use this recipe. What gives?",
                    "score": 3,
                    "author": "WorkSuspicious7959",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Apologies for sounding like a downer, but these dime-a-dozen, \"healthy food blogger\" slow cooked shredded chicken breast tacos are just not great recipes for flavor and texture. Hitting them under the broiler before serving can help, but this is just not the right meat + preparation combo for tacos, in my opinion.",
                            "score": 15,
                            "author": "Uninterested_Viewer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm going to agree. Mine turns to waterlogged MUSH! Maybe because commercially bought chicken is injected with fluid to make it appear fatter and weigh more to cost you more money?? I'd think this could work better with thighs???",
                                    "score": 5,
                                    "author": "WorkSuspicious7959",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed on using thighs. I generally use thighs over breasts for everything (although I'll still sous vide breasts finished on the grill or cast iron). Breasts just take a lot of care to not dry out as they're super lean and don't make much sense in a slow cooker.",
                                            "score": 4,
                                            "author": "Uninterested_Viewer"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hmm I’m not sure?? Do you cook it on high?",
                            "score": 2,
                            "author": "chilly_chickpeas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No usually on low for 8 hours ?",
                                    "score": 2,
                                    "author": "WorkSuspicious7959",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As far as the texture, 8 hours is a bit much for boneless chicken breast. Check with a meat thermometer until it is ~161 or so then let it rest. It should probably take 4-6 hours unless the pieces are gigantic.\n\nAs far as waterlogged, I don't know what to say except add less liquid. Chicken breasts should not be adding much liquid on their own.\n\nAs far as tasteless, chicken does not have a strong flavor by itself. However much seasoning you are using, use more. Which seasonings will depend on what exactly you are cooking, but if it is tasteless you need more.",
                                            "score": 7,
                                            "author": "mrmcdude",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; As far as the texture, 8 hours is a bit much for boneless chicken breast. \n\nI think so, too. I cook 5lbs of fresh boneless, skinless chicken breasts in a slow cooker once or twice a month. With nothing else added, four hours on low works for me.\n\n&gt; Chicken breasts should not be adding much liquid on their own.\n\nI have to disagree. IME of cooking 5lbs, I get a pound of liquid. (That's about a pint.)",
                                                    "score": 3,
                                                    "author": "AQuietMan"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "if you have a powermixer, put the chicken in there with the paddle attachment.  will be shredded in 30 seconds.",
                    "score": 2,
                    "author": "steak1986"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Chicken tacos are my go-to for weekends.  Chicken breast, taco sauce, a packet of taco seasoning, let 'er go for 8 hours.  Cook some taco rice, and have Rotel, cheese, and chopped onions available to fill soft taco shells.\n\nOP's recipie is fancier, but I'm lazy.",
            "score": 8,
            "author": "rumdumpstr"
        },
        {
            "level": 0,
            "comment": "Where’s the chicken?",
            "score": 5,
            "author": "punches_buttons"
        },
        {
            "level": 0,
            "comment": "I’d eat it",
            "score": 2,
            "author": "snpi"
        },
        {
            "level": 0,
            "comment": "I do something similar, but use the shredded chicken in quesadillas.  The extra moisture that makes soggy tacos just makes nice moist quesadillas.\n\nChicken breasts or thighs, diced tomatoes, green chilies, onions, and spices - chili powder, cayenne, Tabasco, smoked paprika, cumin, salt, pepper.  In the slow cooker for about four hours, shred with a fork. \n\nThen it's just cheese on tortilla, as much chicken mixture as you want, more cheese, top with tortilla, cook on both sides, slice into wedges and serve with sour cream and guacamole \n\nThe shredded chicken keeps well in the fridge so you can just keep it around for a quick quesadilla dinner.",
            "score": 2,
            "author": "kirradoodle",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a good idea that sounds good!",
                    "score": 2,
                    "author": "chilly_chickpeas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Light on the meat this one is -Master Yoda",
            "score": 2,
            "author": "bullynogs2deth",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m a big fan of the fixins.",
                    "score": 2,
                    "author": "chilly_chickpeas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I cook my chicken for tacos in salsa verde",
            "score": 1,
            "author": "IntelligentMoney9668"
        }
    ]
}