{
    "id": "13t8z97",
    "score": 6,
    "title": "Need help with purchasing of first slower cooker, I have no clue what to get. Does size matter? (Volume) just looking for best with a decent price.",
    "author": "Garrett_Mulholland",
    "date": 1685197840.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/13t8z97",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "There's a huge variety in slow cookers - what you're looking to cook, and the amount, will help determine your size. If you have a family of 4 or less and want to use it to create a main meal (say a 3lb chuck roast with potatoes and carrots) then a 6quart would be fine. Large family? High volume? Go for the 8 or 10 quart. The 4qt is great for side dishes like rice or beans but it's really pretty small for anything else. Because they're so inexpensive I've got a couple (1-qt for dips/apps, 6qt for day-to-day, 10qt for parties).\n\nI don't like what I'm cooking to have a lot of extra room because it tends to dry out the food so whichever one I'm going to use will fit whatever I'm cooking fairly tight to start with (factor in shrinkage!)\n\nI don't use digital styles but that's my personal preference because I've used them for so many years that I just need the warm, low and high settings 🙃. Plus I've found that the basic model has less parts to go bad than one with all the bells and whistles.",
            "score": 11,
            "author": "Reasonable-Goal3755",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks man, I needed this for im clueless",
                    "score": 2,
                    "author": "Garrett_Mulholland",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If all you want to do is slow cook, the simpler the better. Generally speaking a 4 quart cooker will give 4 servings, maybe 5. A six quart will give you six or 7 servings. (You get more out of soups and stews)\n\nAn oval four quart is better than a three quart round one. It will cook a half a turkey breast, a small whole chicken or a small chuck roast",
                            "score": 2,
                            "author": "TableTopFarmer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agreed-go for oval vs a round one",
                                    "score": 1,
                                    "author": "Reasonable-Goal3755"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Recipes should fill the slow cooker at least 50% full and no more than 75% full. A 5-6 qt slow cooker is appropriate for most recipes. If you frequently double recipes for a large family or intentional leftovers or future meal prep, you’ll probably want an 8-10 qt slow cooker. Be forewarned, a full 8-10 qt cooker will be heavy.",
            "score": 7,
            "author": "PracticalAndContent",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"No more than 75%\" - why? An inch from the top is fine.",
                    "score": 7,
                    "author": "foxvipus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've had stuff cook at the top of my pot. Haven't had any issues.",
                            "score": 3,
                            "author": "furiousbobb"
                        },
                        {
                            "level": 2,
                            "comment": "That’s what’s recommended by all instructions I’ve read.",
                            "score": 2,
                            "author": "PracticalAndContent"
                        },
                        {
                            "level": 2,
                            "comment": "That’s what’s recommended by all instructions I’ve read.",
                            "score": 0,
                            "author": "PracticalAndContent",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A lot of the Google would agree with you, though link below is along the lines of previous instructions I've had. Different Slow Cookers I guess.\nhttps://www.thespruceeats.com/reasons-not-to-overfill-slowcooker-1907576",
                                    "score": 1,
                                    "author": "foxvipus"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Size matters if you want to cook a chicken or ribs or a large piece of meat.\n\nI usually cook and then freeze cause I am the only one eating.",
            "score": 3,
            "author": "froopaux"
        },
        {
            "level": 0,
            "comment": "If you spend the time on prep and the cook time you’ll want lots of food out of it, a 6 quart is going to give you much more in the way of leftovers. You don’t want to be that person who bought a tiny one and realizes a pork shoulder is too big to fit.\n\nI second the advice to get a pressure cooker that also has a slow-cooker function. My slow cooker finally died and I realized how underutilized my pressure cooker was. You don’t get to see your saucy food burbling, but it does just as good a job.",
            "score": 3,
            "author": "kobayashi_maru_fail",
            "replies": [
                {
                    "level": 1,
                    "comment": "We did that with the Instant Pot. The slow cooker feature was the first to tank. I’m looking for a slow cooker too.",
                    "score": 2,
                    "author": "earthmamaley"
                },
                {
                    "level": 1,
                    "comment": "Just remember to get the gauge calibrated annually. Your county extension office should do it in the US.",
                    "score": 1,
                    "author": "Griffen_07"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ninja foodi 11-in-1",
            "score": 3,
            "author": "CrlSagan"
        },
        {
            "level": 0,
            "comment": "If you've got a little extra to spend, a pressure cooker would be a good investment for you because most have a slow cooker feature included, but then it can be a bit more versatile if you don't want to slow cook as often. Some even have air friers included which is really nice for reheating leftovers or just a nicer experience for cooking frozen \"fried foods\" or veggies",
            "score": 3,
            "author": "La_ra_bar",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like love the airfry feature. I pressure cook a whole chicken, then airfry it to get a golden skin or  air fry chicken breasts, sliced and pounded thin, coated with mayo and then covered with cracker crumbs or bread crumbs  They come out juicy and crispy.",
                    "score": 2,
                    "author": "TableTopFarmer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Every girl I’ve been with has reassured me that size does not matter.",
            "score": 2,
            "author": "theHappySquirrel"
        },
        {
            "level": 0,
            "comment": "8 quart instant pot.",
            "score": -1,
            "author": "Least_Adhesiveness_5",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's not a slow cooker.",
                    "score": 4,
                    "author": "SgtSwatter-5646",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They have a slow cooker feature. I use my 8qt ultra so much that my slow cooker only ever comes out if I need to do more than one thing at once. Plus I can make SO many things with it! Slow cook, pressure cook, yogurt, broths, it’s amazing. Actually I want another one some day when I have a bigger kitchen and space to store a second IP.",
                            "score": 1,
                            "author": "wifeofablerb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good for you",
                                    "score": -1,
                                    "author": "SgtSwatter-5646",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I might add, I have an instant pot, 3 crock pots, 2 dutch ovens, an offset charcoal smoker, a propane grill and a 3 burner outdoor range.. not to mention my indoor kitchen.. I'm just saying",
                                            "score": 0,
                                            "author": "SgtSwatter-5646"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes it is. It just has other functions as well.\n\nOP said they have no clue - this choice gives them options.",
                            "score": 1,
                            "author": "Least_Adhesiveness_5"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Be sure it has settings for High, Low, and Warm.",
            "score": 1,
            "author": "LCharteris"
        },
        {
            "level": 0,
            "comment": "My next slow cooker will be one of those that sears the meat as well as slow cooks it.",
            "score": 1,
            "author": "Amethystgold222"
        },
        {
            "level": 0,
            "comment": "Morphy Richards sear and stew, aluminium pot that can go on the hob if you want to brown the meat first.  Lasts forever.",
            "score": 1,
            "author": "jeff43568"
        },
        {
            "level": 0,
            "comment": "Sam's club has a large slow cooker for a good price.",
            "score": 1,
            "author": "SnooMacaroons7893"
        },
        {
            "level": 0,
            "comment": "Size matters,   \nBigger is More, smaller is less.  \nBigger is more. e.g. more room to cook but also more room to put away, more room on the counter, bigger to wash.  \n\n\nSmaller is less, less to cook, but less to clean up, less to carry, less room on the counter, less room in storage.",
            "score": 1,
            "author": "4erpes"
        }
    ]
}