{
    "id": "13tx8fu",
    "score": 526,
    "title": "Chicken stock",
    "author": "RespectBusy2116",
    "date": 1685270260.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/13tx8fu",
    "media_urls": [
        "https://i.redd.it/y948hn7pdl2b1.jpg"
    ],
    "other_urls": [],
    "postText": "Making some chicken stock with leftovers from the roast today. Ingredients are :- \n\nChicken carcass and wings (all meat pulled off), resting juices, onion, mushrooms, garlic, bay leafs, thyme, rosemary, salt and pepper, water. I’d usually use fresh herbs but I was out so dry will have to do. \n\nChuck it all in a pot, simmer for 3-4 hours minimum, strain and use for soup or whatever.",
    "comments": [
        {
            "level": 0,
            "comment": "I usually put carrots and celery in there, but never mushrooms, should I ?",
            "score": 50,
            "author": "Conscious_Cattle9507",
            "replies": [
                {
                    "level": 1,
                    "comment": "Carrots and celery are good yeah. When training in classic french restaurant cooking, you are always taught to not put mushrooms in stocks &amp; jus etc because it makes it cloudy when you're generally looking for a nice clean liquid. However they are very flavourful and have loads of umami so if you're not bothered about that sort of thing they can be a good addition. I'd always use mushrooms if I was making anything veg based because they're so flavourful it's almost like you've used bones.",
                    "score": 63,
                    "author": "BEGB13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'll make sure to add them next time, I don't mind cloudy bouillon, thank you. \n\nWhen making vege stock, I like to add fennel, It really adds depth, but I'll make sure to add mushrooms as well.",
                            "score": 18,
                            "author": "Conscious_Cattle9507"
                        },
                        {
                            "level": 2,
                            "comment": "my grandmother would have a conniption but i love making cloudy, flavorful soup.",
                            "score": 4,
                            "author": "silverbean"
                        },
                        {
                            "level": 2,
                            "comment": "For me, I’d rather eat the mushrooms",
                            "score": 2,
                            "author": "Chefmeatball"
                        },
                        {
                            "level": 2,
                            "comment": "I never knew that, thanks for that lovely tidbit. I think I might have to try that in my stock next time.",
                            "score": 1,
                            "author": "Electrical_Sundae332"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Mushrooms are the BOMB DOT COM (if you like mushrooms, haha) they give such an awesome depth of flavor!",
                    "score": 26,
                    "author": "Dapper_Acadia9835",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love mushrooms, I just never add them in chicken stock. Will try it next time for sure.\n\nThank you !",
                            "score": 11,
                            "author": "Conscious_Cattle9507",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I would chuck in dry mushrooms rather than fresh.  They are cheaper and function as little stock cubes.",
                                    "score": 4,
                                    "author": "Griffen_07"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I put 2 different ki ds of mushroom in my chicken stock and I think it's delicious.",
                    "score": 3,
                    "author": "Garbogulus"
                },
                {
                    "level": 1,
                    "comment": "If you have a Costco membership, they have containers of dried mushrooms that are perfect for this stuff.",
                    "score": 3,
                    "author": "Jamminjordon"
                },
                {
                    "level": 1,
                    "comment": "I needed to use them and thought, why not ? Can’t do any harm. Smells amazing at the moment",
                    "score": 5,
                    "author": "RespectBusy2116"
                },
                {
                    "level": 1,
                    "comment": "Mushrooms taste great in a stock. But doing it this way is kind of a waste in my opinion. They cook so fast you are better off just adding those mushrooms to whatever you are using the stock for later on. Thats just me though. I guess its not really a waste if you enjoy the end product.",
                    "score": 2,
                    "author": "okiesillydillyokieo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes dried mushrooms for stock.",
                            "score": 2,
                            "author": "Griffen_07"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would recommend quartering the onion.",
            "score": 90,
            "author": "Czarsandman",
            "replies": [
                {
                    "level": 1,
                    "comment": "At least peel it.  Skins are bitter.",
                    "score": 50,
                    "author": "Tacos_Polackos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And you often find a little dirt in between the peels.",
                            "score": 20,
                            "author": "Son-of-Cookie-"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You've never had a stock that had too many peels in it then",
                                    "score": 3,
                                    "author": "Tacos_Polackos"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had half an onion left so that went in whole. Also some small white onions halved somewhere in there that are about half the size of that one",
                    "score": 3,
                    "author": "RespectBusy2116"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I save all my cut ends of onions, carrot shavings. Celery end. And make my stock with that. Usually go buy a rotisserie chicken to throw in it too. Makes me feel resourceful",
            "score": 33,
            "author": "calibudzz420",
            "replies": [
                {
                    "level": 1,
                    "comment": "I collect it all in a bag and toss it in the freezer and continue adding until it's full.  I also add any vegetables that are about to go and I know won't be used in time  \n\nI also throw in tiny cloves of garlic in the center of the bulb as they're too fussy to peel and adds good flavor.   I would avoid dry skin of garlic or onion as it won't add much flavor and often contains a lot of dirt.  Skin on the fleshier side is fair game however.",
                    "score": 13,
                    "author": "weeeeum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not OC but I do the same as them, and if anything I find the stock usually comes out really sweet. The difference might be the types of vegetables? I only include onions, carrots, celery, and any other aliums I have scraps of. Sometimes potato or sweet potato scraps, but I rarely have scraps of those and they don't add much.  Mushrooms are delicious but I never have scraps! \n\nDefinitely avoid broccoli, cabbage, cauliflower, and other cruciferous veg (makes the stock a bit...farty) and bell pepper scraps (can definitely make it bitter). \n\nSerious Eats have a good write up with more detail; https://www.seriouseats.com/save-your-vegetable-scraps-make-stock\n\nEdit: I don't use onion or garlic skins like serious eat suggests, because I don't think there's enough flavour or nutrition in them to bother. Roots and off cuts going though.",
                                    "score": 5,
                                    "author": "skankyfish",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Mine is all onion roots, carrot tops, celery ends, garlic root ends, that kind of thing. Very much scraps! Very odd that yours came out so badly. You must try again, for science!",
                                                    "score": 3,
                                                    "author": "skankyfish"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Over-cooking may be the culprit! I used to end up with stocks that were either grossly bitter or sour because I was under the false impression that simmering longer would make a more flavorful stock. Turns out that after an hour or two, veggies start to break down in a way that’s unappetizing whereas bones still have lots of good flavor to render. These days I strain my stock after an hour or two, toss the veggies, then return the liquid and bones to the pot to simmer until the bones can be easily broken or crumbled by hand.",
                                                    "score": 2,
                                                    "author": "snifflysnail"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You could be cooking too high, I cook mine on med or low.  High heat could extract some tannins.  I'm also quite picky with my scraps, like I mentioned in my previous comment I usually avoid dry skins, if you're not sure put it in your mouth and taste it.",
                                    "score": 2,
                                    "author": "weeeeum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh and I just thought of one thing.  Sometimes the dishwasher doesnt rinse off its detergent very well and I learned the hard way when one of my dishes tasted very bitter, turns out it was my fork.  This could also be the case if you don't rinse hand washed dishes very well too",
                                                    "score": 2,
                                                    "author": "weeeeum"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's about time for me to make another stock. My bag is full, and I just deboned like 12 lbs of chicken thighs so I have plenty of bones too",
                    "score": 2,
                    "author": "DoYouWeighYourFood"
                },
                {
                    "level": 1,
                    "comment": "I’m not a fan of this because it’s all the parts that were grown in the dirt, and onion peels sometime have a little dirt in between layers and unless you scrub your carrots before you peel they have some dirt too, same wit celery tails. It’s like your making a dirt broth.",
                    "score": 1,
                    "author": "Son-of-Cookie-"
                },
                {
                    "level": 1,
                    "comment": "That’s an amazing idea !",
                    "score": 1,
                    "author": "RespectBusy2116"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I do this with every chicken, and save the bones after being picked. I smoke lots of chicken, so the bones have lots of flavors too. I often pressure can the stock after that, unless I'm making a soup or large batch of a rice dish like jambalaya",
            "score": 5,
            "author": "Darthtagnan"
        },
        {
            "level": 0,
            "comment": "The mushrooms is a good add. I usually only do carrots and onions, but defo doing this on my next run. My tip is get beef marrow bones from the butcher and put one of those in.",
            "score": 3,
            "author": "BennySkateboard"
        },
        {
            "level": 0,
            "comment": "Good lord, so many people on here are judgemental pricks. They didn't peel the onions! Didn't trim the mushrooms! Oh noes!!!!!",
            "score": 3,
            "author": "SirGuido",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be honest, I couldn’t be bothered with anything fancy this week. I just chucked in a load of leftover veg with some chicken in the hopes of something delicious",
                    "score": 2,
                    "author": "RespectBusy2116",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And that's completely acceptable. Anyone bellyaching about it are just being ridiculous.",
                            "score": 2,
                            "author": "SirGuido"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read this as “children stock”. But looks delicious!!",
            "score": 3,
            "author": "whinnybee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Add one medium sized child per litre of stock",
                    "score": 3,
                    "author": "RespectBusy2116"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have this chicken that I bought but it was the wrong kind and I’m not planning on eating the meat but I wanted to make stock , can I make this and simmer it with the meat on it?",
            "score": 2,
            "author": "Wrestleeuhppp",
            "replies": [
                {
                    "level": 1,
                    "comment": "We've done this a bunch of times - intentionally cook a whole chicken with onions, celery, carrots, fresh thyme, bay leaves, salt and black peppercorns.  The meat will be very tender so you can shred it and use it for a lot of applications where starting with cooked chicken can be beneficial.  We've made chicken pot pies, chicken ala king, fajitas, bbq pulled chicken, chicken wraps, etc...",
                    "score": 3,
                    "author": "Wasting_Time1234"
                },
                {
                    "level": 1,
                    "comment": "I don’t see why not, but I’d cook and pick off the chicken first maybe",
                    "score": 2,
                    "author": "RespectBusy2116"
                },
                {
                    "level": 1,
                    "comment": "I make stock all the time. I’d break down the chicken (watch video) and use meat at a later time. The giblets, chicken bones snd neck can go in the pot raw. Add rough cut onion, carrots, celery, smashed garlic, seasoning, bay leaves and some herbs. Anytime your making a bone stock add a tablespoon or two of apple cider vinegar to extract the bone marrow.",
                    "score": 2,
                    "author": "Son-of-Cookie-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Try adding raw chicken wing tips and a few roasted chicken wing tips gives it that nice fat that coats your lips",
            "score": 2,
            "author": "STL063"
        },
        {
            "level": 0,
            "comment": "Now you’re stockin’!",
            "score": 2,
            "author": "incubusboy",
            "replies": [
                {
                    "level": 1,
                    "comment": "And I hope you like stonkin’ too",
                    "score": 1,
                    "author": "RespectBusy2116"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So do you freeze the stock after draining the liquid?",
            "score": 2,
            "author": "Kidhauler55",
            "replies": [
                {
                    "level": 1,
                    "comment": "This week, yes. But usually it goes in the fridge for a few days then makes chicken soup",
                    "score": 2,
                    "author": "RespectBusy2116"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Homemade stock is one of my favorite things to make.  It's comforting to know it's on the way and is one of the best smells ever.",
            "score": 2,
            "author": "SireBlew"
        },
        {
            "level": 0,
            "comment": "👍👍 the onion skin gives the stock a beautiful yellow color, I also add a little sweet curry!&amp;",
            "score": 2,
            "author": "radiusrod"
        },
        {
            "level": 0,
            "comment": "I have questions. What about the skin on the onion? Does it add anything? Do you not notice the skin in the end?",
            "score": 2,
            "author": "4legsandatail",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just adds more depth of flavour. Try it with and then again without and you’ll notice. Subtle but nice",
                    "score": 1,
                    "author": "RespectBusy2116",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks will try.",
                            "score": 2,
                            "author": "4legsandatail"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Peel the onion and cut the butts off the mushrooms!",
            "score": 4,
            "author": "scottb37",
            "replies": [
                {
                    "level": 1,
                    "comment": "Skin on for more flavour ! But I’ll de-butt the mushrooms next time",
                    "score": -1,
                    "author": "RespectBusy2116",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now I gotta try the onion skins, I didn’t know",
                            "score": 1,
                            "author": "scottb37",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s subtle, but try it with skins on and when you try it without you’ll notice",
                                    "score": 3,
                                    "author": "RespectBusy2116"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why leave the onion paper on?",
            "score": 1,
            "author": "NeoNirvana",
            "replies": [
                {
                    "level": 1,
                    "comment": "To take me to flavour town",
                    "score": 4,
                    "author": "RespectBusy2116"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Couldn't be bothered to peel the onion?",
            "score": -46,
            "author": "dempseyjoshua",
            "replies": [
                {
                    "level": 1,
                    "comment": "Adds flavour when you leave the skin on. Liquid will de drained off so skin on is fine",
                    "score": 38,
                    "author": "RespectBusy2116",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From what I’ve heard it mostly adds color but there’s no harm in leaving it in and I always do just because it’s easier",
                            "score": 8,
                            "author": "m0_m0ney"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Didn't even garnish the water or season the power outlet, truly shameful.",
                    "score": 2,
                    "author": "SonicRainboom24"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Look at this guy, gettin all tough in a sub about slow cooking food. \n\nWhat a world we live in",
                            "score": 19,
                            "author": "Sorryimlatefordinner"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d say it’s a pretty good use of a chicken",
                    "score": 4,
                    "author": "RespectBusy2116",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Peel the onions bro/sis",
                            "score": 0,
                            "author": "MrSaysWhatever",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Onions skin give a beautiful rich yellow color",
                                    "score": 3,
                                    "author": "calibudzz420",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I never knew that,would love the see the final result",
                                            "score": 2,
                                            "author": "MrSaysWhatever"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Onion skin gives a deeper flavour (carrot skin does too but I was out this week)",
                                    "score": 2,
                                    "author": "RespectBusy2116"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cutting and peeling goes out the window, huh?😂",
            "score": 1,
            "author": "Intrepid_Bit_6203",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cut, yes. Peeling, no. Adds to the flavour",
                    "score": 1,
                    "author": "RespectBusy2116"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not the onion skin 😭",
            "score": 1,
            "author": "FoamyCandy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Adds depth of flavour. Try it",
                    "score": 1,
                    "author": "RespectBusy2116"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You need to rough cut your onions and smash your garlic to get more flavor in there, also makes sure to properly trim and wash your mushrooms, onions and garlic. Don’t want it to be brown dirt water. Also try adding rough cut carrots and celery.",
            "score": -2,
            "author": "Son-of-Cookie-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Didn’t have carrots and celery this week unfortunately but I usually have some knocking about that gets thrown in. Garlic was smashed but I’ll trim everything next time !",
                    "score": 1,
                    "author": "RespectBusy2116",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And I make a big pot of mushroom stock and will make a wild mushroom risotto. Always a big hit! Would recommend it.",
                            "score": 2,
                            "author": "Son-of-Cookie-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "EWWW",
            "score": -6,
            "author": "aidixjwnqooejdna",
            "replies": [
                {
                    "level": 1,
                    "comment": "WHHYYY ?",
                    "score": 2,
                    "author": "RespectBusy2116"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Peel and Cut up your veggies \n\nAdds better flavour",
            "score": -2,
            "author": "MsFoxxx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Onion peel adds flavour",
                    "score": 2,
                    "author": "RespectBusy2116",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The flavour of dirt?",
                            "score": -2,
                            "author": "MsFoxxx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Onion flavour obviously",
                                    "score": 2,
                                    "author": "RespectBusy2116"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Vegetable stock with a hint of chicken",
            "score": 0,
            "author": "arcerms",
            "replies": [
                {
                    "level": 1,
                    "comment": "There was more chicken in there than the picture let’s on",
                    "score": 1,
                    "author": "RespectBusy2116"
                }
            ]
        }
    ]
}