{
    "id": "13xu8t2",
    "score": 154,
    "title": "Slow Cooker Spaghetti Squash Bolognese",
    "author": "zorionek0",
    "date": 1685655703.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/13xu8t2",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I don't think this would be for me\n\nDon't understand why you did some of the things you did but I applaud your bravery and creativity",
            "score": 5,
            "author": "And-ray-is",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I don’t think this one will be joining the rotation. It was fun to try though.",
                    "score": 3,
                    "author": "zorionek0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks grim.",
            "score": 4,
            "author": "korgrim",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not my proudest production, but they can’t all be masterpieces",
                    "score": 2,
                    "author": "zorionek0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My Italian ancestors are spinning in their graves for this crime against the culinary heritage. \n\nThat said this was a simple, healthy, and tasty dinner!\n\n**Ingredients**\n\n1 spaghetti squash (uncooked), 1 lb ground beef, 1 28oz can diced tomatoes, 2 tbsp Italian seasoning, 0.5 tsp salt, 0.5 tsp pepper, 0.5 tsp garlic powder, 0.5 tsp onion powder.\n\n**Directions**\n1. Brown ground beef over medium heat. Drain and add to slow cookers\n2. Add tomatoes and seasonings. Stir well to combine.\n3. Halve spaghetti squash and scoop out seeds place cut side down over tomato beef mixture\n4. Cook on LOW for 6 hours\n5. remove squash. Shred with fork. Return to slow cooker or serve on the side.\n\nBonus:\n\nPoverty Garlic bread:\n4 hot dog buns, 3 tbsp melted butter, 1 tsp garlic, 1 tsp Italian seasoning, 2 cups shredded mozzarella.\n\n1. Preheat oven to 375. \n2. Mix together butter, garlic, and seasoning. \n3. Spoon butter mixture over each half bun\n4. Cover buns with cheeses\n5. Bake 5 minutes at 375.",
            "score": 10,
            "author": "zorionek0",
            "replies": [
                {
                    "level": 1,
                    "comment": "The garlic bread with the buns sounds complicated,  would two slices of bread be a good substitute? Or potentially those small dinner rolls?",
                    "score": 8,
                    "author": "Halycon1313",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry to interject but I had to ask..what exactly about the buns sounds complicated?",
                            "score": 4,
                            "author": "And-ray-is",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nothing, it was a terrible attempt to be funny",
                                    "score": 6,
                                    "author": "Halycon1313",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In that case, I actually found it funny just hard to judge tone through text",
                                            "score": 7,
                                            "author": "And-ray-is"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Jesus, I thought this was /r/shittyfoodporn. That sauce is as much of a bolognese as the squash is pasta.\n\nJarred, store bought sauce would be 100x better than this and would have cost less in electricity.",
                    "score": 3,
                    "author": "Unspoken",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s the journey not the destination",
                            "score": 3,
                            "author": "zorionek0"
                        },
                        {
                            "level": 2,
                            "comment": "can't disagree. visually unappealing.",
                            "score": 1,
                            "author": "monvino"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kids at the daycare loved this. The especially like it when I'd give them hot dog bun/cheese garlic toast. For some reason the never liked to eat the buns with hot dogs though.",
                    "score": 2,
                    "author": "Puzzleheaded-Mind525"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As an Italian... My soul is crushed, needs Sofritto (carrots celery onion) also either red or white wine and cream to be a Bolognese.",
            "score": 2,
            "author": "firetothetrees",
            "replies": [
                {
                    "level": 1,
                    "comment": "Serious question: is there an alcohol free way to make a bolognese?",
                    "score": 1,
                    "author": "zorionek0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can certainly leave it out but I don't know what you could replace it with. \n\nHowever that being said the alcohol burns off when you cook it ... if your concern is that you would be consuming alcohol",
                            "score": 2,
                            "author": "firetothetrees"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wouldn't the spaghetti squash get mushy? Or was it stringy after 6 hours on low?",
            "score": 1,
            "author": "Nois3",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was still stringy, check out pic #8. It did mush up when I mixed it back in though",
                    "score": 2,
                    "author": "zorionek0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds like it needs more garlic. Both the bolognese and the bread.\n\nMore garlic!",
            "score": 1,
            "author": "Bat-Guano0"
        },
        {
            "level": 0,
            "comment": "I'm not even of Italian descent and my heart just weeps at the thought of a bolognese without the sofritto.\n\nI'd do the spaghetti squash in the oven, myself. Can't stand a mushy squishy squash. :P",
            "score": 1,
            "author": "SheddingCorporate"
        },
        {
            "level": 0,
            "comment": "At least spinkle some parsley on there.",
            "score": 1,
            "author": "OldStyleThor"
        }
    ]
}