{
    "id": "4n5hh8",
    "score": 3753,
    "title": "Slow-cooked mac n cheese",
    "author": "wuebj",
    "date": 1465398457.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/4n5hh8",
    "media_urls": [
        "http://i.imgur.com/bcefw8L.gifv"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Okay, the image says condensed milk... they mean evaporated milk, right?",
            "score": 296,
            "author": "Transform_n_Rollout",
            "replies": [
                {
                    "level": 1,
                    "comment": "They must. When I saw condensed I went \"this must be a dessert mac and cheese\"",
                    "score": 220,
                    "author": "chusmeria",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah OP's recipe at the top actually says evaporated milk",
                            "score": 74,
                            "author": "No-oneOfConsequence",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, I've made it before (similar recipe) and used evaporated milk. In my experience when people say \"condensed milk,\" they usually mean \"sweetened condensed milk.\" Would hate to see someone use that by accident. ",
                    "score": 79,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh shit my mistake. I have telling people for years my recipe for Mac n cheese and it involves evaporated milk, which looks a lot like condensed milk. :'(",
                            "score": 14,
                            "author": "JazzyDoes"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 6,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh man don't fuck that up. I spent 2 hours making Mac and cheese I fucking made love to this thing it was beautiful. My first time making a gourmet Mac and cheese. When shopping and reading the ingredients it called for condensed milk. I thought to myself that's weird. And scrolled through the comments multiple people mentioned using condensed milk and it was awesome. So i said fuck it we'll try it. WORST DECISION EVER. Couldn't take more than 2 bites it was like dessert Mac and cheese. It was a disaster. \n\nTL;DR Thought I made Mac and Cheese instead made Mac and Cheesecake. ",
                    "score": 74,
                    "author": "snuffl3s",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Best tl;dr",
                            "score": 20,
                            "author": "celluj34"
                        },
                        {
                            "level": 2,
                            "comment": "You could have passed it off as kugle if you add cinnamon ",
                            "score": 4,
                            "author": "picklesandrainbows"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Haha, yeah, I was like \"eww\".\n\nI feel like you could use whipping cream in place of the evaporated milk as well.",
                    "score": 12,
                    "author": "swiftb3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If it was me I'd replace the whole milk+evap milk with cream and call it a day.",
                            "score": 6,
                            "author": "Dubhan"
                        },
                        {
                            "level": 2,
                            "comment": "That makes more sense to me now too.",
                            "score": 4,
                            "author": "snowball666"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is condensed milk always sweet in English? In Germany we say condensed milk for evaporated milk and sweet condensed milk for what seems to be normal condensed milk for you....? And my dictionary tells me condensed milk and evaporated milk is the same.",
                    "score": 30,
                    "author": "Sxtus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the US at least we only have \"evaporated milk\" and \"sweetened condensed milk\", and if someone were to say \"condensed milk\" I'd assume they mean sweetened condensed milk.",
                            "score": 58,
                            "author": "Didgeridoox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Our local grocery stores carry \"Evaporated milk,\" \"Condensed milk,\" and \"Sweetened Condensed milk.\" Maybe it's a regional thing?",
                                    "score": 14,
                                    "author": "Casual_Goth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's certainly possible, perhaps I should have included \"in my area\"",
                                            "score": 11,
                                            "author": "Didgeridoox",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Regional Diversity. One of the best and yet most frustrating things about the US. ",
                                                    "score": 6,
                                                    "author": "Casual_Goth"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'd just like to say that after reading this thread, milk no longer looks like a word to me.",
                                            "score": 7,
                                            "author": "cluttered_desk",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm from the Netherlands, and was very confused by these terms. So, after some googling, and found out why. Your evaporated milk is exclusively used for coffee here, even literally called 'coffeemilk'. I've never come across condensed milk, but apparently it's popular in the Middle East.",
                    "score": 4,
                    "author": "blueechoes",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Does powdered milk work as a substitute?",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Ingredients**\n\n* 500g dried elbow macaroni\n* 150g Gruyere, grated\n* 150g mozzarella, grated\n* 150g cheddar, grated\n* 10 strips of bacon, cooked until crisp and roughly chopped\n* 350ml whole milk\n* 1 can evaporated milk\n* 1/2 tsp salt\n* 1 tsp mustard powder\n* 1/2 tsp black pepper\n* parsley and breadcrumbs, to serve\n\nGrab your slow cooker. Put all of the ingredients in (except for the parsley crumbs), give it a good mix, pop on the lid and cook on high for 2 hours. Dig out, sprinkle over the breadcrumbs (and some extra cheese if you’re feeling adventurous) then dig in!",
            "score": 326,
            "author": "wuebj",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 97,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd probably go half in the cooker, half for garnish afterwards. ",
                            "score": 53,
                            "author": "themactastic25",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The correct answer is to double it, not split it",
                                    "score": 44,
                                    "author": "baardvark"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Extract the flavor into the whole sauce?",
                            "score": 75,
                            "author": "TheGrayishDeath",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The bacon can be extracted, but would it remain crispy after 3 hours in the cheese/sauce mixture? I wouldn't think so",
                                    "score": 35,
                                    "author": "DasHuhn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I prefer the flavor spread around to the crispy but to each thier own.",
                                            "score": 52,
                                            "author": "TheGrayishDeath",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah. And I don't really love my bacon crispy anyway. Barely-cooked chewy is my jam.",
                                                    "score": 109,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "*gag*",
                                                            "score": 112,
                                                            "author": "Ghotimonger",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dunkin Donuts makes bacon on their breakfast sandwiches like this. I have to go home and peel off the limp, mushy bacon, then throw it in the microwave for a minute before it is edible. This is why I don't get breakfast there very often. Well, that and one sandwich is like 1/2 of the day's calories.",
                                                                    "score": 8,
                                                                    "author": "diablette",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Why not make your own damn sandwich at that point? The only time it's acceptable to get a savory sandwich at D&amp;D is when you're farm from home or any decent food source ",
                                                                            "score": 22,
                                                                            "author": "tiredhippo",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "That would require me to go grocery shopping, silly.",
                                                                                    "score": 19,
                                                                                    "author": "diablette",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Also acceptable: about to do a very long, labor-intensive shift at work with no chance for breaks. Calorie load that sumbitch up~",
                                                                                    "score": 3,
                                                                                    "author": "taekwondogirl"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt; microwave\n\nyou complain about food and then you *microwave* bacon? ",
                                                                            "score": 6,
                                                                            "author": "ReCursing",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Have you ever tried microwaved bacon? It actually cooks pretty well.",
                                                                                    "score": 2,
                                                                                    "author": "osee115"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Savage.",
                                                            "score": 2,
                                                            "author": "Dlpcoc"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "seriously, why do people want to cook all the flavor out of the bacon?",
                                                            "score": 8,
                                                            "author": "organicsensi",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "crispy bacon is both a flavor and mouth feel thing. I don't hate softer bacon but it's sincerely not my jam. ",
                                                                    "score": 9,
                                                                    "author": "nothingxs",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Except when it is jam ",
                                                                            "score": 3,
                                                                            "author": "thechilipepper0",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Same reasons they eat well done steaks. They either grew up eating it that way and don't know any better, or they're overly concerned about food poisoning.",
                                                                    "score": 2,
                                                                    "author": "dustinyo_",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I grew up in a \"well done\" household. I'll never forget the first time I had steak medium rare. one way ticket to flavor town. ",
                                                                            "score": 20,
                                                                            "author": "organicsensi"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Sir, did you just equate crispy bacon with well done steak?\n\n\\*glove slap\\*\n\nI demand satisfaction! This insult to my honor will not go unanswered!",
                                                                            "score": 9,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I like my steaks medium rare and bacon crispy. The wet warm chewy noodle of undercooked bacon is disgusting.\n\nIt's not like the meat itself has much flavor, it's all in the curing which just intensifies when crisped.",
                                                                            "score": 5,
                                                                            "author": "Neckbeard-OG",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "There's a sweet spot where the middle is still soft but the edges are crispy when you cook it in a pan on mid-high for a few minutes. For me, that's how bacon should be. ",
                                                                                    "score": 3,
                                                                                    "author": "JediMasterZao"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That's not even close to a good comparison, there aren't any juices or flavours that can be cooked out of bacon. If anything the maillard reaction adds flavour to the bacon rather than taking it away.",
                                                                            "score": 2,
                                                                            "author": "fddfgs"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 4,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Well sure but I'm sure the bacon flavor will get in there whether it's in the sauce or not.  I'd also imagine that 5 slices of crispy bacon will still get the flavor there, while also giving you 5 slices to sprinkle on the bowl for the texture difference :)",
                                                    "score": 7,
                                                    "author": "DasHuhn"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[Por que no los dos?](http://i.imgur.com/821zrQY.jpg)\n",
                                                    "score": 8,
                                                    "author": "MattieShoes"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe split it? Put some in and save the rest as a kind if garnish? ",
                                                    "score": 5,
                                                    "author": "hybris12"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I prefer ham anyway, and also some tomatoes ",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My question is: How does the elbow macaroni not turn to mush...",
                                            "score": 2,
                                            "author": "Darkphibre"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Maybe use bacon grease instead?",
                                    "score": 5,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would just skip the bacon all together. Don't get me wrong, I love bacon, but for some reason I do not like it in pasta dishes.",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think crumbled on the top might be nice.",
                                    "score": 6,
                                    "author": "capnjack78",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm with you there. I can think of a dozen better uses for bacon.",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Agreed, this could end up *very* salty.",
                            "score": 2,
                            "author": "CrystalElyse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You say that like it's a bad thing. ",
                                    "score": 15,
                                    "author": "gecampbell",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't know about you but where I come from, my milk and macaroni noodles don't come salted.\n\n/emeril",
                                    "score": 7,
                                    "author": "Hillside_Strangler",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But my cheese, salt, and bacon do.",
                                            "score": 8,
                                            "author": "Ghotimonger",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I prefer my salt unsalted.",
                                                    "score": 7,
                                                    "author": "Hillside_Strangler",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I like mine iodized.",
                                                            "score": 5,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How's the consistency of the pasta when it's done? I prefer mine on the al dente side, and I've found that most slow cooker pasta recipes end up being pretty mushy. But yours is also the first one I've seen with a cook time under 4 hours, so maybe that helps the elbows maintain their shape? ",
                    "score": 34,
                    "author": "Leagle_Egal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This has been my experence also. I made Mac and cheese once in the slow cooker and vowed to never do it again. ",
                            "score": 10,
                            "author": "earlydawn20",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You could maybe try throwing everything else in there, then adding the pasta when there's only 40-60 minutes remaining.",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you were going to do that, you might as well just make it from scratch in the oven. ",
                                            "score": 34,
                                            "author": "brilliantjoe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Really what is the point of doing this in a slow cooker in the first place? What in that recipe is tasting better because it cooks longer?",
                                                    "score": 12,
                                                    "author": "ckb614",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm new to slow cooking but the only advantage (which is why I'm getting into it right now) is that it is super easy. I still like to cook and basically mastered most savory breakfast foods (I can't eat pancakes or waffles etc.). I like the idea of just putting things in there, set it and forget it, and everything comes out great in the end. ",
                                                            "score": 8,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "But here's the thing. Slow cooking is AMAZING when the recipe lasts the time you'll be at work or something. It kinda becomes pointless when something you'd make in the oven in 30 minutes (which is equally as \"set it and forget it\") now takes 2 hours in the slow cooker. \n\nTo me, slow cooking makes sense when you can put it going while you're at work all day or asleep all night. I'm willing to sacrifice quality for that. A 2-hour recipe that also doesn't yield as good of results as the 30-minute traditional recipe? Not so much. ",
                                                                    "score": 13,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Another scenario where slow cooking works VERY well is the SAHP who has time in the middle of the day but whose late afternoons get pretty frantic. Yes, I'd like to lovingly home cook something amazing every day, but I have 4 tired kids underfoot. Half an hour for dinner prep can be hard to find at that time of day.",
                                                                            "score": 4,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Agree. I saw a Tasty recipe once for crock pot lasagna. It looked horrible. But regardless, I'm willing to sacrifice quality to have a meal ready when I arrive home from a long day at work. \n\nExcept.. The lasagna cook time was 2 hours. My traditional lasagna takes 45 minutes in the oven. I just didn't get it. You're giving up those wonderful crispy edges and non-mushy pasta for a recipe that you can essentially only use if you're home or back within 2 hours. For that, I may as well do the 45 minute one. ",
                                                            "score": 6,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 2,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe, but I'd rather not heat up my entire apartment by using the oven in the middle of the summer.",
                                                    "score": 20,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The no-AC-apartment struggle is real.",
                                                            "score": 12,
                                                            "author": "Hey-GetToWork",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I have AC, I'm just a stingy bastard.",
                                                                    "score": 7,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "For me, then I may as well cook it in the oven. I use the slow cooker for meals after work. I want plug and play meals. ",
                                            "score": 2,
                                            "author": "earlydawn20"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I saw this one on FB recently it looks more creamy than the one you posted but I haven't made either so I have no idea of knowing and I would totally add bacon to the end of this one \n\nhttp://tiphero.com/slow-cooker-mac-cheese/",
                    "score": 16,
                    "author": "TheLawIsi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Looks like they just used more evaporated milk.",
                            "score": 7,
                            "author": "crazyjack24"
                        },
                        {
                            "level": 2,
                            "comment": "The mozzarella is probably the biggest difference.  It's what makes OPs sauce gooey and stretchy.",
                            "score": 6,
                            "author": "evarigan1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For those of us without kitchen scales, what do the gram amounts roughly translate to in cups?",
                    "score": 9,
                    "author": "monkeyhihi",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is a dumb question but is a \"can\" of evaporated milk always the same size?",
                    "score": 14,
                    "author": "flying_giraffe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "5 and 12oz cans, usually when it just says a can its a 12oz.",
                            "score": 38,
                            "author": "panzerbation",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!",
                                    "score": 6,
                                    "author": "flying_giraffe"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "4,600 calories for the whole container. So tasty, but man be careful. Serve this to like 6-8 people.",
                    "score": 13,
                    "author": "itsabearcannon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I worry about these GIF recipes not giving people an adequate idea of portion control. They make these recipes that are 4000, 5000 calories and give absolutely no indication as to how many people it's supposed to serve. Most people can probably tell, but there's always the one person who eats like a quarter of it and then wonders why eating 1200 calories just for one meal isn't good for you unless you're extremely active.",
                                    "score": 24,
                                    "author": "itsabearcannon",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why mustard powder? The extent of my Mac cheese cooking has only gone as far as krafts and never thought mustard was anywhere near the recipe. Is this common and I just never realized?",
                    "score": 7,
                    "author": "DOW_orks7391",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mustard powder is supposed to keep melted cheese creamy instead of lumpy.",
                            "score": 15,
                            "author": "cfinke",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Alton Brown has a recipe for stove-top mac and cheese that uses I think about a teaspoon of mustard powder for this exact purpose.",
                                    "score": 2,
                                    "author": "Squirmin"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I wouldn't say it's super common, but I could see it. Mustard powder pretty much just has a mild savory taste. ",
                            "score": 3,
                            "author": "beetlejuuce",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I put regular yellow mustard in my mac and cheese, it gives it a great little kick. Too much will easily over power it though. ",
                            "score": 2,
                            "author": "HighOctaneCrazyBlood"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can we get those in freedom units?",
                    "score": 10,
                    "author": "Deathlui"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does the bacon get gummy from the slow cooker? Would probably work better as a topping to retain the crunch.",
            "score": 29,
            "author": "bnicoletti82",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cook bacon then save it for later. Make bechamel sauce with bacon fat. Best of both worlds? Although at that point you might as well cook the pasta and skip the slowcooker altogether. ",
                    "score": 30,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Love using the bacon fat for the bechamel. Works great.",
                            "score": 9,
                            "author": "ouldsmobile"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "how does the pasta handle a 2 hour cook time, for that matter?  Seeing as you'd usually boil pasta for all of 8 minutes...\n\nThat cheesy business looks super yummy though",
                    "score": 12,
                    "author": "merreborn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "all i can say is that i've made crockpot lasagna which is a 4hour wait time, and the noodles were amazing ",
                            "score": 2,
                            "author": "Fontaine911"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always feel like I'm in the minority when I say I prefer creamy macaroni and cheese.",
            "score": 151,
            "author": "ANAL_PURGATORY",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah I agree, watching that gave me dry mouth.",
                    "score": 41,
                    "author": "KushQueen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure it wasn't the kush?",
                            "score": 20,
                            "author": "Ghotimonger"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know it isn't real cheese, but Velveeta mixed with mild cheddar makes the best oven mac and cheese.",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Velveeta is cheese. Don't give into snobby cheese racists.",
                            "score": 21,
                            "author": "earthboundEclectic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*Processed cheese product*",
                                    "score": 4,
                                    "author": "celluj34",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well I for one like Macaroni &amp; *Processed cheese product*",
                                            "score": 3,
                                            "author": "isorfir"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh boy, I'm definitely guilty of making Velveeta grilled cheese when I'm drunk. Throw some garlic powder and cayenne on the buttered sides and it's like crack.",
                            "score": 7,
                            "author": "ANAL_PURGATORY"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The thickness of this recipe is partially due to the choice of cheese.  I've done mac &amp; cheese this way using American cheese as well as Cheddar and Gruyere.  It comes out much creamier.   ",
                    "score": 5,
                    "author": "Chrispiest",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not big into American Cheese. I would probably just have added a bit of cream and butter in at the end",
                            "score": 2,
                            "author": "ANAL_PURGATORY"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I always feel like I'm in the minority when I say that GIFs are literally the fucking **worst** information delivery method for a recipe.",
                    "score": 117,
                    "author": "HittingSmoke",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Literally the worst\"??? Interpretive dance? Esperanto? Balloon sculpture?",
                            "score": 48,
                            "author": "niknocee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cool your jets about esperanto there, buddy!",
                                    "score": 9,
                                    "author": "soingee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Cool your jets about esperanto there, buddy\n\n\nMalvarmigi via jetoj pri Esperanto tie, kamarado",
                                            "score": 2,
                                            "author": "Phenic",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I disagree. The gif is just a preview. It quickly relays the ingredients and overall difficulty of the recipe. It makes deciding what to make a lot easier than reading a text version. \n\nIf you choose to make the dish that the gif presented hopefully you will pull up the text version of the recipe to follow. ",
                            "score": 155,
                            "author": "alphaweiner",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I would agree that it's the worst if I could only have the gif - that wouldn't be great. Honestly though the only reason I even looked at this was because there was a short gif. If I wanted to make it now, I'd follow the text instructions. So, mission complete as far as getting my attention.",
                                    "score": 4,
                                    "author": "isorfir"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's making me SO ANGRY.",
                            "score": 4,
                            "author": "Ghotimonger"
                        },
                        {
                            "level": 2,
                            "comment": "I actually really like it as long as the quantities for ingredients is one click away.  It shows the entire prep process and gives you an idea of the final result, all within 15ish seconds.  ",
                            "score": 8,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "I feel you, I HATE the trend of the cooking community to make gifs out of everything. Just make a video or don't make a video and give me the freaking recipe and a picture. I just feel like I am not taken seriously when they make such gifs.\n\nIt doesn't help that most of these gifs are the easiest freaking recipes in the world",
                            "score": 3,
                            "author": "danielswrath"
                        },
                        {
                            "level": 2,
                            "comment": "I prefer a standard recipe to a gif almost any day.",
                            "score": 5,
                            "author": "MockDeath"
                        },
                        {
                            "level": 2,
                            "comment": "I prefer a standard recipe to a gif almost any day.",
                            "score": 2,
                            "author": "MockDeath"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hate baked, creamy all the way! I have a recipe for chipotle Mac and cheese and I skip the whole baking portion and it tastes so much better",
                    "score": 3,
                    "author": "RhubarbCharb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ME TOO. Why the fuck would you put breadcrumbs on mac and cheese and then ruin it? Just give me that tasty creamy cheese that doesn't feel like tumors  slipping down my throat ",
                            "score": 4,
                            "author": "ANAL_PURGATORY"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm with you there. Just cheddar and heavy cream on al dente noodles. IF you want a cheesy top, grate some and broil to finish the dish. \n\nThen again,  I also find bacon on macaroni an abomination as well (Though, my opinion hardly matters to most as I do not eat pork or cow). However, I feel like if you just add bacon to everything you're admitting you feel like your food can't stand on it's own flavor profile. ",
                    "score": 6,
                    "author": "darkm0d",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Then again, I also find bacon on macaroni an abomination as well  However, I feel like if you just add bacon to everything you're admitting you feel like your food can't stand on it's own flavor profile.\n\nI'm with you there. I actually really like bacon, but only with/for breakfast. I always find when adding bacon to other things it ends up making whatever I'm eating taste mostly of bacon and that isn't what I want. ",
                            "score": 7,
                            "author": "mynumberistwentynine"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nah I agree, watching that gave me dry mouth.",
                    "score": 2,
                    "author": "KushQueen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mac &amp; cheese seems kinda unsuited for the slow cooker. Make real mac &amp; cheese - 10mins to make it, 25mins to bake it. It's already easy.",
            "score": 55,
            "author": "expostulation",
            "replies": [
                {
                    "level": 1,
                    "comment": "Every time I see Mac and Cheese on here I want to pull out my god-damned hair. Just because something is good (slowcooking), doesn't mean it's good in every situation! There is literally no reason to make Mac and Cheese in a slow cooker. It takes 20 minutes and one pot to make (non-baking, bechamel method).",
                    "score": 39,
                    "author": "commisaro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep. I had to unfollow one of the gif recipe pages on social media because every time I'd see something like lasagna done in the slow cooker, I'd lose my shit. \n\nPeople would get all defensive, \"Stop being a snob. The slow cooker is easiest for some\" . It's like.. Your slow cooker lasagna is wayyyyy worse in quality yet it takes TWO HOURS vs. the 45 minutes that oven lasagna takes. \n\nSlow cookers make sense when you can turn them on and go to bed or go to work. They don't make sense when the recipe is 2 hours unless that particular recipe is legitimately better tasting in the crock pot. ",
                            "score": 5,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Thank you! A roux is super quick to whip up. ",
                            "score": 8,
                            "author": "expostulation"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nutritional Value for those interested and because I *love* homemade Mac N Cheese. All info was derived from Google.  \n  \n500g dried elbow macaroni;  \n  \n* 1855 Cal  \n* Protein - 65g  \n* Carb - 375g  \n* Sugar - 13.5g  \n  \n150g Gruyere, grated;  \n  \n* 619.5 Cal  \n* Protein - 45g  \n* Carb - 0.6g  \n* Sugar - 0.6g  \n  \n150g mozzarella, grated;  \n  \n* 420 Cal  \n* Protein - 48g  \n* Carb - 4.65g  \n* Sugar - 1.8g  \n  \n150g cheddar, grated;  \n  \n* 603 Cal  \n* Protein - 37.5g  \n* Carb - 1.95g  \n* Sugar - 0.75g  \n  \n10 strips of bacon;  \n  \n* 430 Cal  \n* Protein - 30g  \n* Carb - 1g  \n* Sugar - 0g  \n  \n350ml whole milk;  \n  \n* 147 Cal  \n* Protein - 11.9g  \n* Carb - 17.5g  \n* Sugar - 17.5g  \n  \n1 can evaporated milk;  \n  \n* 504 Cal  \n* Protein - 25.2g  \n* Carb - 156g  \n* Sugar - 0g  \n  \nTotal;  \n  \n* 4578.5 Cal  \n* Protein - 262.6g  \n* Carb - 556.7g  \n* Sugar - 34.15g  \n  \nPut this into Myfitnesspal  and weigh out your servings in order to get individual nutritional values.",
            "score": 60,
            "author": "Do_it_in_a_Datsun",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 91,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"I don't stop eating when I'm full, I stop eating when I hate myself\" - Louis C.K.",
                            "score": 45,
                            "author": "e39dinan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it's \"the meal isn't over when I'm full,  the meal is over when I hate myself.\"",
                                    "score": 16,
                                    "author": "fantasticthrowaway1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right you are! ",
                                            "score": 2,
                                            "author": "e39dinan"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I feel yah, dude. Its hard not to.",
                            "score": 4,
                            "author": "Do_it_in_a_Datsun"
                        },
                        {
                            "level": 2,
                            "comment": "You should be bulking anyway.",
                            "score": 2,
                            "author": "barefootbandit8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I bulk any more, and Greenpeace is gonna try and push me into the ocean. ",
                                    "score": 8,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Protein check\n\nCarbs check\n\nFat??",
                    "score": 9,
                    "author": "pewc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The whole thing.",
                            "score": 10,
                            "author": "CactusInaHat"
                        },
                        {
                            "level": 2,
                            "comment": "I need to get in the habit of putting that for other redditors. I normally don't worry about my fat intake as much as I do with protein and carbs. ",
                            "score": 3,
                            "author": "Do_it_in_a_Datsun"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "one out of one. got it",
                    "score": 2,
                    "author": "abeardancing"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How's the consistency of the pasta and skip the slowcooker altogether.",
            "score": 10,
            "author": "h0m_twinz"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's why it's already rendered down and crispy. The amount of rendered fat in your sauce should be negligable ",
                    "score": 7,
                    "author": "selggu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I tried this once and the pasta just disintegrated and turned the whole thing into a giant cheesey starchy mess. It was unsalvageable and I had to throw it all away. I'm not sure how people successfully make Mac n cheese in the slow cooker.",
            "score": 8,
            "author": "ObviousLobster",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's pretty easy:\n\n* Step 1: Take out your slow cooker.\n* Step 2: Put away your slow cooker.\n* Step 3: Make Mac and Cheese normally.\n\n(For best results, omit steps 1 and 2)",
                    "score": 18,
                    "author": "commisaro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hold on, let me get a notepad...",
                            "score": 4,
                            "author": "ObviousLobster"
                        },
                        {
                            "level": 2,
                            "comment": "Instructions unclear, stuck repeating steps 1 and 2",
                            "score": 2,
                            "author": "swordofthespirit"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok, I just finished this recipe, and honestly I wasn't thrilled.\n\n- First, too much cheese. Usually I am the last to complain about this, but seriously, I was loosing the noodles in the cheese.\n\n- The gruyere. This might just be personal taste, or might come down to the specific gruyere you get, but I did not like the flavor of it enough for it to play such a dominant role. \n\n- The mozzerella. The tendency for the mozz to not melt completely and stay stringy really increased the sauce's perceived volume, and made it feel like I was eating cheese, instead of a cheese sauce, making the \"Too much cheese\" thing seem even worse. \n\nHowever, I was pleasantly surprised at how good both the noodles and bacon were coming out of the slow cooker. If I had to do it again I would do it the same, but change the ratio of the cheeses. Maybe just reduce the gruyere and mozz by half.",
            "score": 8,
            "author": "SirBinks",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What is the value of the mustard powder? Seems like kind of an odd ingredient. ",
            "score": 5,
            "author": "goddesspyxy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mustard brings out the cheesy flavour. I always put mustard in a cheese sauce.",
                    "score": 5,
                    "author": "Fallenangel152"
                },
                {
                    "level": 1,
                    "comment": "Oh my god, you *have* to try mustard in your mac and cheese. It complements the cheese flavor in such an amazing way. ",
                    "score": 4,
                    "author": "Hysterymystery"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love my slow cooker and I cook an awful lot of things in there but no, just no, to this \"mac and cheese\".  \n  \n  \nIt's not worth saving the 40 minutes or so it would take to make *real* mac and cheese.",
            "score": 5,
            "author": "supermegaultrajeremy"
        },
        {
            "level": 0,
            "comment": "I just found what I'm bringing to the next potluck day at work.",
            "score": 5,
            "author": "ApokalypseCow"
        },
        {
            "level": 0,
            "comment": "Saved for when I'm having a bad day and need to eat my feelings. ",
            "score": 2,
            "author": "Iyoten"
        },
        {
            "level": 0,
            "comment": "Bleh, every time I've had slow cooker mac and cheese I've never liked it :(  I don't know if it's the gruyere (this is always in the recipes that I've seen), or if I just don't have the acquired taste for it, but I just don't like it.",
            "score": 2,
            "author": "lessadessa"
        },
        {
            "level": 0,
            "comment": "I just did this recipe yesterday at work, adding the bacon and breadcrumbs as a topping at the end, more salt and pepper stirred in towards the end of cook time, and a bit of colby jack in place of some of the mozz and cheddar.  \n\nTwo separate people came to me and said it was the best mac &amp; cheese they'd ever had.  :-)\n\nNext time I think I'll stir in some pulled pork right at the end.",
            "score": 2,
            "author": "ApokalypseCow"
        },
        {
            "level": 0,
            "comment": "So... I don't want to ask but... Calories? ",
            "score": 8,
            "author": "leonardoty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Best I could do... (might be off a bit here and there, but still...)\n\nIngredient|Calories\n---|---\n500g dried elbow macaroni | 1785\n150g Gruyere, grated | 621\n150g mozzarella, grated | 535\n150g cheddar, grated | 618\n10 strips of bacon | 400\n350ml whole milk | 222\n1 can evaporated milk | 960\nTotal | 5141\n",
                    "score": 27,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you.",
                            "score": 3,
                            "author": "leonardoty"
                        },
                        {
                            "level": 2,
                            "comment": "Holy shit. I had no idea 1 can of evaporated milk was almost 1000 calories. Hot damn.",
                            "score": 3,
                            "author": "Purifiedx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup...  I've used it as an emergency meal replacement.\n",
                                    "score": 3,
                                    "author": "philroi"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't know why everyone who has replied so far has been such a dick, but here, I put this together real fast:\n\n[Nutrition info for slow cooker mac &amp; cheese](http://i.imgur.com/09FSVjW.png).\n\ntl;dr About 800 calories, if you assume 6 servings (I guessed).",
                    "score": 11,
                    "author": "masqueradestar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Meh its the internet I don't mind. My wife adores mac and cheese and I'm diabetic, so I need a carb count for insulin, so thank you for doing this.",
                            "score": 13,
                            "author": "leonardoty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My son was diagnosed with Type 1 last September and holy cow, the carb counting can be such a pain. It's the worst when we go to a restaurant because I've found that most, aside from large chains, don't have that information available. We cobble together what we can based on what the kitchen tells us about ingredients and serving sizes, but it gets frustrating for him sometimes. He just turned 11 and I feel for him (and you) having to deal with that the rest of his life.\n\nThis has nothing to do with anything. I guess I needed to vent a tad. :)",
                                    "score": 9,
                                    "author": "superluminal"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "myfitnesspal.com",
                                    "score": 1,
                                    "author": "masqueradestar"
                                },
                                {
                                    "level": 3,
                                    "comment": "Looks like myfitnesspal\n",
                                    "score": 1,
                                    "author": "nozafc"
                                },
                                {
                                    "level": 3,
                                    "comment": "Based on design/color scheme, I'm guessing MyFitnessPal.",
                                    "score": 1,
                                    "author": "SickeninglyNice"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As Kenji once said on America's Test Kitchen... \"It's bad for you, but in a really delicious way.\"",
                    "score": 9,
                    "author": "bostonbacon"
                },
                {
                    "level": 1,
                    "comment": "Why are you making mac and cheese if you're concerned about calories?",
                    "score": 18,
                    "author": "Quiggibub",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because diabetic people like me **need** to know the nutritional info. Small servings of traditionally decadent things --like mac &amp; cheese-- can be worked into a meal, but only if we know the numbers.\n\nMy family would love this dish, and it would be nice to know exactly how much I can have, too.\n",
                            "score": 25,
                            "author": "DmKrispin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha, I actually asked because I too am diabetic. Need the carb count for insulin dosage. ",
                                    "score": 7,
                                    "author": "leonardoty"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You can still eat healthy/count calories and enjoy things like mac n cheese. ",
                            "score": 43,
                            "author": "Do_it_in_a_Datsun",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Because I'm diabetic and I need to know macro breakdowns for insulin purposes. ",
                            "score": 8,
                            "author": "leonardoty"
                        },
                        {
                            "level": 2,
                            "comment": "Bulking",
                            "score": 2,
                            "author": "tominsj"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "https://www.reddit.com/r/slowcooking/comments/4n5hh8/slowcooked_mac_n_cheese/d412mgz",
                    "score": 2,
                    "author": "Do_it_in_a_Datsun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't post this on r/gifrecipes, all anyone does there is complain about having \"too much cheese\" as if there is such a thing.",
            "score": 3,
            "author": "scam_radio"
        },
        {
            "level": 0,
            "comment": "That looks like a nightmare to clean o.o",
            "score": 2,
            "author": "SockPuppetDinosaur",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How To Ruin Pasta™",
            "score": 2,
            "author": "carkey"
        },
        {
            "level": 0,
            "comment": "Thank you for this.",
            "score": 1,
            "author": "kungfuesday"
        },
        {
            "level": 0,
            "comment": "n00b question, what's the evaporated milk for?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Richness, and slightly, thickening; it's already partially 'cooked down' so you don't have to completely murder the pasta to get a non-soupy sauce.",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So, it takes place of a roux?",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not *really*; this recipe looks like it's relying on the cheese, and to a lesser extent, starch from the pasta, to bind the sauce - it's more in the way of liquid to 'reconstitute'/cook the pasta, and mouth feel.",
                                    "score": 4,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Evaporated milk has been heated to remove 60% of the water. As /u/Orgell_Evaan mentioned so the sauce is not soupy.",
                    "score": 1,
                    "author": "JohnnyBrillcream"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just out of curiosity, can someone provide a rough cost estimation of this?",
            "score": 1,
            "author": "Absle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Based on approximate local prices for store brand ingredients (I converted to US measure), rounded up a bit. Assume six 800kcal servings, per the chart from /u/masqueradestar :\n\n~1lb bag of macaroni $1~1.50\n\n5oz cheddar $1.30\n\n5oz mozz $2 (real mozz, not that powered stuff in a can)\n\n5oz gruyere $2\n\n10 strips bacon $2\n\n1.5cups milk 40~50cents\n\n12oz can evaporated milk $1\n\nSpices/breadcrumbs $1 total\n\n\n$11~12 for the whole pot, give or take/$2 per person.",
                    "score": 6,
                    "author": "EricKei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd expect gruyere to be a little more expensive, but it is pretty inexpensive as e.g. pasta is really cheap.",
                            "score": 2,
                            "author": "masqueradestar",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aaaaaaand save.",
            "score": 1,
            "author": "European_Soccer"
        }
    ]
}