{
    "id": "8hsfqh",
    "score": 4022,
    "title": "[request] can we post more finished products and less raw food (\"see you in ___ hours\" posts)?",
    "author": "imatthewhitecastle",
    "date": 1525739240.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/8hsfqh",
    "media_urls": [],
    "other_urls": [],
    "postText": "feel free to nix this but i feel like i'd rather see actual food than raw meat or whatever. it doesn't make me want a recipe, it doesn't look appetizing, just nothing. it's like one step forward from taking pictures of packaged meat at the grocery store. a lot of the time i'll go into these posts hoping to see what the finished product looks like so i can decide if it looks good enough to try it, and there won't be any mention of what it looks like when it's done. \n\nlike i said, feel free to shut me down if i'm being a jerk, but i feel like i'm not the only one who feels like this. i'm glad everyone's making cool stuff with their slowcookers but i feel like the sub would be improved if people posted their food when it's done rather than as soon as they put it in.\n\nedit: another thing -- if you post before it's done, we don't even know if your recipe is any good. it might look like it's going to be good, but if it turns out not being good and you regret posting it/recommending it to everyone on here, it's too late.",
    "comments": [
        {
            "level": 0,
            "comment": "See you in 10 hours\n\n*picture of grocery store*",
            "score": 438,
            "author": "Dlrlcktd",
            "replies": [
                {
                    "level": 1,
                    "comment": "See you in 3 days!\n\n*picture of grazing cow*",
                    "score": 141,
                    "author": "unbalanced_checkbook",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "3 days? Talk about farm to table! ",
                            "score": 13,
                            "author": "thebbman"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "See you 15 hours ago!  \n*picture of toilet bowl*",
                    "score": 53,
                    "author": "nolij420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*saw you",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That actually makes more sense. In my version he's a time traveler or something.",
                                    "score": 3,
                                    "author": "nolij420"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[This is going to be delicious!](https://www.google.com/imgres?imgurl=http%3A%2F%2F3.bp.blogspot.com%2F-OucL1p84R4k%2FUsrw41AWk1I%2FAAAAAAAAAUU%2Foo2X5r0ko5w%2Fs1600%2FGeneric-Packaging-Design-Retail1.jpg&amp;imgrefurl=http%3A%2F%2Fgbnfgroceries.blogspot.com%2F2014%2F01%2Ffrom-misc-foods-aisle-generic-brands.html&amp;docid=I7LJVG4g6rNvdM&amp;tbnid=kE-QkYx-fFnx-M%3A&amp;vet=10ahUKEwj-u4vo6PXaAhUQzVMKHY6wBU0QMwhlKAgwCA..i&amp;w=679&amp;h=968&amp;bih=911&amp;biw=1688&amp;q=generic%20grocery%20store&amp;ved=0ahUKEwj-u4vo6PXaAhUQzVMKHY6wBU0QMwhlKAgwCA&amp;iact=mrc&amp;uact=8)",
                    "score": 14,
                    "author": "chickentacosaregod"
                },
                {
                    "level": 1,
                    "comment": "Or a pic of your grocery list. ",
                    "score": 4,
                    "author": "thebbman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree. I thought it was a rule for a while that people had to post a finished picture. Was it removed?",
            "score": 336,
            "author": "EdynViper",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn’t see it on the subreddit rules list, but I agree it should be. Why not post a before and after and just reap the karma then?",
                    "score": 38,
                    "author": "ShellieMayMD"
                },
                {
                    "level": 1,
                    "comment": "I don't know. It's definitely a rule on the /r/sousvide subreddit.",
                    "score": 46,
                    "author": "xeeew"
                },
                {
                    "level": 1,
                    "comment": "Not just finished, PLATED",
                    "score": 22,
                    "author": "pegcity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "so before, after, and \"as served\"...i like this rule.",
                            "score": 11,
                            "author": "snakejawz"
                        },
                        {
                            "level": 2,
                            "comment": "/r/wewantplates",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amen! No one wants to see your nasty raw pork roasts",
            "score": 595,
            "author": "meghanmeghanmeghan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I want to see both, before and after pics. ",
                    "score": 81,
                    "author": "bathrobehero"
                },
                {
                    "level": 1,
                    "comment": "Speak for yourself ;)",
                    "score": 23,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am all raw pork roasts on this blessed day.",
                            "score": 35,
                            "author": "sneaklepete"
                        },
                        {
                            "level": 2,
                            "comment": "Classic UncleTouchyPenis.",
                            "score": 9,
                            "author": "colonel-yum-yum"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Idk I kinda subscribed to see food that looks like diarrhea ",
                    "score": 1,
                    "author": "aksumighty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd rather before and after",
            "score": 265,
            "author": "grnrngr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I really like seeing posts with a before/ after and an honest opinion on how it turned out or what they served with it.. ",
                    "score": 93,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m here for recipes and finished product photos to determine if said recipes are appetizing. I want to see FINISHED Mississippi pot roasts. ",
                            "score": 47,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why, it doesn't seem very complex or something I would eat twice. It's like a recipe for wings on the back of a ketchup bottle. All Heinz products also go into said recipe. ",
                                    "score": 1,
                                    "author": "aKingS"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think it starts with that in mind then after 8hrs I just can’t wait to eat it and forget to take the after. At least that’s the case with me. ",
                    "score": 3,
                    "author": "penberkins"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Before and afters are my favorite tbh.",
            "score": 177,
            "author": "carmelsown",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah i wanna be clear here that i'm not bothered by those at all, so long as the after is there and isn't hard to find",
                    "score": 128,
                    "author": "imatthewhitecastle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like the r/diy standard of starting the album with the result, then showing process photos.",
                            "score": 49,
                            "author": "nipoez",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "in our case, the plated meal.",
                                    "score": 7,
                                    "author": "snakejawz"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So do one post with two pics. ",
                    "score": 28,
                    "author": "OddJackdaw"
                },
                {
                    "level": 1,
                    "comment": "I agree. I don’t think the before pics are gross- I think that kind of thought process comes from being disconnected from the idea that many of our protein sources starts out as live beings. I do however think that after pictures should be an automatic part of the post... it’s like doing a diy post without ever showing the finished job. ",
                    "score": 16,
                    "author": "middlenamesneak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Today I made a hand-carved beautiful desk for my wife!](http://cdn.shopify.com/s/files/1/0652/8105/products/lumber2x4-1_grande.jpg?v=1498238381)\n\nThere's nothing wrong with before pictures.  Just include the after picture too!  Even if you don't show it plated, at least show it cooked and say somewhere if it was good or not...",
                            "score": 7,
                            "author": "dchaosblade",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hahah, exactly! ",
                                    "score": 1,
                                    "author": "middlenamesneak"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Definitely my favorite ",
                    "score": 1,
                    "author": "ASYMBOLDEN"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We should all agree to downvote all of those   \"see you in X hours\" posts if they don't contain a finished product.",
            "score": 68,
            "author": "popemichael"
        },
        {
            "level": 0,
            "comment": "Only so many times we can watch a lot full of raw pork before carnitas stops sounding so appetizing ",
            "score": 85,
            "author": "schelbaby"
        },
        {
            "level": 0,
            "comment": "It’s the same few things over and over again too-Mississippi pot roast, pulled pork, pot roast, or carnitas-and they all have the same or similar tag line-tried my hand at x or finally giving x a try...or x-see you in x hours",
            "score": 68,
            "author": "i_ata_starfish-twice",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pork, see you in pork hours?",
                    "score": 30,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pork you in pork hours!",
                            "score": 4,
                            "author": "misspeelled",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pork you, man! ",
                                    "score": 2,
                                    "author": "hirotime"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This sub has always been like the same 5 recipes over and over with some random recipes that should not be cooked in a slow cooker.  But I love looking at pork so... ",
                    "score": 7,
                    "author": "dlxnj"
                }
            ]
        },
        {
            "level": 0,
            "comment": "But how are people going to milk that sweet easy circle jerk karma? ",
            "score": 42,
            "author": "StachTBO",
            "replies": [
                {
                    "level": 1,
                    "comment": "By users of this sub downvoting before-only posts. Like I do.\n\n\"See you in 6hrs!\" Well, I won't be here and I doubt you'll be posting a pic in exactly 6hrs, so downvoted. No one else wants to see that you dumped some* things* in a pot. We want to see beautiful, yummy-looking, mouth-watering meals with a link to the recipe or your step-by-step instructions posted in the comments.",
                    "score": 48,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's sort of like charcuterie board posts on r/food. Like, yippee -- you cut some cheese and put pre-sliced meat on a board!",
                            "score": 18,
                            "author": "mintyporkchop"
                        },
                        {
                            "level": 2,
                            "comment": "Needs the same rule they have in r/diy. Post must start with the completed product first!",
                            "score": 7,
                            "author": "Anechoic_Brain",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Eh... I'm more of a \"this is how it started --&gt; this is what I made it!\" kind of person.\n\nI like to see the shitty pic first and then see how beautiful it all became. However, the order of the pics isn't that big of deal as long as the title accurately tells you which is which.\n\nI mean, of course I can tell the difference between a cooked meal and an uncooked one (most times) but it's a pet peeves of mine for the description to not indicate the correct order of the pics.",
                                    "score": 4,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "if that's what it's about, they'd get more if they just waited until it was done. it's literally the same amount of effort.",
                    "score": 13,
                    "author": "imatthewhitecastle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have seen it a few times the double post for maximum karma. First is the \"see you in 6 hours after my pulled pork cooks\" and then a second with \"(update) pulled pork was delicious ;)\". ",
                            "score": 14,
                            "author": "StachTBO"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; if that's what it's about, they'd get more if they just waited until it was done. \n\nNah, this way they double dip. Karma for the first post and even more karma for the second. And we all know the wonderful stuff you can buy with that sweet, sweet karma!",
                            "score": 8,
                            "author": "OddJackdaw"
                        },
                        {
                            "level": 2,
                            "comment": "Karma you get now is better than karma you can get later, everyone knows that",
                            "score": 1,
                            "author": "gunsmyth"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "While we’re on the topic of pork...what’s the deal with all of the slow cooker Mexican inspired pulled pork that people are trying to pass off as carnitas? Drives me bananas. ",
            "score": 69,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Something had to come after the \"jambalaya.\"",
                    "score": 49,
                    "author": "NeverEnoughCorgis"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just curious what are \"real\" carnitas?\n\nWikipedia says it's just pork cooked slow for 3-4 hours with lard and seasonings like salt, chili, cumin, oregano, majoram, thyme, bay leaf and garlic. Then crisped and pulled. Take out the lard and that sounds like every pork carnitas slow cooker recipe I've read.",
                            "score": 9,
                            "author": "illegal_brain",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The lard and simmering/frying process is the most critical part imo. \n\nIf anything, the slow cooker method is more figure friendly. Lard is awesome (in moderation).",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "True you can't replace lard very easily. I did find a classic Mexican cookbook the said milk would also work as a lard replacement. I always broil my slow cooker carnitas on crisco to give it that final crisp.",
                                            "score": 1,
                                            "author": "illegal_brain"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can get a cazo and propane burner on amazon. Doesn’t have a whole lot of other utility unless you’re into outdoor frying...which is why cazos are passed down. Copper is expensive!",
                                            "score": 1,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah that is definitely real carnitas. I wish I could have that on my condo porch and that copper was a little cheaper...\n\nHowever for a slow cooker version I would say slow cooking a pork shoulder on high with some lard or other fat substitute and some spices then broiling is pretty close in my opinion. ",
                                            "score": 1,
                                            "author": "illegal_brain"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agreed: https://www.reddit.com/r/slowcooking/comments/8ezxl4/quit_it_with_ill_see_you_in_x_hours_post_when_its/",
            "score": 16,
            "author": "Mr_A",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why was it removed??",
                    "score": 1,
                    "author": "TheFuturist47",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No idea. I wasn't even informed that it was. The text said (and still says if you're logged in as me (although I didn't italicise anything; that's just this subreddit's formatting taking liberties with my text)):\n\n&gt;Ten days ago: [See you guys in 9 hours. Slow cooker chicken and dumplings!](https://www.reddit.com/r/slowcooking/comments/8cftoj/see_you_guys_in_9_hours_slow_cooker_chicken_and/)\n\n&gt;Ten days ago: [Slow cooker Feijoada. See you in 8 hours!](https://www.reddit.com/r/slowcooking/comments/8ckjx2/slow_cooker_feijoada_see_you_in_8_hours/)\n\n&gt;Seven days ago: [Pork shoulder with fresh cumin, sweet peppers, jalapeños, garlic, chili powder, paprika, and a couple limes. See you in 9 hours😋](https://www.reddit.com/r/slowcooking/comments/8d8nek/pork_shoulder_with_fresh_cumin_sweet_peppers/)\n\n&gt;Two days ago: [Classic Maple Chili. See you in 12 hours.](https://www.reddit.com/r/slowcooking/comments/8edhlm/classic_maple_chili_see_you_in_12_hours/)\n\n&gt;Today: [Turkey with Turkish seasoning, I’ll see you in 8 hours](https://www.reddit.com/r/slowcooking/comments/8euogq/turkey_with_turkish_seasoning_ill_see_you_in_8/)\n\n&gt;Today: [My grandmother's Cactus n Pork recipe. See you in about 4 hours](https://www.reddit.com/r/slowcooking/comments/8eyrx3/my_grandmothers_cactus_n_pork_recipe_see_you_in/)\n\n&gt;I feel like we have this discussion every couple of months and I wanted to head this one off at the pass. We want to know how the recipe turned out. Anything could go wrong during cooking and if whoever makes the initial post doesn't come back to update it we could all be making something that actually turns out quite poor.\n\n&gt;So PLEASE if you're going to make a post, please make it after you're finished cooking. Let us know how it turns out and feel free to post a before *and* after picture at that point, too. This might just be a pet peeve of mine and I might be wrong, but I consider it courteous and informative to know what the end results are rather than what a bunch of uncooked ingredients look like all mixed together.\n\n&gt;(To be fair two of the above posts have follow-ups, but that's only two out of six.)",
                            "score": 17,
                            "author": "Mr_A",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm actually so much more annoyed after reading the list you compiled of identical titles. Why do people do this oh my god",
                                    "score": 10,
                                    "author": "TheFuturist47",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Maple chili was me. In my defense, it was my first time posting after lurking for a few days. And I followed up.",
                                            "score": 5,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes times a thousand. It needs to have an after photo included. Just be a little patient and wait. ",
            "score": 9,
            "author": "babette13"
        },
        {
            "level": 0,
            "comment": "I just found this sub and was excited to learn some new recipes, but all I’ve been seeing is meat posts. I don’t like eating meat more than once or twice a week. \nI was definitely hoping to see more variety, like lasagna or chicken and dumplings, or stuff like that. \nGuess I’ll be posting here now of my results from Pinterest recipes (I always wind up going back to freakin’ Pinterest for everything).",
            "score": 17,
            "author": "MoistCreamPuffs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes please help us out and bring some variety! Be the change you want to see in the world etc! I'd love a good chicken &amp; dumplings recipe personally.",
                    "score": 11,
                    "author": "TheFuturist47"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The amount of drama in a crock pot sub is hilarious.",
            "score": 3,
            "author": "PERCEPT1v3"
        },
        {
            "level": 0,
            "comment": "Yes! At least do a before/after post.",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This whole sub is the epitome of lazy cooking. Crock pots. Jesus. I thought this was going to be like slow smoked briskets or confit duck legs. Nope. Raw pork ass in a plastic bag with pre-cut carrots and the funniest part is that people find that appetizing instead of culinarily offensive. Most posts on here could easily fit into r/shittyfoodporn",
            "score": 26,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You must have loved that post with the slop that \"tasted just like a big Mac\".",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ugh why does it the American cheese slices make everything look worse?",
                            "score": 0,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Gross, that was a thing? A desired thing no less?",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://imgur.com/gallery/DaITdTw",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm sorry, I love American Cheese Product for some stuff. It is a guilty pleasure but that is possibly one of the grossest slow cooked recipes I've ever seen. Cooking at home to me is about making the best thing I can or the best version of it. Introducing american cheese and half of the ingredients (powder mixes, etc.) people use here is the epitome of things I can't stand while cooking. \n\nIt's an affront to people who actually cook from scratch.  ",
                                            "score": 0,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Gross. That was a thing? A desired thing at that?",
                            "score": -8,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Gross. That was a thing? A desired thing at that?",
                            "score": -8,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Half the recipes are just meat plus a store bought marinade/can of coke. It doesn't even sound appealing. ",
                    "score": 22,
                    "author": "EdynViper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I  am tired of sauce/tomato being used as the liquid... Literally everything tastes the same. I'm all for easy recipes but I need variety",
                            "score": 2,
                            "author": "noyogapants"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lazy cooking?  Haha, joke's on you: That's why I come here!  \n\nSeriously, I'm not much of a cook, and neither were/are my parents.  We never had a crockpot, either.  Couple years ago, I had a roommate with one, and I tried to use it, but every time I made a beef dish, like stew beef or a roast, it ended up a dry, gross yuck.  And I was following recipes!  \n\nIt wasn't until I found this subreddit that I figured out putting it on LOW for around 8 hours, and adding little to no liquid does the trick.  Moreso, I could just coat the meat in seasonings that I like, rather than follow a recipe that calls for several things I'd have to buy, then never use again.  \n\nThat said, I wouldn't mind seeing advanced dishes like you described.  I'm oddly enough, snooty when it comes to spices and seasonings.  We've started growing rosemary, lavender, and basil, and have weaned myself off the prepackaged packets.  \n\n-----  \n\nPS: Forgot about this... the first rule of this sub makes its mission statement pretty clear:  \n\n**This subreddit is for \"Crock-Pot®\"-type recipes only. Moderators may remove posts/comments at their discretion**",
                    "score": 11,
                    "author": "AnnaKossua",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In consideration of the mission statement that you just brought to my attention, I have to agree that my gripe is more or less nullified, and I apologize for any perceived snootiness. ",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "/r/gatekeeping ",
                    "score": 5,
                    "author": "misspeelled"
                },
                {
                    "level": 1,
                    "comment": "/r/iamveryculinary ",
                    "score": 9,
                    "author": "nsgiad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "holy shit thank you for this",
                            "score": 5,
                            "author": "TheFuturist47",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Enjoy! ",
                                    "score": 6,
                                    "author": "nsgiad",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wow what salty fuck felt the need to downvote that harmless chain of comments? \n\nSide note: I've been enjoying reading through that sub all morning",
                                            "score": 6,
                                            "author": "TheFuturist47"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And I got downvoted when I tried to explain that using a Crock Pot and braising weren't the same thing in this sub. ",
                    "score": 5,
                    "author": "Lt_Crunch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's insane, they're absolutely not the same thing. That isn't even being haughty or pretentious - they're just not.",
                            "score": 6,
                            "author": "TheFuturist47",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you",
                                    "score": 2,
                                    "author": "Lt_Crunch"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So fuck off to a sub you'll enjoy. ",
                    "score": 6,
                    "author": "ImALittleCrackpot"
                },
                {
                    "level": 1,
                    "comment": "You said it, man.",
                    "score": 1,
                    "author": "BigLebowskiBot"
                },
                {
                    "level": 1,
                    "comment": "/r/MealPrepSunday has become this too. For a while I was so excited thinking that I was missing out on saving a bunch of time making yummy meals but no, 80% of posts are some depressing slop with instructions indicating absolutely no understanding of how to season things or work with textures. I love prepping and I love my slow cooker but they have a limited scope of things that they can be used for while still making sure the food you’re eating is Good.",
                    "score": -1,
                    "author": "chupagatos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Better yet, take the before pic and then save it for when you have a done pic. Then post them together for MOAR Karma. Profit?",
            "score": 7,
            "author": "SmashesIt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some people like to think they’d get more if they split it into two posts. Probably right too but man is it annoying. I just downvote raw pictures and upvote cooked meals. Unless there is finished results in the comments ",
                    "score": 6,
                    "author": "Legeto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea those people are dumb. I have got the most feedback on this sub by being thorough... having an ingredients shot, an in the crock before, and then after shot. Posting twice for the same meal just means the conversation is in two locations and one of them is a nasty before shot.\n\nI see your point though.",
                            "score": 2,
                            "author": "SmashesIt"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Couldn't agree more.",
            "score": 3,
            "author": "Mooncinder"
        },
        {
            "level": 0,
            "comment": "Honestly after that month where every post was of that Mississippi roast with mayo and peppers slammed on raw meat, I really believed that people should just solely stick with before and after side by side picture instead.  Like I don’t post pictures of raw dough on r/breadit, why are we showing raw food with no results?",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "And while you're at it, plate it up and make it presentable before taking the photo. Slowcooker meals are rarely pretty in the pot.",
            "score": 5,
            "author": "justjokingnotreally"
        },
        {
            "level": 0,
            "comment": "I want both. \n\nBefore pics show me ingredient and arrangement details.\n\nAfter pics show me if I want to try it.",
            "score": 2,
            "author": "burkabecca"
        },
        {
            "level": 0,
            "comment": "I concur. ",
            "score": 3,
            "author": "aKingS"
        },
        {
            "level": 0,
            "comment": "Raw is way prettier than after where it’s a brown mush though. I vote before and after.",
            "score": 4,
            "author": "Knitty_Knitterson"
        },
        {
            "level": 0,
            "comment": "Are people not following up on \"see you in __ hours?\"  \n  \nIf they're following up and their follow-up isn't popular, that's one thing, but to leave us hanging is quite another.",
            "score": 2,
            "author": "Zombie989"
        },
        {
            "level": 0,
            "comment": "I think both is fine.\nBefore and After.",
            "score": 3,
            "author": "C-scan"
        },
        {
            "level": 0,
            "comment": "I personally downvote every post and comment by the OP when they do this. They almost always promise an update picture but I haven’t seen one from a single post lately.",
            "score": 3,
            "author": "Legeto"
        },
        {
            "level": 0,
            "comment": "I'd love both. The before helps me know I'm doing min correctly.",
            "score": 1,
            "author": "I-LIKA-DO-DA-CHA-CHA"
        },
        {
            "level": 0,
            "comment": "I like both.",
            "score": 1,
            "author": "Vadhakara"
        },
        {
            "level": 0,
            "comment": "Be the change you wish to see in the world. ",
            "score": 1,
            "author": "BigVegetables",
            "replies": [
                {
                    "level": 1,
                    "comment": "i don't slowcook often enough to drive this change by myself",
                    "score": 1,
                    "author": "imatthewhitecastle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fewer*",
            "score": 1,
            "author": "cantstopthemoonlight"
        },
        {
            "level": 0,
            "comment": "Also is it too much to ask to see the food plated (maybe even with a garnish!) instead of a top down photo of what often looks like something sloppy in the toilet bowl?",
            "score": 1,
            "author": "the_brown_note"
        },
        {
            "level": 0,
            "comment": "These posts annoy me 2. I would like posts with a split picture though where you see the before and after. ",
            "score": 1,
            "author": "Shattucknick"
        },
        {
            "level": 0,
            "comment": "Unless there's a follow up and the hour number is greater than 24",
            "score": 1,
            "author": "Stanislav1"
        },
        {
            "level": 0,
            "comment": "Yeah. And hurry up.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I have so many pictures on my phone of raw meat because I think to myself, “Who TF wants to see my raw meat?”   I’ve never posted on this sub before. Haha",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I don't mind befores so long as they include afters",
            "score": 1,
            "author": "thomolithic"
        },
        {
            "level": 0,
            "comment": "I agree.   I've commented a couple times to this effect, pics of raw meat make me want to be vegetarian. ",
            "score": 1,
            "author": "cgott84"
        },
        {
            "level": 0,
            "comment": "I think there is an up/downvote button that people can use to indicate interest in posts",
            "score": -22,
            "author": "VROF",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know why you were downvoted for that. Maybe the snark?\n\nBut what you said is true. I have started downvoting all posts that are only a before pic and a \"see you in x hrs!\"\n\nTell us how that shit turned out!\n\n* Was it good?\n\n* Did it taste like ass?\n\n* Did you do something different to the recipe?",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just don’t understand all of the whining about changing the whole sub because some people don’t like pre-cooked pics or Mississippi pot roast, etc. \n\nJust downvote or scroll past. We all have different tastes and don’t need to ban certain posts to accommodate a few people. I love repeat posts because this sub motivates me to cook more. ",
                            "score": -8,
                            "author": "VROF"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always forget to take a picture before I eat it. After smelling it all day, I'm so hungry!",
            "score": -4,
            "author": "Fuzzatron"
        },
        {
            "level": 0,
            "comment": "No",
            "score": -9,
            "author": "MoJony"
        },
        {
            "level": 0,
            "comment": "ok\n",
            "score": -11,
            "author": "josebolt"
        },
        {
            "level": 0,
            "comment": "This sub is pure garbage. I only come to laugh at the awful posts. ",
            "score": -24,
            "author": "RomanHelmet",
            "replies": [
                {
                    "level": 1,
                    "comment": "That honestly makes you sound really sad...do you have depression issues and need an ego boost or something?",
                    "score": 6,
                    "author": "Legeto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "LOOK AT ALL THE CANS I DUMPED IN MY CROCKPOT. SEE YOU IN 6 HOURS. ",
                            "score": -4,
                            "author": "RomanHelmet",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see, not even going to attempt to reason your opinion. Have fun being negative dude, I hope your able to be happy somehow and you aren’t a nuisance to your actual loved ones.",
                                    "score": 5,
                                    "author": "Legeto"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}