{
    "id": "fxwx71",
    "score": 4084,
    "title": "GIANT CHOCOLATE CHIP COOKIE IN THE SLOW COOKER",
    "author": "Bo0ombaklak",
    "date": 1586454299.0,
    "url": "https://www.reddit.com/r/slowcooking/comments/fxwx71",
    "media_urls": [
        "https://i.redd.it/3pspchdmxtr41.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1046,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Chers dude! Your user name reminds me I really want to eat Tacos. Like slow cooked pull pork tacos. Straight up 10 hours cooking or maybe 6 on high. Also the quarantine is getting me fat",
                    "score": 260,
                    "author": "Bo0ombaklak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like the look, how was it?",
                            "score": 2,
                            "author": "Livingontherock"
                        },
                        {
                            "level": 2,
                            "comment": "Take that pulled pork and broil it for 5 minutes in the oven!",
                            "score": 0,
                            "author": "boogswald"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I mean if there was ever a time to try baking a giant cookie in the slow cooker, a global pandemic where we are being asked to stay at home seems pretty ideal.",
                    "score": 31,
                    "author": "agp11234",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Precisely. OP experimented with something, turned out not how they liked but they had a good time anyway. What's the big deal for anyone to be upset about.",
                            "score": 10,
                            "author": "TacoNomad"
                        },
                        {
                            "level": 2,
                            "comment": "Exactly. Also - the nice thing about a slow cooker is you can leave something and forget about it for a while. Baking you have to be more attentive.",
                            "score": 4,
                            "author": "IamYourBestFriendAMA"
                        },
                        {
                            "level": 2,
                            "comment": "All the good smells of that cookie... All day? Sign me up!",
                            "score": 1,
                            "author": "ZanderEV"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Probably the the same people that yell “UMmMM ThATS a MeLT!?!!” On the grilled cheese sub.",
                    "score": 98,
                    "author": "mider-span",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 26,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you ever like to include any ingredients in addition to bread and cheese, you should probably join r/melts as well. \n\nThe grilled cheese sub is fine, and I follow it, but if anyone posts anything besides bread+cheese, they all scream about it in the comments in a way that I think is supposed to be funny but is usually just irritating.",
                                    "score": 25,
                                    "author": "kagzig",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well thanks to you i'm starving, and want to eat alll of this. But im off work (f u covid-19) and unemployment hates me. But me and that sub will meet again after this is all over, so also thanks to you i found my new happiness. :)",
                                            "score": 6,
                                            "author": "beachybeach7125"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I've joined both!",
                                            "score": 4,
                                            "author": "TacoNomad",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There is also /r/eatsandwiches if you want a sub for all your powdered cooked grains and filling needs.",
                                                    "score": 3,
                                                    "author": "logosloki",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Jeeez. I'm trying to maintain my weight. Not gain it back.",
                                                            "score": 2,
                                                            "author": "TacoNomad"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The melt drama from the grilled cheese sub was some of the best drama back in the day, the golden days of r/SubredditDrama",
                                            "score": 4,
                                            "author": "1X3oZCfhKej34h"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "yeah it's so pretentious. it's a meme that they couldn't let die and has turned into this weird mix of \"do it for the meme\" and \"REEEEE\"",
                                            "score": 5,
                                            "author": "bdog1321",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "ew. That sounds atrocious. And not entirely unlike the whole szechaun sauce/Rick and Morty debacle.",
                                                    "score": 2,
                                                    "author": "honeyintherock"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Subbed. Cheers!",
                                            "score": 2,
                                            "author": "Livingontherock"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The melt debate is funny, at least. There's SOME level of self-awareness when it comes to how intense people are about it.\n\nUnlike literally every other cooking discussion on Reddit.",
                            "score": 2,
                            "author": "ChadMcRad"
                        },
                        {
                            "level": 2,
                            "comment": "God those people lol",
                            "score": 1,
                            "author": "hatchetman166"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would simply say yes absolutely the only thing better is the time spent eating it😍",
                    "score": 2,
                    "author": "deeblezzz"
                },
                {
                    "level": 1,
                    "comment": "This is nice and all, but I don't really see any critical comments when you made this comment? Sort of a preemptive measure given the typical reaction to non-traditional slow cooked dishes in this sub.\n\nAdditionally, there's nothing wrong with being critical. In fact, there's quite possibly something to be said about a community that doesn't support criticism.\n\nSure, there's some people that go about it better than others, it's all in the delivery - but please do not conflate criticism with belittling someone. \n\n* Asking questions as to why someone decided to do something isn't belittling\n* Offering an alternative method isn't belittling\n* Questioning methods isn't belittling \n* Offering opinions isn't belittling\n\nEdit: I now see the critical comment, and the person was not very friendly.",
                    "score": -25,
                    "author": "EarlyAppetizer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The horror of someone saying\n\n\"just because you could, doesn't mean you should...but i'm sure it was delicious regardless\"\n\nSomeone save the children from these rude scathing remarks.",
                                    "score": 0,
                                    "author": "JoyousGamer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I guess if you stop reading after one comment then you might make inaccurate assumptions. That comment is irrelevant, read the relevant ones. Carry on, my friend. Carry on.",
                                            "score": 3,
                                            "author": "TacoNomad"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Edited my original to address what you mentioned.\n\nI will say that it was only one person - your comment made it seem like there were multiple people who were behaving this way. \n\nAdditionally - I didn't mean to offend you in any way, but it seems as if you've taken offense by the look of the language that you're using.",
                                    "score": 0,
                                    "author": "EarlyAppetizer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm mimicking your tone. So take it however you like.",
                                            "score": 5,
                                            "author": "TacoNomad"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "does it come out crispy?",
            "score": 135,
            "author": "theblackxranger",
            "replies": [
                {
                    "level": 1,
                    "comment": "It didn’t actually so had to finish it 10min in the oven for colour and crispiness but will definitely do it again. Fun different use of the slow cooker",
                    "score": 210,
                    "author": "Bo0ombaklak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Came in for this question and answer.   Looks good!",
                            "score": 56,
                            "author": "AlottaElote",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 30,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "On the to do list!",
                                            "score": 6,
                                            "author": "AlottaElote"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh those are so good... you can top it with ice cream and stick a spoon in and go to town 😜",
                                            "score": 8,
                                            "author": "Johaan1025"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What consistency was it? I'm tempted into seeing what other baked goods could work.",
                            "score": 4,
                            "author": "ThisWeeksSponsor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well cookies are quite soft at first when straight out the oven but this morning, the left over (about half) is quite hard. You could try a giant muffin! Or slow cooked large pancake!",
                                    "score": 10,
                                    "author": "Bo0ombaklak",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Try portioning out the cookie and adding a slice of bread (or 2) over the cookies, seal in a ziplock container, and refrigerate. It'll maintain moisture in the cookies and keep them soft for up to 3 days.",
                                            "score": 1,
                                            "author": "Sir_GlanceALot"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Maybe leaving the lid off and putting on high a couple minutes could get it crispy? I've baked bread in a slow cooker, it was great!",
                            "score": 2,
                            "author": "meerkatherine"
                        },
                        {
                            "level": 2,
                            "comment": "This is actually outstanding cause if you tried the whole thing in the oven it'd be inconsistent. This must have been a great giant cookie.",
                            "score": 2,
                            "author": "KadenTau"
                        },
                        {
                            "level": 2,
                            "comment": "I think finishing it in the oven also likely helped it taste better in the end - the maillard /browning reaction is part of what makes so many foods tasty! I think it would have been harder to bake it evenly in the oven unless you could go from very low heat to very high heat quickly.\n\nFor people who don't want to finish it in the oven - I wonder if browning the butter in advance would help improve the flavor? I made a gluten free cookie recipe that recommended this, and it was a hit!",
                            "score": 1,
                            "author": "forethoughtless",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are absolutely right. I think the slow cooker’s function was to significantly pre-cook it then finishing it off in the oven enhances the flavours",
                                    "score": 2,
                                    "author": "Bo0ombaklak"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So let me get this straight. You cooked a cookie in the slow cooker, it sucked, so you cooked it an additional 10 minutes in the oven (which is basically cookie cooking time anyway) and you decided this was a good use of a slow cooker?",
                            "score": -173,
                            "author": "drunkfoowl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No. Good use of time. Been in confinement for like 3 weeks. Wanted to test something different. I did. Enjoyed the process. Loved the outcome",
                                    "score": 255,
                                    "author": "Bo0ombaklak",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right on. Right now is the (quaran)time for experimentation trying new stuff.",
                                            "score": 49,
                                            "author": "appleappleappleman"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -163,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Correct. Happy I tested it, next time I will use the same recipe, skip the slow cooker go straight to the oven and no doubt outcome will be very similar. In my defence I didn’t know I would have to finish it in the oven but after 2.5hours on high in the slow cooker it was apparent it would need that magical over touch to finish it off nicely",
                                                    "score": 35,
                                                    "author": "Bo0ombaklak",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "i need to ask a really important question here: how amazing does your place smell after xyz time of this warming in your slowcooker?",
                                                            "score": 22,
                                                            "author": "magictubesocksofjoy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Haha! Actually last night we cooked fresh water fish and it sort of finally covered the fish smell which was nice. I also used almond essence instead of vanilla and that made the flat smell nice too",
                                                                    "score": 25,
                                                                    "author": "Bo0ombaklak",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "i think you've invented the best potpourri",
                                                                            "score": 14,
                                                                            "author": "magictubesocksofjoy",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Should have cooked it on low for 6 hours :)",
                                                                                    "score": 13,
                                                                                    "author": "Bo0ombaklak"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Man what is your problem? It's quarantine and people have a surplus of time on their hands. OP didn't ask for a process engineer to cry about an ineffective use of their time.\n\nI get you are bored, but stay objective. While posting your comment was a good filler of time, it was not a good use of it.",
                                                    "score": 34,
                                                    "author": "JehPea",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Slow cookers are used to make food. So far as I can tell, OP used their slow cooker to make food.",
                                                    "score": 16,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not a kid and I still think you're being a jerk. Your comments are both rude and unnecessary. \n\n\"Is it kind, is it true, is it necessary\" \n\nYour comments fit none of this criteria.",
                                                    "score": 9,
                                                    "author": "fatmama923"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/iamveryculinary] [A baking experiment leads to drama in r\\/slowcooking](https://www.reddit.com/r/iamveryculinary/comments/fy1dje/a_baking_experiment_leads_to_drama_in_rslowcooking/)\n\n&amp;nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
                                    "score": 12,
                                    "author": "TotesMessenger"
                                },
                                {
                                    "level": 3,
                                    "comment": "Cooks do a lot of things that aren't necessarily the most efficient way to do it. I still make mayonnaise with a whisk and a bowl instead of a food processor. And that's okay. Sometimes people do things for the process or just to see what happens. That's how we learn. Maybe OP wasted a bunch of time, but they learned something new and now they have a giant cookie.\n\nIf you want to be a joyless time micromanager, that's great! That works for you. Let people live their lives.",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah but mayo hand whisked tastes different so it *IS* practical",
                                            "score": 0,
                                            "author": "Colordripcandle"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Imagine being mad about someone else experimenting with something for fun. You’re like the grinch of this sub",
                                    "score": 9,
                                    "author": "squirtingwalrus"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 0,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The dude is an ass, it's that simple",
                                                            "score": 3,
                                                            "author": "blabla_booboo",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Not as simple as ur mum\n***\n^I ^am ^a ^bot. ^Downvote ^to ^remove. ^[PM](https://www.reddit.com/message/compose/?to=YoMommaJokeBot) ^me ^if ^there's ^anything ^for ^me ^to ^know!",
                                                                    "score": -4,
                                                                    "author": "YoMommaJokeBot"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So let me get this straight: you condescendingly commented on a reddit post of someone doing something that wasn’t hurting anyone and you decided this was a good use of your time and energy?",
                                    "score": 2,
                                    "author": "Bearshoes5"
                                },
                                {
                                    "level": 3,
                                    "comment": "Dude I'm right with you here. I cannot believe you are getting downvoted so much for this. Cookies are generally baked for a good reason.",
                                    "score": -17,
                                    "author": "CharlieBigs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "/u/drunkfoowl isn't getting downvoted because he's wrong.\n\nHe's getting downvoted because he's an asshole.",
                                            "score": 3,
                                            "author": "pcopley"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Who cares how others cook? Is this guy ruining your enjoyment of cookies?",
                                            "score": 3,
                                            "author": "Bearshoes5"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is no such thing as too much cookie. Especially chocolate chip",
            "score": 19,
            "author": "bluntologist1291"
        },
        {
            "level": 0,
            "comment": "Loving the chip-to-cookie ratio here. Damn chocolatey.",
            "score": 50,
            "author": "yinoryang",
            "replies": [
                {
                    "level": 1,
                    "comment": "There definitely was a lot of chocolate in there but that’s what the recipe said and wouldn’t put less in than what it says. I thought it was a great amount",
                    "score": 15,
                    "author": "Bo0ombaklak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there an advantage doing this in a slow cooker vs an oven?   Just curious if I am missing out on something\n\nEdit: I looooooove cookie dough,  so if you do it on low a while, can you get a cross between cookie dough and cookie?",
            "score": 65,
            "author": "redosabe",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the idea is to test the versatility of the slow cooker but finishing it in the oven somewhat defeats the purpose",
                    "score": 115,
                    "author": "Bo0ombaklak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like how you're not sure of what the idea behind this was ... well done :)",
                            "score": 12,
                            "author": "im_rite_ur_rong",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm interested just because it seems likely to spread the fresh cookie smell more than you'd get from baking them. \n\nPractical? Doubt it. But I doubt I'm alone in thinking the air at home is staring to get stale.",
                                    "score": 1,
                                    "author": "Firehed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What about a rice cooker?",
                                            "score": 1,
                                            "author": "im_rite_ur_rong"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Now you need to bake this again and bake some cookies the old fashioned way in the oven and see if there is anything added from doing it in the slow cooker. I love using my slow cooker for everything, so I’m definitely trying this! Big scoop of this over some vanilla ice cream would be great!!",
                            "score": 2,
                            "author": "VoiceofLou"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would think not having to be in the neighborhood at all for this. With an oven I still stay in the general area, with a slow-cooker, you can just go take a bath and you won't come back to a kitchen full of smoke.",
                    "score": 3,
                    "author": "synalgo_12"
                },
                {
                    "level": 1,
                    "comment": "If you want a cross between a cookie dough and a cookie, I accidentally achieved this last week! I used [BAs Best Chocolate Chip Cookie Recipe](https://www.bonappetit.com/recipe/bas-best-chocolate-chip-cookies) but I changed the oven temp to 400 and cooked them about 8 minutes. Seriously my favorite cookie ever.",
                    "score": 3,
                    "author": "terminally-happy"
                },
                {
                    "level": 1,
                    "comment": "There's no advantage to baking in a slow cooker whatsoever.  It's actually a terrible vehicle for baking.",
                    "score": -26,
                    "author": "junkit33",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Still tasted pretty awesome. I know because I just ate it",
                            "score": 111,
                            "author": "Bo0ombaklak",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Doesn't matter had snacks",
                                    "score": 20,
                                    "author": "FlaviusFlaviust"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's a chocolate chip cookie - they taste good anywhere between raw dough and just short of burnt to a crisp.\n\nI'm just saying you can bake anything in a real oven and it will taste better and cook faster.",
                                    "score": -31,
                                    "author": "junkit33",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And you are right!",
                                            "score": 36,
                                            "author": "Bo0ombaklak"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Some of us don't have ovens.",
                                            "score": 16,
                                            "author": "fiwasan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep. Went about 4 long student years with basically a crock pot and toaster and kettle. This would have been a revelation!",
                                                    "score": 4,
                                                    "author": "Prettyadjacent"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 14,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lmao",
                                                    "score": 3,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s a cookie...",
                                    "score": -22,
                                    "author": "hgxarcher",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly! Happiness",
                                            "score": 30,
                                            "author": "Bo0ombaklak"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Unless you don't have access to an oven...",
                            "score": 4,
                            "author": "cahliah"
                        },
                        {
                            "level": 2,
                            "comment": "*Maybe* it'd be good for a bain marie and steam-based baking? But yeah, the oven is right there",
                            "score": 3,
                            "author": "C_2000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes I cooked a bread pudding in there once, was great. Prepared I the morning, few hours snowboarding, and home to finished cake :) \nI don’t have an oven so I’m always curious what I can do with the slow cooker!",
                                    "score": 12,
                                    "author": "eznai68"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I make a giant pancake-cake in the slow cooker sometimes and it’s pretty good!! Easier than making a bunch of individual pancakes and you can make it in advance",
                            "score": 2,
                            "author": "hdnyc09",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can make regular pancakes in advance too. In fact they freeze and reheat extremely well! Just adding to the convo, not dissing your giant pancake — you do you.",
                                    "score": 1,
                                    "author": "strawcat"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The only advantage of using a slow cooker in general is safety, timing, and the ability to plug it into an outlet. That is it. For developing flavor purposes, there is always a better tool.",
                            "score": 3,
                            "author": "manplanstan"
                        },
                        {
                            "level": 2,
                            "comment": "Unless it’s a hotter climate and you don’t want to turn on the oven to add additional heat to your place. \n\nI tend to avoid baking and general use of my oven in the summer because my apartment is already quite warm and a terrible amount of heat escapes from my oven, so I would welcome fresh homemade cookie(s) in a slow cooker during the summer",
                            "score": 1,
                            "author": "rach-mtl"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's a good exercise in patience as well.",
                    "score": 1,
                    "author": "GusPolinskiPolka"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Recipe: https://www.thesun.co.uk/fabulous/food/11350713/make-giant-chocolate-chip-cookies-slow-cooker/",
            "score": 46,
            "author": "Bo0ombaklak",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! My kids are going to have fun with this!",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm 41 and am giddy with excitement at the thought of making this!",
                            "score": 8,
                            "author": "Phiau"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fuck the s*n",
                    "score": 5,
                    "author": "xryanpagex"
                },
                {
                    "level": 1,
                    "comment": "Please never. Ever. Ever ever. EVER share a link to the suns website",
                    "score": 11,
                    "author": "swashski",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The sun scum of the earth absolute toe rag of a paper",
                            "score": 1,
                            "author": "dannybronze"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The link seems to be broken - is it possible to have another one?",
                    "score": 8,
                    "author": "LliprynLlwyd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh wow! Yeah broken here too! Ok so it was 100g of butter 100g of caster suger 75g of brown sugar, 200gr of flour, 250gr of chocolate chips, one egg, bit of salt, one table spoon of vanilla extract and one of baking powder and a pinch of salt. Mix softened butter with both sugars, add egg and baking powder and vanilla extract, keep mixing, then all the flour. Mix it all with electrical mixer. Then fold in chocolate chips! Just cook it in the oven. You can small when it’s ready. Serve it with vanilla ice cream. Where’s my whisky? Godzilla is actually the nice guy!",
                            "score": 31,
                            "author": "Bo0ombaklak",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For those that enjoy a breakdown, not a wall of text.\n\n\nIngredients:  \n100g of butter   \n100g of caster suger  \n 75g of brown sugar  \n200gr of flour  \n250gr of chocolate chips  \nOne egg  \nbit of salt  \n1tbsp of vanilla extract  \n1tbsp baking powder  \n[removed] \n\n\nMix softened butter with both sugars, then add egg, baking powder, and vanilla extract; Mix well, then add the flour. Mix it all with electrical mixer, (how long? Til only slightly lumpy? Completely smooth?). Then fold in chocolate chips! \n\nPour into slow cooker. After about 2.5hrs on high, it should be done, poke it with a toothpick. If it makes you happy, eat it!\n\n* Parentheses are my direct questions to OP, bc info was unclear. Will update post with correct info if/when OP clarifies.  \nAlso, formatting is easy, but I was too lazy to do conversions to the list to freedom units, (which I, myself, would use. But baking purists would say the metric system *is* for baking, no matter where you are).",
                                    "score": 51,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "MVP status for both trying to make sense of this and doing so with humorous contempt.",
                                            "score": 7,
                                            "author": "accountforaccount087"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Obviously you just stick a spoon in and taste it every 10 minutes to see how it's coming along.",
                                            "score": 5,
                                            "author": "dancer15"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It was 2.5 hours on high in the slow cooker. Thank you. Salt only once hehe",
                                            "score": 8,
                                            "author": "Bo0ombaklak"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It looks like a pretty standard chocolate cookie recipe. I'm assuming you just go until it looks done then poke it with a tooth pick. If comes out clean it's done.",
                                            "score": 3,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Thanks to you and op for providing the recipe in metric, I can't stand recipes that uses cups and whatnot.",
                                            "score": 1,
                                            "author": "ongebruikersnaam",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But then it seems like you use less. Instead of 200 of something you only need 1! Lol.",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "How long did you cook it in the crockpot, and was it on high or low? Thank you!",
                                    "score": 5,
                                    "author": "fiwasan"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dang the link isn’t working anymore",
                    "score": 3,
                    "author": "bigmilker"
                },
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "Mecha-Hermes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In high school, I had a science teacher that had a solar cooker.  I, at the time, was selling baked goods at farmers markets so the teacher asked me to bring in some cookie dough.  I did, he plopped it in the solar cooker and set it outside, and it took a full day to cook, but when it was done he cut it into pieces and distributed it to everyone and it was honestly one of the best cookies I have had.  \n\nSo thank you for that memory, I may need to go try this in my crock pot!",
            "score": 7,
            "author": "dancer15",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice story! For full disclosure, as shared with some who asked, I did have to finish the cooking process for about 10min in the oven which somewhat defeats the purpose but didn’t know I would need to do so when I started but it made the flat smell nice for a long time so all in all fun experience",
                    "score": 1,
                    "author": "Bo0ombaklak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice work! And you never know when you might end up in a situation where you do not have a functioning stove but do have a slow cooker and absolutely need a mostly cooked massive chocolate chip cookie! :)",
            "score": 19,
            "author": "cakecrap",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’d be amazed how frequently this theoretical situation could happen!",
                    "score": 18,
                    "author": "Bo0ombaklak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ooooo I bet that smells amazing",
            "score": 5,
            "author": "blond1eee"
        },
        {
            "level": 0,
            "comment": "Broooooooooo!",
            "score": 6,
            "author": "PantStilliams"
        },
        {
            "level": 0,
            "comment": "Take my upvote cookie monster!!",
            "score": 4,
            "author": "moogmog"
        },
        {
            "level": 0,
            "comment": "I could never have the patience to wait that long for a chocolate chip cookie.",
            "score": 14,
            "author": "Prince5sFluffyButt",
            "replies": [
                {
                    "level": 1,
                    "comment": "You don’t have to. As many pointed out, just use an oven. It is just really rare to have a dessert on this sub so it was worth it just to share this",
                    "score": 28,
                    "author": "Bo0ombaklak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not saying it's a bad Idea, I just wouldn't have the patience.\nI am curious if it tastes different or had a different texture than one cooked in the oven?",
                            "score": 9,
                            "author": "Prince5sFluffyButt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Quite similar tbh. Will most probs stick to oven cooking next time. Wanted to just test this method once",
                                    "score": 18,
                                    "author": "Bo0ombaklak"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Use an instant pot next time!\n\nEdit: I just want to see a pressure cooked cookie. For science.",
            "score": 13,
            "author": "LittleJimmyUrine",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a ninja foodi and the recipe book that came with it has a big cookie in it. It is next on my list lol",
                    "score": 5,
                    "author": "ChetManly12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The absolute unit",
            "score": 3,
            "author": "feelingblue96"
        },
        {
            "level": 0,
            "comment": "gib",
            "score": 3,
            "author": "pansexualsquirrl"
        },
        {
            "level": 0,
            "comment": "r/slowcooking has been on fire lately",
            "score": 9,
            "author": "onebelligerentbeagle",
            "replies": [
                {
                    "level": 1,
                    "comment": "No doubt. Life is slow. Cooking’s all we got",
                    "score": 15,
                    "author": "Bo0ombaklak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so cool! I do not have an oven, but I have a crockpot! I wonder about brownies. I personally don't want those to be crispy, so that may work. Thank you for posting this - I would never have even realized it was a possibility.",
            "score": 4,
            "author": "fiwasan"
        },
        {
            "level": 0,
            "comment": "I can see the cookie not being the best in a slow cooker. But I have baked some awesome chocolate cakes and brownies in the slow cooker. And I have been wanting to try bread. I have a recipe for corn bread in the slow cooker I want to try.",
            "score": 7,
            "author": "buttons66"
        },
        {
            "level": 0,
            "comment": "Might try this when I’m super bored honestly",
            "score": 2,
            "author": "hjx1297",
            "replies": [
                {
                    "level": 1,
                    "comment": "Any day now",
                    "score": 3,
                    "author": "Bo0ombaklak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What was it like just out of the slow cooker before the oven? I don’t really like crispy cookies and I love the gooey ness.",
            "score": 2,
            "author": "I_Dont_Know_jfc",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was quite pale with crunchy sides. Could have been ok like that to eat but got 2 small kids and with the egg in the recipe, felt like I wanted it it to be cooked through but you can test it for 2.5hours on high. I wouldn’t have mind trying it at that stage",
                    "score": 3,
                    "author": "Bo0ombaklak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bet it's so soft.  I need to make this.",
            "score": 2,
            "author": "MimicTheTruth"
        },
        {
            "level": 0,
            "comment": "Low or high heat? And for how long?! I must know!!",
            "score": 2,
            "author": "diemmzzie"
        },
        {
            "level": 0,
            "comment": "imagine this would be an edible",
            "score": 2,
            "author": "Its420amHELP"
        },
        {
            "level": 0,
            "comment": "This looks so awesome, gonna replicate with white chocolate chips and macadamia nuts. Thank you for the inspiration.",
            "score": 2,
            "author": "Sir_GlanceALot"
        },
        {
            "level": 0,
            "comment": "What an excellent use for a slow cooker",
            "score": 2,
            "author": "Fhalala"
        },
        {
            "level": 0,
            "comment": "This is awesome! And I’m a little mad that I’ve had a slow cooker for all this time and haven’t used it for giant cookies. I’m definitely going to try this with my kids as a quarantine distraction.",
            "score": 1,
            "author": "BooBerrySwirl"
        },
        {
            "level": 0,
            "comment": "How is it?  Does it taste better than oven baked?  Is it a flat cookie or like a cake?",
            "score": 1,
            "author": "onyxS4int"
        },
        {
            "level": 0,
            "comment": "I had no idea such things were possible! Looks amazing!!!",
            "score": 1,
            "author": "mighyboosh"
        },
        {
            "level": 0,
            "comment": "Glad your experiment was so tasty!  Keep up the good cooking!",
            "score": 1,
            "author": "MistressPhoenix"
        },
        {
            "level": 0,
            "comment": "That’s what I should’ve done when I made my kitchen sink cookies!!!",
            "score": 1,
            "author": "LadyL86530"
        },
        {
            "level": 0,
            "comment": "Ohhhh...I've seen this recipe on pinterest before and have wanted to try this. Looks so yummy! Cookies are my weakness!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Nice",
            "score": 1,
            "author": "MrWhocares123456"
        },
        {
            "level": 0,
            "comment": "yaaaaaaasssssss",
            "score": 1,
            "author": "Annabellybutton"
        },
        {
            "level": 0,
            "comment": "Wow this looks amazing",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I want to do this because why tf not?",
            "score": 1,
            "author": "Foxxilove"
        },
        {
            "level": 0,
            "comment": "Sweet Odin's Raven!",
            "score": 1,
            "author": "CoryTheDuck"
        },
        {
            "level": 0,
            "comment": "I think I need to try this",
            "score": 1,
            "author": "purplekittylady"
        },
        {
            "level": 0,
            "comment": "You absolute mad lad, you.",
            "score": 1,
            "author": "c4ctus"
        },
        {
            "level": 0,
            "comment": "Does it taste different when you make it in the slow cooker?",
            "score": 1,
            "author": "jesschechi"
        },
        {
            "level": 0,
            "comment": "I don’t have an oven so this is my only option. 👍",
            "score": 1,
            "author": "Tsquare24"
        },
        {
            "level": 0,
            "comment": "Oh my... that's some cookie. Good job.",
            "score": 1,
            "author": "WingZero007"
        },
        {
            "level": 0,
            "comment": "That’s awesome.. cheers! Given me something to do for a while on this lockdown long weekend",
            "score": 1,
            "author": "danielm1001"
        },
        {
            "level": 0,
            "comment": "We’ve been doing so much baking as a family! This looks delicious!",
            "score": 1,
            "author": "vcorder"
        },
        {
            "level": 0,
            "comment": "/r/absoluteunits",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Do you have a recipe? :D",
            "score": 1,
            "author": "FuzzWaveSpaceQueen"
        },
        {
            "level": 0,
            "comment": "Does it have any effect on the flavour compared to normal baking?\n\nWas the dough cooked in any way in the centre when you took it out of the slow cooker?, I imagine it's just in a cooking/dough state until you put it into the oven to harden and crisp up. Maybe it gives the ingredients time to know each other as all the 'pro chef's say",
            "score": 1,
            "author": "soljakid"
        },
        {
            "level": 0,
            "comment": "I need the recipe. It looks so damn good!!!!!!!",
            "score": 1,
            "author": "mrwillie79"
        },
        {
            "level": 0,
            "comment": "Wow that's bad ass! Today I learned you can use a slow cooker for cookies! Looks good too, good job!",
            "score": 1,
            "author": "Zombie_Aficionado"
        },
        {
            "level": 0,
            "comment": "oooh it looks so good im so hungrrry nowww",
            "score": 1,
            "author": "YAHawkeye"
        },
        {
            "level": 0,
            "comment": "Woah",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Can I pressure cook a cookie??",
            "score": 1,
            "author": "gsxrjason",
            "replies": [
                {
                    "level": 1,
                    "comment": "Try it out and let us know.",
                    "score": 1,
                    "author": "TacoNomad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This cookie is why I just ordered a hand mixer",
            "score": 1,
            "author": "futuremvc"
        },
        {
            "level": 0,
            "comment": "I’d smash that in one sitting!",
            "score": 1,
            "author": "MysteriousMarcus"
        },
        {
            "level": 0,
            "comment": "It looks so damn good.",
            "score": 1,
            "author": "DJClapyohands"
        },
        {
            "level": 0,
            "comment": "I think I'm in love",
            "score": 1,
            "author": "im_rite_ur_rong"
        },
        {
            "level": 0,
            "comment": "I know what im doing to surprise my girlfriend when so comes back from work",
            "score": 1,
            "author": "TrippinNL"
        },
        {
            "level": 0,
            "comment": "Gimme the recipe",
            "score": 1,
            "author": "j-mac-rock",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok so it was 100g of butter 100g of caster suger 75g of brown sugar, 200gr of flour, 250gr of chocolate chips, one egg, bit of salt, one table spoon of vanilla extract and one of baking powder and a pinch of salt. Mix softened butter with both sugars, add egg and baking powder and vanilla extract, keep mixing, then all the flour. Mix it all with electrical mixer. Then fold in chocolate chips! 2.5hours on high. Finish it 10min in the oven. You can smell when it’s ready. Serve it with vanilla ice cream",
                    "score": 2,
                    "author": "Bo0ombaklak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm doing this and bringing the cookie to Easter this Sunday. Great idea man!",
            "score": 1,
            "author": "thothpethific92"
        },
        {
            "level": 0,
            "comment": "Walk away, don't read the recipe. Just walk away...",
            "score": 1,
            "author": "ClandestineMovah"
        },
        {
            "level": 0,
            "comment": "Recipe and method (taken from another site):\n\nINGREDIENTS\n\n100 g butter, softened\n100 g caster sugar\n75 g brown sugar\n1 large egg\n1 tsp. vanilla extract\n200 g plain flour\n1 tsp. baking soda\nlarge pinch salt\n250 g chocolate chips\n\nMETHOD\n\nGrease the bowl of your slow cooker. \nUse two strips of parchment paper to line the base. \nUse an electric mixer to beat the butter and sugars until light and fluffy. \nSlowly beat in the egg and vanilla extract.\nAdd flour, baking soda, and salt and stir until fully combined. \nFold in chocolate chips and then add cookie dough to slow cooker.\nCover and cook on high for 2 1/2 to 3 hours (or low for 5 to 6 hours), or until the cookie is almost completely cooked through. \nRemove cookie from the slow cooker and place on a cooling rack to cool.",
            "score": -1,
            "author": "NinjaDingo"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -14,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just enjoy testing new things you know! Just had a slice with whipped cream on it. First round had vanilla ice cream on it. Both kicked butt. You only live once",
                    "score": 14,
                    "author": "Bo0ombaklak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Betcha bite a chip",
            "score": 0,
            "author": "Cannabamystic"
        },
        {
            "level": 0,
            "comment": "Did you run out of chips?  /s",
            "score": -4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Still got 50g to have as a side",
                    "score": 5,
                    "author": "Bo0ombaklak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "👍",
                            "score": 0,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}