{
    "id": "1y47vz",
    "score": 1,
    "title": "A quick question on commuting",
    "author": "GriseusVulpes",
    "date": 1392609319.0,
    "url": "https://www.reddit.com/r/gcsu/comments/1y47vz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've got a friend who's attempting to find out what the maximum distance one can commute to GCSU is. She absolutely refuses to go to Reddit for some reason, and I'm certain it's much easier to simply ask. So does anyone perhaps know what the absolutely maximum distance one can be at and still commute to GCSU?",
    "comments": [
        {
            "level": 0,
            "comment": "I hope she's got a prius",
            "score": 3,
            "author": "prestonb"
        },
        {
            "level": 0,
            "comment": "I don't think there is a limit. Really just personal preferance i guess. \nIf your an incoming freshman you have to live on campus though, rare exceptions are allowed though.  Parking isnt an issue as long as you are willing to walk a little. \n\nHope that helps. ",
            "score": 2,
            "author": "native25",
            "replies": [
                {
                    "level": 1,
                    "comment": "The friend in question is transferring, so she shouldn't have to dorm, however she's thinking about commuting from about 30 miles out and is afraid that that's a tad too far. \nPersonally I think it is, but to each their own. \n",
                    "score": 1,
                    "author": "GriseusVulpes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She wouldn't be required to dorm. \nIt really is to each their own. Up to her. \n",
                            "score": 2,
                            "author": "native25"
                        },
                        {
                            "level": 2,
                            "comment": "It is entirely up to her. ",
                            "score": 2,
                            "author": "native25",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Merci beaucoup to everyone who has responded, I had assumed as much, because you know, college, adulthood, all of that silly nonsense. But sometimes confirmation is necessary\n",
                                    "score": 1,
                                    "author": "GriseusVulpes"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It depends on how she structures her class schedule and how often she wants to go home, it would be pretty easy/manageable to just drive up in the morning and hang out in the Den/library until all your classes are done then drive back home.\n\nHowever it would be gas intensive (especially if she made more than one trip per day) and drinking would be a big no-no unless she had somewhere to stay on campus. A long commute would make 8 am classes a real bitch.\n\nI have a friend who has a long commute to GT, she lives at home and rides up each morning w her dad who works there then leaves when he does, class wise she hasn't had any trouble at all, but it's been fairly inhibitory to her social interactions. But she's not the most friendly of people so she could well be an outlier. Just make sure your friend considers not just getting to class but also getting to people and other on campus resources.",
            "score": 1,
            "author": "VorDresden"
        },
        {
            "level": 0,
            "comment": "a good bit of responses for this subreddit. ",
            "score": 1,
            "author": "drewrunfast"
        }
    ]
}