{
    "id": "3pfcze",
    "score": 8,
    "title": "Thinking about coming here.",
    "author": "FoxyGrandpa15",
    "date": 1445301304.0,
    "url": "https://www.reddit.com/r/gcsu/comments/3pfcze",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a senior in high school down in Savannah and was really considering GCSU. How do you all like it? I toured there over the summer and really liked it. I've almost finished my application for early action. Any feedback would be appreciated. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "It's a small college that still provides a great college experience. (Minus the football)\n\nIt really depends on where your major takes you. A lot of people go here for 2 years then transfer out to UGA or another big school. \nThe professors are awesome, and they encourage you to visit during their office hours. I was failing half of my classes my freshman year, but I kept visiting my professors.from there they told me how and what to study for their class, and they also gave me a little boost!\n\nI'm a sophomore, and I don't plan on transferring out anytime soon. ",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had my sights set on UGA but when I toured, it just didn't feel very welcoming. I guess I just feel like a big school like that could be overwhelming but I really liked GC plus  I have a cousin who goes there that really loves it.",
                    "score": 3,
                    "author": "FoxyGrandpa15",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like GCSU is the choice for you then",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm from Savannah too! \n\nI love gcsu personally. It's small but cute and you get a more personal education where your teachers all know who you are. You won't be just a number here.\n\nThere is not much to do all the time, but I don't go out a lot anyway. Plus it's not too far from Savannah so you can still feasibly go home whenever you want to.",
            "score": 5,
            "author": "DrEmerson",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah my high school is pretty small, around 4 or 5 hundred kids so I kind of like being in a smaller class. I figure it's not too far from Atlanta either so I could easily go to concerts and stuff there pretty easily.",
                    "score": 3,
                    "author": "FoxyGrandpa15",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Totally. My friends and I go up to Atlanta for Dragon*Con every year. Not too far at all.\n\nAnyway, a big part of college is what you make of it so I'm sure you'll be happy wherever you go.",
                            "score": 2,
                            "author": "DrEmerson"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What high school did you go to? Just curious sorry if this is weird because its been a while haha.",
                    "score": 1,
                    "author": "FoxyGrandpa15",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's fine, I went to Savannah Arts. Where do you go?",
                            "score": 1,
                            "author": "DrEmerson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Savannah Christian",
                                    "score": 1,
                                    "author": "FoxyGrandpa15",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh that one is pretty small, gcsu would be a good size.\n\nIt is a liberal arts school though so you'd be taking a lot of classes dealing with all different subjects.",
                                            "score": 1,
                                            "author": "DrEmerson"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you're a business major, you'll go far.",
            "score": 3,
            "author": "prestonb"
        },
        {
            "level": 0,
            "comment": "I'm a junior here, and I love it. I'm so glad I went to a smaller school like this because it gave me the opportunity to stand out. I am normally pretty shy, but I've come out of my shell a lot since coming here and I'm glad I made this decision. The professors in my department are awesome! ",
            "score": 3,
            "author": "ChubPumpkin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol I am writing my last essay about how college is going to make me less shy. What do you recommend to make friends or meet people?",
                    "score": 2,
                    "author": "FoxyGrandpa15",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Join stuff! Find organizations you're interested in, either professionally or as a hobby. If you're interested in campus jobs that's also a good way to make new friends. I'd really just suggest that you get involved as much as possible, it's the best way to meet a diverse group of people! ",
                            "score": 2,
                            "author": "ChubPumpkin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am still deciding but probably either biology or business. Maybe pre-engineering then getting a graduate degree somewhere else.",
                    "score": 1,
                    "author": "FoxyGrandpa15",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh look into a management information systems (MIS) major if you're interested in business. The business program is pretty good.",
                            "score": 1,
                            "author": "DrEmerson"
                        },
                        {
                            "level": 2,
                            "comment": "I just graduated with a CS degree. While there was some left to be desired with the program, I learned more through internships and my own projects and studying. I have a great job and work with people who went to Tech. If I started over day 1 of college I'd do the 3 and 2 program only because I'd think I would enjoy mechE more than cs.",
                            "score": 1,
                            "author": "tomridesbikes"
                        }
                    ]
                }
            ]
        }
    ]
}