{
    "id": "eimfmp",
    "score": 3,
    "title": "Bridge Program.",
    "author": "yodoling",
    "date": 1577906748.0,
    "url": "https://www.reddit.com/r/gcsu/comments/eimfmp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I recently applied to gcsu and received the summer program interview. Does anyone have any insight on the summer program or any tips for the interview?",
    "comments": [
        {
            "level": 0,
            "comment": "It's highschool 2.0. I hated being in bridge, but if it's your only chance to get into gcsu and you really want to, then do it, lots of people like it",
            "score": 3,
            "author": "StrawHatBoofy"
        },
        {
            "level": 0,
            "comment": "I did it this past summer. \n\nBasically in the interview, be yourself, brag about yourself, and treat it like a job you want. Biggest thing is being involved in the community so make sure you either are already doing that or say you plan on doing that. \n\nIn the actual program you start out with a student success class that is 6 hours a day for three days but has a lunch break in the middle. This class is essentially team building and ice breakers. You have your two main classes. Both are 3 hours. One in the morning, lunch, then one after lunch. Don’t focus on the work itself but more of how to do it. I took one class that assigned online reading every night but because of the teacher, you didn’t have to read shit. The other class, however, you had to do all the assignments and if not, pray. \n\nOverall it feels like a summer camp cause of all the team building they incorporate into it. In the end I’d say it’s worth it cause you get to make good friends and you also get 7 credit hours out of it so depending on your degree, that can check some boxes for required classes. Just finishing my first semester I can tell you that bridge is harder in terms of living. I mean that by 6 hours a day and homework all 5 days a week with two weeks worth of info each day. Managing time and learning to physically live by that schedule is my biggest take away aside from learning how to take the classes. When you start the first semester, down time will be plenty and the classes will be so much easier. \n\nIt may sound scary at first but consider this, you get a lot of benefits from it and you get your own room to sleep in\n\nGo bobcats!",
            "score": 2,
            "author": "ya_boy_vlad",
            "replies": [
                {
                    "level": 1,
                    "comment": "hey. i also got invited for an interview. should i be worried about if i get accepted into the program or not, already knowing that i have an interview slot? because i can tell you... i am super worried lol.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have some self confidence and be yourself. I only went for one interview, some had to do 2-3 interviews. Show them who you are and what you can bring to GCSU. Think community, diversity, individuality, and shit like that. You’ll do just fine 👍",
                            "score": 1,
                            "author": "ya_boy_vlad"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in the same place as you. I ended up doing it, and I actually enjoyed being able to make some friends and get to know the campus before the school year starts. The interview was like any other, but know specific stories you want to tell that can be applicable to many different types of questions. It’s a very “story based” interview. The program itself isn’t horrible, you’re in class for a long time but it kind of flies by regardless. I’d say that if you want to go to Georgia College, it’s a good move to do the Bridge Program. (You also get to live in the village apartments which is pretty cash money).",
            "score": 2,
            "author": "benv5413"
        }
    ]
}