{
    "id": "11t12wu",
    "score": 8,
    "title": "Honest opinions about Emerson",
    "author": "SnooMemesjellies4075",
    "date": 1678988905.0,
    "url": "https://www.reddit.com/r/EmersonCollege/comments/11t12wu",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just got accepted into Emerson for film and I am super excited but worried that the social environment might not be right for me. I heard it’s super “clicky” is that true? What are your opinions?",
    "comments": [
        {
            "level": 0,
            "comment": "I mean it is a little true, but in my experience anyone you meet through orgs tends to be super nice so they’re probably the kind of people worth your time anyway. Just make sure you do orgs/extracurriculars, even if that means helping with random people’s short films. The ridiculous tuition is really only worth it for that and the name on your resume.",
            "score": 10,
            "author": "totalwiseguy"
        },
        {
            "level": 0,
            "comment": "Everywhere is going to be like that, at least a little.\n\nMy advice is to find the groups you mesh with, and then \"open the circle\" to invite more people in. Introduce new people to your friends, and introduce your friends to new people.",
            "score": 5,
            "author": "TekJansen69"
        },
        {
            "level": 0,
            "comment": "yes, that is extremely true. but tbh, that's everywhere, and it doesn't really matter. emerson is a great school for what it is. use it to network and make real, honest friendships with people that you vibe with, and it'll be worth the significant investment.",
            "score": 4,
            "author": "electrictennisracket"
        },
        {
            "level": 0,
            "comment": "very cliquey &amp; judgemental. go in open minded &amp; take any friends you can get",
            "score": 5,
            "author": "ratnissneverclean"
        },
        {
            "level": 0,
            "comment": "might be clique-y your freshman year -- everybody's afraid they won't make any friends, and so they stick close to \"home\" after making a pre-established few friends. it may not be clique-y in the way you expect - with some sort of pre-established social pecking order or anything, but it may manifest as feeling out of place trying to make new friends after long enough. honestly in my experience the emerson environment entails extroverts wanting to befriend everybody.\n\nthe social experience totally depends on how much you're willing to put yourself out there both in day to day interactions or parties and into clubs and stuff during ur freshman year. i still make new friends like every other month, so its not hopeless",
            "score": 3,
            "author": "throwawaylolcollege"
        },
        {
            "level": 0,
            "comment": "it's soooooo cliquey, a lot of people still have a highschool mentality. especially vma majors haha",
            "score": 5,
            "author": "RainRose8093",
            "replies": [
                {
                    "level": 1,
                    "comment": "no fr emerson is literally just high school but everybody lives together. ton of drama and cliques, a lot of people here are such assholes too",
                    "score": 3,
                    "author": "No_Bunch2931"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude, trust me when I say this. If you don’t have good social skills or don’t know anyone going to Emerson, then think hard and long about if you really want to go here. Pretty much if you don’t have a solid friend group within the first 4-6 weeks, it’ll be pretty hard to find friends. I would agree that it’s very cliquey, people stick with who they know and it’s hard to branch out. The film program itself is fine, i wouldn’t say it’s outstanding. I’ve learned some, but not as much as I was hoping to.",
            "score": 2,
            "author": "No_Bunch2931"
        },
        {
            "level": 0,
            "comment": "If you're into any kind of artsy hobbies (including filmmaking outside of class) or gaming or anything like that there are clubs for them here and that is where you will make your friends. \n\nCollege is not as social within the classroom as high school, and your first friends will be the people you meet in orientation, your roomate/s, and then the people you meet in clubs. If you don't want to be surrounded by people who are into those artsy hobbies all day, consider a school that isn't mainly for arts.",
            "score": 1,
            "author": "Ufoguy100"
        }
    ]
}