{
    "id": "4l3rz3",
    "score": 8,
    "title": "Advice for a transfer student",
    "author": "RekapRaps",
    "date": 1464238978.0,
    "url": "https://www.reddit.com/r/EmersonCollege/comments/4l3rz3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I am transferring to Emerson in the Fall as a Sophomore. \n\nI'm transferring from a small rural college and I've lived in the suburbs my whole life, so it's going to be a huge change for sure. I'm also from the South, so I'm preparing for the cold weather. haha\n\nI'm not sure what major I'm going to pursue yet because everything looks really interesting but Communications Studies, WLP, Media Studies and Media Arts Production all seem up my alley. I'm also really into rap/spoken-word, music production, video games, film, and media criticism/analysis.\n\nDoes anyone have any advice for me as I start my journey at Emerson? Thank you for your time and I look forward to becoming an Emersonian! :)",
    "comments": [
        {
            "level": 0,
            "comment": "Hey! Recent grad here. I think something like 95% of people going into Emerson have a declared major, but I don't think that's anything to worry about. You're going to meet a lot of people who have been passionate about the things they do for a long time, but don't ever feel discouraged about trying new things. \n\nA great part about Emerson is that there are tons of clubs that anyone can join, and most require no experience. If you don't think that what you end up choosing as a major is right for you, there are always ways to do what you want to do. \n\nOne of my friends is a marketing major who wants to write for comedy shows, so he took a comedy minor that allows him access to writing for television classes.\n\nAnother friend entered school as a Journalism major, realized he wanted to do TV Production, joined a bunch of TV clubs, got insanely good at it, and managed to secure an above entry level job at the Today Show before graduating. \n\nThere are lots of people who are snobbish about their craft, but even more people that are supportive and will help you accomplish your goals. \n\nIn the end, it comes down to how badly you want to do something. There are a ton of comedy troupes at Emerson, and a lot of them were founded because their members didn't get into any other troupes but they still wanted to make comedy. Emerson has excellent ways of letting you do what you want to do thanks to its tons of clubs and great facilities. \n\n\n",
            "score": 1,
            "author": "mrtenorman"
        }
    ]
}