{
    "id": "m626q9",
    "score": 6,
    "title": "Location of Classrooms",
    "author": "emmy0705",
    "date": 1615873850.0,
    "url": "https://www.reddit.com/r/EmersonCollege/comments/m626q9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Honestly such a weird question, but are many of the classes/studios at Emerson on high floors? \n\nI get super woozy being high up and it’s actually become a major factor in whether or not I plan to attend. I’m a transfer Media Production student who would be commuting so the dorms aren’t a factor.",
    "comments": [
        {
            "level": 0,
            "comment": "I think the highest floor on campus is the 13th floor in LB.  There aren't any classes that high up in LB, so I think you should be ok. I'm a freshman at the moment and the highest I've had to go up for a class is the 4th story of Paramount. I don't think you'll have a problem, but I don't know the extent of your condition. Hope this helps.",
            "score": 5,
            "author": "Big_Salvia",
            "replies": [
                {
                    "level": 1,
                    "comment": "To add onto this Ansin does have some higher floors, but I can't recall how many and some aren't for classrooms. Walker does have 10? floors, but in my time on campus I've only gone up to the 6th floor. My classes have been usually on the 2nd or 3rd floor at most buildings. Piano Row doesn't have many floors either. I've only been on the 2nd floor of that building though, don't think there's another.\n\nEdit: Tufte also has quite a couple of floors, I've taken a class on the 10th floor there. It has more, but I'm not sure how many. Maybe 14?",
                    "score": 5,
                    "author": "locketchim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you both so much for being super respectful and helpful! I was afraid if I posted here I’d get a ton of “Then why are you going to a city school?” \n\nTruthfully, I have zero desire to go to school in the city, but I also am not able to move and there aren’t many reputable film schools in New England in general. Plus, I love the staff I’ve met and the general vibe of Emerson, so if I can make it work I really want to. \n\nI have a disorder that causes dizziness/light-headedness and it causes a ton of anxiety. For some reason when I’m on a higher floor, the feeling intensifies and I get those good ol’ buckled knees hahaha. It’s relieving to know the classes don’t go as high as the buildings do :)",
                            "score": 2,
                            "author": "emmy0705"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can attest to what the other commenters have said. 4th floor Paramount or 5th floor Ansin is the highest I've needed to be outside of my dorm.",
            "score": 2,
            "author": "ChristopherJngs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much! I’ll also be Media Arts Production 2024 if I end up going :)",
                    "score": 2,
                    "author": "emmy0705"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most of the upper floors are reserved for specific faculty offices, so you'll be good.",
            "score": 2,
            "author": "Sk8erclone"
        }
    ]
}