{
    "id": "mgkpz0",
    "score": 3,
    "title": "Undecided",
    "author": "ashleyxxdanielle",
    "date": 1617123843.0,
    "url": "https://www.reddit.com/r/EmersonCollege/comments/mgkpz0",
    "media_urls": [],
    "other_urls": [],
    "postText": "After my merit scholarship and financial aid package, it still costs $37k/yr for me to go to Emerson. I’m majoring in communications studies. Is Emerson worth being over $120k in debt?",
    "comments": [
        {
            "level": 0,
            "comment": "Go to a state school and transfer later on if you are that dead set on the name recognition of Emerson. You may be able to build your grades up for a better financial package as well. It’s not worth that much debt. You’ll be entering a field with a pretty low starting salary and it will take you forever to pay that off. Forget about saving for a house, wedding, etc. when you have that much debt to deal with.\n\nAlso - FWIT, people care much less about where you went to school once you are 10+ years into your career. It basically becomes irrelevant. What matters is that you have the degree, not from where.",
            "score": 6,
            "author": "its_a_yoke",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is it difficult to transfer though? And do schools usually give good financial aid for transfers?",
                    "score": 1,
                    "author": "ashleyxxdanielle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can’t speak to the transfer process as I haven’t done it personally, but it shouldn’t matter. If you want to go somewhere, you will just have to figure out the logistics. I know several people who went to a community college or state college to get their Gen Ed.‘s done at a cheaper rate for their freshman year. Talk to a counselor at Emerson to find out more about financial aid and scholarships for students. It’s dependent on the school.",
                            "score": 2,
                            "author": "its_a_yoke",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay, thank you so much for the help. Also, what do you think about with how many years before I transfer? I know probably the most helpful is 2 and 2, but I’ve seen some say that 1 and 3 is better?",
                                    "score": 1,
                                    "author": "ashleyxxdanielle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Again - depends on what you are willing to spend. Most people transfer after the first or second. Transferring after one year defeats the point of trying to save however. You need to be good planner and make sure you are taking credits that will transfer. I don’t remember the percentage (maybe 60%??), but schools have a requirement of the % of credits required from their institution to be considered a graduate from their institution. So you need to account for that. You can’t take 90% of credits elsewhere and be considered an Emerson grad. Best of luck.",
                                            "score": 2,
                                            "author": "its_a_yoke"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay, thank you!",
                                    "score": 1,
                                    "author": "ashleyxxdanielle"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What is great about transferring is that admissions will evaluate you on your college transcripts, so you won't have to worry about standardized test scores. \nEmerson financial aid for transfers is pretty poor, BUT you do become eligible for scholarships if your grades are good. I was able to get a few academic scholarships after my first semester. \nIn other comments, I saw that you really want to have the name recognition of Emerson to open doors at companies. My experience is that the alumni association is piss poor.",
                            "score": 2,
                            "author": "feral_catman"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Okay so i know you said you don't have any transfer experience personally, but I might as well ask. I've always wondered this about transferring but, is it not hard for particular majors? especially Emerson's artsy ones? Like, I'm afraid that I'd essentially be starting over if I transfer bc of the different curriculum.",
                    "score": 1,
                    "author": "Mobile-Ad-7351"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No.",
            "score": 3,
            "author": "theatomiclizard",
            "replies": [
                {
                    "level": 1,
                    "comment": "can you explain please",
                    "score": 1,
                    "author": "ashleyxxdanielle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No communications study is worth $120k in debt.",
                            "score": 4,
                            "author": "RogerGunz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "even with the connections Emerson has? Like I’m worried if I go to a state school for me such as West Chester University, I will have a tough time getting a job with a big company like I want to like Spotify, Live Nation, or an artist. Ideally I would like to work in communications in the music industry. I’m just not sure how much where I go will affect that because I know connections are important for this field.",
                                    "score": 2,
                                    "author": "ashleyxxdanielle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you so much, that was extremely helpful",
                                                    "score": 2,
                                                    "author": "ashleyxxdanielle"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can appeal your package. We started at that and after 3 appeals was given another 12k.",
            "score": 3,
            "author": "cbdwitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "What did you appeal on? I already appealed once and was rejected for more aid. I have no other grounds to appeal on other than concern of ability to pay",
                    "score": 1,
                    "author": "ashleyxxdanielle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We asked for merit aid. My son was accepted to Marlboro and there was a scholarship that he was given which wasn’t in his original package. Talk to your admissions counselor and ask him/her to advocate on your behalf. We told her our number and if they hit it we would commit. In addition to the scholarship financial aid was able to give us a few bucks more in institutional aid. Our admissions counselor said that you can appeal an appeal decision but talk to yours first.",
                            "score": 3,
                            "author": "cbdwitch"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "not even a little",
            "score": 1,
            "author": "mr_spooky_",
            "replies": [
                {
                    "level": 1,
                    "comment": "can you explain please",
                    "score": 1,
                    "author": "ashleyxxdanielle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can further appeal. As the process continues, you may be able to get more aid. That said, no school is worth $120k in debt.\n\nI transferred from community College, and am finishing 2.5 years at Emerson. I got a lot of aid and have been able to fit in well. Emerson has a fantastic alumni network, and I have been looking at lots of job opportunities from my internship experiences here. There are benefits. There are not $120k of debt in benefits, though. Explore all your options!",
            "score": 1,
            "author": "wafflez726"
        }
    ]
}