{
    "id": "uamub3",
    "score": 0,
    "title": "My suite mates stay up really late and I just want them to be quiet.",
    "author": "emerson-kinophile",
    "date": 1650774945.0,
    "url": "https://www.reddit.com/r/EmersonCollege/comments/uamub3",
    "media_urls": [
        "https://www.reddit.com/r/EmersonCollege/comments/uamub3/my_suite_mates_stay_up_really_late_and_i_just/"
    ],
    "other_urls": [
        "https://imgur.com/a/NQdUZn6"
    ],
    "postText": "Basically title. I go to bed at 9 PM on weekdays and 10 PM on weekends, I have had this sleep schedule since I was 6. My suite mates, all year, have put me through hell. They are constantly staying up past midnight and listening to music, watching movies, or talking (without inviting me mind you)! It is completely inconsiderate. It is literally 12:30 right now and I can’t fall asleep because they are so annoying. I texted one of the guys and it got me nowhere.\n\nhttps://imgur.com/a/NQdUZn6\n\nAny advice?\n\nEDIT: Since people seem to be missing the point, I should also mention they have been smoking WEED every now and again. I didn’t report that but maybe I should?",
    "comments": [
        {
            "level": 0,
            "comment": "Oh this was stealthy, almost ate the onion till I saw the bit about the short film lmao.",
            "score": 7,
            "author": "hyperpuppy64"
        },
        {
            "level": 0,
            "comment": "Did you ever even mention that you had a problem with the noise before going off on them over text? And why the need to report them to an RA before at least attempting some kind of conversation first? \n\nUnfortunately for you, it doesn’t sound like they really did anything wrong other than not being able to read your mind, so the punishment will likely be nonexistent or minimal, if anything. All you did here was get them to hate you for snitching instead of talking to them like a normal person, and they’re probably gonna keep doing it even more since, again, music, talking, and movies are in no way prohibited in the dorms. Maybe you should’ve gotten a single if the ordinary noises of college students interacting at midnight (not even that late in my opinion) bother you so much.",
            "score": 4,
            "author": "UndyingAffectionist4",
            "replies": [
                {
                    "level": 1,
                    "comment": "I never brought it up before but I really shouldn’t have to. 9PM is a pretty reasonable bedtime, literally no reason for my suite mates to stay up past then. \n\nThe RA hasn’t gotten back to me but in my email I said this was targeted harassment, hopefully that wording will mean she takes action against them.",
                    "score": -2,
                    "author": "emerson-kinophile",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why are you so adamant about them getting punished? It’s not like anything they did was personal—they might not even have realized it was bothering you until you lashed out in text. You didn’t even give them a chance to compromise with you; instead, you are insistent that they get handed out some sort of consequences on your behalf, based on rules that are both arbitrary and relevant to no one but you. The way you are acting is vindictive, hostile, and downright uncool. Honestly, YOU’RE the kind of roommate I would hate to have. Refusing to communicate and tattling without a second thought is giving strong soon-to-be karen vibes.\n\nEdit: the fact that you reported them for “targeted harassment” when in actuality they were just being regular college students in a communal living space only further solidifies my point.",
                            "score": 3,
                            "author": "UndyingAffectionist4",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "totally agree, what you did is not cool op",
                                    "score": 2,
                                    "author": "Hour_Neighborhood_45",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And what they did is?",
                                            "score": -1,
                                            "author": "emerson-kinophile"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I don’t really understand your point. I shouldn’t have to explain it to them. It’s like explaining to someone “hey could you please not hit me in the face, I wouldn’t like that” It should just be common sense. Also, I reported it as targeted harassment because I feel like I’m being harassed simply because I go to bed earlier than them.",
                                    "score": -1,
                                    "author": "emerson-kinophile"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, hopefully she actually does something. These guys deserve SOMETHING",
                    "score": -3,
                    "author": "emerson-kinophile"
                }
            ]
        }
    ]
}