{
    "id": "1478zqe",
    "score": 5,
    "title": "I really don't know who I am anymore",
    "author": "AdhesivenessSelect69",
    "date": 1686526504.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1478zqe",
    "media_urls": [],
    "other_urls": [],
    "postText": "Here's the story. I am 19 years old, I have just finished exams and I'm on a gap year. The past two years have been the absolute worst years of my life. One month into starting the a levels, my year long relationship ends, my grandmother who I was close with died and I lost a lot of friends and my grades were terrible. I thought after some time past I would bounce back and everything would sort itself out but nothing happened. For two years I had very little friends, I was constantly being chased by teachers because I was struggling with work and I became pretty dissociated from it all. Finally I have left that place and I'm happy to be out of there but now I have no idea of anything. No idea what to do next, who to talk to, what to do with myself everyday and I don't even know who I am anymore. I remember before I went to that school I was an energetic carefree kid with lots of good friends. Now when I try to act like that I feel like I'm putting on some sort of mask to hide my pain. Old memories feel like they are someone else's. Someone who knew how to enjoy life. Old friends grew distant as my social skills decline over time and I went to school further away. and a lot of them it feels too late to try and bring back that close friendship. All my old songs and movies I used to like are painful to listen to. Im not sure where I go now. I want to get back to being my care free self but that feels so far away and I've got a lot of pain I need to settle. \nThank you ♥️",
    "comments": [
        {
            "level": 0,
            "comment": "My best advice would be to turn to God. Wether you believe or not. I was a skeptic for a long time. I got baptized and started living my life as best as I can for Jesus and really trying to Learn what and who God is and everything I’ve ever dreamt for myself along with personal struggles of course has been placed in my life over the last year. God will turn your life around and show you where you’re meant to be. Wether you believe or not go get baptized and learn the gospel and I promise your life will change. I was where you were at 19. Now 21. I’ll put $150 on it haha. Reach out to God. We are in the last days my friend, take it easy and find the Hope you deserve",
            "score": -4,
            "author": "_VonJakob_"
        }
    ]
}