{
    "id": "147ab92",
    "score": 7146,
    "title": "[update] I punched an autistic kid after he groped me and now everyone hates me",
    "author": "chicken_feetlover12",
    "date": 1686530197.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/147ab92",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all. Firstly I would like to thank you all so much for your kind words and messages. Thank you for your support and validation, your words meant so much to me. Also, i thought I would explain the whole \"i hope you all miraculously wake up with more money in your bank account\" comment. I heard someone in tiktok say this and thought it would be a nice thing to say as some people did question it in my messages. But yeah thank you all again. \n\nBefore this update starts I would like to say that this all occurred like two weeks ago now. I just reached my breaking point and needed to vent. Hence why the update may be soon to some, this won't be the final update. But an update. \n\nI would also like to clear the air with my parents. Now unfortunately, my parents come from a country where this stuff is normal. Bot only that but I am partially to blame as I didn't say anything. Eventually I did tell them and they tried their best to help me. But they didn't know how. Though I do acknowledge their efforts, I am still going to be taking time to heal from them as well. My entire family also had a go at them and expressed their disappointment. The best thing for now is for me to spend some time apart from them. \n\nSo to begin. I left the school. After my parents had heard that I got into trouble seriously because of troy again, they basically thought it was time to pull me out. I am due to start my new school in two weeks. I have also been trying to settle at my grandma's house as I just needed a fresh start with fresh people. To be honest, I have never felt so free. I have had to deal with that torment for years and years. So now I can enjoy the pleasure of walking home and not seeing him or bumping into him. So I feel great.\n\nOnto the serious stuff:\nAs I had mentioned, my family basically decided to pay for a lawyer, and we are now hoping to have a lawsuit against basically everyone involved. My grandma also had a go to put nicely with the school's board for basically allowing nepotism to harass other girls. She called all of the teachers a disgrace for endangering not only me but other people and saying how none of the teachers who allowed this deserve to even step foot into a school. \n\nThis experience has also not been all sunshines and daisies. After the suit was claimed or made (idk) my parents got letters and messages basically asking for the case to be dropped. My parents obviously said no. But it still didn't stop the harassment. I eventually got harassed too. All of the people giving me death threats decided to go into graphic detail on what troy wanted to do to me. Spoiler, it wasn't great. And Troy's parents showed up on my doorstep demanding to see me and talk to me and how troy is ready to apologise. Thankfully by then my uncle and I had been on the way to my grandma's house. However, my parents obviously didn't let them in regardless and said that if they want to communicate it had to be through a lawyer. \n \nThe harassment didn't stop. And eventually troy sent me a message on a burner account detailing all of the things he was going to do if \"got the opportunity to\" and that I should be grateful that I managed to walk away with \"just a groping\". Troy also kept spewing on about how I am nothing but a whore or slut etc. And I should be grateful someone so popular even looked my way. He kept saying how if I had just let him *fck* me, he wouldn't have groped me. However, I know if I did that I would no longer be myself. I would be his property forever. The thought of that makes me want to vomit. Also his logic doesn't make sense to me. \n\nAnyway, I just got receipts and blocked him. I also asked my parents to help me change my number. And I did. My grandma being the person she is decided that wasn't good enough and got me a whole new phone. She claims it's compensation for my trauma. Thanks grandma. I am starting therapy the day after tomorrow and I am hoping to start family therapy in August as truthfully, I don't know if I am mad at my parents or should be mad. Like is it my fault for not saying anything? \n\nBut that's all the update I can give you for now. The lawsuit will be a whole other process and hopefully if I remember I can update you all again. Thank you so much for your words. I truly appreciate all of you. I hope this update is clear enough for you and apologises if you made it this far lol.",
    "comments": [
        {
            "level": 0,
            "comment": "Lot of great advice in this thread OP. \n\n1.  Make sure you have copies of his burner account messages. It'll further bury him into the fucking grave he has already made. \n\n2. Keep a log of any time you are asked for at home by his parents or by anyone else on their behalf. \n\nAs someone who was harrassed as well, these 2 things alone are what I had in reserve as weapons that put my harasser down for good.\n\nLuckily for me, just me accounting all the harrassing and constant contact they were making at me was enough to get an order of protection, which got them into jail when they broke it.",
            "score": 3493,
            "author": "edgarcia59",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d go as far as having them set up a camera (if she’s in a one-party consent place) with audio inside the house for “surveillance purposes”, that *just so happens* to include the front door in the frame. Maybe even a few more cheap ones around other rooms if just one is suspicious. They’d be justified to do so due to all the threats. Bonus points if they get his parents to acknowledge the new threats he’s sending. u/chicken_feetlover12 Maybe ask your family to discuss this option with a lawyer? You need to bury them in court with all the evidence you can gather.",
                    "score": 516,
                    "author": "bubbled_pop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If OP isn't in a one party consent state, could a sign in the yard/next to the camera/somewhere visible on the property saying that the property is under surveillance give them the ability to still use the footage in court? As in, would the posted signage and anyone still choosing to step onto the property essentially be giving consent to being filmed? \n\nI think OP and their family need it just in case of both escalation and continuation of the harassment anyway, but this way it can be used in court for sure.",
                            "score": 138,
                            "author": "TriaJace",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It really depends on the circumstances. For example, if your back yard borders a park or golf course, that doesn't give you the right to record private conversations just because you can hear them from your property. If you have a camera *inside* your house then it's a little more lenient but still could be considered surreptitious. \n\nAnother good example, if you have a dash camera that records audio it may be illegal in your state to not inform your passengers, even though it's your car.",
                                    "score": 30,
                                    "author": "TheFightingQuaker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How do cops subpoena ring doorbell cameras all the time then. OP should definitely have cameras recording this prick.",
                                            "score": 19,
                                            "author": "ButtholeAvenger666"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Partially incorrect. If you have a camera in a reasonable spot, such as overlooking your backyard, and a conversation could be heard through that then it is case/judge dependent on whether or not that conversation could be construed as a private conversation due to the location. \n\nFor example on a golf course you might be able to claim it as private, however if you live somewhere that backs up to a road/alley or any other area that’s considered public space then it wouldn’t be considered a private conversation. \n\nFew things to note is that a conversation within an enclosed space, such as a car, you have a reasonable expectation of privacy. If you’re walking and talking down a sidewalk then you do not have a reasonable expectation of privacy. The major key is whether or not a judge decides whether or not your conversation was held in a space with a reasonable expectation of privacy. The judge will decide that whilst evidence is being submitted which is why you hear the term that “X” was tossed out of court.",
                                            "score": 11,
                                            "author": "xLilTragicx"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "For home security you don't need to be in any kind of party consent state. It's your property and you're allowed to put recording devices on it. If that was the case then nobody would be allowed to have a ring camera.",
                            "score": 88,
                            "author": "Gooey_Cookie_girl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m not in the US and ring cameras are actually in a grey area over here, especially if you live in a condo. The EU has stricter privacy laws.",
                                    "score": 41,
                                    "author": "bubbled_pop",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's a shame, they come in handy. Still look into home security. I'm not sure of EU laws, but there has to be something that defines home security.",
                                            "score": 10,
                                            "author": "Gooey_Cookie_girl",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah? Are your streets littered with CCTV cams?",
                                    "score": 11,
                                    "author": "Skooby1Kanobi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The legal grey area, to my understanding, is audio recording",
                                            "score": 7,
                                            "author": "apri08101989"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "To have cameras on your property it automatically takes away the “double consent to record” since it’s on your own property and the person is choosing to be on YOUR property! So that is probably some really really really solid advice! Honestly I’d recommend that everyone have a camera in their house",
                            "score": 7,
                            "author": "Beneficial_Cat9225"
                        },
                        {
                            "level": 2,
                            "comment": "Even in a two party consent state, public spaces are game.",
                            "score": 3,
                            "author": "Huskguy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also: [Gavin de Beckers ](https://en.m.wikipedia.org/wiki/Gavin_de_Becker) advice for phone harassment is: Keep your old phone and the old number. Don't block anyone, don't answer either. The new number is given only to people you want to keep in contact with and can trust.\n\nCollect the messages you receive on your old phone. If it is emotionally draining give the phone to someone else, i.e. your grandma.",
                    "score": 67,
                    "author": "TessiSue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hella, great point with the phone. I changed my number and kept the old phone with all her messages on it. \n\nThey even emailed me, and I blocked em after the whole fiasco easily on that.",
                            "score": 24,
                            "author": "edgarcia59"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd like to add #3, delete this post OP. If there's a lawsuit about it happening, this is a private matter. Sharing details while it's actively developing can really set people back. Not to mention, if this Troy or his relatives have access to Reddit it's likely they can put 2 and 2 together to figure out this post is about him.\n\nAnd #4, do not share this with your new school, your new friends and new teachers. Again, nothing at all until the lawsuit is resolved, for the same reasons",
                    "score": 48,
                    "author": "Correct-Serve5355",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is great advice! I too would suggest the same. Delete the post so that it doesn’t impact your lawsuit.",
                            "score": 4,
                            "author": "National-Return-5363"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "After the lawsuit is finished, dont forget to send copies of the messages to every school in the area and all the colleges in the country too.",
                    "score": 11,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m so glad your family is supporting you. As for “that kid,” it doesn’t look good for him in the long-term.",
            "score": 1409,
            "author": "aquavenatus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup, but unfortunately, it's probably gonna be at the cost of some poor girl when he does get caught. No one takes it seriously until it's too late...",
                    "score": 566,
                    "author": "Weet_1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Another sad truth.",
                            "score": 90,
                            "author": "aquavenatus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you save all the threats Troy sent you? They seriously strengthens your case and show how much Troy is a danger to society and how these enablers need to be punished.\n\nIf you can find the strength in you, you will save another girl from going through the hell you did. (Though please prioritise your wellbeing first and foremost).",
            "score": 1229,
            "author": "jkymochi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Saved every last one.",
                    "score": 647,
                    "author": "chicken_feetlover12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would even say don't block.. give them rope to hang themselves with. Let them keep sending you threats and forward those to the lawyer. In the US you can also have your lawyer supeneoa the ISP to see if you can find out where the burner accounts are coming from. Not sure what the rules are in your country.",
                            "score": 278,
                            "author": "krazy1098",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "While this is true, it might hurt OP (emotionally/mentally) further in the long term and it sounds like she already has a pretty substantial amount of evidence. Not sure the emotional cost would be worth it there.",
                                    "score": 148,
                                    "author": "haethre",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They could give the old phone with the old number to her parents, grandma or lawyer and just let them pick it up once in awhile to take screenshots",
                                            "score": 112,
                                            "author": "Rabelfacs",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, if Troy doesn’t know that OP switched phones, this is the move. I’m assuming there’s already enough evidence, but it doesn’t hurt to take every last piece you can get.",
                                                    "score": 67,
                                                    "author": "RookieAndTheVet"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Good on you! You are incredibly brave to stand up to this the way you are.",
                            "score": 13,
                            "author": "IceQueenTigerMumma"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This OP. As a teacher, I am so angry that this was allowed to go on. Someone should have stepped up and protected you and I'm sorry they failed. I'm glad you're finally getting the help you deserve. I'll be looking for your updates. Good luck OP!",
                    "score": 344,
                    "author": "nard_dog_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had something similar happen. I put my foot down earlier than OP but the amount of school staff who made this person’s comfort my responsibility was staggering.",
                            "score": 15,
                            "author": "hastykoala"
                        },
                        {
                            "level": 2,
                            "comment": "Doesn't sound like OP is in the US.",
                            "score": 35,
                            "author": "SnooWords4839",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And still someone should have stepped up and protected her.",
                                    "score": 75,
                                    "author": "AmbitionDangerous460",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Like the school and admin? Never happens. Responsible parents have a duty to teach our children how to identify and evade predators, at an early age. Including; peers, teachers, admin, co-workers, etc.\n\nI'm as protective as they come but I couldn't safeguard my kid 24/7, without inhibiting her growth and access, could I?\n\nIRC, OP's been dealing with this Troy kid, since middle-school. I would have sussed out the issue and chewed up the whole damned school and ISD for failing to protect my kid from a predator. \n\nOP was failed by the *system* on every level!",
                                            "score": 9,
                                            "author": "disco_has_been"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She said she got the receipts and blocked. So I’m assuming yes. \n\nGotta love when the trash freely give out incriminating evidence against themselves.",
                    "score": 28,
                    "author": "desticon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keep. Copies. Of. Everything. Sent. To. You.\n\nSue ***every single person sending a death threat***. Sue ***all of them***. Use the death threats and rape threats as evidence in court. Keep recordings and tell your parents to of people coming to the door.\n\nMake these people pay you and your family for the rest of their lives. For a start, they'll be paying for the therapy you need and deserve to deal with this trauma.",
            "score": 716,
            "author": "Guner100",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hope she gets a blood thirsty lawyer!!!",
                    "score": 192,
                    "author": "IamNotMariaBye"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a high functioning autistic person. I would never and have never put my hands on someone (mainly because people scare me) without permission. I’m shocked that this boy and this school has allowed what has happened to you to occur. My best wishes to you, I hope this new school treats you better.",
            "score": 2035,
            "author": "BigUpMetal",
            "replies": [
                {
                    "level": 1,
                    "comment": "just realised that first bit might come out wrong. I obviously don’t put my hands on people because it’s wrong, not just because people scare me",
                    "score": 859,
                    "author": "BigUpMetal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hahah, average autism moment.\n\nSource: i also have autism",
                            "score": 250,
                            "author": "theburnix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lmao this\n\nSource: autism",
                                    "score": 93,
                                    "author": "HaiggeX",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is Reddit a place that just draws us in? (My neurodivergence was diagnosed at 44)",
                                            "score": 45,
                                            "author": "Primary-Strawberry-5",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There are dozens of us. Dozens!",
                                                    "score": 38,
                                                    "author": "bubbled_pop",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There are dozens and dozens of stars in the known universe",
                                                            "score": 25,
                                                            "author": "Primary-Strawberry-5",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Us together strong!\n\n\nSource: Autism",
                                                                    "score": 10,
                                                                    "author": "SnooSnooKangaroo",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lol I don't think anyone misunderstood, at least I hope",
                            "score": 292,
                            "author": "Rylan_0604",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd hope not, too, but props to him for clarifying anyways.  Too many people wouldnt.",
                                    "score": 91,
                                    "author": "-PotatoMan-"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I didn’t misunderstand, fellow neurodivergent",
                            "score": 23,
                            "author": "Primary-Strawberry-5"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It pisses me off that this predator is using autism as an excuse for this he’s making it look like everyone with autism is like this",
                    "score": 312,
                    "author": "mr_epicguy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "real. my girlfriend has autism and ik for a FACT it wouldn’t make her grope anybody",
                            "score": 104,
                            "author": "MatthewStudios",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My quasi-adopted sister has autism and is the sweetest one human being ever. I also know she wouldn't grope anybody.",
                                    "score": 30,
                                    "author": "azrael4h"
                                },
                                {
                                    "level": 3,
                                    "comment": "same",
                                    "score": 8,
                                    "author": "Pos3odon08"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've got a plethora of mental health issues, none of them ever drove me to physically harass my peers. Let's be entirely clear here; these actions are a moral issue, and no further attribution needed.",
                            "score": 35,
                            "author": "Notthesharpestmarble"
                        },
                        {
                            "level": 2,
                            "comment": "An acquaintance-by-proximity of mine is on the spectrum teetering around needing aid and just happens to be a racist misogamist, and even *he* has never been physically dangerous. \n\nI do not like him as a person and told him such, he still aggressively hit on me, and I *still* didn’t worry about my safety. That’s how easy it is not to repeatedly assault people.\n\nEdit: misogynist",
                            "score": 34,
                            "author": "Stinky_Cat_Toes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Misogamist? As in he hates marriage? Or is it specifically related to the racism",
                                    "score": 8,
                                    "author": "ultracat123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think they meant misogynist but autocorrect changed it.",
                                            "score": 12,
                                            "author": "AMvariety",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah sounds like it.",
                                                    "score": 5,
                                                    "author": "ultracat123"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That would be my autocorrect going rogue.",
                                            "score": 5,
                                            "author": "Stinky_Cat_Toes",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He's not making it an excuse. The adults and authority figures in his life are. \n\nHe's just a product of his upbringing and socialization. If the adults didn't say it was okay or that his behavior was out of his control, then none of this would have happened.\n\nSure we can say that at his age now he should know better. Yes true. But when you've been allowed to do things with zero consequences and probably soft parenting, then this is the product.\n\nSo many kids these days are being destructive and there is nothing being done. \n\nJust take the Florida incident: (warning - graphic violence. Possibly triggering)\n\nhttps://youtu.be/QV8yb3_T51g\n\nThere were too many posts of people saying things like \"he doesn't know better. We just have to show him love and support\" which is total BS in my opinion.\n\nOur world is going to the crapper because we've decided to take away consequences and follow this line of thinking that nero divergent means we let destructive, harmful behaviour be allowed/tolerated. This is just bad parenting/socialization",
                            "score": 42,
                            "author": "oOoBeckaoOo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "While you're not wrong that a lot of it is upbringing, you don't get to be a shit because you had a bad upbringing. Deal with it, many people have had horrible upbringings, much worse than others like this guy, and have adjusted well.\n\nYou don't get to control your upbringing, but you get to control your own actions. He's not 7 years old, he's old enough to know right from wrong.\n\nThis exact thinking that absolves people of responsibility (Ie. \"I don't know any better, I was brought up to think it was okay/not punishable!\") is why we have people like this.",
                                    "score": 45,
                                    "author": "Guner100"
                                },
                                {
                                    "level": 3,
                                    "comment": "The first post outlines how he was targeting her and how she had tried to get him to stop on a multitude of occasions on her own. He did know better, but he was being allowed to abuse her without repercussion because the adults and he had enveloped the behavior into autism.\n\nThis is much simpler than autism or mental challenges, though, he is a sexual predator, worthy of juvenile detention.\n\nThis won't happen, obviously, so the satisfying wake up call that was getting cold cocked will just have to suffice for now.",
                                    "score": 23,
                                    "author": "Animanic1607"
                                },
                                {
                                    "level": 3,
                                    "comment": "Don’t even get me started on this bloody video. The lack of help here was sickening.",
                                    "score": 8,
                                    "author": "IceQueenTigerMumma"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also high functioning autistic here! \nGlad to see these comments, can't believe how the school handled this, they obviously have no actual clue. \nSure, I may not be the best at understanding obscure social clues that make no sense to me, but you know what is really easy to understand? Consent and sexual assault!! \nSo glad to hear about the positives here OP, I hope that moving forward the therapy helps, and that the court case goes well. \nI'm super proud of you for standing up for yourself!",
                    "score": 41,
                    "author": "doodlemama94"
                },
                {
                    "level": 1,
                    "comment": "I am also high functioning autistic, my parents would unleash hell on me if i ever did what Troy did, or even a 1/10th of that for that matter.  Everyone is definitely using his autism to excuse his behavior, and he's using it very well to his advantage and knows it.",
                    "score": 27,
                    "author": "cburgess7"
                },
                {
                    "level": 1,
                    "comment": "As a fellow high functioning person I feel you. I unfortunately had an ex GF who would get handsy while she was drunk. A lot of it was without my consent. Which is why now as an adult I have such profuse consent boundaries. I would **never** consider taking advantage of someone. I’d never use my autism as an excuse but a reason. This guy harassing OP is so full of it",
                    "score": 13,
                    "author": "Gingerpyscho94",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Funny how stuff works in real life.\n\nDown's Syndrome? Autism? Groping girls? Automatic pass. Doesn't know any better.\n\nMeanwhile, the object of attention is just dismissed. I got mauled on the regular by my bosses DS brother. Fuck that!\n\nI watched my nephew grab my daughter's boobs, at 8. \"Oh, he doesn't know what he's doing!\" BS! We had a serious heart-to-heart. He's on the spectrum and I don't give a rats ass! \n\nThat was a big fight with the fam. I don't dismiss and overlook issues. I see them as *accessories*. \n\nI'm sick of the world making excuses for people others can't be bothered to recognize and teach.",
                    "score": 11,
                    "author": "disco_has_been"
                },
                {
                    "level": 1,
                    "comment": "It amazes me what schools just allow. I would've expelled that POS kid. Autistic or not, he know what he's doing is wrong.",
                    "score": 8,
                    "author": "FlavoredButtHair"
                },
                {
                    "level": 1,
                    "comment": "I didn’t misunderstand. I don’t have autism but my son does and this is something to what he would say",
                    "score": 5,
                    "author": "Disastrous-Panda5530"
                },
                {
                    "level": 1,
                    "comment": "Yeah, it's not an autism thing. Troy is using it as an excuse and everyone's buying it.",
                    "score": 6,
                    "author": "xFloppyDisx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey OP, regarding your question of should you be mad to your parents or was it you to blame for not speaking up, I believe those are questions that would be great to bring up in therapy. For one, you ARE not to be blamed for what Troy did to you. He terrorized you for years, you SPOKE up about him but people in your school swept it under the rug. And now he's terrorizing you again even when his parents said he's ready to apologize. He is insincere and is a danger to people. You are the victim, not the one at fault. I hope therapy helps you cope and adapt to the things you had to fight against. Good luck to a new chapter of your life, OP!",
            "score": 154,
            "author": "UrsaBearOso",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for this. Truth be told I was wondering what I would say in therapy. Like I know my situation is absolutely horrific. But it's weird actually talking about. I kinda just lost it and punched him then never talked about it again until the reddit post. Tbh I don't think the gravity of the situation set in until recently. Now all I want to do is cry and throw up",
                    "score": 107,
                    "author": "chicken_feetlover12",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m so relieved to hear you’re out of there. Best wishes.",
            "score": 523,
            "author": "Sleepy-Forest13"
        },
        {
            "level": 0,
            "comment": "OP, I'm so glad you're no longer being sexually harassed and assaulted by this POS and will be able to have a fresh start at a new school. That said, I'm still concerned for your safety. Are you certain that Troy does not know where you are (and cannot find out)?  Is it possible for you to seek a restraining order? If not, are you able to keep away from anywhere that he might be?  \n\nGiven the recent threats he's made against you and his long-standing obsession, I want to be absolutely sure that you're safe. Especially now that there's a lawsuit. I'm very glad that you're exposing his actions and seeking justice in court, but just a reminder that your health &amp; safety should be everyone's #1 concern.",
            "score": 86,
            "author": "nocturnalswan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am happy i am away too",
                    "score": 45,
                    "author": "chicken_feetlover12"
                },
                {
                    "level": 1,
                    "comment": "This is my exact thought process as well. I even worry about the fact that she stated where she is staying in this thread since his parents have already shown they don’t respect boundaries by showing up to OP parents house unannounced.",
                    "score": 11,
                    "author": "Puppybrother"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP, KEEP ALL THE SHIT HE SENT YOU!!!! THATS EVIDENCE FOR YOUR LAWYER!!!!!!",
            "score": 53,
            "author": "StangF150"
        },
        {
            "level": 0,
            "comment": "As someone with ASD, I thought a lot about your post. It hits me personally because I had issues keeping my hands to myself as a child. However, I was 9 and I only touched shoulders and heads. This dude is 16 and intentionally commits sexual assault. When I was 16, I was a bit anti-social but I never harmed anyone and never even thought about groping anyone. \n\nPunching him after he grabbed your ass was absolutely justified. He needs to learn that behavior is unacceptable and would have serious consequences unless he's of elite noble status.",
            "score": 45,
            "author": "Phuxsea",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's what upsets me too. I feel like so many people with autism already have a bad reputation and people like him are the reason. The thing is I don't fault him for having autism. He's just a shitty person",
                    "score": 57,
                    "author": "chicken_feetlover12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope you saved all the threats you've been receiving. \n\nAlso tell your parents to note down all dates and times etc that anyone knocks on the door and asks for you, a brief description of what is said. It'll all help toward the court case against them. \n\nI'm glad you're out of that school. They don't deserve the pleasure of you being a student there. \n\nI look forward to seeing an update of a positive outcome for the court case. \n\nGood luck with your therapy. I'm glad I'm reading a step in the right direction update from the original post I commented on.",
            "score": 140,
            "author": "Unl0vableDarkness",
            "replies": [
                {
                    "level": 1,
                    "comment": "With your suggestion about OP’s parents writing down times and dates, maybe a ring doorbell or a blink camera by the door will be a good idea?\n\nThat way you’ve got video evidence of the people so they can’t deny it was them showing up to the door to harass the parents.",
                    "score": 17,
                    "author": "ShortStuff_xo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup excellent idea and a very good investment. Especially as it sounds like Troy is a massive Ahole in more ways than one here. As if he thinks an apology will suffice. And then to state he'd do other things if he could. \n\nI think op needs to make sure her parents know to keep the house watched with a camera just incase. \n\nTroy sounds like he's a sandwich short of a picnic basket, not neurodivergent.",
                            "score": 8,
                            "author": "Unl0vableDarkness"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i read your original post - i am so fucking sorry for what this misogynistic asshole has done to you. and i am so so happy to hear there are legal proceedings now. please save all of the threats he sent you!! you deserve justice!!!",
            "score": 27,
            "author": "prolixandrogyne"
        },
        {
            "level": 0,
            "comment": "Autism is truly one hell of a spectrum. Having worked with autistic children for years , I think I have a somewhat decent understanding of it. \n\nIf Troy is able to articulate what he wanted to do to you the way in which he did, his autism is no excuse. He knows damn well what’s going on and good for you for standing up for yourself. This story is whacky and if you were my daughter I’d have been proud to know you stood up for yourself",
            "score": 26,
            "author": "Decent_Bunch_5491"
        },
        {
            "level": 0,
            "comment": "I hope that piece of shit ends up in prison.",
            "score": 69,
            "author": "OddResponsibility565",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m so tired of this culture where repeated weird actions by people who are “on the spectrum”, are accepted.",
            "score": 21,
            "author": "bitNine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hope someone also beats him up one day for this.",
                    "score": 9,
                    "author": "IamNotMariaBye"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He's not autistic, he's a sociopath. Also,  king of the incels vibes",
            "score": 57,
            "author": "maymayiscraycray",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly!!",
                    "score": 18,
                    "author": "Secretagenta92"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Doesn't matter if you're autistic. Negative feedback to an action motivates you to not do that action again. If your feedback was a punch I'd say it's well deserved and it's about time he learned his lesson",
            "score": 19,
            "author": "PopeyesBiskit"
        },
        {
            "level": 0,
            "comment": "OP, keep your old phone and number going but give it to an adult or lawyer, unblock Troy so he can dig a deeper pit for himself.",
            "score": 16,
            "author": "procrastinationprogr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did that already",
                    "score": 18,
                    "author": "chicken_feetlover12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really like your grandma.",
            "score": 14,
            "author": "SoulSensei"
        },
        {
            "level": 0,
            "comment": "Show everything Troy sent you to your lawyer. Glad you have a strong grandmother behind you, and that you are away from the situation. It sounds like Troy knows exactly what he's been doing and that everyone had been enabling him to bully and sexually assault you.",
            "score": 11,
            "author": "Conscious-Arm-7889"
        },
        {
            "level": 0,
            "comment": "Please update us as things progress. Good luck!",
            "score": 28,
            "author": "wakingdreamland"
        },
        {
            "level": 0,
            "comment": "I have an autistic teenage son. If he ever gropes someone without their consent, I would thank them for punching him.",
            "score": 29,
            "author": "notsosecretshipper",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol. He didn't expect it because apparently I don't look intimidating so it caught him off guard lol",
                    "score": 26,
                    "author": "chicken_feetlover12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just want to give you some advice from my experiences with bullying and the school. Unfortunately, schools surprisingly don’t care about the welfare of their students, as you’ve now discovered the hard way.\n\nMy parents did a lot of the same as yours, going to the head, speaking to the people in charge of the school and even the police. Even after a very serious assault had happened they just couldn’t give a fuck. They tried their best to sweep everything under the rug and drag their heels, much like in your case. \n\nThe second my mother said she was going to speak to the regional newspaper about it HOLY SHIT did they change their tone. They still could have done more but it was at that point they started taking it seriously which is honestly quite sad. It really is sad but it’s a life lesson. \n\nJust keep it in mind. I’m sure you’ve already thought of it but I’m verifying that it works. You shouldn’t have to but they should’ve looked after you. Going to the news or threatening it is one way to get people to do something. Because deep down they know it’s wrong. Sorry you had to go through that and hope you settle in to the new school.",
                            "score": 8,
                            "author": "BigWeld38",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "your grandma is an angel, hope all goes well with you and you’re able to put this exhausting ordeal behind you soon!",
            "score": 8,
            "author": "orangecatsrsnippy"
        },
        {
            "level": 0,
            "comment": "It’s giving incel… I wouldn’t be surprised if he was highly active on incel subs smh",
            "score": 9,
            "author": "Dstar538888"
        },
        {
            "level": 0,
            "comment": "I'm glad that you are getting more support from your family and seem to be in a safer position now. \n\nI am not sure what country you are in, but do you know if in your country teachers are mandated reporters? Mandated reporter typically means that they are legally required to report child abuse and suspected child abuse to Children's Aid. To my understanding (I am a mandated reporter in my country), a child or teen saying that they were SAed would be something I am required to report immediately. You may want to check with your lawyer about if you should report what happened to your version of Children's Aid, and potentially put in a complaint with whatever regulatory body oversees the teachers.",
            "score": 24,
            "author": "PickledPizzle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Based on their previous post, I assumed it was the UK, but it could've been another country that uses a similar school system.\n\nIn the UK, teachers are supposed to report any safeguarding concerns. It's usually reported to a safeguarding lead within the school, and it's not reported externally unless it's deemed necessary (i.e. bullying could be reported to safeguarding, but it would be dealt internally in the school. If a child is experiencing domestic abuse at home, the school will likely report it to social services or another agency).",
                    "score": 6,
                    "author": "ithinkiamgoth"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stay strong.\n\nDon't let this scum get away with it.\n\nYour Grandma is a boss",
            "score": 7,
            "author": "DarkAvengerx"
        },
        {
            "level": 0,
            "comment": "Please don't delete any messages and hanf on to your old phone for court.  The nerve of his parents to show up on your doorstep and demand to speak to a minor child.  Glad you were gone.  \nThey want you to drip the suit bc they know they are gonna lose big! Awesome that gma got you a new phone &amp; number and for her telling it like it is!  NONE of those teachers deserve to step foot in a school again. \n\nWishing you all the best with the lawsuit &amp; your new school, new start!",
            "score": 8,
            "author": "musiak1luver"
        },
        {
            "level": 0,
            "comment": "Autism doesn’t allow you to be shitty to people. He’s a little creep.",
            "score": 7,
            "author": "sam77889"
        },
        {
            "level": 0,
            "comment": "\"Troy\" is straight up evil and manipulative, borderline if not straight up sociopath...full tilt he's gaming the system and using his \"autism\" as a shield. The people who should have course corrected his bad behavior didn't and now they're deflecting onto you because they fucked up. I know people who are \"on the spectrum\" and a good friend of mine has aspergers (were both in our early 30s btw)...and he would NEVER lay a hand on anyone inappropriately. He has confided to me privately that he has wanted to slap girls asses before but he knows that doing so is wrong..ie his moral compass isn't completely fucked. And he damn sure does harass someone like Troy did to you.",
            "score": 7,
            "author": "Lil_Jazzy"
        },
        {
            "level": 0,
            "comment": "I am so sorry you had to go through. Just because he was autistic doesn’t mean he can get away with SA’ing someone. I have depression so can I just unalive someone whenever I want? That doesn’t make sense. I hope you find peace and that karma goes all the way around on these teachers, the school board, the students, and especially Troy.",
            "score": 7,
            "author": "mishalynnne"
        },
        {
            "level": 0,
            "comment": "I'M SO HAPPY FOR YOU!!!! keep all those screenshots, will be useful during the lawsuit I guess",
            "score": 6,
            "author": "Biomorbosis"
        },
        {
            "level": 0,
            "comment": "As someone who works in the disability sector his behaviour was extremely mismanaged. Regardless of his level of understanding of his actions, it doesn’t make them any less harmful. There should be a plan for handling it. \n\nAnd try seeing the hate mail trying to get you to drop the case as vindicating. If they had nothing to worry about from your case, they wouldn’t be trying so hard to get it dropped. Hang in there.",
            "score": 6,
            "author": "blaertes"
        },
        {
            "level": 0,
            "comment": "So much for “it’s just his autism” if he’s now going out of his way to I presume threaten to further violate you.",
            "score": 7,
            "author": "SkyHighTigre75"
        },
        {
            "level": 0,
            "comment": "Are you sure he's really autistic??? He just sounds like any other s3xu@l predators. A literal PSYCHOPATH! Put him in a spych ward or something before he starts doing nasty sh!t to the children!",
            "score": 6,
            "author": "Glass-Host-3015"
        },
        {
            "level": 0,
            "comment": "&gt;And eventually troy sent me a message on a burner account detailing all of the things he was going to do if \"got the opportunity to\" and that I should be grateful that I managed to walk away with \"just a groping\". Troy also kept spewing on about how I am nothing but a whore or slut etc. And I should be grateful someone so popular even looked my way. He kept saying how if I had just let him fck me, he wouldn't have groped me. \n\nI'm not entirely sure but wouldn't that count as an evidence and help them sue him? Did OP screenshot it? I'm not sure how it works that's why asking",
            "score": 6,
            "author": "riana_01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably, if they can prove it came from him.",
                    "score": 3,
                    "author": "Obstacle616"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nail that little shit to the wall. Autism is no excuse. Hopefully this Troy dude and his friends/family back off as things progress. Supply the lawyer with anything harassing that’s sent, especially these rape threats from the burner. He will bury himself. \n\n\nI wish you luck and hope that shit clears up and everyone(crappy) involved gets fucked royally by the courts.",
            "score": 7,
            "author": "WhoLetMeHaveReddit"
        },
        {
            "level": 0,
            "comment": "Save the threats, pass it on to the lawyer. At this point, you have enough harassment against you that if your lawyer is good, he could get you an order of protection.",
            "score": 14,
            "author": "DutyValuable"
        },
        {
            "level": 0,
            "comment": "You did save those messages right? Because even if it was a burner account or whatever that shit is serious",
            "score": 5,
            "author": "LadrilloDeMadera",
            "replies": [
                {
                    "level": 1,
                    "comment": "I definitely did",
                    "score": 8,
                    "author": "chicken_feetlover12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As autistic adult myself - this (beep) uses his diagnosis (if he even has one) as 'get away with anything card'\n\nNope. does not work this way.\n\nOne can be nice and autistic, or one can be a terrible person and autistic - but the fact one is autistic means one is autistic, not that one is a crap person\n\nThese \"teachers\".. if this dude makes people unsafe, if his mental wiring means he sees others as not human - newsflash - he does NOT belong in school, but in some assisted living / closed off school as he cannot function normally.  \n\n\nBottom line - dude is a sexual predator, and his 'friends' are probably supporting him out of fear . If his behavior is autism caused (extremely unlikely) then he should go to a specialized institution (guess that is why grandma is on the warpath)\n\nKeep ALL messages, screenshots of threats - and add these to the lawsuit.\n\nThose people protect abusers and sexual predators, they should be taken down (legally of course) and troy needs to be locked up.",
            "score": 4,
            "author": "SamuelVimesTrained"
        },
        {
            "level": 0,
            "comment": "Him using his autism in a way to SEXUALLY ABUSE SOMEONE is disgusting. I would’ve done more than just punch him honestly",
            "score": 5,
            "author": "Average_Jay22"
        },
        {
            "level": 0,
            "comment": "But you did speak up, people just didnt listen.\n\nAlso OP, if you've got a new phone and number anyways, unblock troy and collect those messages! Great proof that regardless of an autism diagnosis, this man is turning into a creep",
            "score": 6,
            "author": "Kitashh"
        },
        {
            "level": 0,
            "comment": "I really hate how people give autistic men a pass for being creepy and gross just because they have autism… how come we never see autistic girls acting like this??🙄",
            "score": 5,
            "author": "Dstar538888",
            "replies": [
                {
                    "level": 1,
                    "comment": "He and his parents are probably just using it as an excuse parents probably to mask up their shitty parenting and him because he thinks it’s a get out of jail free card. I’d argue he’s probably a sociopath rather than autistic. He and his parents have probably used that trick before to excuse his sociopathic acts with him being “autistic”. I doubt that if he has it it’s even to the extent him and his parents make it out to be let alone that he has it at all.",
                    "score": 5,
                    "author": "Fluid-Alternative-22"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m glad you’re being supported, your grandma sounds great. I hope therapy and your new school goes well. I’m seriously rooting for you to be great in everything you do now and in the future. \n\nPlease keep remembering none of this harassment with Troy and his minions is your fault. You told the teachers as you should’ve, they should’ve protected you but they and they school district and the police failed you continuously.\n\nI’m glad you stuck up for yourself, you should always be proud that you didn’t give in to the abuse, you resisted and stuck up for you.\n\nI hope Troy, his family and friends they pay for all get in serious trouble and people stop enabling him so he doesn’t hurt other young ladies like he did to you. He’s going to have a hard life once he joins the real world and can no longer get away with stuff because of his parents money and them using autism as an excuse for criminal behaviour. People will realise he’s just shitty and all autism doesn’t cause shitty rapist and stalker like criminal behaviour",
            "score": 6,
            "author": "AugustWatson01"
        },
        {
            "level": 0,
            "comment": "Wow. The first post was disturbing enough,but this update? I mean, sending letters detailing r*pe now?? Damn, Troy and his enablers are total psychopaths. l'm so glad you're leaving that crazy school behind OP. Wishing the best for you, and bless your relatives for being there for you the entire time! l hope things will be okay for you.\n\nPS. Be sure to document all the insane stuff Troy and friends are sending you. This will make for solid evidence for future lawsuits.",
            "score": 4,
            "author": "Artistic-Cost-2340"
        },
        {
            "level": 0,
            "comment": "Careful now with the updates as your Lawyer would probably recommend being silent.  Good luck Ms.",
            "score": 6,
            "author": "Hipsternotster"
        },
        {
            "level": 0,
            "comment": "Your grandma is a real one",
            "score": 5,
            "author": "Artichokeypokey"
        },
        {
            "level": 0,
            "comment": "My God, this brat is now frothing from the loss of control and taking out his failed cruel fantasies on you. I'm so glad you're away from him, that's the main thing, don't forget to take screenshots of these comments, it never hurts to have proof that a predator is a predator. Remember, you're not to blame, never, and good luck with the trial, I believe in you",
            "score": 4,
            "author": "Unlikely_Nothing_781"
        },
        {
            "level": 0,
            "comment": "I have an autistic brother and three autistic friends. Literally none of them would *ever* pull this, ever. His autism is no excuse.",
            "score": 6,
            "author": "_-UndeFined-_"
        },
        {
            "level": 0,
            "comment": "What do you mean apologies for making it this far? You were very clear about what events followed your original story, thanks for that! And good luck with the healing and the new school.\n\nAlso, save these messages from Troy. With a bit of luck, he just dug his own grave by making these threats.",
            "score": 5,
            "author": "DynkoFromTheNorth"
        },
        {
            "level": 0,
            "comment": "damn grandma doesn't F around and I love it. im so happy to see you have such support from your family and that everyone has your back. im glad you can finally breathe again but gosh im so sorry that you've been through this BS.",
            "score": 5,
            "author": "Candy_Venom"
        },
        {
            "level": 0,
            "comment": "As someone with a child who is classed as \"high functioning Autism\", this whole thing HORRIFIES me. I would be absolutely mortified if my son acted the way Troy did and rest assured he would absolutely not be able to pull any of this shit and would be having a lot of interventions as well as making sure you were safe. \n\nTroy's actions are absolutely not due to his autism - he is clearly a sick and spoiled individual who thinks he can do what he likes because of who is parents are. I am so incredibly sorry you experienced sexual assault for a prolonged period due to the many failings of the adults involved and I highly recommend you press charges against him if you can. \n\nSending gentle hugs.",
            "score": 4,
            "author": "anothermanicmumday"
        },
        {
            "level": 0,
            "comment": "What the hell is wrong with all those people sending nasty ass shit on his behalf?",
            "score": 5,
            "author": "BaddieKarma"
        },
        {
            "level": 0,
            "comment": "My son has autism and nowhere is it okay to let them get away with stuff because of this diagnosis. And it does not mean mentally disabled.\n\nI, his school and everyone around him tries to make sure he learns how to behave towards other people. The value of apologising and right from wrong.\n\n\nI'm sorry this happened to you.\nI just wanted you to hear from a parent of an autistic child. None of this is okay.\nYou did right defending yourself.",
            "score": 5,
            "author": "Jenjalin"
        },
        {
            "level": 0,
            "comment": "Troy, and everyone sending you threats, are all absolute scumbags. Him sending those messages will absolutely ruin any chance he has of coming out on top in this. I hope you are pressin charges against him, as well as the school.",
            "score": 5,
            "author": "moofather"
        },
        {
            "level": 0,
            "comment": "((HUGS)) I hope you can heal, and your parents pursue the lawsuit!!",
            "score": 13,
            "author": "SnooWords4839"
        },
        {
            "level": 0,
            "comment": "Save the receipts OP with these threats you now have solid proof people would rather protect a predator than help the victim.",
            "score": 5,
            "author": "Gamecat93"
        },
        {
            "level": 0,
            "comment": "As someone with high functioning autism I’d never sexually assault someone.",
            "score": 4,
            "author": "TheSilentTitan"
        },
        {
            "level": 0,
            "comment": "Good luck with your new school. I hope you're now able to have some fun and be a kid for a bit without thinking about this every minute of the day",
            "score": 3,
            "author": "sixpackofducks"
        },
        {
            "level": 0,
            "comment": "uhhhh thanks troy for more evidence against you...",
            "score": 5,
            "author": "sixpack_or_6pack"
        },
        {
            "level": 0,
            "comment": "Two phrases: restraining order &amp; mandated reporters. Be sure to save all the evidence of his threatening and harassing texts. If you successfully get a restraining order against him and he keeps violating it, it’ll just dig the hole he’s in deeper. Also, teachers are what’s called mandated reporters. If they witness or are told of any abuse (ex. Student tells teacher they are being beaten at home by a parent), the are legally required to report it, and can even lose their jobs if they fail to comply.",
            "score": 4,
            "author": "TheVoonderMutt"
        },
        {
            "level": 0,
            "comment": "Keep everything an turn it in to your lawyer. Lil shit just made it easier for you in court.",
            "score": 3,
            "author": "Active_Entertainment",
            "replies": [
                {
                    "level": 1,
                    "comment": "Already done. This process has been exhausting and I just want it yo end",
                    "score": 7,
                    "author": "chicken_feetlover12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Since you've gone the lawyer route, you should be careful about posting anything online. Consult your lawyer, screenshot everything and yeah someone else suggested to maintain your old number and unblock that scum so he can incriminate himself further.\n\nI don't know if you can trust cops in your city but those death threats need to be forwarded to someone through your lawyer.\n\nSociety is pretty disgusting when they rally behind other scum.",
            "score": 4,
            "author": "L45TPH45E",
            "replies": [
                {
                    "level": 1,
                    "comment": "As long as they don’t find out and she remove some details she should be good",
                    "score": 3,
                    "author": "Other-Bandicoot-453"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does your lawyer have the disgusting message from Troy yet?\n\nPlease take it to the police and the school board as it's a serious threat to your safety.\n\nYour safety has to be everyone's focus as this Troy and his enablers are giving me Brock Turner rapist vibes. \n\nPlease keep safe.",
            "score": 4,
            "author": "Bitter-Position"
        },
        {
            "level": 0,
            "comment": "This Troy fellow sounds dangerous. Definitely keep all of those texts.",
            "score": 5,
            "author": "TechieTravis"
        },
        {
            "level": 0,
            "comment": "To be honest, I have a feeling that \"Troy\" is the only person responsible for all the threats. It could be a ploy of his to scare you into dropping the case. I could be wrong too and that your ex-classmates condone rape.",
            "score": 3,
            "author": "Nickckng"
        },
        {
            "level": 0,
            "comment": "Love how his self control is so poor he just gave you a win for the court battle.",
            "score": 3,
            "author": "orochimaru2009"
        },
        {
            "level": 0,
            "comment": "Well if Troy sent you a message proving it's him and saying what he'd do, that's evidence.",
            "score": 5,
            "author": "BloodBride"
        },
        {
            "level": 0,
            "comment": "Tell your grandma that I think she is great",
            "score": 3,
            "author": "Southern_Regular_241"
        },
        {
            "level": 0,
            "comment": "Atp I don't think his autism is a mild case where he doesn't know what's wrong or right. He knows the power his diagnosis holds and he is using it to harass OP. You did nothing wrong. Remember to show everything these assholes send to you. And especially the one he send. They're just making your case easier by harassing you via text and making threats 😒",
            "score": 4,
            "author": "Every-Tax-8341"
        },
        {
            "level": 0,
            "comment": "Are you sure he’s autistic? He just sounds like an asshole. Glad you finally got away from all that bullshit.",
            "score": 4,
            "author": "Daddy_Onion"
        },
        {
            "level": 0,
            "comment": "He deserved it, I’ve got your back OP",
            "score": 4,
            "author": "galaxy-parrot"
        },
        {
            "level": 0,
            "comment": "I’m so happy for you. I’m glad you got what you deserved, freedom. I hope your healing process goes smoothly.",
            "score": 4,
            "author": "fathersakata"
        },
        {
            "level": 0,
            "comment": "Keep it up! You're doing good and you'll be back on track soon. 👍🏾\nDon't let those idiots get to you.",
            "score": 4,
            "author": "Weebahoy"
        },
        {
            "level": 0,
            "comment": "Connect every single piece of everything as evidence. Texts, letters, etc.",
            "score": 4,
            "author": "timteller44"
        },
        {
            "level": 0,
            "comment": "youve been through so much, and im so glad you have the opportunity to heal by going to therapy, a new school and living in a different house. i truly hope everything gets better for you OP, and that you get the support and justice you deserve.",
            "score": 4,
            "author": "Aitchhh14"
        },
        {
            "level": 0,
            "comment": "My child has high functioning autism, and if I heard they were ever tormenting someone in school I’ll make that shit stop immediately. There should be absolutely no justification for behavior like that. And the fact this has been going on for years is daunting and scary. You were at your wits end, so please do not think you deserve this backlash. I and many others support you. \n\nDo not back down OP. Fight this fucker all the way to the ground. Buy yourself something to protect you. You never know when a maniac like that can come back and torment your life.",
            "score": 4,
            "author": "Friendtoallandnone"
        },
        {
            "level": 0,
            "comment": "Don't feel bad I once had to have a fist fight with a severely mentally disabled kid when I was at cub scouts, else he would have stopped me breathing... in the end just ripped a chunk of my hair out and my head was literally out of shape, but felt like I had to fight for my life, did my shoe lace up next to his wheel chair grabbed me by the hair and dragged my face up the side of his wheel chair and I ended up with my throat across the arm of the chair with him on top.....until I went into gorilla mode.\n\nAll the adults just ran to him, didn't even ask if I was ok.....but granted, I didn't get reprimanded for it.",
            "score": 5,
            "author": "AgentSears"
        },
        {
            "level": 0,
            "comment": "If someone did that to my daughter, a lawsuit would be the least of that shits worries.",
            "score": 4,
            "author": "Rattkjakkapong"
        },
        {
            "level": 0,
            "comment": "I hope Troy gets his proper punishment. Him and all his little enabler fuckos",
            "score": 3,
            "author": "DatguyMalcolm"
        },
        {
            "level": 0,
            "comment": "Keep all that communication.  It shows a pattern.  I'd also get a restraining order.",
            "score": 5,
            "author": "Huskguy"
        },
        {
            "level": 0,
            "comment": "Everyone else has great advice. However…Troy and his parents KNOW where you live. I’m not saying he will come over and rape you or something, but given his threats and how he’s acted in the past, the possibility should NOT be overlooked.",
            "score": 4,
            "author": "AlastorFan2022"
        },
        {
            "level": 0,
            "comment": "The fact that people still support Troy after suggesting what he wants to do to OP is sickening. Like for them even tell OP what he truly would do to her, just sickening af!",
            "score": 3,
            "author": "MissMadness145"
        },
        {
            "level": 0,
            "comment": "Good for you OP. I know you haven't gotten the full justice you deserve *yet*, but it's a start. \n\nAlso, F that guy. Take solace in the fact that eventually, he's gonna try this with someone who is (or has a partner who is) much meaner and quicker to violence than you, and he'll get his ass handed to him. I shouldn't condone violence, but sometimes people FAAFO, and that's the only way they learn. Once he's out of school and on his own in the real world, you can bet he will find out that no one gives a shit about his claims of autism if he's sexually assaulting people and acting a fool. That excuse might fly for a child, but once he hits the age of majority, it's a VERY different ballgame.\n\nJust go through the motions, follow the advice of your lawyer, and stay vigilant. Keep any messages he sends too. That will make it easier to get a restraining order, if you don't have one already. You got this op. F that guy, he'll get his in due time.",
            "score": 4,
            "author": "TheLastGerudo"
        },
        {
            "level": 0,
            "comment": "Good for you. Some people gotta learn thar shit ain't sweet out here.",
            "score": 4,
            "author": "Varrick1990"
        },
        {
            "level": 0,
            "comment": "You did the right thing. Just keep up with what you're doing now and you should be fine. Still though, prepare for the worst, hope for the best.",
            "score": 5,
            "author": "SymbioticGames"
        },
        {
            "level": 0,
            "comment": "This kid Troy is a fucking sociopath and will end up being a violent sexual predator (moreso than he is now) if limits are not set on him right now.",
            "score": 4,
            "author": "pardon_the_mess"
        },
        {
            "level": 0,
            "comment": "Maybe the kindest thing you can do to Troy is get a restraining order and make your facebook open without blocking. If he interacts at all get him thrown in jail. Maybe it would knock some sense into him. Clearly he is a sick person hiding behind the veil of absolute sympathy he owns socially. Also good for you for all the steps you have made.",
            "score": 5,
            "author": "frantichamster1234"
        },
        {
            "level": 0,
            "comment": "Autistic person here.\n\nAutism is a spectrum, with a plethora of lacking in social interaction and interaction skills.\n\nI have never nor encountered any Autistic people that groped / sexually assaulted people and blame it on being Autistic. To say he doesn't know any better is bullshit, I always knew what I was doing was either right or wrong.\n\nThose that blame you are narrow minded, stupid idiots that are enabling him. Fuck em all. Troy is just a stupid, dangerous idiot that'll end up with his comeuppance at some point. I don't believe he has Autism.\n\nReading your first post got me angry. Troy deserves a smack for what he's done to you. But it's great your family is supporting you.\n\nSending big hugs.",
            "score": 5,
            "author": "OraclePariah"
        },
        {
            "level": 0,
            "comment": "Okay, that shit is a WAAAAY bigger fucking problem than just autism? I have no idea how anyone could see that happening and still excuse such behavion just \"because rhe guy is autistix\"??? Bitch, I AM AUTOSTIC and would never in my right or even sick mind do anything mentioned. Never. Whether that sick in the head kid has autism or not is completely irrelevant. His parents and every single adult assosiared with him absoloutly FAILED to raise him in an acceptable way. It goes way beyond \"boys will be boys\". That is sexual assoult that doesnt even try to pretent it isnt what it is. He addmitted and i hope everyone at fault will get accuratly punished. \n\n\nIts sick. God.\n\n100% save all the messages and his accounts, numbers, letters. Everything he ever sends or gives you. Present it in court.\n\n(If i seem a bit angry. Nonim not a BIT angry. Im raging.)",
            "score": 3,
            "author": "Colrel"
        },
        {
            "level": 0,
            "comment": "Im autistic. I would never fucking grope someone. Im SO GLAD you stood up for yourself!! And im so sorry this is happening to you!!!!",
            "score": 4,
            "author": "foxglovefanatic"
        },
        {
            "level": 0,
            "comment": "Keep everything he sends you, and watch who you give your new number to. You never know who claims to be your friend and then they give your number out to him. \n\nStay safe. ❤️",
            "score": 14,
            "author": "RxseThxrn"
        },
        {
            "level": 0,
            "comment": "Is troy autistic or a sociopath? Nothing of this sounds autistic per se. Meltdowns can just be that he is an entitled AH that gets away with anything.",
            "score": 15,
            "author": "Single_Vacation427",
            "replies": [
                {
                    "level": 1,
                    "comment": "He can be autistic and just be using his disability as an excuse for his behavior. Or he could be autistic and sociopathic",
                    "score": 18,
                    "author": "emusmakemehungry"
                },
                {
                    "level": 1,
                    "comment": "Probably both",
                    "score": 15,
                    "author": "chicken_feetlover12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly from what little I can tell from the posts, he seems like he’s both.",
                            "score": 3,
                            "author": "shemtpa96"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man lawyers love nothing more than an idiot that provides evidence. Make sure they get the texts from the kid. Makes settlement money grow and grow!\n\nAnyways heres to hoping you never have to deal with this again. You did move far enough away that they wont casually run into you right?",
            "score": 8,
            "author": "blackmobius"
        },
        {
            "level": 0,
            "comment": "It’s good to know that things are getting better. Hopefully they keep going that way",
            "score": 3,
            "author": "Braeden3141"
        },
        {
            "level": 0,
            "comment": "Screenshot and document everything, it sounds like this may not yet be over, though I'm glad your family is being supportive. Every message from ppl defending him to his direct threats to you. I know it is not easy but the amount of enablers in this story is unnerving. Best of luck",
            "score": 3,
            "author": "Afluforyou"
        },
        {
            "level": 0,
            "comment": "Holy shit this guy is insane. \n\n\n\nMakes me angry.\n\nMakes me mad.\n\nAs an aspie myself, stay safe. Seriously. \n\nFind ways to keep yourself safe, he might do something drastic here.",
            "score": 3,
            "author": "AscendedViking7"
        },
        {
            "level": 0,
            "comment": "He’s disgusting I hope he burns in hell I’m glad you got screenshots I hope of the messages so you can use them against him I’m so sorry you went through this he’s a monster.",
            "score": 3,
            "author": "OrganizationEqual689"
        },
        {
            "level": 0,
            "comment": "I'm proud of you. You're fighting for the respect you should have been given all along and it's going to be difficult, but you can win this.",
            "score": 3,
            "author": "Pandaploots"
        },
        {
            "level": 0,
            "comment": "Hey, I wanna say: I'm glad you managed to make it this far, with a supporting family. Prayers for you OP. If Troy and his cronies are always harassing you for protecting yourself, this is more evidence that all of these guys are narcissists who plan to use you for entertainment. Do NOT allow anyone like these into your life! \n\nI pray that one day, you will eventually find friends who appreciate you",
            "score": 3,
            "author": "JB57551"
        },
        {
            "level": 0,
            "comment": "Maybe I’m just being overly paranoid for you but if he’s threatening you I’m not sure overly paranoid exists so I’ll say that I would be weary of even sharing where you are staying on here. I know it’s anonymous but the scenario is so specific it just takes one person who could be adjacent to him and you ti find out where you are and share that information with him or his parents. Stay safe OP!!",
            "score": 3,
            "author": "Puppybrother"
        },
        {
            "level": 0,
            "comment": "Imagine not believing someone’s sexual harassment experience and then when that person takes legal action threatening with sexual harassment, the stupidity of some people knows no bounds.",
            "score": 3,
            "author": "JohnnyXorron"
        },
        {
            "level": 0,
            "comment": "Well, yes you did wrong for not telling but who rlly tf cares abt your fault of not telling? That kid is the trying to RAPE you! And EVERYBODY SUPPORTS HIM!!! Please, dont go around alone or unarmed. Get a pepper spray for the love of God. Stay safe",
            "score": 3,
            "author": "some_random_guy_007"
        },
        {
            "level": 0,
            "comment": "Please tell me you saved all those messages?! They'll be gold dust during the lawsuit",
            "score": 3,
            "author": "TheBendyOne"
        },
        {
            "level": 0,
            "comment": "Aw, that's terrible. Stay safe and glad you got out of that. That fucking creep will get whats coming to him, karma is a bitch and you wanna stay on that bitches good side.",
            "score": 3,
            "author": "BEEL1NE300"
        },
        {
            "level": 0,
            "comment": "I'm so sorry and I hope Troy gets what he deserves.\n\nThis is a typical case of 'boys will be boys', coddled by his mom, especially because he's autistic so she will let him get away with everything. \n\nI'm also sick of boys and men acting shitty and doing bad things, even criminal things, because they can't help themselves, they're autistic / have adhd / are depressed / yada yada yada. Zero accountability, zero regret, zero self awareness. Plus thinking they're entitled to something (or everything) because mommy dearest told them so. Disgusting.",
            "score": 3,
            "author": "Lady_Lovecraft89"
        },
        {
            "level": 0,
            "comment": "You did the right thing, I hope you never regret it or listen to people who will try to make you regret it. What he did to you could carry onto his adult life if he doesn't learn a lesson about harassing and assaulting people the way he's been going at you. \n\nMy husband works for people as a caregiver for adults who need help in day to day life and he specializes in adults who are diagnosed with autism and such. There was once a very similar man only threatened to SA me (he was big enough that he probably could have on his own) and that DID NOT fly with him. He immediately shut it down, called other staff in to help with the client and he wasn't allowed to be on his own or allowed near the girls for a long while. And even then, he was still supervised 100%.\n\nWhat the school did to you was not right at all. It was absolutely wrong and them asking you to drop it is a good indicator that they know it too.\nI am so sorry that happened to you and I wish you nothing but the best. You don't deserve people saying those things about you. They are totally untrue.\nEFC.",
            "score": 3,
            "author": "DreadedSupalion"
        },
        {
            "level": 0,
            "comment": "Keep kicking ass, OP. We’re rooting for you. (And definitely hoping that karma bites incel Troy in the ass.)",
            "score": 3,
            "author": "oceanduciel"
        },
        {
            "level": 0,
            "comment": "Document all of this.  It's all evidence.",
            "score": 3,
            "author": "Potatoti"
        },
        {
            "level": 0,
            "comment": "u/chicken_feetlover12\n\nI was really glad to read that you're being supported by your family, changed school, preparing a lawsuit and all of it.\n\nThat is really great! You are now on the path of healing, getting better and eventually leaving this shit behind you completely. A whole new fresh start! That's awesome! I hope that things keep going this way for you, and that you will make good experiences giving you an easy time forgetting this mess of human mistreatment. I hope that you'll find new friends easily, who you can trust and feel comfortable with. May your life be filled with good news from now on!\n\nRegarding those disgusting messages you got: Sounds like the brainless idiot just served you evidence on a silver tablet, lmao. Let's all hope that our little aspiring rapist crybaby spends some time in jail. It is seriously needed.",
            "score": 3,
            "author": "Fearless-Physics"
        },
        {
            "level": 0,
            "comment": "Almost this exact thing happened in Cheyenne Wyoming in 2017ish. Except the DA charged the Troy with sexual battery and the town lost its mind.",
            "score": 3,
            "author": "Wonderful_Minute31"
        },
        {
            "level": 0,
            "comment": "It is not your fault for not trusting your parents enough to tell them. They obviously made you feel like you wouldn't be heard so you kept silent. That's on them. It is a parent's responsibility to make sure their child feels safe enough with them that they could come to them with a problem. \n\nWhen I was in 6th grade I was being bullied by a kid who kept sexually harassing me &amp; grabbing me. I didn't tell my parents about the grabbing &amp; sexual comments but told them about the rest of the bullying. Their response was that he's smaller than me I can take him. So obviously I didn't feel like I could tell them the rest of the stuff since they're not going to do anything anyway.\n\nI felt like I shouldn't have to fight him &amp; if I had hit him he was stronger &amp; him &amp; his friends would've ganged up on me. (This was over 20 years ago.)",
            "score": 3,
            "author": "Far-Inspector331"
        },
        {
            "level": 0,
            "comment": "&gt;Anyway, I just got receipts and blocked him. I also asked my parents to help me change my number. And I did. My grandma being the person she is decided that wasn't good enough and got me a whole new phone. She claims it's compensation for my trauma. Thanks grandma. I am starting therapy the day after tomorrow and I am hoping to start family therapy in August as truthfully, I don't know if I am mad at my parents or should be mad. Like is it my fault for not saying anything? \n\nOP, your family are trying to build a ring of protection around you. \"Circling the wagons\", if you will.\n\nThat's fabulous!\n\nNever ever, blame yourself when someone chooses to stalk and harass you. BE ANGRY! \n\nBe mad as hell, in the *right direction*. Take your power and control over the situation. GM and your parents are your allies and foot soldiers.\n\nPretty sure you're gonna come out on top of this situation. Yea, you! I'm so proud of you!",
            "score": 3,
            "author": "disco_has_been"
        },
        {
            "level": 0,
            "comment": "Just wanted to add, please discuss with your lawyer about the influence this creature's parents have in your community. I wouldn't put it past them to \"talk\" to any judge who is assigned your case. I'm not sure about your country, so I have no idea the laws and court procedures, but in my country, especially the little towns, judges are very cozy with rubbing elbows with the good olboys. Please take care. Hopefully Troy will be in a jail where he gets to understand how it feels to be grouped by someone and feel helpless.",
            "score": 3,
            "author": "anarchallamaspit"
        },
        {
            "level": 0,
            "comment": "Record and report every single try of contact and messages.\nI'm glad that your family stepped in and providing much needed support. So sorry that school system and community let you down.\n\nAutistic or not, that guy had it coming. He is a rapist in the making and encouraged by his enabler parents and teachers.\nCall me horrible, but I'm hoping for many punches in his future and someone should lock him up and throw away the key.\nAll these people defending his maniacal little ass using good old autism defense, don't know the first thing about autism.\n\nI hope you will never see him again and wishing you all the best.",
            "score": 3,
            "author": "corrygan"
        },
        {
            "level": 0,
            "comment": "as a teacher this makes my blood boil that they did nothing. Your grandma is right, they don't deserve their jobs for enabling this behavior. Godspeed and I hope you can start healing from this!",
            "score": 3,
            "author": "mundanehistorian_28"
        },
        {
            "level": 0,
            "comment": "Autism is not a pass to grope and sexually assault someone. You were correct to punch him. I hope you get some Justice.",
            "score": 3,
            "author": "thechosenwonton"
        },
        {
            "level": 0,
            "comment": "Someone said ‘I hope you get a thirsty lawyer’ - I can’t find their comment so I am quoting it. I hope what they said actually happens and you get a badass lawyer who will destroy everyone who wronged you! Stay strong and keep fighting!!",
            "score": 3,
            "author": "gowaz123"
        }
    ]
}