{
    "id": "147ei3p",
    "score": 2,
    "title": "I don’t like cuddling but girls do. What to do?",
    "author": "anoniinternetguy",
    "date": 1686542952.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/147ei3p",
    "media_urls": [],
    "other_urls": [],
    "postText": "As the title suggests, I personally do not like cuddling. Sometimes I do but have a hard time falling asleep while doing so and I turn to my side and sleep with a pillow.\n\nI usually cuddle for 10 minutes then turn on my side and go to sleep. Is this weird / rude?",
    "comments": [
        {
            "level": 0,
            "comment": "Learn to cuddle. Keep them happy and you will be happy!!! We all do things we don’t want to to keep relationships going. Women do too, trust me",
            "score": 2,
            "author": "Bmilvis"
        },
        {
            "level": 0,
            "comment": "As a girl who does not like to cuddle with a husband who does. You find someone who will compromise when he really needs it. I cuddle, i lie there until he is asleep and wiggle out. *shrugs* things i do for him.",
            "score": 1,
            "author": "audrima"
        },
        {
            "level": 0,
            "comment": "Say you have a meeting in the morning and go sleep in your own bed",
            "score": 1,
            "author": "illmatic708"
        },
        {
            "level": 0,
            "comment": "Do you not enjoy cuddling while falling asleep or cuddling period? Because I love cuddling, I just need my space when I fall asleep. I’ve never met a girl that isn’t into cuddling, but who knows? Maybe there’s someone out there who isn’t or someone you’re willing to compromise with",
            "score": 1,
            "author": "Gallagher908",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t enjoy cuddling when I’m trying to fall asleep. Very light sleeper who needs his own space and girls usually complain about it…literally can’t sleep if I do it and don’t want to stay up an extra 30-45 minutes until they fall asleep to slink out of it",
                    "score": 1,
                    "author": "anoniinternetguy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol you’re like me then! I usually cuddle for a while and when I’m ready, explain why I need some space in order to sleep (and reassure the guy I’m with that it’s not that I don’t want to cuddle more, it’s just that I need to sleep). It’s been a reasonable compromise for me so far",
                            "score": 1,
                            "author": "Gallagher908"
                        }
                    ]
                }
            ]
        }
    ]
}