{
    "id": "147hku5",
    "score": 3,
    "title": "What if I did actually go through with ending my own life?",
    "author": "SalRN7",
    "date": 1686553892.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/147hku5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I admitted defeat to my mental health issues about a year ago, I'm done. I fantasize about it pretty much every day now. No point in flooding a page about some self-pity party story about why I am the way I am. It's unfixable and I have accepted that. \n\nI am at the same standstill most people who are mentally-ill come to. I want to off myself, but I cannot bring myself to do it because the primitive parts of my brain that tell me to live overpower my will to take action and end my own life. Every time I come close I cannot do it. All those thoughts that push me to the edge are invalidated by the fear of death in that instance. \n\nI am well aware of the fact that people have it way worse than me. I know that there are people who are suffering that would do anything to be in the same position that I'm in. I'm 22 years old, healthy and good-looking. I am financially supported and in school pursuing a lucrative career. None of it gives me any motivation or empowerment to keep going. The thought of not having to exist anymore is more appealing to me than using those resources to secure a wealthy lifestyle. Nothing would change if I left it all behind. Don't have anyone left in my life that I could confidently say who would be truly devastated by it either, which makes it feel like a practical idea overall. \n\nCould sit here and go on forever about what led to this path but there's no point. It just really sucks that I can't go blow my fucking brains out because of this stupid fear when it only feels like it's the right thing to do, living right now is worse than actually being dead.",
    "comments": [
        {
            "level": 0,
            "comment": "I would be sad that we lost another amazing and beautiful person to this shitty world we call home if u wanna talk dm me ill give u my snap and we can talk",
            "score": 5,
            "author": "goldendiamond1666"
        },
        {
            "level": 0,
            "comment": "\n&gt;Could sit here and go on forever about what led to this path but there's no point. \n\nCan you do it anyway?",
            "score": 2,
            "author": "Kuliyayoi"
        },
        {
            "level": 0,
            "comment": "[This](https://youtu.be/L7FkyF4ux70)",
            "score": 0,
            "author": "ebonyudders",
            "replies": [
                {
                    "level": 1,
                    "comment": "Eat it.",
                    "score": 2,
                    "author": "Negative_Froyo_1014"
                },
                {
                    "level": 1,
                    "comment": "lol",
                    "score": 1,
                    "author": "DoctorRiddim"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whenever I think about it, I always think \"what then?\"",
            "score": 1,
            "author": "Key-Ambassador2970"
        },
        {
            "level": 0,
            "comment": "From my favorite show(paraphrased): People who are suicidal(me and you included) cannot differentiate the present from the future - there is no problem that can’t be sufficiently solved in time. \n\nI know it’s not what you probably want to hear right now, but it’s good you are wondering what would happen because it shows that deep down you know there’s a way forward and that the future is distinct for better or worse",
            "score": 1,
            "author": "Ok-Classroom7747"
        },
        {
            "level": 0,
            "comment": "It gets better. Just stick it out and see.",
            "score": 1,
            "author": "Jealous-Percentage-7"
        }
    ]
}