{
    "id": "147mnfu",
    "score": 0,
    "title": "My mothers husband molested me as a child, then my mother neglected me until i didnt need her.",
    "author": "throwaway439875b",
    "date": 1686572131.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/147mnfu",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi reddit. This is a part of my life I've been in denial of for the better part of my life. I know that if i told anyone in my immediate family about this, my life would come crashing down. I want to let my story be heard and forget about this post. Apologies for the jumbled sentences, I've never explicitly said this out loud, ever.\n\n&amp;#x200B;\n\nI come from a muslim country, so polygamy is a normal occurrence. My mother was my father's second wife. The age gap between my parents was something like 20 years, and all my siblings are well into their 30s now. Anyway, my parents had an unusual marriage. Some sort of marriage of convenience to get my mother out of trouble with the law. I don't have many memories of that man, mostly me being scared from when he would visit(yes he lived with his other wife, we lived 300km away from that house). They got divorced in 2008, and my life really didn't change much, until my mother remarried. I don't have many memories of when it happened, I only have memories of what he did to me, and the day he finally died. He would force me to have sex with him at my moms home(yes she married another married man, no he didn't live with us), in his car, in public bathrooms. My mom would even encourage me to go out with him since he drove and would take me to \"fun places\". He never did. He would do it right under her nose. He died in August of 2011. I never really realized what had happened to me until it was 2017. I went to 1 therapy session in June of 2017 to talk about my \"anger issues related to my migraines and because I hated losing in minecraft so much that I'd slam my fist against the table\". I have now come to realize it is because of what has happened to me.  I had so much pent up anger and I didn't know how to release it. I've been going to therapy regularly for the past 2 years, and it was not easy. The denial I was in was so deep that it took a year just to deconstruct the belief I was in that I brought that onto myself. I used to get flashbacks to it happening to me. Those were the only flashbacks where I was me in the scenario I'm looking back at, every other flashback i had i was always an observer. But not the flashbacks of him forcing me to do sexual acts with him. I still remember the scent the places he would force me to do it with him. \n\n&amp;#x200B;\n\nMy memory of 2012-2016 is blurry, I have no distinct memories from that period. I just know my mother wasn't there. She retired in 2017, but for most of my life I was raised in the care of live-in nannies. Nannies that, hit, slap, washed my private parts with soaps, forcefully feed me, brushed my hair so violently that I'd always cry at the end, you get the picture. My mother was very neglectful of me. Part of me wants to believe that it was because she didn't know any better. I've asked her a few times and shes always said that she didn't know that it affected me that much. \"I had to work all those hours to provide us with a living\" I get it. Life in the middle east is hard if you don't have any money, but me thinks that it is equally important to take care of children you brought into the world. I mentioned the forceful feedings, that was her idea. I was too skinny for her liking so she had the nanny pin me down and feed me rice and peas so i gained weight. I gained all that weight and never lost it. Anyway, after her retirement, our relationship hit its lowest. I hated her being there, at home all the time. Home wasn't a safe haven for me, but now it was battleground. Everyday we had a screaming match, fighting over every single detail shutting the wifi off so i \"have\" to go to sleep, blah blah blah. That all culminated into that one therapy session i had in 2017. She, my aunt, my uncle, all came with me to this first therapy session. I knew what they would do so I spoke in a language my therapist didn't know for an hour and after we got done, they barged in questioning the poor therapist who has no clue what is wrong because i just spilled all my heartache out to her in a language she didn't speak. They couldn't get any information out of her, and i didn't see her again as i had a vacation scheduled for early next week and i thought that would fix me. Spoiler alert, it didn't. all it did was help me bury that dark part of me for a bit and then i got to appreciate the nice weather and the beauty of life. I felt okay for the next 6 months, and then felt like shit for the next 4. On a random Tuesday night i decided that I was not gonna be sad anymore and it worked. It wasn't healthy when i look back at it but it worked. \n\n&amp;#x200B;\n\nUp until the pandemic, school WAS my safe haven. Where I felt the safest, away from any man, and from my own mother. Until the pandemic started and we went into lockdown. I was at home again, in the constant presence of my mom 24/7 again. The constant fighting came back, I dreaded leaving my room. We had no boundaries and it was killing from the inside that I did not get any space to be me, ever. I was always what she wanted to be, her dreams always came ahead of mine. I couldn't take it anymore. I made it a year and three months before my body just couldn't take it anymore. I started therapy again, it went well, until it didn't. I saw the therapist i saw in 2017, and she does remember me for some odd reason. Anyway, this was a cathartic experience. I've never spelled it out like this, ever. Not even to my therapist.\n\n&amp;#x200B;\n\nWriting this out gave me some relief. Thank you for reading.",
    "comments": []
}