{
    "id": "147m051",
    "score": 1,
    "title": "I slept with my step sister and live to regret it",
    "author": "prdrage",
    "date": 1686570066.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/147m051",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m now a (M19) but when I was 14 me and my step sister were normal for the most part we both played sports and had our free time activities we would play. But one day we both looked a each other and she kissed me. Me being so young idk what I wanted to do next or what she was planning to do I started kissing her back and one thing led to another and we ended it up doing it. If that’s where it ended I would have been ok and been able to live with the regret but no. I was 14 and stupid. We off and on made out and made love for the next 2 years until we went on a family trip we’re one night we did it and I was able to bust and stuff came out. That’s when I thought enough is enough. So I went to my mom that night and told her everything. To this date she is extremely supportive and tells me to just not thing about it. But it still haunts me what a stupid thing I did in the past and I can’t stop feeling like it’s my fault. \n\nThanks for taking the time to read this idk I’m not great at writing so I hope you can understand.",
    "comments": [
        {
            "level": 0,
            "comment": "love the creative writing bro. keep it up ! \nyou might be on new york times best seller one day",
            "score": 59,
            "author": "balenciaghoe"
        },
        {
            "level": 0,
            "comment": "Was she stuck in the dryer?",
            "score": 52,
            "author": "Bmilvis"
        },
        {
            "level": 0,
            "comment": "It's a lot more common than anyone would think or be willing to admit.\n\nI've never actually had sex with a stepsister, but I did have some experiences with my stepsister when I was younger. We had flirted a little before our parents met and just never really stopped after they got together.",
            "score": 10,
            "author": "Zorro_del_Sur"
        },
        {
            "level": 0,
            "comment": "it took you two years having sex before you had an orgasm?  Also how long before this were you two step siblings?",
            "score": 3,
            "author": "yetagainitry",
            "replies": [
                {
                    "level": 1,
                    "comment": "We were step siblings the whole time we didn’t become real siblings till recently but my mom and step dad got together in 2018",
                    "score": 1,
                    "author": "prdrage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So in 2018, when your mom and her dad first got together, and you two first were around each other, how old were you?",
                            "score": 1,
                            "author": "yetagainitry",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Both of us were 13",
                                    "score": 1,
                                    "author": "prdrage"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think he said he ejaculated later.",
                    "score": 1,
                    "author": "ChairmanSaaaaab"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Relax dude. If this is the worst mistake you make with regard to sex then you are probably better than most people.",
            "score": 5,
            "author": "LukeLovesLakes"
        },
        {
            "level": 0,
            "comment": "This is more common than you think (Not my own experience, but I do know people) specially when you're so young.\nWas your family unloving or lacking in any way?",
            "score": 2,
            "author": "ignoredWeirdo",
            "replies": [
                {
                    "level": 1,
                    "comment": "No I’m blessed in having loving parents just bad relationships and obviously this that’s all",
                    "score": 1,
                    "author": "prdrage"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At 14 you were dry firing?   Most people talk about that when they are under 12",
            "score": 2,
            "author": "Ballard_77",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those dry orgasms were the best for me. I miss em.",
                    "score": 4,
                    "author": "ChairmanSaaaaab"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are you doing, step bro?",
            "score": 2,
            "author": "returnofceazballs"
        },
        {
            "level": 0,
            "comment": "Don’t know age of your step sister (potentially grooming or assault) but I can understand why this is distressing. You were not really old enough to consent -/ that’s messy. This must make for awkward family gatherings.\n\nI hope you are able to talk to a professional (therapist). If only it was that simple to ‘just not think about it’. But it’s not and could affect your relationships with any female partner in the future.\n\nI’m sorry this happened to you.",
            "score": 1,
            "author": "This_Cauliflower1986",
            "replies": [
                {
                    "level": 1,
                    "comment": "We were both the same age and as I’m getting older I’m looking for professional help but thanks",
                    "score": 1,
                    "author": "prdrage"
                }
            ]
        },
        {
            "level": 0,
            "comment": "pics or it didn't happen",
            "score": 1,
            "author": "ShiRonium"
        },
        {
            "level": 0,
            "comment": "Weak story. Try harder next time.",
            "score": 1,
            "author": "dfgthree3"
        },
        {
            "level": 0,
            "comment": "Sweet home Alabama",
            "score": 0,
            "author": "Dangerous-Skill1104"
        }
    ]
}