{
    "id": "147oquo",
    "score": 9,
    "title": "I still love and miss my xwife",
    "author": "Impossible_Coyote_30",
    "date": 1686578099.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/147oquo",
    "media_urls": [],
    "other_urls": [],
    "postText": "We have divorced 4 years and I really have tried to get over her.  The problem is that I still remember EVERY detail of the first time I met her.  I even remember the clothes she wore and what she brought to the party (stuffed mushrooms).  This was almost 40 years ago.  Why is it that 2 good people make bad/horrible decisions.  \n\nI would love a second shot at this relationship, but it will never happen.  My family and friends would stone me.  I know she abused me and stole from me.  I do not care.  She is a good person that was under a lot of stress and took the wrong road (IMHO).\n\nYes, she did make some bad decisions but don't we all but, she is a good person just not to me.\n\n&amp;#x200B;\n\nAHHHHHHHHHH....",
    "comments": [
        {
            "level": 0,
            "comment": "Time heals all wounds they say, it also shine light in the good and darken the bad, you seem to be ignoring the bad and focusing in the good, you are doing it to justify your feelings because who wants to love a bad person? Without details I would say to listen to your friends and family and stay away.",
            "score": 3,
            "author": "Dresden_Mouse"
        },
        {
            "level": 0,
            "comment": "She a CRAZY hoe",
            "score": 2,
            "author": "_-1__-8-_1_-8-__1-_"
        },
        {
            "level": 0,
            "comment": "I don't know your pronouns, but it doesn't matter; abuse is abuse. It's so hard to walk away from somebody, especially when you have rose tinted glasses on. You remember the good times, but you also need to remember the bad; if they really loved you, they never would have hurt you.",
            "score": 2,
            "author": "Sociox"
        }
    ]
}