{
    "id": "147xqla",
    "score": 22,
    "title": "I just want to be the one to someone",
    "author": "Expensive-Ad-8974",
    "date": 1686604109.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/147xqla",
    "media_urls": [],
    "other_urls": [],
    "postText": "I (40+ F)have never been married, no children.  Marriage has never been really important to me, as long as we are committed I am ok with that.  Too many people get married for the wedding rather than what it is supposed to symbolize anyways.  Children, I was indifferent,  waited too long for a previous partner to prove he was going to put in the work to raise a child and not leave it all to me.  Too late now....  \n\n\nMy current BF (41M) is everything I ever wanted in a partner, except we are not partners.  We are simply BF/GF.  I have never felt this way about anyone, I know what I what with them, and if we had met 10 years ago, I'd have had his babies, even though having kids was also not that big of a deal to me.  \n\n\nNow, we are in a place where I want more, I want a partnership (again, marriage is not required, and babies wont happen).  I just want to live life with someone who wants to do the same with me.  When i let myself be really vulnerable and open,  I voiced this and was truly hurt by the response.  I know he loves me, but doesn't know what he wants, doesn't want to plan for the future, or sees a future with me. I think after 3 years you would know if you want or see a future with someone  \n\n\nSeriously, my last long term relationship was basically my entire adult life and while we were partners in the sense that we owned a home and had pets, i never felt like I was one for them, that I was a priority.  That they wanted me to be happy and loved me unconditionally or even just do common courtesies because they loved me.  And here I am with a man I would do anything for and I worry that again, that I am not the one for him.    \n\n\nI just want someone to tell me they can't see their life without me,",
    "comments": []
}