{
    "id": "147yv0e",
    "score": 0,
    "title": "My boyfriends best friend hates me and i kinda want to make them hate me more (mentions of: $@ and sh)",
    "author": "Free_Manufacturer268",
    "date": 1686607083.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/147yv0e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Alr me and this friend met in a discord gc with me my bf and some friends from school including them. (Weren’t dating here).\n\nWe’ll call the friend S and my ex X (hes important to the story). One day S comes to the gc talking abt how badly they wanted to harm themselves and i tried talking to them.\n\nAsking them whats wrong saying things like “Whatever happened isn’t worth it” “We can talk abt it”.\n\nThis mf straight up says “Who the fuck are you” my bf explains who i am and what not and i think nothing of it.\n\nI start dating X and i have a rlly sucky memory but i do know he’s an extremely shitty person. When we started dating he told me he was accused of $@. Idk why i believed him i think its dumb i did.\n\nHe was extremely sexual and would sexualize things that normally shouldn’t be like things he did as a child or being treated like a dog.\n\nHe had told me he liked me for 3 years so i rlly didn’t wanna hurt him and took me a while to break up with him but we agree to be friends.\n\nWe still had classes together and when he saw me at gym he ran away from me and didn’t look or talk to me at all which got me confused and angry.\n\nA while later he starts talking shit abt me to the friends we had in a theatre class (who he was also sexual to). \n\nSkip to may of this year i start dating my amazing bf he was kind and a while before we started dating he told me how my x without even knowing his best friend $@‘ed S at prom.\n \n\nThey weirdly started dating after that but meh love is love i guess. My bf didn’t like X and made that extremely clear to S but he said he would tolerate him for them. But S was angry my bf didn’t like X.\n\nRecently X wanted to talk to my bf abt why he didn’t like them and my bf couldn’t make it to the room where they were gonna talk now X is disappointed (who gaf) and S decided to talk abt me to my bf.\n\nS said “Yknow that ick you get when you first meet ppl? I got that with (me)” after asking my bf if we were dating\n\nOfc my bf told me and we started talking abt the entire situation and how it didn’t make any sense. \n\n\nCant wait to go in person next year tho i kinda feel bad for my plans on making them hate me for which are listed below:\n\n-Entirely ignore them when they’re around\n\n-Talk over them loudly if im around while they’re talking to my bf \n\n-side eyeing and giving them looks when they’re around\n\nI dont want my bf to have to end a friendship cause his best friend doesn’t like me we’re in high school friendships are precious. I rlly jus want them to hate me more and do smtg.",
    "comments": []
}