{
    "id": "1481pew",
    "score": 11,
    "title": "I flirt with a lot of people",
    "author": "Equivalent-Boat346",
    "date": 1686615334.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1481pew",
    "media_urls": [],
    "other_urls": [],
    "postText": "Recently I've realized that I'm a shitty person for what I do. I used to think it but wasn't a big deal but now I know that I'm just being a douche. I am not in any type of serious relationship with anyone but I do often flirt and be suggestive with friends or coworkers, and a lot of them flirt back and are interested in me, even though I only flirted with them because I liked them in that moment. I hate myself for doing it because now I've given a lot of people false hope. I've never been the type of person to talk to a bunch of girls or be in many relationships but when I am spending one-on-one time with people I tend to be flirty with them regardless of our current relationship or if they're attractive to me or not. I didn't come here to make this post because I want sympathy. But I do want to get it off my chest and tell somebody.",
    "comments": [
        {
            "level": 0,
            "comment": "Hopefully they notice that you're flirty with most everyone so they don't take it too seriously. I always pay attention to that so I can tell where I stand with them 😜",
            "score": 13,
            "author": "spiveycat"
        },
        {
            "level": 0,
            "comment": "i don’t think that flirting in general is a bad thing and i also don’t think that it’s your fault if someone interprets too much into it tbh \n\nsome people are very flirty and charismatic and just have this special vibe and as long as you don’t talk about feelings, serious stuff or actually do things that should be relationship-exclusive i think you‘re good",
            "score": 7,
            "author": "Timely_Song7537"
        },
        {
            "level": 0,
            "comment": "I mean, they probably just think you’re a douche and they move on",
            "score": 5,
            "author": "MonicaHuang"
        },
        {
            "level": 0,
            "comment": "If you’re flirting with people who are already involved with someone, this is a habit you need to break. And it can give seriously bad impressions to work colleagues.",
            "score": 2,
            "author": "wakingdreamland"
        },
        {
            "level": 0,
            "comment": "Sound like my ex.",
            "score": 2,
            "author": "Bella-Blu62"
        },
        {
            "level": 0,
            "comment": "Pretty sure they’ll all say the same thing, avoid dairy products, no beans, and if you feel even a little gassy shut it down quick.",
            "score": 1,
            "author": "Juancho511",
            "replies": [
                {
                    "level": 1,
                    "comment": "spit-take",
                    "score": 1,
                    "author": "calvinball14"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So what?",
            "score": 1,
            "author": "Ecstatic_Cold3068"
        },
        {
            "level": 0,
            "comment": "I don't think it's a big deal it can be fun n flattering if you don't take it to far. Sometimes it's nice just knowing you're attractive even tho you're not going to do anything and I think it's nice for others as well.",
            "score": 1,
            "author": "mattg4704"
        },
        {
            "level": 0,
            "comment": "Don't be so hard on yourself.  That tiny sliver of false hope may be the only hope they really have.",
            "score": -6,
            "author": "Huskguy"
        }
    ]
}