{
    "id": "1482xkd",
    "score": 37,
    "title": "The way some people treat people with disabilities is disheartening",
    "author": "Technical_Ask7027",
    "date": 1686619178.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1482xkd",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a part of the center for accessibility at my university because I have schizoaffective disorder and when I went to take my exam they would no joke read me each line of the instructions sheet and check if I understood or not. Like no I don't have a learning disability :/ \n\nAnother situation is that whenever I talk to someone in class and tell them I'm with the center for accessibility, they think I'm dumber than them or something and immediately act as if they know more than me. \n\nAnyways thank you for reading.",
    "comments": [
        {
            "level": 0,
            "comment": "I get it. When I was in uni, I needed accommodation because of an inability to take notes due to an injury to my hand/wrist. People would often speak to me very loudly - because of course I must have hearing loss - and also speak very, very slowly to me, because I must be developmentally delayed in some way. It was bizarre. And they meant well, so good on them for trying.",
            "score": 19,
            "author": "Royal_Visit3419"
        },
        {
            "level": 0,
            "comment": "I have accommodations at my university as well mine is vision related. And I kid you not once teachers or other students find that out they always try to guide me when I don't ask them to( like take my hand and try to walk with me somewhere) . Or they talk slow like I'm deaf like.... what? For example I'm treated normally at first but if they find out then all of a sudden I'm very fragile to them. So I know how you feel.",
            "score": 6,
            "author": "Monae92"
        },
        {
            "level": 0,
            "comment": "So people being accepting and accomodating is now a bad thing?",
            "score": -6,
            "author": "alanius4",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you were born with a club foot, or had a hearing condition, or had PTSD, or any other disability that did not affect your intelligence, would you really want some one treating you like a baby? \n\n\"Do you need help, sweetheart? I know it's hard, don't get too frustrated! Math can be fun, I promise! Now what is 2 + 3? It's 5! Do you understand that, precious? :D\" Imagine that spoken very loudly in baby speak directed towards you right in front of your peers, then watching *them* also assume you must have cognitive issues for someone to talk to you like that, so several of them start talking to you like that too.\n\nIt's not accommodation, it's discrimination, and believe it or not, this kind of thing happens all the time in work places and colleges.",
                    "score": 16,
                    "author": "Elle_Pandora",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is really, really common for people associate mental health issues with just being stupid, lazy etc. Our understanding of mental health is still pretty limited.",
                            "score": 7,
                            "author": "hkkffh"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Speaking of someone else with a vision impairment that I can’t hide, it’s not a bad thing. However, having people who seemingly think they know what you need is a bad thing. Trying to guide you somewhere where you had no intention of going, yelling at you from across the hall or street because you made a turn they think you didn’t mean to make, the list goes on.\nImagine being in a familiar place, not a very familiar one, but maybe one you haven’t visited in a few months. You step out of your car or get off the bus and take a moment to get your bearings. Maybe you walk a couple steps in a certain direction or another, And all of a sudden, you have people yelling at you, trying to guide you or just trying to be helpful in any number of ways, but not one of them asking if you need help in the first place, or how they can help you.",
                    "score": 2,
                    "author": "cyclops32"
                },
                {
                    "level": 1,
                    "comment": "It's not a bad thing unless they try to either infantile you or treat you very differently.",
                    "score": 3,
                    "author": "Monae92"
                }
            ]
        }
    ]
}