{
    "id": "14838ae",
    "score": 5,
    "title": "I have a crush on my friend and I don't know how to tell him",
    "author": "Wow_IDGF",
    "date": 1686620130.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/14838ae",
    "media_urls": [],
    "other_urls": [],
    "postText": "So Me(F14) My crush (M15). I have had a crush on this guy for 2 semester almost a year. How do I confess I can't KEEP IT IN ANYMORE. I don't want to confess becuase i'm scared of rejection. I fell like me and him have a bond and friendship. Help",
    "comments": [
        {
            "level": 0,
            "comment": "I’d go for it and let him know. I think what matters a lot is the energy of this conversation. If you say it in a sincere, vulnerable but also playful and lighthearted way, it might be best. I don’t know about your friend’s personality, but in general, people react better to this type of energy when someone is “confessing” a crush. \nSay what you feel! And before you do it, make a pact with yourself that no matter what happens, you won’t regret it ❤️ Good luck!",
            "score": 5,
            "author": "MissRoja",
            "replies": [
                {
                    "level": 1,
                    "comment": "aww thanks for your respond idk what it is about confessing is so hard. One time I was so close but then he told me about his crush(it was a long time ago).",
                    "score": 1,
                    "author": "Wow_IDGF",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Putting yourself out there like that can be scary! Specially at your age. So I totally understand why it’s hard. But you’ll never know what can happen unless you say it. And you should know that this is something anyone would feel extremely flattering about. If he never saw you as a potential girlfriend before, he might do so after you confess. It’s inevitable, he’ll at least think of that! But I don’t want to get ahead of things. Just have fun telling him, and it will go well regardless.",
                            "score": 2,
                            "author": "MissRoja",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I will at the end of the school year I don't want any awkward situations. Thanks for the advice &gt;3",
                                    "score": 2,
                                    "author": "Wow_IDGF"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I was your age, I had a crush on a friend. I confessed my feelings to him, got rejected and I felt awful. But you know what? Now I don’t even have a second thought about it, rejections happen but in the grand scale of things it’s not important. I didn’t mold me to be the way I am today, it was just one of those trivial experiences I had. \n\nIn life you’ll be rejected 10000 times, but it takes one acceptance to potential change your life. He might reject you, it might feel awful but the pain won’t last forever. Or he might not reject you, maybe you’ll start dating and it’s the start of something beautiful. Who knows? It’s your decision and your feelings ❤️",
            "score": 2,
            "author": "Novel_Text6772",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for sharing! I always have second thoughs so this helped!",
                    "score": 2,
                    "author": "Wow_IDGF"
                }
            ]
        }
    ]
}