{
    "id": "14899z3",
    "score": 8,
    "title": "I don’t sleep anymore. &amp; When I do I have strange, vivid, odd dreams that don’t make sense.",
    "author": "alienboy222",
    "date": 1686640942.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/14899z3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I haven’t gotten a good nights rest in months now. I pretty much sleep in increments of 2-3 hours. On the few occasions I sleep longer, I have these extremely vivid dreams that don’t make sense. \n\nI noticed some of them have a pattern of me being locked in a closed space. I had one of me being locked in a completely white tiled room. No doors, no windows. No way out. Another, I was locked in my room and paint was melting off the walls. Or where there was a fire in my house, and I watched everyone from the window get out and leave while I awaited my death as the fire reached the second floor. \n\nSome dreams are completely random and freaky, but don’t cause to much anxiety. Others are completely out of pocket I won’t even mention them here. Sometimes I have anxiety attacks in the dreams, and multiple times I have woken up in the middle of one. Most of the time they aren’t so bad and I can easily recongize it was a dream and calm down pretty quick. Other times, I wake up in utter panic and can’t breathe at all. Once I even woke up fully hyperventilating. I just want to a goodnights rest, that’s all.",
    "comments": [
        {
            "level": 0,
            "comment": "Do you use any substance? I only ask this because sometimes substances can alter your mental state and the quality of your sleep. If not, then try to identify the reasons for not sleeping well. Is it stress related? Anxiety can affect your sleep quality and can induce nightmares. Best to speak with your doctor about it and maybe see a psychiatrist to get the anxiety under control. Wish you all the best.",
            "score": 8,
            "author": "Emisthefish"
        },
        {
            "level": 0,
            "comment": "I suffer in a similar way.  Only 3-4 hours of proper sleep and then in and out of sleep with stressful dreaming for the rest of the night.  It's a very frustrating way to live.",
            "score": 3,
            "author": "Relevant_Ad711",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same, never again will I buy a memory foam mattress. It sucks waking up every two hrs, toss and turn and then wake up again and again",
                    "score": 1,
                    "author": "pyromnd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This has been happening to me too. I’ve been having a lot of anxiety and it’s causing more vivid dreams. What I’m going to try is just build a different routine and hopefully that will solve it.",
            "score": 1,
            "author": "Ok_Balance8844"
        },
        {
            "level": 0,
            "comment": "So you do sleep",
            "score": 1,
            "author": "Defiant_Low_1391"
        },
        {
            "level": 0,
            "comment": "I’m sorry this is happening to you. Dreams are your subconscious mind’s way of trying to make you face what you’re feeling in real life. Unfortunately it does this by writing crazy scripts packed with metaphors. Since you often dream about being trapped, I’d imagine you are feeling trapped in some way in your real life. You can Google any detail of your dreams and the meaning and find lots of possible interpretations. But feel free to message me if you like:)",
            "score": 0,
            "author": "YourFriendMaryGrace"
        }
    ]
}