{
    "id": "148bzwe",
    "score": 1,
    "title": "Rumor at work that I identify as a dog",
    "author": "TheQueasyMongoose",
    "date": 1686651534.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/148bzwe",
    "media_urls": [],
    "other_urls": [],
    "postText": "I wish I was joking.\n\nI love where I work, my coworkers in my department are great and there’s a specific group that often has debate-like discussions and when I sit with them on break I enjoy it because I feel comfortable actually sharing my thoughts without feeling the pressure of “being right” and sometimes actually seeing a different point of view that I hadn’t been able to understand before.\n\nI mention this because last week we had a discussion about transgender rights, I expressed my thoughts and got into some slightly heated territory because they started making remarks about a coworker who recently transitioned. I was trying to keep things non-hostile and also non-personal and offer a different perspective but in the end we all got our points across and had to agree to disagree for the most part. I can’t change my coworkers and I don’t want to, I also wouldn’t want to work with anyone else as they’re great to work with and easy to get along with, even when we actually argue (work related or otherwise) we don’t hold grudges and we can talk it through and be back to normal within minutes. Regardless, break was over and so was the conversation.\n\nThe next break on the same day, another coworker who is the same age as me was watching a tiktok of a dog with a funny bark, she imitated it, I imitated it, we laughed and moved on. Later that day, before we clocked out, coworker walked past me and did the bark again, to which I did it back, again we laughed then said bye, and I went on about my business. I didn’t think anything else of it.\n\nCut to yesterday, by the end of my shift all of the departments had heard a rumor that I was now identifying as a dog. Evidence being that I barked at someone and was “arguing for my rights” on break. Not trying to have any problems (legally I assume), a lady from HR had to ask me if I did genuinely identify as a dog. Of course I said no, she said “well we can’t be too careful with these things, we want to do our best to make sure everyone feels accepted here” I get it, but I explain that it’s not true and it’s just a misunderstanding.\n\nSeveral people have now asked me in all seriousness if it’s true.\n\nIgnoring the ones I catch giggling to themselves when they see me, so far I’ve had two people that I’ve never even spoken to before come up to me just to make a joke about puppy pads and marking my territory. I laugh it off and try to ignore it but it’s just so aggravating.\n\nI know it’s dumb to let it get to me, but I’ve just never had this sort of thing happen before. I’ve dealt with rumors, but nothing as wild as this. I’m genuinely baffled, but also don’t know how to react. Like yeah, it’s kinda funny to think how two things just so happened to line up to somehow give someone the impression that I was identifying as a dog, but it’s also annoying that some people took that so seriously and ran with it. I hopefully it’ll die down soon, I don’t want to be known as “that girl that thinks she’s a dog” but I don’t really know how else to deal with it other than laugh it off even though it bothers me that some people are genuinely so gullible they actually think it can be true.",
    "comments": [
        {
            "level": 0,
            "comment": "Well, do you?",
            "score": 1,
            "author": "Defiant_Low_1391"
        }
    ]
}