{
    "id": "148here",
    "score": 4973,
    "title": "My medical condition has made me an enemy of Islam",
    "author": "LobsterHot5607",
    "date": 1686668448.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/148here",
    "media_urls": [],
    "other_urls": [],
    "postText": "I 21F am a college student that suffers from alopecia and a rare skin condition called solar urticaria. For those that don't know what either are, alopecia is a condition that causes me to spontaneously lose patches of my hair and solar urticaria causes me to break out into hives and welys whenever my skin gets exposure to the sun.I made the brave decision of shaving my head last year due to my alopecia because I would have a breakdown whenever I had one of my flare ups. It was a very hard decision for me and I missed having hair. I tried different treatments and even wore wigs, but my skin had a bad reaction to one of the wig glues that I used and I ended up getting a skin infection. I had to take tetracycline to treat it which my body also had a very negative reaction to and as a result, I developed solar urticaria.   \nSolar urticaria is a very rare and very painful disease and there's unfortunatley no cure (talk about bad luck). I am still taking treatments for both conditions although I am notably staying away from wigs. I had no problem rocking the bald look after the wig fiasco, but after being diagnosed with solar urticaria, the lack of hair on my head became a problem due to there being no protection for my scalp. I was coming up with ways to appease my solar urticaria because dealing with the symptoms were not fun. So I began to wear long sleeve shirts and pants, and I would apply heay amounts of sunscreen, and I would take the medication that my doctor prescirbed. I also started to wear scarves on my head.  \nWhen I first started wearing my scarves, I had trouble keeping them on my head, so I started watching hijab tutorials on Youtube and I got pretty good at wearing them. I would like to clarify that I am not Muslim, I just used the hijab tutorials to help me wear my scarves better. The trouble started when one of my classmates who is Muslim invited me to join out school's Muslim Student Union. I then told her that I wasn't actually Muslim I just covered myself from head-to-toe for medical reasons. This offended my classmate and she said that I was making a mockery of her religion, and how dare I wear the hijab for slefish purposes.  \nThat's why I came here to Reddit. I had no intention of mocking the religion. I just wanted to make my quality of life more bearable. I have had less solar urticaria flareups due to the scarves, but I had no clue that what I was doing could actually be deemed offensive. However I may be the asshole in this situation since I never bothered to research if what I am doing is okay. I really dont' want to stop wearing my scarves because my life has became so much easier, but I'm now public enemy number 1 to all the muslims at my college and I don't know what to do.",
    "comments": [
        {
            "level": 0,
            "comment": "She’s wrong, though. It’s not a hijab, it’s a head covering for medical purposes. \n\nI have a friend with alopecia who wears head wraps. She looks amazing in them. She buys them from a company owned by Hasidic Jewish women, and they have a huge list on their website of reasons why people cover their heads with fabric or wraps - all religious reasons including Christian and Pagan reasons, illness, early baldness, taking back their bodies after trauma, sun sensitivity… the whole lot. \n\nLet her be mad. You’re not Islamophobic or an enemy of a whole religion for protecting your skin.",
            "score": 2017,
            "author": "RadioSupply",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wrapunzel? Or is there another I should look at?",
                    "score": 261,
                    "author": "Noladixon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Omg I thought you just made that up off the top of your head (HA!) for a second there. That would have been amazing",
                            "score": 71,
                            "author": "LeekAltruistic6500"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wrapunzel are amazing.  I chose to wear head wraps during my chemo, rather than wear a wig and found my way to tichels and then the Wrapunzel site.  They have a great choice of beautiful scarves, wraps and accessories and wonderful tutorials to help you.\n\nWhen I reached out to them they stayed in contact with me and were so welcoming even though I am not part of their faith.  THAT is how you do it. \n\nThe Wrapunzel ladies are the best and I now I have my hair back I kinda miss my colourful wraps.",
                    "score": 142,
                    "author": "Pinchyfeets",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, it’s Wrapunzel!",
                            "score": 20,
                            "author": "RadioSupply"
                        },
                        {
                            "level": 2,
                            "comment": "I have TTM and love Wrapunzel! It's made such a difference! I have a very simple wardrobe, so I could match everything. It is life changing.",
                            "score": 15,
                            "author": "ScreamingSicada"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Woot woot! That's gotta be Wrapunzel. I've given them so much money over the years. They carry the most beautiful scarves!",
                    "score": 13,
                    "author": "ReluctantChimera"
                },
                {
                    "level": 1,
                    "comment": "The hijab is just the Arab and Roman styling of hair covering and no scripture in Islam mandates it. Anyone making it a religious symbol is wrong, including Muslims.",
                    "score": 35,
                    "author": "NerdStuffOnly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This clothing style is clearly used with the sun in mind. Everyone covers their heads in the Sahara. \n\nBut how dare you dress the way she thinks women should dress!",
                            "score": 9,
                            "author": "DDownvoteDDumpster"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That makes me smile, be inclusive",
                    "score": 34,
                    "author": "artemisRiverborn"
                },
                {
                    "level": 1,
                    "comment": "Aldo what a dumb fucking argument \n\n\"You wearing it for an objective reason with tangible health benefits takes away from me wearing it because sky daddy would be mad otherwise.\"",
                    "score": 47,
                    "author": "Better-Director-5383",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sky daddy 😂",
                            "score": 10,
                            "author": "Horror-Impression411"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Islam isn't even the only religion where women cover themselves. I'm an eastern Orthodox woman, and I wear a head covering. If I saw you wearing a head covering, I wouldn't be offended at all!",
            "score": 4016,
            "author": "MontegueLovesPie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some of us do it just to keep our hair down or whatever",
                    "score": 584,
                    "author": "Chickenherdturd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This as my hair reached over 30 inches it's easier to use a scarf to protect it.",
                            "score": 90,
                            "author": "Velveteen_Coffee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Genuine question, whats the point of having long hair when nobody can see it?\n\nI always wanted long hair, but couldn't really grow it. A lot of people recommended to keep it in a bun, as a protective hairstyle, but i just never got the point? If it's up in a bun it doesn't matter how long it is.\n\nSo i don't mean it in an offensive way, but why would it matter? I do a lot of things just for myself but caring for hair is time consuming and if nobody can appreciate it with me i don't think I'd bother",
                                    "score": 36,
                                    "author": "Zaurka14",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm a man and prior to getting married (well over 20 years ago now) I just kept my hair pretty short.  However, my wife really likes my hair and finally talked me into growing it long.\n\nA couple of years ago, at its greatest extent, it came down to the middle of my back (when wet).  However since my hair is kind of frizzy it quickly turns into a mess unless braided.\n\nAnyway, a possible answer to your question: I grew my hair out long, even though it's often in a tight braid, because my wife likes it.",
                                            "score": 27,
                                            "author": "diederich",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sounds like you might need to use more conditioner after washing your hair if it's frizzy",
                                                    "score": 9,
                                                    "author": "rolypolyarmadillo"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Great answer",
                                                    "score": 3,
                                                    "author": "scissorseptorcutprow"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Whats the point of working out 5x a week then wearing loose clothes? Or buying some fancy, expensive lace underwear you like and wearing it to work where no one will see it? \n\nSometimes, it's not about anyone else, we do things purely for our own sense of self and appreciation. I have a beard that touches my nipples, but I didn't grow it for anyone elses enjoyment, and I will shave it off again on a whim like I do every few years. \n\nI'm sure op's hair gets plenty of air time, but as they said, is much easier to manage day to day when it is up out the way.",
                                            "score": 42,
                                            "author": "PM_Me__Ur_Freckles",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Whats the point of working out 5x a week then wearing loose clothes?\n\nHealth.\n\n&gt;Or buying some fancy, expensive lace underwear you like and wearing it to work where no one will see it? \n\nI didn't know people do that, I assumed lace underwear is only worn to be seen, and usually not for long. For the day I go for comfort.\n\nThanks for your answer though, it does provide some perspective. And makes me realize I'm very lazy.",
                                                    "score": 15,
                                                    "author": "Zaurka14",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Great answer",
                                                    "score": 2,
                                                    "author": "HarrysDa"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "For day to day blue collar work I need it up and out of the way. The rest of the time I'll have it up in a fancy bun or French twist. There are a lot of styles I like that require a lot of hair. That being said it's really not that much work having my hair put up in a scarf. Scarf and twist once you get the hang of it take under 3min, maybe 7min if I want it smoothed out nice.",
                                            "score": 10,
                                            "author": "Velveteen_Coffee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It just made me realize something... Can you just go out with greasy hair? Since nobody would see? Because when i thought how much effort hair is i thought about washing and drying and maybe styling, but you can just skip it right? Up to a point where it gets uncomfortable of course, but skipping a day or two extra shouldn't be a big deal?",
                                                    "score": 6,
                                                    "author": "Zaurka14",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I only wash my hair a few times a week. It only looks greasy if I get sweaty or go more than 2-3 days without washing. Washing it everyday is actually bad for it and can make it frizzier etc.",
                                                            "score": 5,
                                                            "author": "IDidItWrongLastTime",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Right? A lot of the hippy ladies I know wear head scarves. They just like them.",
                            "score": 22,
                            "author": "No_Composer_6040",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, to me, it spans many cultures and time periods. There are African cultures that use certain tie methods to signify different things. I've seen methods used for waves, curls, men's styles, and for cancer patients. The head wrap is incredibly useful, especially when blocking out the sun or heat. There is a world full of people out there, OPs classmate needs to get out and see more. You would think going to an actual college would show them that people from all walks of life exist.",
                                    "score": 17,
                                    "author": "Chickenherdturd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right? I’m primarily a hermit, but even *I* see all kinds of different people wearing headscarves: old ladies, people of every race, little kids, and so on. Covering one’s head is one of those things common in most, if not all, cultures. Trying to claim it belongs to one culture only is a silly as trying to claim hair braiding or food-on-a-stick.",
                                            "score": 11,
                                            "author": "No_Composer_6040"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nope sorry Muslims are the only ones allowed to wear fabric wrapped on their heads /s\n\nThe girl in OPs story needs to grow up / go to a music festival / think about things for longer than 2 seconds.\n\nOP you are not the asshole.",
                            "score": 258,
                            "author": "Jaegernaut-"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Some pagans even wear head scarves.",
                    "score": 110,
                    "author": "Fluffy_Trip_8984",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "THOSE HEAD SCARVE WEARING PAGANS ARE [DARK-SIDEDDDD](https://www.youtube.com/watch?v=Fj9ITiViECo)!!!!!",
                            "score": 39,
                            "author": "serenwipiti",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Apparently that lady got help and now is an LGBTQ+ ally, going to pride parades to support her kids and stuff. Got out of the church and it all got better from there.",
                                    "score": 54,
                                    "author": "vikingboogers",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Omg are you for real?? Thats wild but also good for her!",
                                            "score": 35,
                                            "author": "spookyl1ps"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wow did she really? Any links? I can still recite her wild speech almost verbatim, I’m glad to hear this!",
                                            "score": 11,
                                            "author": "elusivebutterfly84",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "https://www.themarysue.com/god-warrior-marguerite-perrin-of-trading-spouses-is-back-with-a-more-positive-worldview/#:~:text=Marguerite%20Perrin%2C%20better%20known%20as,up%20her%20whole%20world%20view.\n\nI don't know how to shorten links off the top of my head.",
                                                    "score": 15,
                                                    "author": "vikingboogers",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is so sad:\n\n&gt; Though Perrin’s then-extremist religious views wouldn’t seem to be compatible with supporting and accepting queer people, her iconic rant did win her a fair number of LGBTQ+ fans (it helps that she’s always been very good-humored about it, laughing at herself and saying of her meme-making fans, “You know that kind of stuff, that actually makes my day. It makes my day. That’s not mean spirited, they don’t mean it in any kind of way.” And then, when her elder daughter died in a car accident in 2007, it was her queer fans who were there for her and pulled her out of it.",
                                                            "score": 20,
                                                            "author": "MNGirlinKY",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Haha at first I thought you were saying it’s so sad that OP didnt know how to shorten links",
                                                                    "score": 6,
                                                                    "author": "Puzzled-Display-5296"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Put the link in Square Brackets and the intended text in regular brackets immediately after",
                                                            "score": 6,
                                                            "author": "TheChartreuseKnight"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Orthodox Jewish women do it, too. Sometimes even in similar styles.",
                    "score": 29,
                    "author": "adventuresinnonsense"
                },
                {
                    "level": 1,
                    "comment": "I think all Abrahamic religions retain the part about head coverings, its only certain branches of them that adhere to that part of the base scriptures.  This then comes to what makes something a hijab rather than a head covering.  Although at the end of the day I get the feeling the Islamic girls anger is either derived from embarrassment, assuming OP was Muslim, or as someone else said, she just wanted to take offence to something.",
                    "score": 23,
                    "author": "GMoI",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some Catholic women even wear them during Mass",
                            "score": 6,
                            "author": "jellyrat24"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Muslims do not own the head covering - it is a mandate that pre-dates Islam. By the same token, Islam was revealed by God to the Prophet Muhammad (peace be upon him) for all of mankind, not for any one person or type of people. If any Muslim is offended by you wearing hijab it is due to their own error and not rooted in Islam. \nThere is absolutely no harm or disrespect in you wearing a head covering. If you wear the head scarf, that is your choice, and you have personal reason!\nI am a moslem, btw. But not those stupid-conservative one😡… why can’t people respect each other?",
                    "score": 39,
                    "author": "Osulisti"
                },
                {
                    "level": 1,
                    "comment": "Seriously, go get a head covering like the old orthodox and Catholic ladies wear and they’ll probably only tell you how clever you are if you tell them you aren’t either",
                    "score": 6,
                    "author": "FewHearing5"
                },
                {
                    "level": 1,
                    "comment": "Mix it up.. wear Nun garb some days.",
                    "score": 4,
                    "author": "Feral_KaTT"
                },
                {
                    "level": 1,
                    "comment": "Well that's the problem, the girl is \"choosing\" to be offended because that's what's cool these days, being a victim. And if you can be a victim of racism or sexism, wow, you're the coolest one in the group!!\n\nEdit: of* when I typed or by mistake",
                    "score": 227,
                    "author": "Skitteringscamper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yikes, i can hear the youtube university leaking.",
                            "score": 81,
                            "author": "SeaTeawe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Please don’t listen to those stupid people who will have the audacity to tell you this knowing your conditions. I’m a Muslim woman and i’m not offended at all actually I’m sorry you have to protect yourself rather enjoy something must people can.",
                                    "score": 65,
                                    "author": "NortxdPanda",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; because that's what's cool these days, being a victim\n\nummm... that's not \"cool these days\". \n\nit never has been and it isn't now. \n\ni feel like we're just exposed to more of these putzes these days because they're documented on social media.",
                            "score": 17,
                            "author": "serenwipiti",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It is a little too cool to be offended these days but both racism and misogyny are legitimate issues that are actually faced by people that still aren’t viewed as actual human beings in the year 2023. The US has never even had a female president before, despite having had 46 of them, and despite scientific evidence that women actually make better leaders than men do",
                            "score": 53,
                            "author": "DisciplineBitter8861",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s exactly why one shouldn’t appropriate those legitimate issues in order to be ‘cool.’\n\nPeople who actually suffer from them lose respect and credibility because of people like this. 😞",
                                    "score": 32,
                                    "author": "DaniMW",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lot to unpack there, friend",
                            "score": 25,
                            "author": "chagirrrl",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah as a Muslim OP’s friend is being inappropriate. If anything she should be happy to see non Muslims dressing modestly",
                    "score": 3,
                    "author": "Unusual_Specialist58"
                },
                {
                    "level": 1,
                    "comment": "Wth the place where I live every girl wears them hair or not doesn't matter what the religion is because honestly if they don't they will prolly melt away in the heat 🤒",
                    "score": 2,
                    "author": "November_World"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As others have said, head covering spans many cultures and religions. It isn't just Islam, that's just the most prevalent one.\nYour classmate is an idiot, and is not a true representative of all Islam. I know plenty of women who cover their hair, or lack thereof, with scarves and NONE of them have offended anyone with their choices because their choices aren't derogatory, but personal.\n\nIf you are comfortable wearing scarves and uncomfortable without, wear the damn scarves. If Miss Offended has anything to say, you just tell her that you don't have to explain your choices to her and Islam does not have the monopoly on covering up. You owe her nothing, least of all your getting rid of a clothing choice that helps you cope with a skin condition.",
            "score": 319,
            "author": "Panaccolade",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Muslim here - your classmate is being absolutely ridiculous. There is not a single teaching in Islam that says “stop those who aren’t Muslim from wearing a headscarf”. Further to that, there is a difference between a hijab and a headscarf, where a hijab represents a veil of modesty (of sorts) while a headscarf is the literal cloth that covers the hair so your classmate is clearly misinformed about the fact that they aren’t the same. Your intention was not to be Islamophobic but to find a way to ease your symptoms. No one should dictate how you dress and be offended, especially when there’s absolutely no reason. \n\nI would recommend maybe speaking to a teacher or the college counsellor as the way they are treating you is ridiculous and a horrible representation of Muslims everywhere. I hope things get better for you - please don’t stop wearing the headscarf and dressing the way you do if you feel like it’s helping you! 🤍",
            "score": 510,
            "author": "unstablechickenshit",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm certain if OP is in. U.S. this would qualify under the ADA protections as well.",
                    "score": 91,
                    "author": "null640"
                },
                {
                    "level": 1,
                    "comment": "She isn't offended on behalf of her faith or Muslims.\n\nShe's just a modern brat being offended over anything they can, because being a victim is cool in modern culture. It's social points, clout, attention attracting behaviour. \n\nIt's gold dust to attention seekers.",
                    "score": 40,
                    "author": "Skitteringscamper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That sounds... Like you've got some things to work through. I mean, I feel like the rest of us just accepted this person might've been mistaken and moved on. \n\nSome people get offended as a reaction to being told they're wrong, and honestly, tons of entitled boomers come to mind, more than any demographic. This is not a \"modern clout\" thing. \n\nThis is an overreaction, sure, but more likely this person was embarrassed, didn't want to admit their mistake, and doubled down.",
                            "score": 42,
                            "author": "senadraxx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The person you replied to has left at least four comments in this thread complaining about young people wanting to be victimised. It’s really weird and obsessive.",
                                    "score": 37,
                                    "author": "Jamesifer",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wear leather jackets and have friends that are vegan. Just tell her it's not a hajib and that it's just a scarf and if she can't understand that then maybe she's the problem",
            "score": 805,
            "author": "Azraels_Cynical_Wolf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spoiler alert: the offended party is the problem. It is a choice to be offended. It is also ableist for her to be making comments like that, she’s doing this for a medical reason, and that should not be too difficult to understand for someone that is studying at the post-secondary level.",
                    "score": 124,
                    "author": "Valley_valkyrie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Spoiler Alert #2: Also a pretty good chance this story may or may not be true.",
                            "score": 8,
                            "author": "South_Geologist_1591"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That student is simply being unreasonable. Honestly, I'm an exmuslim myself and I think if you asked Muslims on Islam related subreddits then even they would find the whole thing ridiculous. I recommend speaking to a counsellor at your college that you can confide in so there's someone with authority that knows the situation. Heck even feel free to email your official national Muslim organisation (if this is the US then it would be CAIR). That student body is making a meal out of nothing.",
            "score": 860,
            "author": "fathandreason",
            "replies": [
                {
                    "level": 1,
                    "comment": "Non Muslims asking about hijab comes up not infrequently in the Islam sub and usually everyone is like, \"Yeah, no problem, go for it.\"",
                    "score": 31,
                    "author": "RadsCatMD"
                },
                {
                    "level": 1,
                    "comment": "Ex-muslim here as well and I completely agree. Most muslims I know wouldn't care about non-muslims wearing hijabs/scarves etc",
                    "score": 205,
                    "author": "Megumin7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Most muslims I know wouldn't care about non-muslims wearing hijabs/scarves etc \n\nIn fact, this is generally a *requirement* for women on any faith to enter a mosque.\n\nI was in Muscat with my wife recently and she bought a headscarf to wear for the visit (as is required) and dressed in abaya (not required) for it. There was not one complaint about a [quite clearly] not Muslim looking woman dressed in traditional Muslim attire.",
                            "score": 47,
                            "author": "kiwirish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;\tThere was not one complaint about a [quite clearly] not Muslim looking woman dressed in traditional Muslim attire.\n\nNot trying to be argumentative, but it seems like she *did* look like a Muslim woman wearing traditional Arabic/Muslim attire. \n\nOnly pointing this out because Muslims don’t *look* any specific way. It’s a religion with different sects, not a race :)",
                                    "score": 7,
                                    "author": "muddyrose",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I contemplated wearing a hijab for my own religion and i asked my friend (Muslim) for tips. She was so excited to tell me the best ways and where to get one. She said as long as someone is being respectful about it, most won't care what you do.",
                    "score": 47,
                    "author": "No-Appearance1145"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol, tell me youre out of touch with younger people without telling me you're out of touch... Are we playing that game today? \n\nListen, what you're describing is not exclusively a younger-generation thing. Plenty of older folks would get offended that OP doesn't have hair, even. And you're... Offended by the idea of teenagers, apparently? From what we're gathering, this takes place at a college. Different age groups. \n\nOn that note about demographics, I've seen plenty of boomers throw hissy fits bigger than yours when things don't go their way. They gaslight and double down when someone gives them evidence that they're wrong, almost like they feel their entitlement gives them this superpower to change the reality of facts. Do you fall into this group, or do you have some other problem we can unpack in group therapy today?",
                            "score": 15,
                            "author": "senadraxx"
                        },
                        {
                            "level": 2,
                            "comment": "You’re describing the mentality of red hatted individuals of all ages far more than you are today’s teenagers. You should like your entire exposure to young people has been filtered through shitty right wing news outlets.",
                            "score": 3,
                            "author": "nudiecale"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some people just want to be offended.",
            "score": 946,
            "author": "Elvtars426",
            "replies": [
                {
                    "level": 1,
                    "comment": "And then act like they are actually  \"defending\" something xD",
                    "score": 4,
                    "author": "HorizontalPotato"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 22,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please don’t listen to those stupid people who will have the audacity to tell you this knowing your conditions. I’m a Muslim woman and i’m not offended at all actually I’m sorry you have to protect yourself  rather enjoy something must people can. \n\nIf she can’t  express compassion and understanding to you after finding out what you are going through then she is the one who should be ashamed of herself . \n\nDont let people who don’t use their brains correctly hurt you. I hope your condition will get better and I wish you well",
            "score": 108,
            "author": "Technical_Pumpkin_65"
        },
        {
            "level": 0,
            "comment": "No religion or culture has a monopoly on covering your head with cloth. That has been invented at some point or other by every culture who has both heads and cloth. So, damn newr everybody. \n\nThe girl in your class is ridiculous. Ignore her.",
            "score": 32,
            "author": "checco314"
        },
        {
            "level": 0,
            "comment": "Im Muslim\n\nI'm sorry your classmate made you feel like that honestly it's shitty you and everyone else is welcome to wear a hijab or abaya (Muslim women clothes ) or the dudes to wear (thoub)\nThe white clothes men wear\n\nShe just wants to be mad screw her.",
            "score": 267,
            "author": "OBIEDA_HASSOUNEH",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, you'd think that she would be happy that OP was covering herself and being \"modest\".  The more people who wear hijabs / abaya / head coverings that aren't Muslim would help normalize wearing them for everyone else and take away the stigma of wearing them.",
                    "score": 40,
                    "author": "Lin0712",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not to take away from your sentiment, but Muslim laws don't apply to non-Muslims. So the concept of seeing other people dress modestly making us happy isn't a thing. It does help in terms of normalization, if someone needs that.",
                            "score": 17,
                            "author": "moonlitsteppes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some people in the west think they're saving hijabis by making them unacceptable. I don't mind people with no skin in the game showing that we can make the choice for ourself",
                                    "score": 14,
                                    "author": "DaughterEarth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't mind if they do. But it's a neutral reaction on my part, because I don't think these things need to be normalized by everyone trying to do the same thing to make x action more acceptable. \n\nThose types of actions ends up spiraling out into a quandry we all - Muslims and otherwise - put ourselves into and misplaced expectations of what reciprocity should look like. Ik the reality is much more complicated, just one of those things that grates me lol.",
                                            "score": 4,
                                            "author": "moonlitsteppes",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "FFS. Ignore this person. I'm really sorry to hear about your medical issues.",
            "score": 18,
            "author": "NerakYak"
        },
        {
            "level": 0,
            "comment": "Muslim here\n\n\nUr classmate doesnt have the right to be offended. You're literally wearing it for medical reasons. Getting on someone's bad side doesnt mean ur an enemy to their religion.",
            "score": 15,
            "author": "Ghost_Reaper123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Forget that. Even if she wasn't doing it for medical reasons, the classmate wouldn't be justified.",
                    "score": 2,
                    "author": "GodkillerArthur",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wasn't implying it wouldnt be okay if she didnt have a medical reason\n\nEither way, OP isnt in the wrong here. Medical or not. \n\nIt's the act of covering up yourself that's a part of islam, not the hijabs themselves. And even so, if OP WERE to want to just cover herself up, muslims should encourage her, as it's what we believe is good.",
                            "score": 3,
                            "author": "Ghost_Reaper123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That Muslim student needs a detailed lecture in Islam and Humanity if she tells you that you cannot wear your head scarf. If your head scarf makes her religion flare up she needs to study Quran again and in detail. I can even provide you with teacher for her.",
            "score": 14,
            "author": "Nuttercase2",
            "replies": [
                {
                    "level": 1,
                    "comment": "* sorry on behalf of us all",
                    "score": 4,
                    "author": "Nuttercase2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a Muslim hijabi woman. Hijab is not exclusive to Muslims and throughout history it never was.\n\nWear whatever you want and I am so sorry about what that girl said to you, a huge part of Islam is being kind to others and she dropped the ball, big time. \n\nKeep wearing the hijab as it brings you physical comfort, you have every right to do that, you don’t owe anyone an explanation.",
            "score": 46,
            "author": "Secretagenta92",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I think if most Muslims heard OP's plight they'd be happy that she could use hijab techniques for her health. Youth pastors would go crazy, \"hijab is not only for modesty and protecting your beauty, it's a MEDICAL DEVICE that will PROTECT YOU. Tell ya friends\" XD",
                    "score": 22,
                    "author": "sszszzz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m sorry this is happening to you and hope you’re well. \nI’m Muslim and this isn’t how we behave, they just be mad to be mad atp. \nHope your condition gets better!",
            "score": 37,
            "author": "vainhope_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "as a fellow muslim girl here tell her to calm down , I have friends who are christians but veil and I taught them to wear it muslim style, we aren't the only religion to wear head wraps just the most prominent one who still do",
            "score": 36,
            "author": "somali-beauty",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeah, you’re allowed to wear what you want. A hijab is not a specific Islamic thing, other religions encourage women to cover their hair too. \n\nHonestly one persons opinion doesn’t mean it’s offensive. If it works for you continue wearing what you want. \n\nHowever your clickbaity title is a bit shitty as one person got offended and at no point did they say anything about your medical condition.",
            "score": 79,
            "author": "Beautiful-Toe-5026",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'd be tempted to advise somebody about your \" interaction\" with the Muslim Student union member within either the Student Union or the admin of the college. \n\nSimply so that they are aware of the situation &amp; can simply advise that this is a medical issue not Religious one. Both of which have legislation covering them.",
            "score": 8,
            "author": "TillyMint54"
        },
        {
            "level": 0,
            "comment": "I'm a Muslim and I'm offended of your Muslim classmates' reaction, you could tell them you know Islam gives very big importance to life and one's well being and that you could consider becoming Muslim but because of their reaction you changed your mind checkmate on them and they'll burn in hell because they pushed a potential Muslim.\n\nOh and I know other checkmates in your situation.",
            "score": 10,
            "author": "Sure_Moment926"
        },
        {
            "level": 0,
            "comment": "Hijab is WAY more than just the scarf, it’s an entire religious concept relating to modesty and religion. You are NOT wearing a hijab, you are wearing a headscarf. And headscarves don’t belong to anyone because of how common they have been throughout history! \n\nThe only thing I’d recommend is looking up tutorials for other religions/cultures that use headscarves- if you use/wear your headscarf in a traditionally hijab-style way, I can see why she may assume that you are Muslim. But as long as you have respect for Islam and are honest about why you wear a headscarf, there shouldn’t be any issues. And if they are, it’s because she’s rude- not because of anything you’ve done wrong.",
            "score": 8,
            "author": "ThatWanderGirl"
        },
        {
            "level": 0,
            "comment": "Interestingly enough, most religions have woman covering their heads. Modesty is a thing. \n\nI grew up Catholic and lots of woman do veiling or they wear a lace head covering. \n\nYour health is more important than a religion.",
            "score": 8,
            "author": "MissMurderpants"
        },
        {
            "level": 0,
            "comment": "Nah im Muslim and it really doesn't matter, wear whatever it's not offensive , those western Muslims are weird",
            "score": 8,
            "author": "SlightlyOutOfTone"
        },
        {
            "level": 0,
            "comment": "Did you actually offend all Muslims at your school?\n\nOr did you upset one Muslim Karen who was looking for a way to be upset?\n\nHonestly, if you really want to reach out and find a solution, consider going to the Muslim student union or student group and talking to them about this.\n\nReasonable people -- and yes, Muslims are people, and are quite capable of being reasonable -- will understand that you are just trying to cope with a severely discomforting set of medical conditions.\n\nI'd bet it is only Muslim Karen over here who is actually bothered.",
            "score": 25,
            "author": "poolpog",
            "replies": [
                {
                    "level": 1,
                    "comment": "And it’s quite possible that she has been harassed for wearing her hijab and has strong feelings about it because of that. That’s not your fault, nor your issue to deal with, and it doesn’t excuse her behaviour towards you.  But if you want to be the better person, talk to her (or other Muslim women) about their experiences and what it means to them, and get their help in dealing with your issues.\n\nBecause they more than likely have solutions to aspects of being covered all the time that you’ve noticed but not fixed, and will probably sympathize with you more than others.",
                    "score": 6,
                    "author": "thetwitchy1"
                },
                {
                    "level": 1,
                    "comment": "I loled at muslim Karen. \nYeah, as a hijab wearing muslim, that sister has a lot of reflecting to do.",
                    "score": 3,
                    "author": "House_of_the_rabbit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What an asshole. Of course man, you could choose not to be sick or suffer and protect their fragile ego.",
            "score": 5,
            "author": "Potironronne"
        },
        {
            "level": 0,
            "comment": "Islam does  not own scarves. Your silly classmate just wants to pick a fight.",
            "score": 17,
            "author": "Obrina98"
        },
        {
            "level": 0,
            "comment": "“Enemy of Islam” lmao one woman got pissy with you calm down.",
            "score": 46,
            "author": "JoeBidenisAbeSimpson",
            "replies": [
                {
                    "level": 1,
                    "comment": "😂😂😂",
                    "score": 6,
                    "author": "bibsmalton"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You need to speak with your school and make them aware/ask for accommodations as soon as possible.\n\nYou need to do it now so you'll get ahead of possible weaponised racism accusations.\n\nYou need to report harassment you're experiencing",
            "score": 26,
            "author": "16bitsISenough",
            "replies": [
                {
                    "level": 1,
                    "comment": "She needs to escalate this to an authority figure before the offended student spreads malicious rumors about her. Getting ahead will allow her to control the situation.",
                    "score": 9,
                    "author": "Bored_Schoolgirl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;how dare I wear the hijab for slefish purposes.\n\nKeeping yourself from suffering is more important than being called \"selfish.\" Technically, it can be called a selfish reason, as it is something you do for yourself. *But,* doing something for yourself is not wrong, as long as it doesn't cause unnecessary harm to someone else. \n\nThe word selfish has a negative connotation to it, even though it is not always a bad thing. For example, harming someone else in self-defense is technically selfish, as you are doing something to protect *yourself.* But that doesn't mean that it is wrong to do so, because it is for your own safety. \n\nSo, 1) you wearing the scarf like a hijab is for your safety, as it protects you from physical harm from your medical condition. 2) it doesn't truly hurt anyone, and even if it does offend some people, it is a miniscule amount of harm that is being done. \n\nEven if you are accused of being selfish, you shouldn't care in this case. You are not doing anything wrong.",
            "score": 5,
            "author": "barelyasociopath"
        },
        {
            "level": 0,
            "comment": "Yeah that’s not being an “enemy of Islam” thing. That’s just an individual who wants to be a victim",
            "score": 5,
            "author": "Sir_Lagz_Alot"
        },
        {
            "level": 0,
            "comment": "Muslim here, who isn't offended.\n\nI'd advise getting lightweight cotton hijabs, especially during summer and it's better for skin conditions. \nMost Western fashion brands do modesty wear now too.",
            "score": 5,
            "author": "ColonelBagshot85"
        },
        {
            "level": 0,
            "comment": "Oh dear. Hijab predates Chrisitanity by over 2,000 years. Islam wasn't even a thing until 700ish years after Christianity had been established (using christianity here as the dating reference, not saying one religion is better than the other). My point is, hijab was a part of cultural dress long before it became associated with Islam.\n\nAnd as others have pointed out, many other religious women cover their hair.\n\nI don't wear hijab but I do often partially cover my hair (my style is more like the Nigerian gele, not a full one but partial) and that combined with the modest way I dress leads some people to assume I'm religious. When folks round-about inquire I just say mmm-hmmm. If they ask directly about a particular religion, I just say 'I am not of that particular faith' and then immediately change the subject or walk away.\n\nPeople really need to mind the business that pays them, and in turn, people need to really learn it pays you no quarter to explain your business to strangers. Sometimes it's in your best interests to avoid or shut these conversations down off top.",
            "score": 7,
            "author": "earthgarden"
        },
        {
            "level": 0,
            "comment": "Wait till she learns about nuns",
            "score": 6,
            "author": "ThDutchMastr"
        },
        {
            "level": 0,
            "comment": "As a Muslim myself, she had the audacity!!\n\nI live in southern África. A lot of women wear hijab, and they are not Muslim.\n\nThere is no compulsion in Islam. We need to show respect in order to be respected.\n\nShe does not speak on behalf of any hijabi but herself",
            "score": 6,
            "author": "anaisa1102"
        },
        {
            "level": 0,
            "comment": "Muslim here, you are doing nothing wrong.\n\nTell that classmate that they aren’t being a good Muslim, and instead should listen before going straight to false outrage.",
            "score": 4,
            "author": "Spirited-Armadillo-1"
        },
        {
            "level": 0,
            "comment": "Head scarfs have been worn throughout history by pretty much every society. Hell, the Queen of Britain used to frequently wear head scarves, in Europe, they used to wear wimples, and nuns still wear wimples.\n\nNo one culture or society owns the rights to head scarves/ coverings.",
            "score": 6,
            "author": "a_man_has_a_name"
        },
        {
            "level": 0,
            "comment": "As a Muslim I'd say it's totally fine if you wear the hijab especially for medical reasons. Even if you have no reason to wear it but just wanted because you liked it, it's still not a problem! She's just being toxic. You're not an asshole.",
            "score": 6,
            "author": "antlereye"
        },
        {
            "level": 0,
            "comment": "Anyone can wear the hijab as long as your being respectful, which you are.",
            "score": 6,
            "author": "Altruistic_Usual_855"
        },
        {
            "level": 0,
            "comment": "As a muslim please dont listen to them, their head is too far up their ass to realise how stupid they are being",
            "score": 4,
            "author": "vizualwarriorz08"
        },
        {
            "level": 0,
            "comment": "Omg what wrong with people . Tell her that many women wear head wrap. It's not a Muslim thing",
            "score": 4,
            "author": "Single-Being-8263"
        },
        {
            "level": 0,
            "comment": "I’m a Muslim woman, I’ve thought about this over and over and I still can’t find a reason why she would be offended that you’re wearing a hijab. She needs to mind her own business and if she doesn’t then just report her for discrimination.",
            "score": 4,
            "author": "Lesdom22",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This girl is offensively making a mockery of your medical condition.",
            "score": 4,
            "author": "wont_eat_it"
        },
        {
            "level": 0,
            "comment": "I, too, am a non-Muslim who often wears hijab when I go outside to protect my (ageing and very sensitive) skin from too much contact with allergens.  I have been doing this for years now, since a Muslim friend suggested it might help -- and it does.  Having lived in more than one dominantly Muslim country, having many *observant* Muslim friends in my home country, I have *never* been told it was offensive to wear \"for selfish reasons\".  Men rarely comment, women have been very generous with teaching different ways to wrap, to pin, etc.\n\nClearly, the Muslim kids at your college do not have enough to do.  Take it over their heads to a local imam to get a ruling.  My bet is he'll side with you.",
            "score": 3,
            "author": "NannyAnnaple"
        },
        {
            "level": 0,
            "comment": "I say this as a Muslim, there are many cultures and religions that practice head coverings. A head covering is not a hijab by nature, they need to educate themselves. The girls in your college are bullies they have no right dictate what you do or do not wear. The problem isn’t Islam the problem is they’re bullies. If they continue to harass you speak to the a senior member of staff. You do not have to justify what you wear to anyone.",
            "score": 4,
            "author": "a-_rose"
        },
        {
            "level": 0,
            "comment": "As a Muslim myself i have to tell you that in no way whatsoever what u did is offensive. What the other person did was offensive and has absolutely nothing to do with the Islamic teaching. Hijab \"as some may want to call it\" is just a way to dress to show modesty... a lot of Christians and Jewish people wear it with pride as a form faith practice. some do it all the time, some on religious occasions. So please don't let poeple's ignorence bother u. She was just an AH  and a disgrace to the faith she claims to belong to. \nAll humans are equal in the eyes of god and everyone is free to do what he wants and dress as he wishes with or regardless of his faith or health problems. That said, i am sorry you have to go through all of that and i wish you get soon better. And remember that with all what you're going through at least you're not an AH, so keep the smile and get better soon ☺️",
            "score": 4,
            "author": "Brilliant-Talk-7468"
        },
        {
            "level": 0,
            "comment": "OP, just so you're aware: most athletic suppliers sell clothing that is light and breathable but also a strong sunblock. Some of it is even very fashionable and not just super tight yoga stuff.\n\nI highly recommend you look into [Sun Sleeves](https://www.rei.com/product/203635/rei-co-op-active-pursuits-sun-sleeves). They also sell them for your legs. They act as SPF 50+ and easily fit with shorts and t-shirts. Even short shorts. Though, they're not going to work for a tank top.\n\nI have worn these while biking across hot dry deserts in the southwest as well as in stupid hot and humid conditions in the southeast. They breath very well and they keep me from getting even a little red despite being one of the palest people you will ever meet.\n\nYou can easily take them off and put them on when going from outside to in or inside to out.\n\nI hate slathering myself in sunscreen every day, but I love the outdoors. These, and other items like them, let me enjoy the hell out of the summer without worrying about applying sunscreen every few hours and while being very active.",
            "score": 5,
            "author": "nsfredditkarma"
        },
        {
            "level": 0,
            "comment": "First of all I'm muslim and we have no problem with anyone wearing the scarf or covering and not being muslim. That girl is wrong and dumb lmao. Don't listen to her. Sorry she was so nasty to you about it. But she sounds like a 7 yr old bc she's completely wrong about what she told you.",
            "score": 4,
            "author": "soccersprite"
        },
        {
            "level": 0,
            "comment": "This sounds super made up.",
            "score": 13,
            "author": "Negative_Froyo_1014",
            "replies": [
                {
                    "level": 1,
                    "comment": "Account with 1 post and no comments. People here are so gullible.",
                    "score": 5,
                    "author": "HellsNoot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you ever heard of a throwaway account?",
                            "score": 2,
                            "author": "painispleasurexx"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My exwife had solar urticaria. A dermatologist told her the key to it was sun exposure and or a tanning bed, while taking Pepcid in the morning and Benadryl at night. The rash is a histamine response in your body. By deliberately exposing yourself to UV light you’ll eventually deplete your histamine levels, or that’s how it was explained to her. The Pepcid and Benadryl are histamine blockers and will help to mute the breakout reaction. It did take a little while but eventually, she did get to where she had zero response to the sun. You might try this or see about getting in with a dermatologist before, but this guy had a tanning bed in his office and said he could get tanning session covered by insurance for medical purposes.",
            "score": 8,
            "author": "Mursemannostehoscope"
        },
        {
            "level": 0,
            "comment": "Just point to that verse in the Bible that says Christian women are also supposed to wear head coverings and tell them you're extremely old school.",
            "score": 3,
            "author": "Pterodactyloid"
        },
        {
            "level": 0,
            "comment": "Your class mate can go fuck herself. Women across religions and cultures cover their heads with scarves. You haven’t done anything wrong",
            "score": 3,
            "author": "123shelp"
        },
        {
            "level": 0,
            "comment": "You’re not wearing a hijab. You’re wearing a scarf. There’s a difference. The use of a scarf to cover your head isn’t exclusive to Islam. Anyone can wear one. I just left a cancer center from a doctor appt. Do you know how many women were wearing headscarves? I guarantee they weren’t all Muslim. \n\nIt sounds to me like the girl was embarrassed that she assumed you were Muslim and this is her reaction.",
            "score": 3,
            "author": "kikivee612"
        },
        {
            "level": 0,
            "comment": "Women all over the world have covered their hair in various ways, for centuries. Wear your headscarf.",
            "score": 3,
            "author": "xthecollectorx"
        },
        {
            "level": 0,
            "comment": "If you were going about telling people you were Muslim when you're not, and/or using the headscarf as a way of making fun of Islam or any other religion then yes, the other student would have a right to say something about it.\n\nYou are wearing a scarf as treatment/protection for a serious medical issue. The other student needs to shut up, listen to what you have to say and apologise for jumping down your throat and making nasty accusations. You rock your headscarves.",
            "score": 3,
            "author": "Potaytoz"
        },
        {
            "level": 0,
            "comment": "Everyone wants to be a victim",
            "score": 3,
            "author": "FTE710"
        },
        {
            "level": 0,
            "comment": "As a Muslim woman, tell her to shove it! You do what makes you comfortable",
            "score": 3,
            "author": "Bluetoe4"
        },
        {
            "level": 0,
            "comment": "I’m a non practicing Muslim. That girl has her head high up her own a$$. It’s possible she was coerced into wearing her hijab and is now just being a bumhole to anyone who tries to wear a scarf voluntarily (for whatever reason). \n\nI wouldn’t bother explaining to her your medical condition. She’s a loser and doesn’t know what she’s talking about. Anyone Islamic I know would be more than happy to show you how to wear a scarf or new ways to wrap one. (I’ve seen really cool ways to do a turban thing on IG).\n\nThey might be curious, sure, why you’re wearing one, but they react the way that girl did. She’s ‘special’.",
            "score": 3,
            "author": "bibsmalton"
        },
        {
            "level": 0,
            "comment": "I can't really comment on any of that, but I can share that Orthodox Jewish women also cover their hair and we have different scarf-tying customs you might want to try if the Muslim-appearing ways of tying and securing are causing you problems\n\nJewish women wear snoods, scarves/tichels, turbans, \"falls\" that have a piece of fake hair along the back, hats, etc. Satmar women actually shave all their hair and then cover \n\nWe don't cover our necks, so the tying style looks different to a Muslim scarf swept across the neck or an Indian scarf that is laid across the top of the head or thrown across the chest and over the back shoulder \n\nNon-Muslims usually can't tell the difference [a scarf is a scarf], but it *may* help show the Muslim students that you aren't trying to copy their culture",
            "score": 3,
            "author": "huevosputo"
        },
        {
            "level": 0,
            "comment": "You know what? Opinions are like assholes. Everyone has one and they all stink. The only one that matters is yours because you live with it. If they aren’t fucking you, feeding you, or financing you then their opinions are irrelevant.",
            "score": 3,
            "author": "DrTwilightZone",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well said!",
                    "score": 2,
                    "author": "CanadianHeadbanger"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Guess she's never heard of nuns either huh.",
            "score": 3,
            "author": "skorletun"
        },
        {
            "level": 0,
            "comment": "People of colour in the US generally take cultural appropriation way too seriously. As a Muslim myself your not doing anything wrong.",
            "score": 3,
            "author": "the-grape-next-door"
        },
        {
            "level": 0,
            "comment": "Up until recently, Saudi law used to require all women, even non-Muslims, to cover their hair out of modesty. Would that have been a mockery according to your classmate? I'm genuinely perplexed.",
            "score": 3,
            "author": "eveninghope"
        },
        {
            "level": 0,
            "comment": "Just because you're wearing a scarf doesn't necessarily mean you're mocking a religion. Wear that scarf and enjoy not breaking out into painful hives",
            "score": 3,
            "author": "Hello_Hangnail"
        },
        {
            "level": 0,
            "comment": "Tell her it’s not a hijab 😧 she sounds nuts. Me and my sisters wear all types of turbans and headscarves. We not muslim and no one ever assumed we were. So yea, ignore that girl.",
            "score": 3,
            "author": "FloraWinx"
        },
        {
            "level": 0,
            "comment": "You need to do this for medical reasons so there is no other explanation needed.",
            "score": 3,
            "author": "PurpleSailor"
        },
        {
            "level": 0,
            "comment": "When someone gets offended it's their problem not yours.",
            "score": 3,
            "author": "SonStatoAzzurroDiSci"
        },
        {
            "level": 0,
            "comment": "One person, let alone a college girl, it's not the representative of a religion.",
            "score": 3,
            "author": "pdeboer1987"
        },
        {
            "level": 0,
            "comment": "I fail to find the reasoning of why thats offensive. It's not a joke and you are doing it for medical reasons.",
            "score": 3,
            "author": "Panda_Photographor"
        },
        {
            "level": 0,
            "comment": "You don't have to be Muslim to wear hijab.",
            "score": 3,
            "author": "pchandler45"
        },
        {
            "level": 0,
            "comment": "Everyone's offended by everything. It's not your job to worry about what they worry about. You do you.",
            "score": 3,
            "author": "DieingFetus"
        },
        {
            "level": 0,
            "comment": "Muslim here - you’re NOT an asshole. Your health comes first, your explanation makes sense - keep doing what you need to in order to be safe and healthy. \nIn regards to the hijab &amp; classmate reactions - clearly they need to be less judgemental and learn to listen and understand where different people come from. That’s just a young person lacking life experience getting all bothered over a non-issue.\n\nMy prayers for your recovery and best of luck to finding peace and happiness in these trying situations you’re going through.",
            "score": 3,
            "author": "Mr_Khan2081"
        },
        {
            "level": 0,
            "comment": "Bit of a dramatic title after your experience with one person.",
            "score": 9,
            "author": "GreytracksuitPants"
        },
        {
            "level": 0,
            "comment": "It's never the people who are actually from these cultures that get offended. It's always the vapid, second-generation American who likes the idea of showing off her ethnic identity without actually understanding what it is.",
            "score": 5,
            "author": "TheLolomancer"
        },
        {
            "level": 0,
            "comment": "I had cold urticaria growing up, and that was hard. My mom has lupus so she has to limit her Sun exposure too. Make sure that you’re getting enough Vitamin D!",
            "score": 2,
            "author": "unusually-so"
        },
        {
            "level": 0,
            "comment": "That's total bulshit. You can do what you need to protect yourself. Frankly, you aren't doing it to mock or offend, and it isn't selfish to look after your own health. This other person can take a flying leap. Tell them to stop being such a little sensitive bitch, and try breaking away from thier tiny world view and see things from another perspective. You have a serious medical condition that requires you to protect yourself and that's all there is to it.",
            "score": 2,
            "author": "captainawesome92"
        },
        {
            "level": 0,
            "comment": "Your classmate is just being a dweeb. Islam doesn't even have a monopoly on dressing modestly. Like I understand why you are worried but it is the classmate who is being a prick here 100%",
            "score": 2,
            "author": "LoomisKnows"
        },
        {
            "level": 0,
            "comment": "Hey, under the ADA your solar thing is a recognIzed disability. Get a handicapped placard for your car if you drive. Less time in the sun.",
            "score": 2,
            "author": "hiyabankranger"
        },
        {
            "level": 0,
            "comment": "I am sorry this happened to you. Wearing scarf that represents a hijab is totally fine, and you have a valid reason. Its not mentioned anywhere in islam that people from other religion cannot wear what muslims wear. Infact a lot of muslims dont follow the ruling on how the religion asks us to be dressed, thats their problem. \nYour classmates are just stupid. They unnecessarily got triggered. They are ignorant about the religion,  doesn't mean you should hate Islam. \nAnd it's also forbidden to force Islam onto someone, the least they can do is advice, and it's upto to them to listen.",
            "score": 2,
            "author": "MeGoL1"
        },
        {
            "level": 0,
            "comment": "Ignorant insensitive snowflakes will be offended nonetheless. Damned if you do ,damned if yo don't.\nSo frick her fragile insecure opinions and go on rocking your new fashion style, which improves your Quality of Life. She ain't the one who has to suffer through two difficult diseases.\n\nEdit: her opinions are of her own, which she hides behind the cover of religion. I am calling her kind out aka (Karens) not respectful Muslims",
            "score": 2,
            "author": "GamerMasis"
        },
        {
            "level": 0,
            "comment": "You unfortunately ran into a very unkind person. You have valid medical reasons for your clothes and Muslims don't own all headcoverings and modest clothing designs. They really don't.",
            "score": 2,
            "author": "Fredredphooey"
        },
        {
            "level": 0,
            "comment": "Modesty is universal! Also, Christian women were wearing headcoverings long before Islam was even funded.\nWear whatever you feel comfortable and healthier in dear ❤️",
            "score": 2,
            "author": "iwillneveradmitthis"
        },
        {
            "level": 0,
            "comment": "You met one of the Karens of muslims community. These kind dont even spare the muslims let alone other religion, that’s because they are taught weirdly that islam is theirs to protect. Unfortunately, they don’t understand that neither of the rulings in islam are forced or are pushed down other throats.",
            "score": 2,
            "author": "Theuserizabitch"
        },
        {
            "level": 0,
            "comment": "I'm Muslim and I wear hijabs in public. Your classmate needs to chill and reassess her understanding of appropriation because it's not about how covered up someone is (or isn't) in public. I'm going to assume she's about your age, OP? She's still young but that doesn't mean she shouldn't be able to understand if it were pointed out to her.\n\nAnd going back to the whole reassessment thing, she also needs to reflect on her implicit ableism because that's worse than assuming someone is going out of their way to \"dress offensively.\"",
            "score": 2,
            "author": "acactustransplant"
        },
        {
            "level": 0,
            "comment": "You’re a ninja plain and simple",
            "score": 2,
            "author": "pedrofantastic"
        },
        {
            "level": 0,
            "comment": "Muslims aren’t the only people that cover their head because of religion so that person really can’t say that😭",
            "score": 2,
            "author": "maddie2092"
        },
        {
            "level": 0,
            "comment": "What a dramatic and click baiting title 🙄 No one's calling you an enemy, you wore something that is obviously and clearly a symbol of a particular religion, then a t like a victim when people assumed you were that religion (and tried to include you in something). There are plenty of ways to wear a scarf. Don't act confused.",
            "score": 2,
            "author": "Confident_Ad_7947"
        },
        {
            "level": 0,
            "comment": "Your health is more important than her comfort. Plenty of people of different religions and of no religion at all wear similar head coverings, perhaps if you want to keep the peace maybe you could look up a different way to wear your scarf, and if she tries to raise a stink over it you could then point out you tried to accommodate her by changing a style so it doesn't look like a hijab. Ultimately, though, you shouldn't sacrifice your health for somebody else if you don't want to, you shouldn't be in pain so she can be comfortable. I'd honestly report this to somebody, especially if this condition is in your files.",
            "score": 2,
            "author": "krisismouse"
        },
        {
            "level": 0,
            "comment": "She is a fucking idiot don't mind her. It's just a scarf. You don't have to get her permission to wear one. Next time she bothers you tell her to fuck off.",
            "score": 2,
            "author": "Lost-Crow1235"
        },
        {
            "level": 0,
            "comment": "Wrap it \"Little Edie\" style. She had alopecia and became a fashion icon ✨",
            "score": 2,
            "author": "BellaDonnaDrag"
        },
        {
            "level": 0,
            "comment": "Do you think you’re in danger from the Muslim Student Union now that they’ve declared you an enemy of Islam?  If you think you might be, you may want to talk to the school about it, walk with buddies, etc.\n\nAlso, if the glue gave you an incurable skin disease, are you able to hold the glue company accountable?",
            "score": 2,
            "author": "sabrefudge"
        },
        {
            "level": 0,
            "comment": "&gt;I had no clue that what I was doing could actually be deemed offensive.\n\nWhat is seen as offensive is purely subjective. What offends you might not offend others and something you deem innocent could start a riot on the other side of the planet.  \n\nYou can't double guess yourself with every breath you take. If people get offended, let them. It's their problem to deal with, it's the choice they made for themselves. They've decided to be upset over something trivial.  \nEven if you were voluntarily insulting, their behaviour is theirs to control, and it's only up to them to deal with whatever situation they are facing.  \n\nSaying \"I'm offended\" is meaningless. It doesn't do anything, it doesn't justify any action made after, it doesn't mean rights were infringed, or laws broken.  \nSaying \"I'm offended\" is the equivalent of saying \"I can't deal with this situation, you need to worry about how **I** feel and you need to cater to **my** whim and needs, regardless of your own feelings\".  \nIt says \"I'm more important than you\".  \n\nThis goes for any belief - religious or not - anywhere, anytime.  \n\nPeople are offended?  \n\nFuck 'em. Not your problem.",
            "score": 2,
            "author": "bordain_de_putel"
        },
        {
            "level": 0,
            "comment": "Short answer: you can't please everyone and you aren't malicious or obnoxious in your approach with this. Let them be in their feelings. They don't know you and your situation and if they don't care to ask, that shows how much you should care about their feelings on the matter. Life isn't black and white, all religious or all skin color etc. Respect to it is important but respect to INDIVIDUALS is just as important.",
            "score": 2,
            "author": "MTVcribbs"
        },
        {
            "level": 0,
            "comment": "Your classmate is soft and selfish. If you have a viable medical condition and the only \"offensive\" thing that you are doing is covering yourself, then they need to check themselves. If they give you any grief - any at all - let an authority figure know. You shouldn't have to take any abuse for what you wear, whatever the reason.",
            "score": 2,
            "author": "Ghost_of_P34"
        },
        {
            "level": 0,
            "comment": "&gt;she said … how dare [you] wear the hijab for selfish purposes.\n\nexcept, it’s not a selfish purpose, and is literally in response to a medical condition. just ignore her, if she takes action, she’s in the wrong.",
            "score": 2,
            "author": "immickle"
        },
        {
            "level": 0,
            "comment": "Religions are all myths.  Don’t let them bother you.",
            "score": 2,
            "author": "gitarzan"
        },
        {
            "level": 0,
            "comment": "Don't worry, islam is already the enemy of everyone.",
            "score": 2,
            "author": "Koor_PT"
        },
        {
            "level": 0,
            "comment": "Fuck her and anybody who agrees with her for looking down on a disabled person without even trying to understand.",
            "score": 2,
            "author": "bewarethetreebadger"
        },
        {
            "level": 0,
            "comment": "Muslim here who believes it's pretty much one's choice to wear a head scarf/hijab. Head scarf is an article of clothing that does not belong to a religion or a culture. The Muslims at your college are ignorant AHs. You're doing nothing wrong and even if someone considers it a Muslim cultural dress, I , as a Muslim, invite anyone and everyone here to wear it and celebrate my culture with me.\n\nI don't know much about either of your conditions but I hope you recover from them. More power to you.",
            "score": 2,
            "author": "whitedranzer"
        },
        {
            "level": 0,
            "comment": "You havent made yourself an enemy of islam, you've just realised that your friend is a moron.",
            "score": 2,
            "author": "raargfkys"
        },
        {
            "level": 0,
            "comment": "Your classmate is an idiot, speaking as a muslim myself, fuck her. You do whatever you need to to feel better about yourself, and like many commentary are saying, head coverings aren't solely and islamic thing.\n\nI'm sorry you're going through this, I hope you come to a point where it becomes a strength of yours instead of a point to negative self esteem. Good luck.",
            "score": 2,
            "author": "IndifferentFento"
        },
        {
            "level": 0,
            "comment": "OP you are NTA\n\nThe other girl mentioned in this story doesn’t get to decide who wears what, it is everyone’s own choice.\n\nI am not saying that you owe her a justification but personally I think I would just because I think she misunderstands.",
            "score": 2,
            "author": "benwill79"
        },
        {
            "level": 0,
            "comment": "Muslims don’t have a monopoly on headscarves.",
            "score": 2,
            "author": "Revolutionary_Bed431"
        },
        {
            "level": 0,
            "comment": "Don't listen to religious nuts that are always looking for things to get offended about. You know you're not purposely offending anyone and that's all that matters.",
            "score": 2,
            "author": "Crimsonghost95"
        },
        {
            "level": 0,
            "comment": "The offended girl can straight up go fuck herself.\n\nNobody owns wearing scarves, protecting themselves from something harmful, or even just choosing to dress that way for modesty or personal comfort.\n\nDress your body as you see fit.  You did absolutely nothing wrong.",
            "score": 2,
            "author": "SummerBirdsong"
        },
        {
            "level": 0,
            "comment": "Im a Muslim and I do not see anything wrong with what you're doing, I think she is over reacting TBH",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Whoa your Muslim classmate is completely wrong. You’re not mocking us at all. Sorry you had to deal with that, and you’re not anyone’s enemy except for that weirdo who probably is a crazed progressive who obsesses about intersectionality and cultural appropriation.",
            "score": 2,
            "author": "Wonderful_Pace_5139"
        },
        {
            "level": 0,
            "comment": "I am a Muslim and I don't agree with the student/s who got offended at a non-Muslim wearing a hijab. There isn't harm in wearing hijab. It's not exclusively for Muslims only. Wear what you need to protect yourself.",
            "score": 2,
            "author": "laygo109"
        },
        {
            "level": 0,
            "comment": "Fuck anyone gatekeeping religious clothing. As long as you're not hurting others, how much you participate in any religion - whether you just wear the clothing, pray once a year, or anything else - is not anyone's business. Dress up like the pope and participate in Hindu traditions, why should anyone be bothered?",
            "score": 2,
            "author": "appropriate-username"
        },
        {
            "level": 0,
            "comment": "Hey OP,\n\nI have cholinergic urticaria (same thing but from heat and not sunlight). I struggled for years with it and had doctors tell me the same thing that there was no cure. \n\nEventually I had a doctor who looked at food allergies. Turns out I am allergic to cow dairy and when I avoid cow dairy my urticaria is reduced a lot. You may want to explore some food restrictions and see if that is also helpful for you",
            "score": 2,
            "author": "Tharn11"
        },
        {
            "level": 0,
            "comment": "Hello, orthodox christian (eastern european) women wear head scarves too, if that helps you as an excuse in the future, it wouldn't be offensive if you do so as well (and dont practice the religion). You can always lie and say your grandmother is oldschool and encourages you to wear it for modesty, to protect your head from the sun, or something too lol. It is a different way of tying it than a hijab though. You may be asked if you are eastern european - if you dont mind that",
            "score": 2,
            "author": "forestly"
        },
        {
            "level": 0,
            "comment": "The muslims I know would be offended by the insinuation that the coverings can only be worn by muslims for 2 reasons:\n\n1.\tTo them it’s clothing like any other. It’s like women wearing a bra because that’s their level of moral covering\n2.\ttheir religion says women SHOULD wear it. That’s like a Christian getting mad that a non Christian is waiting until marriage before sex",
            "score": 2,
            "author": "garry4321"
        },
        {
            "level": 0,
            "comment": "Muslims aren't the only ones who wear head coverings. If you aren't wearing it for Muslim religious reasons then it's not a hijab.",
            "score": 2,
            "author": "tabbycat4"
        },
        {
            "level": 0,
            "comment": "Just tell her to read the hadiths that mention the head covering in islam first started to avoid getting raped by followers of the prophet, not devotion.",
            "score": 2,
            "author": "Hauntcrow"
        },
        {
            "level": 0,
            "comment": "You do not need to bend the knee to people who are offended for the sake of being offended. \n\nYou do not exist to live up to their expectations nor are you obligated to apologize for trying your best to cope with the way your condition makes you feel.",
            "score": 2,
            "author": "blitzlurker"
        },
        {
            "level": 0,
            "comment": "People can’t gatekeep wearing clothes",
            "score": 2,
            "author": "AmbientAvacado"
        },
        {
            "level": 0,
            "comment": "Sometimes you have to just laugh in someone’s face",
            "score": 2,
            "author": "j2spooky"
        },
        {
            "level": 0,
            "comment": "Hi, As a middle eastern Muslim I really wanted to interject and say that this classmate is absolutely wrong. If she had any sort of sense, she would know that it is a head covering, and it is not something that is the icon of Islam. If you walk into the middle east, you would see people from all religions wearing a headscarf/head covering. Nuns for instance, wear head coverings for modesty reasons as well as establishing their occupation.   \n\n\nThis girl needs some serious re-educating, and she needs to stop gate keeping. Headscarves are not something to hinder other people from wearing, for any reason. Ever. This is extremely inappropriate behavior coming from her, and if this classmate continues to be rude, then please report her, because this is literal discrimination. This is extremely vile and inappropriate behavior, and I'm very sorry you experienced this.   \n\n\nI'm wishing you all the best, and also I would like to recommend silk scarves, as they help to keep the head cool as well as being thin enough to prevent moisture and humidity. They're just all round great. &lt;3",
            "score": 2,
            "author": "Ray_DiValentino"
        },
        {
            "level": 0,
            "comment": "Head covering is not restricted to Islam. You will see women across countries, continents wearing a head cover of various kinds. It's not your fault. Do not be guilty",
            "score": 2,
            "author": "Abundancehappiness"
        }
    ]
}