{
    "id": "148jycf",
    "score": 0,
    "title": "I stopped being a nice guy and I am doing much better with women",
    "author": "Defiant-Eye-9909",
    "date": 1686675239.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/148jycf",
    "media_urls": [],
    "other_urls": [],
    "postText": "For most of my life I have been a good guy, moral, respectful, not aggressive. I would ask women on dates instead of making moves, I never slept with women on the first date and was only interested in serious relationships.\n\nA few months ago, I got sick of this getting me nowhere, I could see that everyone my age was sleeping around and not taking things seriously. I decided to change things up and be more a player, casually date, make moves early, sleep with women early on and so on.\n\nAnd I am sort of disappointed because that worked wonders. Instead of asking women on dates, I would simply make it obvious I was interested in hooking up and see if they were down. I even got it down to a tee, if I was out and met a girl I liked, I'd try to create some alone time to chat with her one on one for a bit then at some point when emotions were high and I thought she was into me, I'd take her hand and say, \"Look, honestly I think your hot and all I've thinking about is kissing you, can I kiss you right now?\".\n\nIt's fast efficient, I figure out there and then if she is actually interested in me and after a few times I stopped caring about the outcome. Most of the time women agree and we get together.\n\nAnd every time I am thinking, what the fuck, this is supposed to be more difficult. I think I built all these stages up to dating before that were unrealistic, it's not anything more than two people who like each other getting together. So if we are both adults, lets just put it out there and see if they are into it.\n\nIdk why I needed to say this, I guess it's just good to feel like I have finally figured it out after all this time.",
    "comments": [
        {
            "level": 0,
            "comment": "What do you want to get from your interactions with people?  And are you getting it?\n\nIf you want to hook up without strings, then acting like you want a relationship is not going to help. Asking women if they want to hook up will.\n\nIf you want a long term, committed relationship, acting like you want to hook up without strings is not going to help.  Taking the slow approach and being kind and understanding will.\n\nIt’s all about the desired outcome.  If you try to get a long term relationship with someone who wants to just have some fun, you’re going to be disappointed. And if you try to hook up with someone who wants a long term relationship, you’re going to be disappointed.  But if you try to be with someone who wants what you want?  Yeah, it’s going to be easy.",
            "score": 20,
            "author": "thetwitchy1"
        },
        {
            "level": 0,
            "comment": "You can still be a good person while being direct about your attraction to someone.",
            "score": 70,
            "author": "DeanNKS",
            "replies": [
                {
                    "level": 1,
                    "comment": "Self-explanatory",
                    "score": 3,
                    "author": "ET_Phone_Homer_Simp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; was only interested in serious relationships\n\nBut you’re still not getting what you want? You’re just hooking up. \n\nOr did you just pretend that you wanted a serious relationship when all you really wanted was to hook up? No surprise that didn’t work then. Why would a girl that’s looking for a hook up be attracted to a guy saying he wants a serious relationship? \n\nAnd all the girls that wanted a serious relationship saw the NiceGuy red flag and realised you were just pretending. \n\nNow you’re telling the girls that you’re just looking to hook up and the ones that also want that react to that. \n\nIf you really want a relationship though this is still getting you nowhere.",
            "score": 30,
            "author": "xxSKSxx_",
            "replies": [
                {
                    "level": 1,
                    "comment": "This^",
                    "score": 2,
                    "author": "ET_Phone_Homer_Simp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's two different types of women that you're comparing here.\n\nSome look for long term things and don't want to rush, others just want to hook up and don't mind direct guys.\n\nThe difference is that with you being directed you expose the idea to more people faster, and while the percentage of failure will be higher you'll also have more people potentially interested.",
            "score": 48,
            "author": "PigeonOnDrugs"
        },
        {
            "level": 0,
            "comment": "There is a big difference between being nice and being kind: \n\n-When you are nice it’s in the intention to have something in return.\n\n-When you are kind it’s from the hearth and you are just doing things because you want it.\n\nNow you should be careful on the kind of girls you are after! Some girls just want to have fun and love ´bad ’ guys BUT others want a serious relationship that will took time to build and i garantee you being nice is a Huge red flag.\n\nNow you should maybe work on knowing more yourself to be able to look after the right woman for you in the right place. Being a good person is a must!",
            "score": 25,
            "author": "Technical_Pumpkin_65"
        },
        {
            "level": 0,
            "comment": "So you're having casual hookups and so are these women? \n\nGreat\n\nBut the ones you were trying to get before wernt looking for casual hookups 🤷‍♀️ you want long term, you're not gonna get it by going after the women who want casual hookups 🙄",
            "score": 11,
            "author": "ice7i7y"
        },
        {
            "level": 0,
            "comment": "So, women aren't interested in dating you but they're okay with a one time hookup? That really isn't a huge revelation. Most women experience the same thing where a guy feigns interest but gets upset when the woman doesn't want to bang right away. Relationships are not going to be made out of random bar hookups.",
            "score": 3,
            "author": "weeblewobble82"
        },
        {
            "level": 0,
            "comment": "Being clear of what you want is probably what differentiated success versus failures in getting to know women. When I was younger, lack of confidence was my biggest issue. But as I grow older, along with success comes the confidence.\n\nI am not sure how young you are, but usually as men, we would attract specific type of women with the vibes we are giving off as.",
            "score": 13,
            "author": "_Ozeki"
        },
        {
            "level": 0,
            "comment": "Doesn’t this post confirm that you weren’t in fact a nice guy ? I’m not a decent person with people for the sole purpose of some intimate or sexual transaction fulfilled from completing the task.",
            "score": 6,
            "author": "ET_Phone_Homer_Simp",
            "replies": [
                {
                    "level": 1,
                    "comment": "he's referring to being a \"Nice Guy\" which is someone who is overly pleasant and accommodating to to women with the expectation of getting some kind of reward (attention, dating, sex) from it. that kind of thinking usually fails and leads to resentment because...as you say being \"nice\" to people is just the baseline of human interaction. \n\nwhat he's doing right now, just being direct with women about his intentions, doesn't preclude him from being decent and well mannered to everyone and it's a lot better than stewing in resentment and entitlement.",
                    "score": 1,
                    "author": "OdaibaBay"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And then everyone in the elevator clapped.",
            "score": 4,
            "author": "Somguy555"
        },
        {
            "level": 0,
            "comment": "Quantity over quality. Do what makes you happy though. But don't discard forming a connection with someone. There are people out there that want more than hookups. \nEdit: grammar.  Btw* I mean quality in terms of the type of relationship",
            "score": 2,
            "author": "dmpls2102"
        },
        {
            "level": 0,
            "comment": "Trying to explain this without getting all philosophical and pretentious, but it kind of sounds like the Hegelian synthesis, you tried being nice and got no where, and you tried being a dick and got a casual relationship, now try being nice but making it clear you want a serious relationship after?",
            "score": 0,
            "author": "Opposite-Cry-172"
        }
    ]
}