{
    "id": "148pf7d",
    "score": 26,
    "title": "Cancer is all around me and I think I’m losing my mind",
    "author": "syomaro",
    "date": 1686689801.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/148pf7d",
    "media_urls": [],
    "other_urls": [],
    "postText": "My mom, aunt and grandfather have been diagnosed with cancer in the last year or 2. My mom passed a few months ago, and my aunt last night. I’m still a bit shocked my grandfather, who’s 86 managed to outlive them both. \n\nI’m yet to open the box where I’ve put all the grief and guilt about my mom’s death and now with my aunt, it’s like cancer is everywhere I turn.\n\nTwo months before my moms passing, I had surgery to remove some abnormalities and get a biopsy done to screen for cancer. And 2 weeks ago, I go for a follow up to find, the abnormalities have returned and I have to do the same surgery as well as I’m being referred to a oncologist. \n\nI feel so overwhelmed and I’m scared to death that I’m next and my grandfather might outlive me too.",
    "comments": [
        {
            "level": 0,
            "comment": "Me too!  Cancer is like a sniper, you just wonder who the heck it's going to hit next!!!",
            "score": 11,
            "author": "Limp-Outcome3164"
        },
        {
            "level": 0,
            "comment": "I am so sorry for what you are going through\n\nhave you had genetic testing? some cancers run in families",
            "score": 8,
            "author": "GrumpyOldBear1968"
        },
        {
            "level": 0,
            "comment": "Have you had a toxin screening in your home? That's a real cluster. Stuff like that is often tracked back to weird shit. There was a Soviet radioactive device which was lost in an industrial accident and was buried in an apartment wall. Everyone who lived in that apartment got cancer and died before they realized\n\nhttps://en.wikipedia.org/wiki/Kramatorsk_radiological_accident",
            "score": 3,
            "author": "Fuzzpot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow. I mean that’s plausible, but I haven’t lived with my mom since I was 11 and I never lived with my aunt.",
                    "score": 1,
                    "author": "syomaro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ask the doctor if the cancers seem related. Genetics is obvious, but worth asking a doctor. Bring that wikipedia article if necessary. You never know.\n\nCancer isn't uncommon, but it also sounds like your family is getting hammered all at once, which is a bit of a statistical outlier.",
                            "score": 1,
                            "author": "Fuzzpot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate it when someone i know is all like \"i have cancer and starts sobbing\" like, thanks for ruining the mood. God i just need to get away from all these toxic people in my life",
            "score": 1,
            "author": "Thereisnoonehere1"
        },
        {
            "level": 0,
            "comment": "Look into Dr. Sebi, body alkalization, carbon monoxide therapy (baking soda 3tsp or so a day works), the negative effects of glyphosates from genetically modified food. Eating organic and alkalization both alone can go a long way.",
            "score": -20,
            "author": "Seven0neSeven"
        }
    ]
}