{
    "id": "148q8qr",
    "score": 2,
    "title": "I will break up with my boyfriend",
    "author": "suicms",
    "date": 1686692003.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/148q8qr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'll break up with my boyfriend of 2 years and kill myself afterwards. I'll do it exactly a month from now on. I want to keep the effect on him minimal but i do not know how.\n\nI have made my choice and I won't change my mind. I just wanted to tell someone, even if they don't hear it. I wanted to tell the truth one last time. I will miss our kitty and him, love them both oh so dearly. Goodbye.",
    "comments": [
        {
            "level": 0,
            "comment": "You want to keep the effect on him minimal? I had the same relationship case for 2 years she left and its not been a day to think me hurting myself.(dont even know what would i do if she did ended all) But in the end we do need to LIVE as we have only this life and if it may not look like much now it will later, kids family and much more. You will be wanting to live only longer and more. I wish I was the better person to tell you these. Dont break hearts, try to heal them.",
            "score": 5,
            "author": "ardiax"
        },
        {
            "level": 0,
            "comment": "This will traumatize your boyfiend for years to come, I don't think he could ever get over it and it would no doubt seriously affect any furure relationships he might have. If you truly do love him, then you should get some help. I know that sounds insurmountable but even just talking to your boyfriend is a massive first step.",
            "score": 5,
            "author": "oddremembrance"
        },
        {
            "level": 0,
            "comment": "Seriously? He’s going to be traumatized for life.\n\nAnd that cat will spend years going through the house, meowing in the hopes that you’ll come pet her again.\n\nIf you love them so dearly, stay with them.",
            "score": 3,
            "author": "wakingdreamland"
        },
        {
            "level": 0,
            "comment": "I know where you’re coming from, I’ve felt this overwhelming feeling so many times and I wished I had just one person to show they cared so I’ll be that person for you. My inbox is open just for you. Whatever you need. You just want to vent and me listen and not say anything? You got it. You want to talk about random stuff? You got it. Whatever you need, just please don’t do this.",
            "score": 1,
            "author": "mama_loony"
        }
    ]
}