{
    "id": "148r4a4",
    "score": 1,
    "title": "I feel suicidal.",
    "author": "Noshadehere30",
    "date": 1686694358.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/148r4a4",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nI know this is very deep, but I’ve been having this feeling linger for a long time. I have the most supportive partner and my family, but I just constantly think they’re better off without me. \n\nWork has pushed me into overload, I can barely handle anything like I use to without getting upset easily and I just don’t know what to do. \nHow can I get away from this feeling?",
    "comments": [
        {
            "level": 0,
            "comment": "You need to take slime time off work and focus on yourself. Talk to a therapist, and tell your family how you’re feeling. You need help, and support and rest",
            "score": 2,
            "author": "Solfeliz"
        },
        {
            "level": 0,
            "comment": "First of all: I highly doubt they would be better off without you, especially since your partner is very supportive and caring which means they really love you. \n\nSecond, I know it’s a subreddit to get things of your chest but I recommend you to get professional help if this is the state you’ve been in for a while. It’s not normal but I doubt that anyone here can be as helpful as therapy or conversations with professionals could ever be. And since you got a loving and caring family it’s the best you can do",
            "score": 2,
            "author": "Timely_Song7537"
        },
        {
            "level": 0,
            "comment": "Go to the doctor and get help, the same way you would if your heart was beating erratically. Depression kills just as much as a variety of physical health conditions kill. If you're in the US, there are a ton of affordable options for therapy ranging from better help to psychologytoday where you can filter therapists by what insurance they take. Consider talking to your PCP about starting an antidepressant, but know that meds are usually not the cure. They are good to pull you out of the slumps so you can do the work needed to pull you out of the pit.  If it's possible, consider using FMLA to take a little leave of absence in a month. Try to coordinate it with starting therapy if possible. Just *knowing* you have a break coming up will reduce stress. Also, if you're full time, your employer may have an Employee Assistance Program (EAP) that offers a certain number of free therapy sessions.\n\n\nTalk to HR, your PCP, your partner, all the resources you have to come up with a plan that will allow you to slow down enough to have time to heal and recover. Don't do anything less for yourself than you would if you were diagnosed with stage 4 (enter scary disease here). Mental health is physical health. Take care of yourself.\n\nIf you're in the US, 988 is the crisis line. Call if you aren't sure you'll make it through the night/ your planning suicide.",
            "score": 2,
            "author": "weeblewobble82"
        }
    ]
}