{
    "id": "148wpfm",
    "score": 0,
    "title": "My fostersiblings are so attached to their phones that they have no future.",
    "author": "Technical-Piccolo-15",
    "date": 1686711409.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/148wpfm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have four younger fostersiblings. I'm 19, then we have (not real names) Kaden (16 almost 17M), Jacob (16 almost 17M), Lily (14F) and Sarah (13F). Lily and Sarah have social skills and have friends they hang out with almost weekly outside of school. Wherever they go they make new friends. They're doing great socially and I'm really proud of them.\nKaden has no social skills. According to Jacob, he sits on his phone in class and sits alone at lunch to be on the phone with his discord boyfriend in another country. Jacob is no better - he does the same except he also has an asian person fetish. He wont talk to you unless you're asian or fosterfamily/workers, he won't be your friend unless you're asian, and he won't date you unless you're asian. He rarely talks, mostly doing handsigns instead, and no it's not ASL and no he's not autistic - he's been tested several times. When he does talk, it is cringey weeb shit. \"I want to be kawaii desu!\" \"Konichiwa! How was your day, onee-chan?\" He is black by the way. Not asian at all. Never lived outside of the USA. We tried telling him to just use normal english and not a language he doesn't know, but he refuses. He will also follow japanese fashion trends and use makeup to make his eyes smaller and try to do the sterotypical thin asian eyes. \n\nThis is all finally hitting me because we've been trying to make them socialize. We want them to go make friends at school but they refuse. We can only get them to leave the house (The boys) if we bribe them with free food. They dont even leave their rooms unless it is to eat, use the bathroom, or go to school. They're so lazy we have to tell them to clean their cat's litterbox because they'll let it get full and won't clean it even when it stinks up the house. When they leave to eat dinner, it takes them 10-15 minutes after being told to come eat, then they speedrun eating to go back to their phones. They dont even talk to eachother in their room (according to them). \nThey have no plans for the future and refuse to make a plan. They are not motivated to work. They dont want to go to college. We're worried for them but can't do anything. If we lock up their phones via parental controls, they shut us out and go on hungerstrikes. They refuse to talk.\nI'm worried, disappointed, and frusterated. I just needed to rant this out.",
    "comments": [
        {
            "level": 0,
            "comment": "Let them hunger-strike, they won’t starve; they sound like spoiled babies.  Someone has to actually parent them.",
            "score": 2,
            "author": "mattdvs1979"
        }
    ]
}