{
    "id": "148xe6v",
    "score": 1,
    "title": "This summer has started off as shit",
    "author": "Repulsive-Pea-6131",
    "date": 1686713605.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/148xe6v",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was trying to find a second job this summer due to my current job only giving me like 10-15 hours a week but the pay is pretty good I get 12 an hour but it’s not enough and when my friends are at work I have literally nothing to do. \n\nI rear ended somebody and totaled my car now I am basically stuck at home and when I do work I have to find a way to get to and from work. I got in trouble a while ago because my mom made my curfew 12:00 AM for the first time ever but I got home around 12:10 due to having to drop my friend off before coming home and she made my curfew 9:30 PM. I signed up for some classes and I found out I don’t even qualify for the classes because my grades weren’t good enough.\n\nI’m just so stressed I work tomorrow at 12 in the morning and I truly have no idea how I am getting two and from work if we are being honest. I feel so stupid for totaling my car and my stepdad won’t even talk to me for some reason now like even if I do Like a simple greeting to him he’ll just ignore it or start talking to the dog.\n\nIt just keeps getting worse and worse. Some good things that have happened I went to go visit my first college and I think I might actually wanna go there when I graduate. I also got accepted to connections academy so now I might be able to get my diploma early.\n\nI’m so worried though because lately it seems like everything academically related is just not going well. Like I have no idea what I’m gonna do if I don’t get accepted into college.",
    "comments": [
        {
            "level": 0,
            "comment": "Like I got rejected for every dual enrollment class I applied for because of my grades I guess and I was only going to dual enroll so I could graduate early",
            "score": 1,
            "author": "Repulsive-Pea-6131"
        }
    ]
}