{
    "id": "148yg7e",
    "score": 9,
    "title": "I tried to kill myself last night and no one knows.",
    "author": "goblinbeatle",
    "date": 1686717086.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/148yg7e",
    "media_urls": [],
    "other_urls": [],
    "postText": "The title is pretty self explanatory. I haven’t left bed today other than to turn on the light in my room. I went back to my bed straight after.\n\nI was supposed to go out of town for the day to visit my medium distance partner. I didn’t. I couldn’t bring myself to do it.\n\nThe only reason I’m getting out of bed tonight is to feed my cat. I feel awful.",
    "comments": [
        {
            "level": 0,
            "comment": "Jeez that does sound awful but any reason to get out of bed is a good one feed your feline friend, although I do suggest talking to someone about it, it’s alright to not feel ok just know that I care stranger Stay resilient",
            "score": 3,
            "author": "Odd-Joke5816"
        },
        {
            "level": 0,
            "comment": "This probably won’t mean anything to you because you don’t know me but I’m really glad you survived. I know it can prove difficult but I urge you to discuss this with your partner !! Or simply just be with them. You need them the most right now of all times especially. Really proud you got up to feed your cat !! I know that couldn’t have been easy. And make sure you’re eating and staying hydrated, doesn’t have to be a four course meal but just that you’re eating at all is the most important. I’m wishing you well !!",
            "score": 3,
            "author": "exeropsIII"
        },
        {
            "level": 0,
            "comment": "so glad you are still here; feel free to message if needed. pls take care of you🙏🏿",
            "score": 3,
            "author": "YakRevolutionary8112"
        },
        {
            "level": 0,
            "comment": "Do you want to talk? You can message me",
            "score": 6,
            "author": "TallNPierced"
        },
        {
            "level": 0,
            "comment": "I‘m glad you’re alive. And you can get through it. I‘ve been there myself and the best thing I ever did was get professional help and change my surroundings (new job, new apartment, a few new friends that understand what it’s like). Please talk to someone about it. Feel free to message me if you wanna talk.",
            "score": 2,
            "author": "Putrid_Ad695"
        },
        {
            "level": 0,
            "comment": "I’m so glad you’re still alive… and i’m sure your cat and parter is also thankful for you. Try to stay alive, and if you feel like you don’t have a reason to stay alive, then think of your cat",
            "score": 1,
            "author": "angelmasha"
        },
        {
            "level": 0,
            "comment": "Hope you will perfectly well soon again",
            "score": 1,
            "author": "Intelligent_Sun425"
        },
        {
            "level": 0,
            "comment": "I'm also glad you're still here with us. You can also reach out to me if you want. Just hold on.",
            "score": 1,
            "author": "FlashyTrainer4102"
        },
        {
            "level": 0,
            "comment": "what a weird feeling. I would talk to a beloved deity or ancestor spirit about it.",
            "score": 0,
            "author": "shbrrt"
        }
    ]
}