{
    "id": "148yugy",
    "score": 1,
    "title": "Just had the worst dinner ever…🌮",
    "author": "pjmthrowaway",
    "date": 1686718427.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/148yugy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Tacos do not make things better. For some context, a couple days ago, I posted that I found out my dad (47) is seeing my ex (19). I deleted the post because I figured maybe I’m just overreacting and they’re just really good friends since they work together. Admittedly, I have a really good friend I hook up with that I work with too. Sure, she’s not my son’s ex-girlfriend, but I just tried to tell myself that’s all it is. There was a couple comments telling me to confront them. I thought about it and what I would I say, but I couldn’t bring myself to. This is really the first time I’ve seen my dad happy since my mom left in 2015. \n\nMy dad asked if I wanted to come over for a taco Tuesday dinner. I said yes thinking it would be just us or maybe one or two of his buddies. I get there and it’s his truck and another SUV I’ve never seen in the driveway. Can you guess who it is? My ex. Standing in the kitchen cooking with my dad. My jaw dropped to the ground and I just feel instantly nauseous. I left the kitchen and went to the living room with the dogs so I didn’t have to see them or say/do anything stupid. \n\nThey finished cooking and he pulled out the chair my mom used to sit in. I didn’t think this would bother me, but no one has used that chair since. None of his girlfriends after my mom, not even the one he got engaged to. Seeing the girl I thought I would marry one day being all lovely with my dad in the chair my mom used to eat dinner for years in just ruined the dinner immediately. Keep in mind it has been dead silent since I got there. Other than them whispering, there hasn’t been a single word said. Being the little shithead I am, I asked my dad if he’s “gonna introduce me to his ole lady considering I don’t know her anymore.” I could feel both of their death stares burning a hole through my head. He replies “well, you know (name) already even if you pretend you don’t. We’ve been dating for 6 months. We didn’t know how to tell you, but knew you needed to know. Please tell me honestly how you feel about this.” I mean, how the fuck am I supposed to feel about this? I told him it made me uncomfortable and I can’t think of her as my dad’s GF and especially not my stepmom. It went silent for the rest of dinner until I decided to leave. \n\nSo, now I’m laying in my bed at my apartment thinking how the fuck either of them think this is okay. Or how they think I’m supposed to be fine with it.",
    "comments": [
        {
            "level": 0,
            "comment": "Your dad is a sick fuck that gives little fucks about you - its ok my step dad was too.\n\nFucked my only friend in middle school and then went on to marry her.\n\nShe divorced him a few years later when she also realised hes a sick fuck.",
            "score": 3,
            "author": "emshungrybitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel you. She was my only friend when I moved there in 3rd grade. She was the only person I talked to and trusted until 7th grade. I pray they don’t get married. Especially pray they don’t have a kid. She always talked about how much she wanted kids. Like to the point that she was already weaning off birth control when we got into senior year so that she could be ready to get pregnant once we graduated. \n\nI also really hope she realizes that she’s making a mistake. I went to text her after dinner and she’s blocked me on every form of social media.",
                    "score": 1,
                    "author": "pjmthrowaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What you choose to do going forward, how you handle things is ultimately up to you. \n\nBut here is my two cents for what its worth.\n\nPrepare to cut contact. \n\nIt will be a painful exercise but its proven worth it (at least to me). \n\nThese people dont care about you, your dad might think he does but ultimately hes willing to put his sick desires before his own sons feelings and well being. Is that a person you want to keep in your life ? for me is wasnt. \n\nThey invited you around (ambushed you) and asked how you felt not because they care but because they knew at some point they had to face you. not because they care what you think. I highly doubt any emotions you express will top their \"love\" for each other. \n\nFocus on building relationships with people who care for you and cut out anyone who doesnt.",
                            "score": 2,
                            "author": "emshungrybitch"
                        }
                    ]
                }
            ]
        }
    ]
}