{
    "id": "g0bpa2",
    "score": 105259,
    "title": "As a grocery worker I’m so fucking tired of these “thank you” commercials. If you were actually thankful you’d pay me a god damn living wage fucking cunts.",
    "author": "fuxfy",
    "date": 1586751322.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/g0bpa2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Title",
    "comments": [
        {
            "level": 0,
            "comment": "As a comedian once said, money is a better motivator than voice modulation.",
            "score": 1352,
            "author": "uchiha_building",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think most are missing the point.  Everyone is so worked up with these thank you commercials thinking it's for the workers.  It's for buyers.  \"thank you\" just happens to be the new voice modulation of the day.\n\nNo actual workers need to even watch one.",
                    "score": 247,
                    "author": "1541drive",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are so right! These commercials piss me off to no end. Instead of spending millions of dollars making thank you commercials,  they could be investing into the communities that are hardest hit, ppe for front line and healthcare, salary guarantees for their workers.... this list of better uses for this money is endless.",
                            "score": 56,
                            "author": "Daenaryan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Better\" in that it makes the world a better place, yes.  They are looking for \"better\" as in improves the bottom line of the company.  The stuff you mentioned is expensive and its effect on profit and loss is uncertain at best.  A commercial is relatively cheap.",
                                    "score": 4,
                                    "author": "thenasch",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly right - it’s the new “we care so buy our shit” tagline of 2020",
                            "score": 28,
                            "author": "Markamp"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Money can open more doors than dynamite",
                    "score": 8,
                    "author": "SomeBoioNamedJack",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Thanks for the input Sasuke",
                    "score": 69,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah that's his house",
                            "score": 3,
                            "author": "JonAndTonic",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Corporate: Pay grocery workers $2 more per hour? That's crazy talk! \n\n\nMeanwhile...\n\n\nCorporate: We present our latest advertising blitz campaign - thank you commercials to our staff! It'll only cost about $50 million in ads, that's practically free!\n\n\nEDIT: Came back to see this exploded. Am not going to address each response one by one but just generally have some observations from the comments I've gotten... \n\n1. I'd readily admit I plucked the ad numbers from thin air since I am not a \"corporate guy\" who \"controls the marketing budget\". I used the recently reported ad numbers.. being from Bloomberg (over $500million!!!), divided that by a factor of 10 since we're not going to flood people like Bloomberg did, and considered the fact that ads might have gone up in price (given that we probably have the largest captive audience in history) and arrived at the completely arbitrary number of $50 million. \n\n2. Naturally, there are some people who think that there's nothing wrong with that as long as financially it makes sense and to these people I implore you to consider that we like in extraordinary times, where we have a chance to fundamentally rethink of how corporations should be run (less \"make money at all costs\" and more \"a win-win situation from employee to employer) and to consider the viability of ethically driven companies where everyone is paid a living wage to not just survive, but thrive.\n\n3. To the one person who argue that consumers should be held accountable for their own behaviour, I completely agree - we can all do better. Wear a mask, make a conscious attempt to touch less things while shopping, observe social distancing when possible. If we all do what we can, we will get through this.\n\n\nAnd to those of you who continue to work in the grocery stores to keep everyone fed, thank you.",
            "score": 3040,
            "author": "deadlyfaithdawn",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 543,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Like Verizon and those *fucking* Superbowl ads - multiple ones - bragging about how they support first responders after they cut service to firefighters who were literally battling massive forest fires at the time.\n\nJust more PR crap. I love being fed a spoonful of shit and being told it's pudding.",
                            "score": 278,
                            "author": "IrishFast",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "PR Crap but specifically to get their past “oopsie” moments onto the ghost town of googles 3rd page.",
                                    "score": 85,
                                    "author": "FlexualHealing",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People go to the second page?",
                                            "score": 5,
                                            "author": "ses1989"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, it was all misdirection to try and cover up the the fact they made the fire fighters inoperable and then demanded more money from them, while they were holding their ability to function hostage..",
                                    "score": 44,
                                    "author": "FloridaTyler1519"
                                },
                                {
                                    "level": 3,
                                    "comment": "[Woke Brands](https://www.youtube.com/watch?v=06yy88tLWlg)\n\nBusinesses and corporations are not your friends.",
                                    "score": 50,
                                    "author": "Elektribe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And they're not your fucking family, despite then driving that message into their employees fucking brains.",
                                            "score": 6,
                                            "author": "Mmmmhmmmmmmmmmm",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I loved those ads! for the reason that during the net neutrality fiasco I had some intense debates with my mostly libertarian boss about it. Then he came in talking about superbowl ads and how that verizon one was touching. he had no idea about the cutting service to firefighters until I showed him all the news from it. I wish I had a camera so I could have posted it on r/watchpeopledieinside",
                                    "score": 62,
                                    "author": "FabulousBankLoan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I work in sports/entertainment marketing.  Companies begin planning their Super Bowl advertising campaigns a year in advance.  Its probably has the widest (consumer market) audience of any event other than the Second Coming.",
                                            "score": 3,
                                            "author": "cheap_dates"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My retort to that was always \"Don't shit in my corn flakes and call them raisins.\"\n\nSurprisingly I haven't been fired too many times in my life but often the black sheep of the office.",
                                    "score": 12,
                                    "author": "TheOneNamedSprinkles",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Verizon cares for fire fighters and BP cares for the environment!",
                                    "score": 14,
                                    "author": "JB-from-ATL",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I get SO pissed when I see those commercials. I am a volunteer firefighter. Verizon can go fuck themselves.",
                                    "score": 14,
                                    "author": "thatgirl239",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I like it when they ask every customer on every purchase if they'd like to donate a dollar to whatever cause instead of just donating some money themselves.  They even spend money training staff and printing up promotional crap about it.",
                            "score": 65,
                            "author": "cyclemonster",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The actual worst part of that is they pool all your donations and then donate it themselves for a huge tax write-off. It actually benefits them financially.",
                                    "score": 46,
                                    "author": "djloid2010",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Common misconception. \n\nTax write-offs work like this. \nThe compagny gets taxed on it's profit.\nIf something is written of, then that gets subtracted from that profit.\n\nSo, from this you may conclude that if a corporation made 1 million in profit, and get 100 000$ in charity contributions, that they wrote of 10% of their taxable profit.\n\nWhere this goes wrong is that it forgets that those charitable contributions were also counted as profit. So, with 100 000 in charity contribution, the taxable income is ( 1 100 000 - 100 000), or the same 1 million as before.\n\nWhat the compagny does gain is good PR, as they can take that 100 000 figure and brag about it.",
                                            "score": 26,
                                            "author": "10ebbor10",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes the real truth the person you were commenting on is trying to talk about is a bit darker.  To avoid taxes a lot of wealthy people set up their fortunes within a tax loophole that stipulates their children cant touch the majority of the capital for 20 years and any profits from interest must be spent on charity.  Which sounds great on paper until you consider that this is why so many people who are rich from inheritance have their own charities named after them AND they have found ways to use this money for political purposes disguised as charity.  Ever tried to look deep into the financials of these charities? The ones that do actual charity work for the most part are getting around rules with loopholes saying as long as 51% is spent on charity then 49% can be put into political causes AND it doesnt have to be reported and donors dont have to be reported.",
                                                    "score": 7,
                                                    "author": "Couldbduun"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean, that's not how corporate tax works at all in any country that I've heard of",
                                            "score": 12,
                                            "author": "Ubernaculum",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A lot of companies here donate money to charities to get tax write-offs. The most insidious one is companies that pressure  their employees to donate part of their salary to United Way, and then collect the tax write-off themselves.",
                                                    "score": 21,
                                                    "author": "FloridaTyler1519",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I wonder if its pre-tax or post tax. If I was the employee I'd claim it myself. Double dipping, not allowed but I wonder how it would go down on an audit. it was the employee's contribution.",
                                                            "score": 5,
                                                            "author": "ifosfacto"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "My company did this. My father's company did it also. Dad taught me how to screw your employer, while at the same time, getting them off of your back to \"contribute\". They go to extreme lengths to make you feel guilty, and \"not part of the team\". Fuck that. I give to the charities of MY choice. Anyway, what you do is.... Donate a single quarter, out of each paycheck. That way it costs the company for being cunts, and they shut the fuck up.",
                                                            "score": 3,
                                                            "author": "grinndel98"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Ive, kindly, told my old boss to feck off with that shit. \n\nMy manager wasn't happy about it so I said, \"tell them to pay me 26,75/hour and I'll do it. \n\nI left a couple years later",
                                                            "score": 3,
                                                            "author": "PrOwOfessor_OwOak"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I hate when the reality that they calculated that cost against potential profit is not a part of the discussion.",
                                    "score": 9,
                                    "author": "passivelyaggressiver",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm the pizza guy for the biggest chain in America, I've gotten a few thanks but nobody's called me a hero. I'd like that on top please. Let me inflate my ego while zero customers realize my first delivery last night was to someone who wrote in the delivery notes they were sick with no other explanation.\n\n\nSmarten the fuck up people. If I catch it everyone at the store catches it. You realize three separate fucking people touch the box you're about to open to shovel finger food in your mouth? That's not counting the fact I make twenty fucking runs a night.",
                            "score": 51,
                            "author": "HertzDonut1001",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ordering pizza delivery in my city is now completely contact free. You pay and tip upon order and get a text telling you the pizza has been delivered outside your door.\n\nUsually the pizza guy is waiting in their car until you get out to pick up the pizza. \n\nIt's a pretty good solution, especially for quarantined people with no food at home.",
                                    "score": 27,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So are we. The amount of people who don't follow CDC guidelines is ridiculous. I get at least three a night.",
                                            "score": 18,
                                            "author": "HertzDonut1001",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I get them to leave it the door and then yell THANK YOU through the door and wait until I hear their car door close before peeking out.  I've also been tipping higher to the delivery drivers from Uber Eats, Deliveroo, Menulog etc. \n\nI've also been going out of my way to buy coffees etc which I wouldn't normally do.\n\nAll this good will has caused me to gain even more weight.",
                                                    "score": 12,
                                                    "author": "Wild-Kitchen"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Speaking as a delivery driver who just got home a couple of hours ago from a night shift, it's not as great of a solution as it might seem.\n\nI run significantly fewer deliveries per night because of all the extra little steps. The extra cleaning and sanitizing, phone calls, people dawdling to come out and get their food like I'm not sitting there waiting to make sure they get it.\n\nI just worked almost 12 hours on Easter, in the rain, away from my family, being \"essential\" to the world, and I didn't even make $100 tonight, thanks to all the people who are taking the convenient opportunity to stiff me while I'm standing away from their house in the rain trying to keep an eye on their food. It's not worth showing up and risking the health and safety of my entire family for this shit.\n\nI have a really hard time feeling bad for people anymore. Ever.",
                                            "score": 45,
                                            "author": "ambotron2001",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, no I was saying you guys have it easy or anything. The system is fucked and people are fucking selfish pieces of shits. \n\nBut as a hopefully somewhat responsible customer, I do tip and I do appreciate the steps that the delivery businesses in my area have done to move payment online in stead.",
                                                    "score": 25,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Fuckers are out there not tipping on fucking Easter while you are delivering during a pandemic.  Holy shit. I tipped 6 bucks to our local delivery place on 25 dollar order that is only a couple minutes away. Is that normal tip? I figure it's about standard.",
                                                    "score": 10,
                                                    "author": "MarthFair",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The real truth, at least at our store, in our area, is that the good tips just offset the far more common bad ones, or \"none\" ones.\n\nAny of us are pretty genuinely grateful for anything $1+, unless the delivery is a bitch. None of us really expect to be tipped on some percentage scale because we get stiffed commonly on orders anywhere from $2.99 (coupons, discounts, complaining to a manager..) to $75 and up. (I delivered 30 pizzas to a hockey team post-victory and got stiffed on it last week.) \n\nWe just hope that if a customer is gonna make us drive a long distance (keeping us from other deliveries for a longer period of time), or make us juggle a buffet to your 5th floor apartment -- and then call you when we're outside the door, or they fall asleep and leave us desperately trying to reach you before we're forced to give up and go back with no income and a bunch of wasted time, they maybe throw us something better than $1 - $3.\n\nThis \"no contact\" stuff is essential but the way it works is bogus. It takes WAY more time in store as far as prepping the orders and sanitizing the bags, all of us constantly trying to wash our hands and wipe things down. When I get to their house I have to set up their food like I'm some merry fucking holiday pizza elf instead of just handing it to them. Many customers live in a time warp and have no IDEA what the hubub is all about or even get all freaked out because DIFFERENT! We're still taking cash orders, in spite of being \"no contact\" on all deliveries. So.. we're not 100% no contact and I don't forsee it actually being enforced soon. I have customers tell me at the door, after they've handed me cash, that I need to \"disinfect that as soon as I get to the store because we're all sick.\" \n\nWe're sacrifices and we're still making nothing. This is a ~~joke~~ boring dystopian nightmare.\n\nEdit: People who tip well, if you see this, thank you. You're not as common as you might think, and you're paying us directly and keeping us going. Thank you. Right now getting one solid tip breaking up a bunch of straight 0's is what directly changes the timeline of someones whole life.",
                                                            "score": 14,
                                                            "author": "ambotron2001",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 8,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Contactless is such bullshit... even if you're wearing gloves, how long ago did they change those gloves? Did they touch a potentially infected surface with those gloves? How thoroughly did the sanitize surfaces?\n\nLike I'm sure they're reducing risk but contactless implies no one is touching anything which is a joke... it's a new corporate buzzword and whoever came up with it probably deserves a fat paycheck because it's fooling a lot of people",
                                                                            "score": 3,
                                                                            "author": "pavioc16"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“Yes. That’ll show the public we care” as Galen Weston lights a cigar with a lit $100 bill.",
                    "score": 516,
                    "author": "janus270",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Loblaws did in fact give workers a $2/hour wage increase. Though I imagine Galen will still have enough hundreds left over for his cigars.",
                            "score": 125,
                            "author": "biznatch11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 49,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yup. It's pretty fucked up. Grocery store workers were making living wages in the 80's and some even in the 90's. What was done to their wages needs to be more widely known. These are essential jobs that are way undervalued thanks to the environment we have setup now here in Canada as we copied the Americans.",
                                            "score": 31,
                                            "author": "UltraCynar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 12,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The worst part of this argument is you never see kids in these jobs.. almost ever. And when you try to bring that up as a counter to people, they shift the discussion over to foreigners taking jobs. Like what the hell. \n\nThat is just my experience when talking about these things with people.. so take it with a grain of salt. Just annoying and wanted to share.",
                                                            "score": 6,
                                                            "author": "Crackbat"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Highschool kids shouldn't need to get jobs...",
                                                            "score": 5,
                                                            "author": "Jaredismyname",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Truly a shame. Interestingly, I’ve found out that at Walmart, at least the older one that exists near me, some of the twenty-year plus workers have phenomenal benefits, rates of pay, and a retirement (optionally) based on stock they’ve been allowed to acquire at a discount since they were hired all those years back. Just as in your example, it *was* an example of a good job, a career, essentially, with zero-low qualifications nor barriers to entry. Those don’t exist anymore, however.",
                                            "score": 19,
                                            "author": "RyLucas",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Used to sell to WalMart back in the day. Old Walmart corp used to treat employees more like family and provided benefits. Now? Shit company. Reason I no longer shop there. Fuck Alice Walton and her fucking billion dollar museum. No, you old cunt, I dont need to see the Picasso on the wall if that means youre not giving benefits to your workers. How does she sleep at night?",
                                                    "score": 25,
                                                    "author": "weehawkenwonder",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 20,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don’t doubt that for a second, and I know they are heavily enticed to rid themselves of those older, higher-paid employees.",
                                                            "score": 14,
                                                            "author": "RyLucas",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Its because Sam Walton was a good man and didn't want his people on welfare now we have the second generation who don't care they only give lip service to media when they say we pay 13 dollar an hour starting cheapskates.",
                                                                    "score": 10,
                                                                    "author": "delmecca",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Being run by a worker vs. Being run by trustfund babies",
                                                                            "score": 6,
                                                                            "author": "SealClubbedSandwich",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "*temporary* increase",
                                    "score": 94,
                                    "author": "MaplePoutineRyeBeer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's apparently worse than that. It doesn't count as an actual pay increase, it's some other kind of income and so it's taxed differently (and much more heavily).",
                                            "score": 13,
                                            "author": "TheSweetestKill",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Bob Loblaws?",
                                    "score": 31,
                                    "author": "The_Professor2112",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "From the Bob Loblaws Law Blog?",
                                            "score": 31,
                                            "author": "molecuul",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bob Loblaw Lobs Law Bomb",
                                                    "score": 16,
                                                    "author": "sparkyroosta",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He'll have Lottie Dottie D.A. to answer to!",
                                                            "score": 12,
                                                            "author": "IntellegentIdiot",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Did you guys hear the news. Bob Loblaw lobs law bomb!",
                                                    "score": 11,
                                                    "author": "itsonlyjbone"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That man is a mouthfull.",
                                            "score": 11,
                                            "author": "MisterCheeks"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nice, so for a little while they can afford both rent AND food",
                                    "score": 13,
                                    "author": "MundaneInternetGuy",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It's temporary.",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We got the \"temporary $2 an hour raise\" but meanwhile sales are double and were even more shirt staffed and stressed than before while also being exposed to all these people. \n\nYeah I get $80 more per paycheck (before taxes. It's really more like $60.)  But I basically have no life outside of work and am a potential carrier until this is all over. \n\n$60 is basically enough to order takeout twice in that two week period because you are too exhausted to cook after working yourself to exhaustion. It's also how much my insurance costs per paycheck, and is less than my average electric bill because using the AC in Texas gets expensive as fuck. It got to 95 the other day, and it's only spring.",
                    "score": 61,
                    "author": "BureaucratDog",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That ad buy has a demonstrable ROI in most cases. Paying more for unskilled labor when there are 15x applicants for every 1 position has zero ROI.",
                    "score": 24,
                    "author": "MetalGearFoRM",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lesson: Don't be unskilled labor.",
                            "score": 11,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's such an insane strategy. Well paid employees are happy employees - they will help make a customer's experience amazing whenver they interact, making that customer come back. And if the customer knows the employee is making a living wage and working for a company who cares about them, then it will keep them coming back. That is guerilla marketing.",
                    "score": 17,
                    "author": "shyflydontbotherme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And it's not even a far out concept. Costco and Aldi pay their employees above minimum wage and are well loved stores.",
                            "score": 10,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Our major grocery store chain, Wegmans,  actually did give workers a $2/ hour raise during this.",
                    "score": 18,
                    "author": "ExpressRabbit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yo, it’s not enough.",
                            "score": 52,
                            "author": "bankslikemoney",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "min wage should be 24 dollars an hour if they had kept increasing like everything else did since the 70s",
                                    "score": 44,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Seriously, $15 an hour is less than the bare minimum and the federal government can't even commit to that. The living wage in the US is over $16/hour and that's assuming a full 40 hour workweek. And good fucking luck getting a guaranteed 40 hours per week if you're working a minimum wage job in the middle of a huge economic crisis.",
                                            "score": 45,
                                            "author": "MundaneInternetGuy",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm a huge Bernie supporter, and I believe in raising Minimum Wage to a living wage on a county level because $15 in Kansas is a lot more than $15 in LA, but your comment is demonstrably false; it would be a little over $8 if accounting for inflation:\n\nhttps://www.pewresearch.org/fact-tank/2017/01/04/5-facts-about-the-minimum-wage/",
                                            "score": 10,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm the CSM at a grocery store and I can tell you that our profit margins aren't high enough to support that kind of base wage for everyone. Wonder why your groceries are so cheap? Shitty wages for most",
                                            "score": 3,
                                            "author": "DrFewzion",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is the thing, they increased my pay that much at work but I'm still taking a leave of absence. That amount of pay increase is absolutely pathetic, like 2 extra dollars is going to be enough to risk me or my family dying? No, thanks.",
                                    "score": 11,
                                    "author": "whythishaptome",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In America they called it a \"hero reward.\" Basically you'll get $10, after tax, a day. That's insulting af.",
                            "score": 27,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I work at Casey's general store in the midwest and they also gave us $2/hour hazard pay but only for a limited amount of time and only on time worked and not any sick or PTO days. Theyve extended it twice but they also just laid off almost all of the part time people besides like 2 and cut all of our stores employee hours in half, besides the general manager- she still gets 45 hours and her salary pay, plus $100 extra a week.",
                            "score": 11,
                            "author": "Why-do-we-exist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh hell- a fellow Casey's employee!\n\nAre you guys doing that weird two team system starting this week too?",
                                    "score": 6,
                                    "author": "LeotheYordle",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The worst part is knowing it is only temporary, so after a month or two they'll take away the two dollar raise, while there is still a potential chance that we could become sick with COVID-19.",
                            "score": 9,
                            "author": "HQowns",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Heh I work at Kroger and our $2 hero pay ends this week LOL. It only lasted 2 weeks meanwhile we have been doing double our budget in sales for the last month every day.",
                                    "score": 4,
                                    "author": "lazava1390"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Say it with money, I always say.",
            "score": 729,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Money talks",
                    "score": 157,
                    "author": "CH705-807",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Well in the UK we're currently paying our care staff in applause 👏👏\n\nIt's great for the self promoting narcissists who post pics/vids on their feed at 8 pm every Thursday of how great they are clapping at their doors for the NHS\n\nWhen I do my 10 day shop all the supermarket tannoy is bleating out is \"care workers aren't they great\" which I'm sure the minimum wage supermarket workers love hearing on a loop all day \n \nThe one thing both groups won't be seeing anytime soon is extra money and in the US I bet the profits are going through the roof for medical companies just as much as the supermarket chains are currently killing it in profits \n\nIt's a shame this virus doesn't hunt out selfish attention seekers as they are fucking everywhere, coughing up false platitudes on behalf of those making real money off the backs of those being put at risk",
                    "score": 96,
                    "author": "Reverend_Vader",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The hospitals in my area have actually been losing money because they aren't performing surgeries as much rn. They're either talking about cutting wages or have already done it for care staff. Also we've been howling instead of clapping.",
                            "score": 26,
                            "author": "Savage2280",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same with private practices. Doctors are doing less in person patient visits and taking a lot more phone calls. Many offices have been operating at a loss, and some even having to lay off staff. \n\nOur healthcare system isn’t setup to get more money when they do more work. It is setup to get more money when they do certain types of works. The high billable stuff isn’t happening right now for many.\n\nIm sure somebody in healthcare is making money off the virus right now. But it’s not necessarily everyone you’d think.",
                                    "score": 22,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Supermarkets are not making more money.\n\nDemand hasn't actually increased, what we saw at my workplace on our busiest day is a taking of over £200,000 when we would normally expect half of that, the next day it was £50,000.\n\nRight now consumers have the same, or less money to spend. Sure people have been panic buying and spending all their money at once but their consumption is still the same, nobody is panic eating.",
                            "score": 11,
                            "author": "1nfernals",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Depends in where your store is located. Mine is up 30%+ and that's because we have a lot of commuters in the area, who would usually shop elsewhere on their way home. Meanwhile stores near universities etc. are really bleeding.",
                                    "score": 6,
                                    "author": "lylimapanda",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; nobody is panic eating   \n    \n😳",
                                    "score": 5,
                                    "author": "saltyketchup"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "everyone that gets publicly thanked is like this too. soldiers don't wanna hear your stupid shit or shake your hand, sick people don't want your thoughts and prayers, homeless people don't want you go record giving them $20\n\nwhen people are doing nothing but TALKING about doing something, that's all it is. talk",
            "score": 109,
            "author": "shezarrine7280",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is exactly how I felt in the military.  Everyone says thank you because it’s the socially acceptable thing to do and not because they mean it.",
                    "score": 28,
                    "author": "ac7275",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I honestly cringe at people who call every military personel a hero, when they don't even know the meaning of that word. No offense of course, i honestly respect ppl who stick in the army and try to make a career after listing for 9months or w.e. that's required in different countries, I did mine before going to college and though about going into military career, but damn after talking with some friends who went that path, some still are there, others left, i lost the will.",
                            "score": 17,
                            "author": "Azazir",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I appreciate op posting this \nBecause those commercials make my blood boil they do not care especially Walmart",
            "score": 414,
            "author": "inastateofmind",
            "replies": [
                {
                    "level": 1,
                    "comment": "Man this fucking YouTube Walmart ads driving me bonkers. At the end the CEO saying thank you. Clearly recorded on his phone, probably from the safety of his mega mansion, and his bank account that affords him financial comfort during this. \n\nYou can go fuck right off with that shit, bud.",
                    "score": 23,
                    "author": "jeffandeff",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I work at a Safeway and im constantly having to call my union to complain that the manager doesn't have anyone cleaning the staff bathrooms or breakroom.  Tons of attention paid to cleaning the store where customers can see us,  to the point that all of our hands hurt from the cleaner,  but behind the scenes our own toilets don't get cleaned for weeks. \n\nThey don't care about us,  only about image and sales",
                    "score": 54,
                    "author": "raspberrykoolaid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly. At work they gave us a mask. A MASK. We have to write our names on it, put it in a bag and leave it there for the next shift. They dont give a shit about our health, they just want to comply with the rules and the image.",
                            "score": 21,
                            "author": "Dreamylantern",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You should report this to the health department anonymously. Making employees share an unwashed mask is very unsanitary and dangerous, and I'm sure the health department will be very interested",
                                    "score": 15,
                                    "author": "ACatWhoFliesInTheSky",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "You get masks? We're actively talked down to like idiots for even asking for masks",
                                    "score": 5,
                                    "author": "raspberrykoolaid",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That sucks!",
                            "score": 3,
                            "author": "Starbuck522"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm pretty fucking sick of big companies and idiots behind news desks telling me \"we're all in this together\"",
                    "score": 28,
                    "author": "Linubidix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This phrase actually plays over my store radio ever so often and it never fails to make me angry\n\nNo the _fuck_ we aren't corprate, you're not the one dealing with people willingly ignoring the six feet rule _while the reminder is playing over the radio_",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dominos employee who delivered to a person explicitly stating they were sick in the delivery instructions. Profits before people. Burn this fucker down.",
                    "score": 75,
                    "author": "HertzDonut1001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hopefully it was a pay by card and leave at the door situation?",
                            "score": 35,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah their service is pretty good. You can pay tip and specify no contact pickup. The driver called me that he was outside, I didn't open the door. He placed the pizza down on the step and backed up. Once more than 6 feet away he left and I thanked him.",
                                    "score": 18,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have had multiple places deliver me food and every single place has left it at my door after knocking . i have never even had to request this.",
                                            "score": 8,
                                            "author": "Mrbuttersw0rth",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The option to pay in person at the door via cash / card reader still exists on a few take away websites in my area. These are local places that have their own drivers and don't operate thru Uber eats ect. I still specify no contact delivery in the requests field to hopefully make the delivery driver feel more secure.",
                                                    "score": 3,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Pretty sure the manager and any driver would have the right to refuse to take it",
                            "score": 13,
                            "author": "oarngebean",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have the highest sympathy for delivery drivers, but why refuse to take an order from someone who was honest about their status? Sick people need to eat too. Just leave the pizza on the ground outside and call them to tell them it’s there, no need to interact directly",
                                    "score": 19,
                                    "author": "morado_mujer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's for this reason I'm glad I have a mudroom in my house. Should I get sick I have a perfect little chamber or space for delivery personnel to never have to directly interact with me",
                                            "score": 5,
                                            "author": "MYO716"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ve seen the Walmart commercials. Ugh, they just scream “Okay, we pretended to care about you and your family, where’s our money?”",
                    "score": 6,
                    "author": "Smileyface8156"
                },
                {
                    "level": 1,
                    "comment": "Y'know at least Wal-Mart rolled out protections and customer limitations long before Lowe's did. Our CEO is dragging his feet doing anything because he is making money by putting his workers in danger.",
                    "score": 5,
                    "author": "TLEToyu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not all Walmarts, I work at one... :'(",
                            "score": 4,
                            "author": "papilover64"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Those Burger King commercials are infuriating. We all know you pay your employees shit, stop pretending you give a fuck about the community.",
            "score": 25,
            "author": "QuallUsqueTandem",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As others have said, people will clap for you, and say \"thank you\" , \"you are a real hero\", but give it enough time and they will all go back to \"you don't deserve $15/hour (if you are in America). Just look at how they treated rescue workers during 9/11.",
            "score": 469,
            "author": "the1992munchkin",
            "replies": [
                {
                    "level": 1,
                    "comment": "People say thank you and then also tell us we don't deserve more money and then outright attack us in public, too. I'm a healthcare worker in a hospital. I don't make 15$ an hour (close, but not quite). I also now have to hide my badge and change at work because people are throwing bleach on us in public. The asskissing is on my nerves. Either help us, tangibly, or leave us to it. Lip service is just that.\n\nEditing to add: about the bleach attack: I've listed two separate links to articles about it. My work was proactive and told us about it and directed us how to be safe. Sorry if it offends any delicate feelings, but that's all I know.",
                    "score": 167,
                    "author": "FormerSadWalrus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why are people throwing you bleach in public? WTF?",
                            "score": 85,
                            "author": "the1992munchkin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because we're apparently Tainted. Nope. There are plenty of positions in hospitals where we don't often get our clothes dirty. I'm an inhouse transporter. I've gotten my top soiled three times in two years of full time work. But, people assume we're all covered in covid. I'm not even allowed in the covid ward, and we only have two patients in there! Trust us to know if we're clean or not. And on the way to work? We're pristine.",
                                    "score": 88,
                                    "author": "FormerSadWalrus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Health care workers probably more „safe“ than other workers who still have to work outside of their home, as most of the people in medical fields know how hygiene and disinfection work. \n\nAnyone throwing bleach at another person is an idiot, that can‘t (or shouldn’t) be legal. I am no pro but I don‘t believe throwing bleach* at someone who has an infectious disease will make them less of a danger. It‘s just stupid. \n\n*Being realistic, how much bleach can one carry along to „disinfect“ health care workers they meet this way? That just doesn‘t make sense, at all.",
                                            "score": 41,
                                            "author": "Water_Melonia",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;\tthat can‘t (or shouldn’t) be legal\n\nUm, I’m pretty sure tossing bleach (or any substance, probably even water) at another person, unprovoked, has always been illegal via assault and/or battery.",
                                                    "score": 22,
                                                    "author": "pizza_for_nunchucks"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Because they're assholes, duh",
                                    "score": 18,
                                    "author": "Niku-Man",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 20,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "theyre the same people that the warning to not drink bleach was made for",
                                    "score": 10,
                                    "author": "kittens12345"
                                },
                                {
                                    "level": 3,
                                    "comment": "Nobody is getting bleach thrown at them. They're just being dramatic\n\nWhat? Did one lunatic do this and now this person says it like it's happening to all healthcare workers on a daily basis.",
                                    "score": 5,
                                    "author": "caffieinemorpheus"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You have more self control than I friend. Meanwhile I'm a truck driver so I'm the scum of the fucking earth, I'm not allowed to exist on the road without illiciting hatred from every cunt that passes me in traffic. I can't wait for late stage capitalism to finally collapse in on its neglected foundations.",
                            "score": 25,
                            "author": "lesserDaemonprince",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, truck drivers are the scum of the earth until the day the toilet paper runs out.  Then they're greedy, lazy bums.  How do we think toilet paper gets from the factory to the supermarket?  Magic?",
                                    "score": 16,
                                    "author": "Supposed_too",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;\tI also now have to hide my badge and change at work because people are throwing bleach on us in public. \n\nWhat are you even talking about?",
                            "score": 4,
                            "author": "BagOnuts",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hero worship is society's way of patting itself on the back over not doing anything about things they know are objectively unjust. Nurses being paid dick all while working 14 hour shifts that exposes them to a deadly disease? You get endless posts on Reddit and Facebook about \"superheroes\" in their PPE but not a fucking peep when it comes to actually addressing the issue of healthcare workers having to use rubbish bags as PPE. It makes my blood boil",
                    "score": 35,
                    "author": "2022022022",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah wife is a nurse and has friends in Alabama working for 20/hour buried under 50k in student debt, living with their parents and worried about bringing home covid. No PPE available, it goes to the doctors. \n\nThey're heroes until it's time to pay up.",
                            "score": 16,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Oh, look. It's the teacher treatment. Teachers have been hearing this sort of thing for 40 years (not that it makes it okay).",
                            "score": 4,
                            "author": "ThrowAwayAcct0000"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You guys need unions. We don't have a minimum wage where I live, but agreements between unions and companies. And if the companies misbehave, it is very easy to mobilize enough force to completely shut down their business.",
                    "score": 19,
                    "author": "Checkmate1win",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's tricky because most corps will fire you for even talking about unionizing with your coworkers and they'll be fired for not reporting you.  When I had crappy department store jobs even decades ago they'd all show you videos about how you basically drop everything and go report if a coworker's even casually talking about unions as if they were talking about shooting up the store.  It's unreal how little power the American working class has had for a long time and how defanged they are, I know anyone from another country I said this to had a hard time believing it.",
                            "score": 27,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I have heard of this phenomenon. It makes it very hard to actually have it put in effect. \n\nOnly solution I see is being inspired by the French and fight for your rights. Of course all the other countries with unions have fought hard for it too, but the French is a lil more belligerent.",
                                    "score": 7,
                                    "author": "Checkmate1win",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What with the guillotines and all.",
                                            "score": 9,
                                            "author": "CodeOfKonami",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It shocks me every time I hear an American talk about it to be honest. I'm in the UK and I can't fathom not being signed up to a union at all times. Pretty much one of the first things I do when I join a new job is ask if we have a dedicated union and if we don't which more general union usually represents us.",
                                    "score": 8,
                                    "author": "babydave371",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For us young and youngish people we have the political dynasties our parents put in place to blame for it all, starting with Reagan.  Both dems and republicans have worked to erode workers' rights since before we were born and now we're saddled with the outcomes of all the decisions Boomers made.",
                                            "score": 12,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There already is a union (the United Food &amp; Commercial Workers) for grocery workers, and it's one of the biggest unions in the country.  However, there are anti-union laws in place in many states that make it difficult for grocery workers to unionize, so not nearly as many grocery workers are in the UFCW as might otherwise be.  \n\nOne thing that Americans might choose to do if they're truly serious about improving pay for grocery workers would be to make a point of only shopping at union stores.  Of course, in much of the U.S. there are no unionized stores, but in those places where there are both unionized and non-union stores, why not shop at the union store and send a message with your money?",
                            "score": 7,
                            "author": "JuzoItami",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;but in those places where there are both unionized and non-union stores, why not shop at the union store and send a message with your money?  \n\nI like this, get to work US!",
                                    "score": 4,
                                    "author": "Checkmate1win"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like a lamb going to get slaughtered at my work. No one gives a shit and isn’t taking precautions. And I agree, pay us what you think our life is worth!!!",
            "score": 226,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Heh, they already do. Believe me, they already do.",
                    "score": 126,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Much more, actually",
                            "score": 22,
                            "author": "cumfarts",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly. If slavery was legal, they'd jump on that shit in a heartbeat.",
                                    "score": 11,
                                    "author": "onetruemod",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well it's be irresponsible to the shareholders not to. Hmm maybe something is a little twisted in our system....",
                                            "score": 4,
                                            "author": "SoutheasternComfort"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Heh, they already do. Believe me, they already do.\n\nNo I don't think they do.  \nThey're forced to pay them based on the law, not what they believe their worth.\n\nThere are so many that would pay them even less if they could get away with it.\n\nSad really",
                            "score": 3,
                            "author": "Habanero_Eyeball"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm taking everyone's temperature when they come to work. I am security, not medical staff but my boss is dickless and wouldn't go to bat for us so either I do it or the 70 year old guy in terrible health does it.",
                    "score": 28,
                    "author": "wickedblight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Solidarity from another Security guard here.  Boss still thinks this is the flu, and the higher ups haven't even sent out a message to wash our hands or anything.\n\nNo pay raise, no paid sick, no vacation, and the medical plan is worthless and for my family costs more than I make in a month.\n\nBut hey, this place is secure and the few people that still come into this place for some reason are always greeted with a smile, a nod, and a polite good morning.",
                            "score": 14,
                            "author": "TheHopeStrikesBack",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 87,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. Kinda getting tired of the empty 'thank yous', especially from people who haven't changed their consumer habits despite shelter-at-home orders. I have bills to pay and it's my job, I don't exactly *want* to be at a location where dozens of people shop regularly, each one of them a possible disease vector.\n\nAt least we're getting paid a weekly hazard bonus applied to each hour of work, roughly equivalent to a temporary 15-20% raise. Just gotta try hoarding that money, 'cause they'll halt that as soon as things return to some sense of normalcy.",
                    "score": 28,
                    "author": "TimeZarg",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Helps them imagine essential workers as valiant heroes instead of people who can’t run off to their vacation homes to ride out the pandemic because they have bills to pay. And no vacations homes. \n\nCompletely out of touch and patronizing.",
            "score": 85,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "100% fucking true.. same bullshit happened at my job. The rich love to take and walk on others.. and make up stories instead of payment for services rendered. It's disrespect, bottom line..",
                    "score": 30,
                    "author": "snow_traveler",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it's now time to eat them",
                            "score": 11,
                            "author": "poopystinkyhed"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And then they have the nerve to complain that they're \"bored\" staying at home. Essential workers would love to have the luxury of being able to quarantine",
                    "score": 5,
                    "author": "ACatWhoFliesInTheSky",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work in the medical field. The thank you applause bullshit needs to stop. Fuck off and give me proper PPE. This passive “thoughts and prayers” negligent mentality that this country loves so much is getting people killed every day.",
            "score": 59,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "While I get that on a corporate level that BS is absolutely disingenuous and is completely for profit, what about on an individual level? \n\nI'm a minor who's trying their best to follow all the rules, who has no money to donate and can't volunteer. I'm scared, I have no control over anything right now, and I want to help but I can't. I want higher minimum wages, I think the treatment of healthcare, retail, and other workers is awful, and I want to help, but my voice won't be heard by the people in power. The most I can give right now is a thank you and my respect. \n\nIs that annoying? Should I stop? I don't mean that as a condescending rhetorical question, i'm genuinely asking if that does more harm than good.",
                    "score": 5,
                    "author": "idk_anymore143"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Louder so corporate can hear you over the jangle of their jewelry",
            "score": 146,
            "author": "VolitheBear",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Those in the cheaper seats, clap. The rest of you just rattle your jewelry.\"",
                    "score": 8,
                    "author": "Faboogaloo",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 26,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They're clapping for a video, not for the people.",
                    "score": 7,
                    "author": "Azazir"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wanna get more mad?! Look into what the company paid to have the commercials made AND aired!!",
            "score": 33,
            "author": "kavien",
            "replies": [
                {
                    "level": 1,
                    "comment": "And they will make that money back because it's basically just an advertisement for their store.",
                    "score": 10,
                    "author": "DisparityByDesign"
                },
                {
                    "level": 1,
                    "comment": "Wanna get more mad?! Look at how much the ceo of a company is making right now while doing jack shit versus the workers who have to work in these terrifying conditions.",
                    "score": 5,
                    "author": "ionicshoe",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly anyone who has to work out of the home right now should be getting hazard pay especially those who come in contact with the public in anyway.",
            "score": 25,
            "author": "MertWhenNeeded",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup. A lot if these companies are making record money. Grocery stores are doing phenomenal. As the only thing open, everyone just eases their shopping habits there.",
                    "score": 8,
                    "author": "BullShitting24-7",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here here. I literally was subjected to a Walmart YouTube add thanking their “hero” workers while failing to mention that they receive subsidies and spend millions on lobbying to insure they don’t have to play those “hero’s” a living wage. We are not heroes. We are wage slaves who have to risk our lives for base necessities. It is pathetic, but we eat that shit every day with a spoon and ask for more.",
            "score": 46,
            "author": "BurtReynoldsLives",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That's because they aren't thanking you as a person they're thanking you as cannon fodder.",
            "score": 11,
            "author": "T4RTT0t3R"
        },
        {
            "level": 0,
            "comment": "But people are applauding at 8pm.",
            "score": 10,
            "author": "mezcao",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 181,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They don't even know their own history. The minimum wage was created to be a living wage.\n\n&gt;During an address FDR gave about one of his many economic salvation packages, he explained that “no business which depends for existence on paying less than living wages to its workers has any right to continue in this country.”\n&gt;\n&gt;At the time, Roosevelt’s Fair Labor Standards Act of 1938—passed as part of New Deal legislation—set minimum wage at 25 cents. Roosevelt intended this rate to be “more than a bare subsistence level.” The minimum wage was created expressly to ensure that people of all skill-levels, if they worked, could “earn a decent living” off those wages—thus, a living wage.",
                    "score": 85,
                    "author": "chunes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Here are some numbers for context. \n\nNew home price 1938: $3900 (15,600 hours of minimum wage work)\n\nNew home price 2018: $329,000 (45,380 hours of minimum wage work) \n\n\n\nAverage rent 1938: $27 a month (108 hours of minimum wage work)\n\nAverage rent 2017: $1082 a month (150 hours of minimum wage work) \n\n\n\nPrivate university tuition (1920's-1940): $250-$420 a year (1000-1680 hours of minimum wage work)\n\nPrivate university tuition (2019): $35,680 (4920 hours of minimum wage work) \n\n\n\nSources: [1](https://www.businessinsider.com/the-cost-of-living-2014-10) [2](https://www.deptofnumbers.com/rent/us/) [3](https://www.usnews.com/education/best-colleges/paying-for-college/articles/2019-06-25/the-cost-of-private-vs-public-colleges) [4](https://www.bestcollegesonline.com/blog/a-timeline-of-college-tuition/)",
                            "score": 59,
                            "author": "Ihatethemuffinman",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also itt: The fallacy that others have it worse makes your situation okay.",
                    "score": 3,
                    "author": "ProdigiousPlays"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The reason you're being paid crap is because replacement workers are easy to find. \n\n\"You want to quit because we're not paying you enough? Be my guest. There's the door.\" \n\nThe employer will have a dozen new applicants next week ready to fill that vacancy because people are constantly looking for jobs.\n\nLook at it from the employer's point of view: why should he pay you above minimum wage when there's a dozen people willing to do your job for minimum wage? \n\nIn our economy you are paid based on how difficult you are to replace, not how much good you bring to society.\n\nThat's why ambulance drivers make $30k a year and Justin Beiber makes $30 million a year.  Which one of those is more important?",
            "score": 39,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; In our economy you are paid based on how difficult you are to replace, not how much good you bring to society.\n\nWhile this sounds true and may be one of the factors, it isn't actually true and is misleading.\n\nPeople are paid what they're paid. Two people can have the exact same job with the exact same responsibilities and get paid different amounts based upon their personality, personal connections, negotiating ability, what church they go to, etc etc etc.\n\nPretending like pay structures are at all dictated by one determining factor without a single piece of evidence is a great way to earn some internet points, but is complete and utter horseshit.",
                    "score": 9,
                    "author": "sandiegoite",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That's why you shop. Minimum wage requires minimum effort. Don't give two weeks, walk when you find an easier job. Don't stick with one until you've found one that will pay you for effort or will keep you around for doing next to nothing.\n\n\nThat's ten years of experience in the restaurant industry doing literally everything from dishes to managing kitchens talking.",
                    "score": 15,
                    "author": "HertzDonut1001",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Calling people heros is easier than helping them, works well for the military.",
            "score": 8,
            "author": "bargu"
        },
        {
            "level": 0,
            "comment": "It really is astounding how \"I deserve to afford being able to live\" is a controversial statement. If things like this don't change when the pandemic ends, there will most certainly be an uprising of essential workers against the corrupt capitalist hell that is America. We'll see how the people in these comments be when they're denied what they very much need yet look down on 🤭",
            "score": 135,
            "author": "des-the-tiny",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 81,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;\tcorporations like Walmart will only hire you part time so they don’t have to give you benefits. You’d have to have 2 jobs to live on that.\n\nThis happened to me. But I couldn’t even get a second job, because despite only giving me 12-29 hours a week, Walmart expected me to have fully open availability. And there was no consistency, so I couldn’t even get a general idea of when I could declare myself available for another job. My schedule would be totally different every week.",
                            "score": 11,
                            "author": "lorsquie",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Most people working minimum wage work as hard as a lot of people making $18-20 an hour. And in many cases could be doing their job with 4 hours of training. Everyone working should get paid enough to live.",
                            "score": 29,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One thing I've found in my career is that the more I get paid usually means the easier my job has gotten. I've worked minimum wage in retail, and that was one of the hardest and most stressful jobs I ever had. I'm a software developer now, and honestly... it's really easy to do my day to day, and there's virtually no stress. I've had plenty of jobs in between and it's been this trend of more money = less work.\n\nI get where people are coming from when they think people don't deserve a living wage. They see the jobs virtually anybody can do and think it's not fair that those people would earn what they are earning, especially after developing special skills. Paramedics for instance earn around $15/hr. Criminal.  \n\nThese people are forgetting that raising minimum wage will lead to wage increases in their industry as well so that the industry stays competitive and attracts the best talent. So even from a selfish point of view, the grocery worker earning a living wage is good for you. It also boosts the economy, so the fast food worker earning a living wage is good for you. Then there's the fact that happy people work better, and put in more effort. This means better service all around. So the waitress earning a living wage is good for you.  \n\nThen of course there is the moral reasoning so many people just turn off. Minimum wage jobs aren't easy. They are extremely difficult and taxing, they just require little skill so anyone can do it. If you had the choice between your office administrator job and flipping burgers, both paying the same... you wouldn't be flipping burgers. If I as a software developer could earn the same money waiting tables in a restaurant... I'd still be a developer. So few people get this.",
                                    "score": 35,
                                    "author": "AmazingSully",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Raising the minimum wage and paying the people who earn the least more means they are able to purchase more things. People who are poorer are more likely to spend that money to meet daily needs in the short and medium-term, as well as any luxuries that may make life easier. \n\nThe impact of the money spent by them is magnified as that money changes hands from purchaser to store/service to employees to other stores/services. \n\nIt's called the multiplier effect. Giving people money so they can spend means that money can be used to pay the salary of someone else, who can then spend it. Some of this leaks out through taxes, which can be reinvested into the community to share the cost burden of communal infrastructure and services (healthcare, roads, etc).\n\nIn the grand scheme of things, walking through this reasoning is hard in a large number of cases when the other party sees salaries as a zero-sum game. In other words, a sense of \"if someone's pay is being raised due to government regulation but mine isn't, then they shouldn't get a pay raise. Someone's getting richer so I'm getting poorer!\"",
                                            "score": 18,
                                            "author": "asstalos",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And to make this happen, we need to convince people too psychotic to arrive at the conclusion that people who work hard should at least eat.  To make this happen, we have to convince elites who have grown too dim to comprehend that having all the money is useless once it's worth nothing.  If we are to achieve this, we must first get through those whose sole joy in life is the misery of others.\n\nI'm not optimistic about our national prognosis.",
                                                    "score": 8,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's grocery. Anyone can do it. You are replaceable by someone who would be happy to have that wage.\n\nSorry.\n\nSource: an army vet working in retail",
            "score": 109,
            "author": "oss_spy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Listen here mclucksky if your employer doesn't provide enough sick leave and healthcare options for me to get a sex change operation then that violates my human rights. Check yourself bigot.",
                    "score": 35,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/drama] [Commies, socialists, and NEETs btfo after I tell them they aren't worth six figures](https://www.reddit.com/r/Drama/comments/g0vtqw/commies_socialists_and_neets_btfo_after_i_tell/)\n\n&amp;nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
                    "score": 17,
                    "author": "TotesMessenger"
                },
                {
                    "level": 1,
                    "comment": "Right on. The same people bitching are the first ones to miss shifts, show up late and generally put in a sub- par effort into their work. You have to make yourself a sought after commodity and earn your way to the top. Bottom tier grocery workers are never going to make 70k a year because it requires no skills and the basic ability to show up on time. It's very easily replaceable.\n\nAt a certain point if it's too expensive to hire humans for a job that requires basic skills they will just bring in machines to take over- as many grocery chains have started doing with the self checkouts.",
                    "score": 17,
                    "author": "hello_hellno"
                },
                {
                    "level": 1,
                    "comment": "I'm going to get downvoted because of how shitty this hivemind is, but thank you for your service, even if you did or didn't go into battle",
                    "score": 8,
                    "author": "1ya",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So brave",
                            "score": 6,
                            "author": "Denny_Craine",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Instead of spending money on \"thank you\" add, you should be spending money for labor. People need money, especially when you're risking your life",
            "score": 7,
            "author": "mrbtheboss205",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yo and now we are getting our gratz when before they didnt even see us as equals!!!",
            "score": 5,
            "author": "ASimpleCaptain"
        },
        {
            "level": 0,
            "comment": "Even worse some are getting pay cuts https://www.independent.co.uk/news/world/americas/us-politics/coronavirus-us-healthcare-doctor-pay-nurse-wages-a9440521.html",
            "score": 4,
            "author": "nijay123",
            "replies": []
        },
        {
            "level": 0,
            "comment": "true but isn't that how society always reacts, remember how the bill that pays for medical treatment for 9/11 first responders  was not going to get reauthorized if john stewart (a fucking comedian) didn't go on TV and pressure members of congress to vote for it, yet every year the fucking say \"never forget\"",
            "score": 4,
            "author": "stathow"
        },
        {
            "level": 0,
            "comment": "Organize and unionize.",
            "score": 13,
            "author": "TurboAbe",
            "replies": []
        },
        {
            "level": 0,
            "comment": "They’re giving grocery workers a $2 per hour raise here in Ontario.",
            "score": 14,
            "author": "cindybubbles",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 20,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In Lithuania, my friend is working in factory, which makes pillows/bed sheets etc for abit more than minimum wage. Whole working place is same size, if not bigger than maybe 200-300 ppl stadium/arena,  there's now 2 shifts(depends on how much work there''s a night shift too, 8y ea) and around 40ppl per shift, so 80ppl + managers etc. that go to work and all they did was add a 30min window from morning to day shifts ( so 5:30 they start working and at 14:00 they're supposed to leave the workplace, then for 30min someone is supposed to use disinfectant  everywhere, when they announced it, he said first day its smelled really bad with that disinfectant smell, next day, day shift came as if it was normal everyday with no smell of disintectant and the same till now(since our country announced lock-down/quarantine in 03/27). Nobody got a raise, everyone is expected to go to work and workplace has literally no rules for quarantine, they put hand sanitizers near coffe machines and that's it. they now started firing ppl off, already fired close to 20 in the last 2 weeks, not from his team tho. \n\nOur country started using police officers to check on public transport/cars and if people are keeping to the rules. I told him to gtfo from there half a year ago already and he's still thinking about it till now, he's only 22y old and has saved up some cash and still lives with mom(he pays rent,she buys food etc. so no problem on saving) and he could literally live for a year with his saved up money for rent/food., but still goes into that shit...",
                            "score": 4,
                            "author": "Azazir"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "18.50? isn’t a living wage? tf? go cry somewhere else idiot",
            "score": 3,
            "author": "FD_Fickler",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You are doing unskilled labor that basically anybody can do. Your pay is not determined by how important your job is, its determined by how easy you are to replace.",
            "score": 9,
            "author": "Who_Cares-Anyway",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I can't say the same for myself about being a grocery worker, but I totally can agree that I'm tired of them. They don't seem genuine at all and at the end of the day they're just trying to make a buck. Especially these stupid car commercials. Who TF is thinking about buying a car right now?",
            "score": 5,
            "author": "wyccad452"
        }
    ]
}