{
    "id": "k9sxat",
    "score": 35628,
    "title": "If you have been mostly quarantining since March, you are my hero and I, along with my fellow healthcare workers, appreciate you.",
    "author": "phd_dude",
    "date": 1607524625.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/k9sxat",
    "media_urls": [],
    "other_urls": [],
    "postText": "You, yes you, are my hero.  I don’t know you, but you have helped to keep my family safe.  I am physician resident this year, aka my intern year. Much of the news focuses on those not wearing masks, not social distancing, and the political leaders and individuals behind the spread of this disease.  **So I need to get this off my chest, not enough is said about the countless number of people who have sacrificed towards trying to slow the spread.**  \n\n\nI appreciate every sacrifice, every missed opportunity, every missed dream, every canceled vacation, every lonely holiday and birthday, every missed school event, every moment of insanity from social isolation, and every moment of self-restraint you have shown.  Social isolation via solitary confinement is considered one of the cruelest forms of punishment you can put on someone.  Although not entirely the same, many of you have chosen to face isolation to protect healthcare workers, family members, the elderly, and strangers you have never met.  Many of you go to work (or work from home), and then turn down social opportunities for this cause.  Only you know the depth and extent of your sacrifice, and to you I tip my hat.  It makes the fear of going to work every day and knowing that I could accidentally bring something home that could kill my family much more bearable.  Thank you for wearing masks, following guidelines and being a great example to others.  \n\n\nI know you are discouraged at the recent surges despite your best efforts.  I know you feel cheated as you see others not willing to make the same sacrifice.  You are the “helpers” that Mr. Rogers spoke of to look for during times of tragedy.  The times “person of the year” may be directed towards essential workers, but I want you to know that I consider you part of these essential workers.  You are the type of people that would sacrifice their life for a higher cause. You are the ones that have helped the pandemic become less worse than it would have been.  Thank you.  Please reach out and stay connected with others.  Please get help for your mental health if it has taken a toll on you to make such a sacrifice.   \n\n\n**TL/DR:  I'm tired of all the focus on those not helping the cause. \nThose who have been quarantining since March are my personal heroes and you may never know how much it has meant to me and my family.**\n\nEdit:  Thanks for the awards but you are the heroes that deserve them :)  Also, I do understand people have to work and should work.  I am grateful for people who go to work as well (100%) and who are also trying to minimize exposure outside of work.  \n\nI also agree that mental health is very important. Please find ways to get out and into nature, find ways to connect with people socially, and seek help for your mental health (via tele- services etc.).",
    "comments": [
        {
            "level": 0,
            "comment": "I'm a lab tech in a microbiology lab. We've been doing covid testing since about March/April, working extended hours and overtime. I haven't seen my friends or family since February, it's just better not to put them at risk considering I am exposed to this thing every day. \n\nNobody tends to think about pathology staff, we're the invisible behind the scenes folks you always take for granted. We never get thanks, only angry phone calls when a test is taking too long because the machine is broken or whatever. It can be very demoralising. \n\nBut, we're still there. I was expecting staff to drop and start quitting with stress, but everyone's still there. And when this thing is finally over? We're all going on the biggest fuck-off all nighter bar crawl you have ever seen. Motherfuckers gonna *know* the Micro crew is in town that night.",
            "score": 997,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 260,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You may have a point. The Spanish flu pandemic lasted from 1918-1920. After WWI and that, just check out what happened next: The Roaring Twenties. :)",
                            "score": 150,
                            "author": "Ah_BrightWings",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No one tell this guy what happened between 1929 and 1945.",
                                    "score": 118,
                                    "author": "ValAsher",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm well aware of the Great Depression and of course WWII. I was just saying that immediately after the pandemic and WWI ended, people partied.",
                                            "score": 52,
                                            "author": "Ah_BrightWings",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Many cream pies were made",
                                                    "score": 17,
                                                    "author": "ProGamusian",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Did they have porn hub back then?",
                                                            "score": 11,
                                                            "author": "NOTaRussianTrollAcct",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They had hookers for a nickel",
                                                                    "score": 16,
                                                                    "author": "Plump_Chicken",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "and don't forget blackjack",
                                                                            "score": 7,
                                                                            "author": "NapalmWeed",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Can't call him that anymore, that was 1920's lingo",
                                                                                    "score": 4,
                                                                                    "author": "gripmastah"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The Great Hangover.",
                                            "score": 20,
                                            "author": "TriXieCat13",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is why I'm working on getting my shit together so when that blessed day comes, I'm ready AF. So ready.",
                            "score": 22,
                            "author": "TigerMonarchy"
                        },
                        {
                            "level": 2,
                            "comment": "I want to throw a huge party when this is over but I feel like it’s going to be kind of a slow roll with the vaccinations and feel a little... anticlimactic?",
                            "score": 3,
                            "author": "sketchahedron"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks for your work. My sister is a lab tech too, and staying busy!",
                    "score": 20,
                    "author": "RavenAva"
                },
                {
                    "level": 1,
                    "comment": "Thank you so much for your incredibly important contributions! Know that a random Redditor appreciates you &lt;3",
                    "score": 13,
                    "author": "the_hummingbird_"
                },
                {
                    "level": 1,
                    "comment": "I'd buy you all a round if the Micro crew crosses my path.",
                    "score": 9,
                    "author": "ghintziest",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would give almost anything to just browse a crafts store in silence for an hour, but I’m doing my bit.",
            "score": 1097,
            "author": "p0tat0p0tat0",
            "replies": [
                {
                    "level": 1,
                    "comment": "I miss just strolling my library. \n\nI saw someone on YouTube the other film some of their trip to the library and I was just SO jealous they could go inside. Mines at least open, but you have to select books online and pick them up in the lobby. \n\n\nI miss casually looking for books and picking up weird finds 😔\n\n\nTruly a tiny sacrifice to make but it’s like one of the first places I’ll go when everything goes back to normal lol",
                    "score": 267,
                    "author": "Lmb1011",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too. I think I miss the library the most. I was thinking they have probably lost funds and they could probably sell time slots for patrons to browse alone. You know, like $20 for 20 minutes or something like that. There would probably be a lot of people that would do that, but then it would open up a whole can of worms for those that simply cannot afford that right now. (Me being one of them.)",
                            "score": 55,
                            "author": "elisha_gunhaus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They did this model of library browsing somewhere...I remember reading about it. \n\nLibraries are not only needed for those who want to read, learn, and research...but also for lower income/homeless people to access the internet to apply for jobs or resources. \n\nLeaders should definitely have looked into creative solutions for library access.",
                                    "score": 23,
                                    "author": "BellaRojoSoliel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's not always available with winter weather here, but my local library has been doing outdoor computer lab hours for anyone who needs the access. They have someone monitoring the two distanced mobile computer stations all the time and they sanitize things well after people use them. You also have to sanitize and wear a mask the whole time to use them.  They're also a wifi Hotspot for anyone who needs it for remote school.",
                                            "score": 10,
                                            "author": "St3phiroth",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh that’s good, at least they were looking for *some* sort of solutions. Maybe not perfect, but nothing is this year. Gotta try to make it work!",
                                                    "score": 7,
                                                    "author": "BellaRojoSoliel"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah I know the feels. The library was one of the places I could take my 4 and 6 year old as a \"day activity\". Part of me being a mom is planning outings, playdates and activities for my kids. Since covid I havent taken them anywhere aside from the store very rarely (they wear masks and are not allowed out of the cart or to go around touching things. There has been the odd playdate with others that have been careful. I mean, I couldn't even take them to the park when it was warm because the playgrounds were off limits and then they just spent the whole time questioning why they weren't allowed on the equipment. No physical school or preschool anymore, no trampoline/play places, no library, no rec center classes, swimming or local sport teams. It's been hard on everyone just inside all the time.",
                            "score": 12,
                            "author": "DieSchadenfreude",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s got to be so frustrating. I can’t imagine how hard it been on kids, and subsequently parents, to not be able to let kids be kids especially when it’s hard for them to understand just what a pandemic is.",
                                    "score": 7,
                                    "author": "Lmb1011",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I miss seeing movies in the theater",
                            "score": 15,
                            "author": "CatOverlord2020",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I honestly wasn't a big movie-goer, but now that they are closed I feel like I would kick a child just to go see a movie. Hopefully soon we will be able to.",
                                    "score": 10,
                                    "author": "zeek_smol",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hey, live your dreams and kick that child. They’re everywhere and they can’t fight back.",
                                            "score": 4,
                                            "author": "frittataplatypus",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Me too! \n\nI bundled up and went to bookstore in August, then felt guilty for a couple of weeks.\n\n(Bundled up = masks, protective eyewear, gloves)  I got warm, but I figured all the bases were covered. \n\nMy husband and I are currently discussing if we want to make another grocery run this year, or just deal with running out of dishwasher detergent.",
                            "score": 7,
                            "author": "AnswerIsItDepends",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just shop online, most grocery chains have delivery options now.",
                                    "score": 3,
                                    "author": "someguynamedjohn13"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes. I miss hanging out and browsing the library, then going to a cute little coffee shop to sip and read. The coffee shop thing was a new discovery for me (former Mormon, so no devil bean juice for me!) and I’ve been shocked at how sad I am to lose it again so quickly.",
                            "score": 3,
                            "author": "Asher_the_atheist"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I’ve been trying to find new things to read by starting off with a book I know I like, then seeing what comes up in the “other people who looked at this product have also bought ___”. Or by browsing on good reads or other websites. It isn’t the same, but it’s a good way to find books that I can get a virtual copy of through the library.",
                            "score": 3,
                            "author": "puportoddler",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh for sure. \n\nIt should be noted my personal library is large, and I have a huge backlog of unread books\n\n\nI just really like the library 😂",
                                    "score": 6,
                                    "author": "Lmb1011"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Me too, friend. Me too.",
                    "score": 103,
                    "author": "booktrovert",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I work part time at a craft store that has stayed open this whole time because it was deemed \"essential\" due to selling mask making components. I will say this, I mirror OP's sentiment, and am grateful for those who have lessened the strain (if I didn't need money to survive, I too would be in quarantine), however, those who the media focuses on are the ones shopping, and therefore are not the kindest or most thoughtful of individuals. What I miss most are my kind and respectful regulars who I can \"ooo\", and \"awww\" over pictures of thier latest projects and maybe say hello to thier fur baby. \n\nAfter 20 years of customer service, I'm done y'all because it's been 9 months of black friday shoppers.",
                            "score": 112,
                            "author": "Bluebeauty17",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I work retail, in BestBuy specifically. I have never been abused and pushed around at work like I have in the last 4 months. It's like, only the assholes show up to shop and yell at workers. It makes sense now, the empathetic customers are being responsible and staying home. *Sigh*. Black Friday Everyday.",
                                    "score": 24,
                                    "author": "QQSolomonn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I hate that for you, and it's those assholes that have basically worsened conditions for all of us. We've only done curbside pickup, or shipping, since this started. When I am finally able to go into a store again someday, I'll be sure to be extra nice and grateful to all of you. Not that it would make up for those asshats...",
                                            "score": 9,
                                            "author": "PedanticMouse"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Me, but with thrift stores. I miss them so much, but I would absolutely hate if I unknowingly spread COVID. So, I stay home and browse Etsy and do what I can to protect my family and neighbors.",
                    "score": 45,
                    "author": "Discalced-diapason",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I try to do grocery shopping at odd hours cause there's a goodwill right next door and I like to do both.  But there's always a line of like 10 people waiting to get inside.\n\nwtf! I guess I'll just get groceries then.",
                            "score": 5,
                            "author": "not_a_moogle"
                        },
                        {
                            "level": 2,
                            "comment": "Same. I miss thrifting so much!!!!",
                            "score": 4,
                            "author": "Vesenya5000",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I went into Michaels the other day. The line-up to cash was at least 40 people long. The older lady behind me took one look at the line and goes 'wow, yeah, I don't need a Christmas wreath that bad' and walked back out.",
                    "score": 33,
                    "author": "obeehunter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did that at Lowes the other day, I was there for an extension cord. I didn't need it that badly, I'll go during the day while I'm working when it's not so busy.",
                            "score": 3,
                            "author": "jcutta",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I miss aimlessly wandering around Home Depot",
                    "score": 10,
                    "author": "rebuiltalternator",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Just anything other than a grocery store. A museum. Live music",
                    "score": 18,
                    "author": "nojustlurkingty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And to actually browse in a grocery store and get meal ideas. Now it's make a list the night before, go at 7AM, get what's on the list, and get out.",
                            "score": 11,
                            "author": "JustaRandomOldGuy",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Live music is mine. Thrashing around in a mosh pit at a Punk show was my way of letting some steam out.",
                            "score": 9,
                            "author": "ABotelho23",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Movies! Gosh, I miss the cinema!",
                            "score": 6,
                            "author": "Eineed",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just wanna go eat at a restaurant with a bunch of friends I haven't seen in almost a year now like we used to do every once in a few months. Oh well.",
                    "score": 23,
                    "author": "UberSquirrel",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Don't do it. I tried to get my sister a Christmas present that I've been unable to source online and it was torture. I entered a small store with three people inside, all wearing masks and distancing, headed to the back room and started browsing. When I came out 15 minutes later it was packed. Wall to wall I nearly cried. So many people were maskless, not coving their nose, touching each other, coughing, laughing like it's any old day. I literally hid in the back for half an hour until the crowd thinned out and I'm not going into town for the foreseeable future.",
                    "score": 32,
                    "author": "bangitybangbabang",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I’ve been holding fast and staying inside. The only other indoor place I’ve been besides my apartment is the elementary school gymnasium where I dropped my ballot off. \n\nIt blows.",
                            "score": 12,
                            "author": "p0tat0p0tat0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wanna take the kiddo to the zoo :(",
                    "score": 3,
                    "author": "JCtheWanderingCrow"
                },
                {
                    "level": 1,
                    "comment": "There's a 24hour grocery by my house and I'll only go at 11pm or later on a weekday so it's deserted and I can shop in peace and use self-checkout, but even then I know I'm risking the plaguelands. But it feels like a vacation and I kinda hate that it feels like it.",
                    "score": 4,
                    "author": "radenthefridge"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not a hero. I've quarantined most of the time to save myself above anyone else. As a ripple effect, some other people may have been helped out too, but I'm not a hero.\n\nedit: wow i genuinely wasn't expecting this at all. appreciate the kind words! stay safe",
            "score": 393,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ya know, you deserve to feel good about yourself here. Hear me out...\n\nI think 'hero' should be seen as fully subjective, a lot like 'attractive'. You can't  really call yourself attractive without sounding like an ass. You probably shouldn't call yourself un-attractive, because that sort of judgment impacts your self-image over time. Instead, if someone calls you attractive, it means they find you attractive! The same should apply to heroism.\n\nToday, OP thinks you're a hero - and so do a lot of other people. Doing the right thing isn't always easy, even if the right thing aligns with your self interest. Most people will never know the motivations for your actions, but everyone will experience their outcome.\n\nThanks for doing the right thing, and for treating yourself well too. 👍",
                    "score": 225,
                    "author": "MycoNot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for this. I am potentially high risk, so myself and my boyfriend have been hardcore quarantined most of this year. He gave up going to his improv comedy rehearsals, which is his passion, even though most of his group was still going. Just to keep me safe.\n\nWhen I saw this post, I thought: I'm not a hero. I'm doing it for selfish reasons, really. But I like to think I'd also do it even if I wasn't high-risk. And I do hope that my actions have had a positive influence.\n\nI think the *really* amazing people are those like my boyfriend (u/DaveD90 I fucking love you) who could have said \"I'd rather keep doing the things I love to do\" but instead gave up his passions just to keep me, and those like me, extra safe.",
                            "score": 48,
                            "author": "PhotographyByAdri",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Damn... this is an amazing way to look at it. \n\nHeroship is hard. In a way I think everyone wants to be a hero, but when they do something heroic to someone, they see it as \"anyone could've/should've done it.\" You hear that from firefighters, war veterans, and even the random people that stepped up and saved someone's life. \n\nI think this way of looking at it takes the \"I'm just a person\" out of it. Beautiful.",
                            "score": 29,
                            "author": "wwcraw",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A saying about firefighters: \"The only brave thing a firefighter does is sign up for the service. The rest is just part of the job\".",
                                    "score": 11,
                                    "author": "LokisDawn",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I love this take! I would love your outlook on life to be a running commentary in my head, kinda like a fairy godmother! I think I'd quite enjoy that lol",
                            "score": 4,
                            "author": "Iknowshitall"
                        },
                        {
                            "level": 2,
                            "comment": "Aww. This is really wholesome and is a really lovely perspective to take. Made me smile!",
                            "score": 3,
                            "author": "TarManJr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "me an introvert being finally appraciated once: Thanks",
            "score": 258,
            "author": "ADudeThatLovesMemes",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 37,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Me too but god is it lonely\n\nRealizing it takes about 6 months to really start feeling lonely was a good thing though",
                    "score": 25,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seriously lonely. And something making it feel so much more lonely is that everyone around me has basically just proceeded as if everything is normal now (live in Florida). I get constantly shit on for not seeing other people, told I’m paranoid, forgotten. It was much better in the beginning mostly bc we were in it together. More facetimes, more virtual communication. It extends to my workplace too. My employer is 100% back in the office. No masks, no distancing. They’re throwing a huge holiday party too. My arrangement was remote prior to covid thankfully, but they keep asking me to visit and I’m losing essential communications and relationships now bc I’m unwilling (in their eyes)/unable (in mine) to go in and see the team. I’m being made to feel as if IM CRAZY, when I want to protect myself, my family and others. I want to end this so I can have my life back to normal. And they’ve just decided to blow ahead and have normal anyways and if someone dies, too bad. Been a tough year mentally. I hope anyone who can relate stays strong",
                            "score": 19,
                            "author": "Gertruder6969",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hang in there m8",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm with you! Thanks for the appreciation! Wish I could quarantine more thoroughly,  but I'm a psych nurse.",
                    "score": 26,
                    "author": "pfizzy70",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yes! Quarantine feels no different than normal life and gives me a better excuse not to go out or go to family events. I have to leave my house for doctor appointments though.",
                    "score": 8,
                    "author": "raketheleavespls"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey thanks.  I came home from work March 17th, and have been here ever since.  I picked up a bunch of cool hobbies over the summer and did a ton of solo adventuring.  I have not seen my friends in person except for one afternoon in my buddy's driveway back in June, just the two of us.  I haven't seen my mom or any of my other family and am alone 99.999% of my time.  \n\nIt's nice to be appreciated for these sacrifices, thank you.",
            "score": 230,
            "author": "The_BenL",
            "replies": [
                {
                    "level": 1,
                    "comment": "Every single person that I've spoken to that has actually taken this seriously knows the exact date it started.\n\nMarch 11th for me",
                    "score": 24,
                    "author": "funkymonksfunky",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha yep, I remember because it was a Tuesday. I work in IT and my whole department started working from home that Monday, the 16th and to make a long story less long, it was sort of implied that I needed to be on site. I did not, as it turned out, and haven't been back since except once on a Saturday at like 11pm to get what I cared about from my cube.\n\nThat day is like 9/11 for me. I remember everything.",
                            "score": 7,
                            "author": "The_BenL",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm high risk. Thank you for your sacrifices, seriously. I see photos of my own family on Facebook where they are together in groups, hugging people. It makes me want to cry and rage all at the same time. The fact that a stranger can care more about people like me than my family makes me sad...but also extremely appreciative of people just like you. ❤",
                    "score": 53,
                    "author": "PhotographyByAdri",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 16,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Turns out I'm kind of built for this.  I've always struggled with being a social introvert, I love spending time with my friends, but I definitely have a pretty small social battery.  This time has really made me accept that fact about myself, and realize that I don't need to fight the desire to be alone, I'm happy just by myself.  I do miss my friends, and we still have frequent Zoom calls (every Wednesday evening we play board games on boardgamearena.com over Zoom), but I've learned a lot about myself and what I need to be happy.  \n\nI can't tell you how angry I am at all the people still not taking this seriously.  They're all so fucking *smug* about it too.  I've lost 'friends' and family through this, because I just don't need people like that in my life.  \n\nKeep on keeping on friend, we'll get through this yet.",
                            "score": 12,
                            "author": "The_BenL",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mental health was flushed down the toilet months ago, especially since I have Cystic Fibrosis, so my anxiety during the pandemic has been horrendous. I’d gouge out my left eye with a rusty, jagged spoon drenched in lemon juice just to be able to go to the grocery store without needing a fucking gas mask and a massive bottle of hand sanitizer. I’m sure many can relate. \n\nAside from that, I’m just pissed. I am appalled by the behavior of many people during this pandemic, including from some of my own relatives. It hurts my soul to see people being so fucking selfish because of “MuH fReEdOmZs”. Like, I get it. Life sucks major ass right now. But unless you absolutely need to leave the house to work or get food, stay the fuck at home. Thanksgiving dinner isn’t a fucking necessity, and neither is Christmas. Guess how I spent every Holiday and Birthday this year? Sad as fuck and just with my household. But, ya know what? I’d rather be physically healthy and sad as fuck, rather than in the ICU and sad as fuck. \n\nAnd don’t even get me started on the fuckwads who have decided covid doesn’t exist, and have taken to facebook to brag about attending maskless parties and weddings, or the so-called “Christians” who have decided to be the very opposite of Christ-like so they don’t feel sad. There’s a special place in hell for them, that is for damn sure!",
            "score": 59,
            "author": "camohorse",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, fellow CFer here! Just wanted to reach out and say you’re definitely not alone, I’ve been going through pretty much exactly what you’ve described. I don’t really have anything earth shattering to say, I just really related to your post and absolutely share your frustrations. I hope you’re hanging in there, only thing we can do is take it a day at a time. Wherever you are, sending love!",
                    "score": 9,
                    "author": "ballpointed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“You are the ones that have helped the pandemic become even worse”\n\nMay want to edit that, I’m sure that’s not what you meant.",
            "score": 22,
            "author": "LavernDankins",
            "replies": []
        },
        {
            "level": 0,
            "comment": "to be honest nothing really changed besides i gotta wear a mask if i do end up going into a store",
            "score": 128,
            "author": "LBD420",
            "replies": [
                {
                    "level": 1,
                    "comment": "Forget masks I FINALLY convinced my mom to buy groceries online and have them delivered, and, shocker, she loves it. She's a 15 year remission cancer survivor and had surgery for something unrelated right in the middle of lockdown(necessary, don't worry) and after four years of trying, I finally got her to learn the amazing world of online shopping.",
                    "score": 90,
                    "author": "sojojo142",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm a FedEx Ground contractor, even with the influx in volume from COVID, and now holidays, none of us are expecting the numbers to drop anytime soon. Even when people get this vaccine, when things return to 'normal', we will still be as busy as we have been simply because of a story like yours. So many more people are now ordering things that they normally wouldn't and I can't fault or blame them. Please don't take this in a negative light, it is what it is and I fully respect and support whatever people need to do to be comfortable and safe - don't go to the store if you don't feel comfortable with it, order online if you can. We'll take care of you, one way or another. But one thing I ask; Don't order a trampoline in the beginning of winter, right during the holiday season - we all know you aren't jumping or setting that thing up in December. (I'm just joking, buy what you want.)",
                            "score": 14,
                            "author": "navy1227",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for your hard work! It seems like all the delivery drivers and store shoppers don't get enough credit during this time, either. I for one appreciate you! \n\nI just moved back into my home state August 2019 and now live with my 66-year-old widowed father who survived cancer and has diabetes and high blood pressure. This year has been about keeping him safe, and we've learned how to take full advantage of grocery delivery and online shopping. Thank God for all the people who have worked hard and taken the risk of shopping and delivering for us!",
                                    "score": 5,
                                    "author": "Ah_BrightWings",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hey, any time! We get everything from groceries from Walmart to Pet Supplies from Chewy.com and medical supplies for houses, clinics and hospitals. (we don't talk about the amount of wine I deliver too...I can't speak for everyone but I will gladly do everything I can to keep people safe and happy at home. I told my wife one day, \"It's not my job to be happy for people, it's not my responsibility to put on a smile when I'm sad or angry... But I do it anyway because I'm probably the only person people will see in a day so I like to make it count.\"",
                                            "score": 7,
                                            "author": "navy1227",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I wish I could but the ones near me only are open for certain hours and have certain slots. I tried delivery services but it cost us more to have them delivered than getting them ourselves. Thankfully our grocery store is only 5 minutes for us and we seldom shop and shop when the store isn’t so crowded. We’ve driven to the grocery store and see the parking lot crowded a few times then just left.",
                            "score": 11,
                            "author": "sweetnectarines",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you. I’m also “essential” and have been working through all of this but my poor kids. It is so depressing. They are struggling. And all of their stupid friends are getting together and I am so proud that they have resisted. It’s such a hard time for kids.",
            "score": 77,
            "author": "Ninja_socks",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the worst part. I'm lonely, but whatever, I'll be fine. My kids have no friends. They're intensely social things, but we moved in March and have been at home ever since. It's terrible to see their sadness.",
                    "score": 13,
                    "author": "oliverismyspiritdog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same, moved in April and no school or even homeschool groups this year to make new friends. We ended up getting a dog (completely surprising considering we haven’t ever had a furry pet), she’s helping some with the sadness but I’m afraid our younger kids are losing significant social skills and confidence. Nothing to be done but try to make up for lost time when this is all over.",
                            "score": 4,
                            "author": "kindpeoplekindworld"
                        },
                        {
                            "level": 2,
                            "comment": "Omg we moved in may! We know like 2 families",
                            "score": 3,
                            "author": "ChoiceBaker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Please tell your kids that, as someone who could die if I got sick, I REALLY love and appreciate that they are looking out for people like me. They are saving lives. ❤",
                    "score": 19,
                    "author": "PhotographyByAdri"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I needed this so bad. I'm tearing up, because, honestly,  I'm at the point of questioning my own sanity. I've been quarantining since March and everyday I Iook outside my window and see people up and down the street all day, without a mask or a care in the world. 11 people died in my neighborhood alone.\n\nFriends going out, throwing countless parties and even a wedding, accusing me of being paranoid or a debbie downer for not attending. Everyone is making traveling plans to spend time with their loved ones for the holidays, and I'm like... Did I go crazy? Am I the wrong one? \n\nMy anxiety is going through the roof, I gained 15 kg, I'll most likely spend Christmas alone because my parents are high risk, and it feels like I'm the only one still doing it. But reading this, I felt so seen, and stronger, and confident in my decision. If there's just one person alive because I didn't give them covid, or a health worker slightly less tired because they didn't have to treat me, then I'm definitely not the wrong one.",
            "score": 97,
            "author": "krncrds",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for sharing this. It helps to hear from similar people. I have also been staying inside for the most part. Went to the grocery store once a week for a couple of months when things were mostly OK, now I'm hunkered down again, doing just curbside grocery pickup and delivery. I feel sad and lonely a lot of the time. I feel like life has no purpose. Christmas is going to be sad. And I too, gained about 10 kg in the beginning of the pandemic, but thankfully lost about 5 later on. Still haven't lost the other 5 yet.\n\nI'm thankful that I have managed to stay safe this entire time and avoid getting anyone sick.",
                    "score": 12,
                    "author": "throwaway1928675",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "10.0 kg is 22.03 lbs",
                            "score": 3,
                            "author": "converter-bot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are also a hero Converter-bot.",
                                    "score": 9,
                                    "author": "Ochoytnik"
                                },
                                {
                                    "level": 3,
                                    "comment": "Good bot",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You are not the crazy one! I feel you, and am absolutely shocked at the behavior and denial and arguing that's been going on during all of this. A slight comfort to me has been studying the Spanish flu pandemic of 1918-1920 and a little bit other pandemics throughout history. Human behavior has stayed the same essentially for centuries. And you know what, so have the measures to mitigate disease spread. People talk about being on the right side of history, which seems a little dramatic, but rest assured that you're doing the right thing and this won't last forever!",
                    "score": 26,
                    "author": "Ah_BrightWings",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Thank you, it really helps to hear these words from someone else. I've been feeling like The Crazy One too. I'm glad some of us are in this together and holding strong to our convictions.",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You are not alone.",
                    "score": 3,
                    "author": "GhostofGideon",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt;Did I go crazy? Am I the wrong one?\n\nI have the SAME thought, all the time. It's insane, feeling like half the country is gaslighting the other half.",
                    "score": 3,
                    "author": "drebunny",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Just had a fit about this myself. My family was pissed at first and so were my friends, but they’ve mostly figured it out. We are all sad but it is what it is. Most days I just want to ignore the world but then they get mad for me not texting back which keeps me going.\n\nMore than that even, I work in reproductive health care. If we get sick, we shut down and people lose critical access to health care. That keeps me running.",
                    "score": 3,
                    "author": "LadyGrimSleeper",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I could do this my whole life! Have mostly been\n\nThanks for YOUR hard work! At least for me, the isolation is not difficult at all, healthcare work is, so thanks for saving so many lives",
            "score": 14,
            "author": "apalachicola4"
        },
        {
            "level": 0,
            "comment": "Thank you so much for posting this - I actually needed to hear this today. I've been alone since Feb here in Italy, with my significant other in the U.S. and not likely to be able to fly out until February 2021. There was period of 3 months when the only face I saw was the guy who delivered my cropshare food. Just found out today I'll be alone for Christmas (as I was for my birthday), and while facetiming will make that a lot easier the day of, all I want to do is go give my 85 year old dad a hug - can't remember the last physical contact I had, I think it was in January.\n\nThank you for your service to your fellow humans during this time - I will never, EVER take a healthcare professional for granted again.\n\nMuch love to everyone out there - stay healthy, stay safe, and if you are bunkering down with family and loved ones give them an extra squeeze.",
            "score": 14,
            "author": "thereluctantpoet",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was alone for the first 5 months of the pandemic, in a country and a city where I had no family. Hang in there and keep virtual contact with all your friends and family. I know how hard it is but you are doing what’s right!",
                    "score": 4,
                    "author": "marachella",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Since February, too; that's just impressive.  I wish more people had the chance to live with somebody through quarantine, bc it is easier.  But you definitely seem strong, so I wish you only the best!",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Hey fellow human, you are the hero this is about ! I can't imagine going through that, by magnitude it's the type of sacrifice that gets you medals in wartime. I for one am grateful there are people like you in the world.\n\n I hope this pandemic ends soon and you can get back to your family. \nCheers !",
                    "score": 3,
                    "author": "Armiesupmysleevies",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't wait for loud rock concerts again.",
            "score": 15,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"Our actions have consequences not only on our lives but many others around us too\"\n\nThis was ingrained in my head when it started getting worse. And yeah when someone chooses to step out u not only put urself in danger but a bunch of others around u as well",
            "score": 32,
            "author": "adithya_chittem",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly, this is the first time my quarantining has been appreciated-- not that it has to be. I literally have friends who make fun of me for still staying home and socially distancing and I just ignore them, but at the end of the day, I'm doing what's best for me, my family, and others.",
            "score": 32,
            "author": "rollllllllll_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm glad you're not letting them get to you too much.  I've always been a worrywart, so even my friends who go out aren't surprised with how fiercely I've been quarantining.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really needed this today, thank you.",
            "score": 30,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Quarantine (ive been in quarantine since february) and a couple of other things has made my mental health go from terrible to insufferable, the quarantine wont end any time soon here, i dont know how we arent hearing about any increased suicide rates in the news.",
            "score": 44,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel the same, I can’t believe suicide rates aren’t all over the news. I don’t know if it’s under-reporting or what. Although there have definitely been massive increases in “overdose” deaths; maybe a lot of those are intentional.\n\nI see you. Please be well. Reach out if you need help. The pandemic will end, just hold the line.",
                    "score": 18,
                    "author": "sito-jaxa",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Oh we will, therapist are going to be in demand in the next 5-10 years from all this. We just haven’t had time to study it yet, I’m sure",
                    "score": 6,
                    "author": "neonblue01"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely need to hear this more often. It’s been a lonely year and I’ve had basically nobody to turn to. My friends and I have lost touch, I’ve just been home, and my baby hasn’t been able to see much of the outside world in his first year. People can be so awful and I really hope things will get better soon but I’m highly doubtful these days.\n\n\nOne of the things I’m really bummed about surprisingly is not being able to put my son in a shopping cart now that he’s able to sit in it. I never would’ve thought twice about it before.",
            "score": 9,
            "author": "justnousa",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thank you so much for this post. I live alone and have been so incredibly lonely lately. I see one friend regularly, because if I didn't I'd go insane. \n\n\nIt's nice to have a little focus on people who follow all the rules, instead of those nutjobs who think wearing a mask is getting controlled by the government. \n\n\nAnyway, just needed to get this off my chest, as I am unable to share my problems with people close to me. To whoever may read this; stay strong",
            "score": 9,
            "author": "nonacrina",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Getting real tired of spending 22 hours a day in my apartmemt. Luckily i have a dog so i have an excuse to get out a few times a day.",
            "score": 7,
            "author": "nathan1942",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I went into strict lockdown for myself on March 13th. Since then I only go to the grocery store once a month, I pick up my prescriptions there too. I go to doctor appointments and spent 6 weeks in hospital with sepsis. Otherwise I go nowhere.\n\n  I do get visits from my best friend whenever he can manage it with his super busy schedule.",
            "score": 8,
            "author": "Informal_Control8378",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I miss window shopping and my family. But I’d be devastated if I found out I had it and gave it to someone else because not everyone survives this as we’ve seen day in and day out. Thank you for appreciating our sacrifices too.",
            "score": 6,
            "author": "Little_Bear716",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 19,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have to work at the hospital so quarantine hasn’t been an option for me until I caught COVID but thanks for looking at everything else aside from the annoying anti-maskers.",
            "score": 10,
            "author": "samfish90212",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ah thank you very much! /s\n\n~Electrician that has been working all throughout the pandemic to ensure that power gets where it needs to be.",
            "score": 63,
            "author": "JANICKGMO_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d like to add an appreciation for the HVAC workers and plumbers. We live in an old house and during this time have needed our AC repaired, bathtub drainpipe cleared, boiler valve replaced (it was leaking), and a new water heater. It sucks to need these repairs, but I have been very grateful that they were willing to work in our house.",
                    "score": 17,
                    "author": "planet_rose",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And mechanics, police, security guards, bus drivers, warehouse workers, sanitation workers, delivery drivers, service workers, and everyone that has helped keep us alive and moving during this time. \n\nI know for a lot its \"I gotta feed my family\", regardless I appreciate your sacrifices. You are a hero, to a lot of us, and definitely your family.",
                            "score": 10,
                            "author": "wwcraw"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How dare you leave your home /s",
                    "score": 13,
                    "author": "Ceshomru",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How dare you exist /s",
                            "score": 9,
                            "author": "JANICKGMO_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hey man. You’re definitely an essential worker. If it wasn’t for people like you, I’d be without power, heat, internet, or even a lock on my door. For some reason, my house has decided this is the year it’s gonna start falling apart, and we’ve been getting some unusually strong winds as well resulting in power outages. While it’s not exactly awesome to have people outside of my household in and out of the house, at least they’re extremely careful and considerate, as I try to be as well. Both they and I wear masks when they are around fixing things. \n\nWithout people like you risking your health to ensure the rest of us have infrastructure, we’d be completely fucked. The healthcare system relies on power just as much, if not more so, than everyone else. Without y’all working nonstop to keep our power on and our utilities working, covid-19 would probably be almost as bad as the black plague. \n\nSeriously, thank you so damn much! Your work has saved countless lives.",
                    "score": 9,
                    "author": "camohorse"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 33,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you!",
                            "score": 13,
                            "author": "JANICKGMO_",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As someone whose power has gone out too many times this year, thank you for doing your job.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've got crohns and my mom has cancer gotta stay home or we both die lol",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Well thanks but I'm no hero I'm just a social outcast with no reason to go outside to be honest there is not much of a difference for me in quarantine then there was in my normal life except for school being online which I suppose sucks but hey could be worse",
            "score": 5,
            "author": "unclassifiedrandom",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I for one would like to thank Blizzard for crafting such an incredible world... of Warcraft. Without it, I think I'd have gone crazy. Got the wife involved, too. Haven't played since WoD and it felt like coming home. A home ravaged by old gods and demons and monsters but still, home.",
            "score": 6,
            "author": "wet_sloppy_footsteps",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I stayed in since March 16th because this is literally the most disruptive health emergency in a century, since 1918, and it's obvious that this event will inform people what to do and what not to do for generations. So at the very start I decided to set the best example. I stayed in because for non-essential or remote workers it's the obvious decision - What is one year of inconvenience? One re-infection grows geometrically so at the beginning I recognised that if you infect just one extra person, the consequence is that within a year, hundreds more will be infected, several people could and probably will die because of you.\n\nFrom of the amount of Zombie and horror films I've seen throughout my life, the consistency is that the dumbest people die first because they're ignorant and make blatantly stupid decisions like not following basic safety protocols. The dumb people are the ones you shout at your screen to, to tell them \"DON'T GO IN THERE YOU FUCKING IDIOT\". Horror films are masters of schadenfreude really. And it's obvious that the most ignorant people are going to infect more people on average, just like the annoying dumb people in horror movies.",
            "score": 5,
            "author": "Aerothermal",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I stayed home from the end of March until the second week of November but finally ran out of money and had to go back to work where I am worried every day.  I am immunocompromised and work with a bunch of backwoods covid deniers.  I do what I can to stay safe but it is nerve wracking.  Stay safe everyone!",
            "score": 4,
            "author": "fitafter40",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My wife and I often talk about how guilty we feel that we work at home and basically only leave the house to go grocery shopping once a week. The biggest sacrifice I had to make this year was skipping playing beer league ice hockey. \n\nWe just wish there was something more tangible we could do to help besides donating money and trying to vote for people they understand what a pandemic is. \n\nIt feels nice to be appreciated for staying home though. So thanks. It's amazing how many people just don't give a shit, or actively work against each other's safety.",
            "score": 5,
            "author": "romple",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thank you so much. I’ve been in since March 19th after begging my coworkers to take one of the ten masks I used when immune compromised. They thought I was a crazy coward, but as a cancer survivor with heart failure I figured I’d lay low. I’ve been through different phases during this time.  From relief I don’t have to go anywhere (homebody) to shopping online like crazy to stopping my self care and over drinking. \nI have cooked and cleaned up over 795 meals for 2 (curbside groceries). My house is a disaster. I’m annoyed with my pets and I haven’t spent one day away from my WFH husband. I’m especially equipped to stay in like this after living through cancer treatments so I feel for the folks that just can’t handle it. It’s depressing there’s no way around it. My first grand child was born in April and lives across the country so that’s been tough. \n\nMostly though I’ve been in a state of grief for all that are suffering (including you guys) and for all the dying and those that love them. \n\nAgain thanks for the shout out!!  Thank you thank you for looking after folks. You know, I LOVED all my nurses and doctors and techs and pharmacists over the years. They gave me 13 extra years so far.",
            "score": 6,
            "author": "stripmallbars",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s a privilege to be able to just stay home and I’m happy to do it. Thank you so very much for all you and your colleagues are doing. 💜",
            "score": 17,
            "author": "kizzy1312",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are not a bad parent! Your baby won't remember any of this, and you're doing the best you can. :)\n\nTotally agree with you on all points! \"Worn out mentally\" is a good way of describing it.",
                    "score": 4,
                    "author": "Ah_BrightWings"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I haven't left my house in too long. Too many times I've been asked to go out, or pressured to go to restaurants etc. It is very upsetting, feeling as though my efforts are in vain, seeing too many people around me act like the virus is over because they are over it. Though I'm glad I could be someone's hero. A big thank you to all the health care workers who have to deal with this situation first hand, please stay safe.",
            "score": 9,
            "author": "MitchyMooooo"
        },
        {
            "level": 0,
            "comment": "I am an essential employee. I have received less than $300 in hazard pay from my employer the entire year. I make drastically less than everyone I know receiving unemployment benefits. Even working 45 or 50 hours weeks my checks came up hundreds of dollar short of what my unemployed mother, brother, or friends were making. To all the people that have had the privilege to quarantine, coast through hard times, and not risk them or their families health: I ENVY YOU.",
            "score": 8,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "March 16th was the day my department started working from home. And I’m told the soonest they’re going to even consider bringing everyone back to the office full time is next March.\n\nMy life turned on its head a month later, I split up with my gf of 4.5 years, went home to live with my parents for a while. Ended up buying a house because for some reason the rental market in central Kansas is insane right now. Now living on my own, going in to the office once a week, and have no friends anywhere local to me, nearest one is a half hour drive away. I go to the grocery store once a month or so. That’s the extent of my social interaction. I went from having a person I loved with me nearly 24/7 to absolutely nobody but my cat. My mental state is fucked. Constantly battling depression, anxiety. But hey, I don’t have the ‘rona!",
            "score": 4,
            "author": "ratrodder49"
        },
        {
            "level": 0,
            "comment": "Thank you for being a beacon and a driving factor in the narrative! I/we appreciate you! God bless you!",
            "score": 4,
            "author": "seg321"
        },
        {
            "level": 0,
            "comment": "My husband and two young boys and I haven’t been in a store since March. We haven’t seen friends without both parties isolating for two weeks...and I miss my local book store so much! I miss taking my kids to the playgrounds. They get so mad that other kids are playing while we walk by. My heart breaks for them. But we are so close to getting the vaccine. Now is not the time to get complacent. Thank you to all of our frontline workers. Your efforts are not forgotten :)",
            "score": 5,
            "author": "ohdutch28"
        },
        {
            "level": 0,
            "comment": "I would give ANYTHING to sit at a quiet bar with my husband, chat with a bartender about whatever and listen to them shake me up a drink.... in person. \n\nBut ya know.... sitting at home.... making our own cocktails.... talking to the dog. (Who is clearly not impressed and the cat about ready to throw us out of our own establishment.). I feel you guys. Hopefully we’re close. \n\nAnd also, happy holidays to all.",
            "score": 4,
            "author": "MidnightMarigold"
        },
        {
            "level": 0,
            "comment": "Only essentials/ doctor/grocery stores for us, since March 13th, other than eating outdoors twice this summer,  at very off peak times. Haven't even had a professional haircut. \n\n\nCertainly can't wait for it to be over,  and go on a jive l nice vacation,  or even see family/ friends,  but we're glad to do our part.",
            "score": 5,
            "author": "Pristine-Evening"
        },
        {
            "level": 0,
            "comment": "This sent a tear down my cheek. As a service industry worker who has been out of work since March, I’ve learned to feel useful around the house and fill my days with new hobbies and reading, but man.. I miss the world, and having fun with restaurant guests celebrating life events or just a night out. I miss the security of having a job. But through all of this I have realized for those willing to see it, we have gained a new appreciation for our fellow humans and their sacrifices for each other, big or small. For that, I’m thankful, and I can’t imagine it would have happened for us any other way.",
            "score": 5,
            "author": "kissingtheturns",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I miss going to school. My first semester was in January and it was the best time of my life. I don't learn in online classes. So I'm in limbo now. \n\nYou are my hero. You are out there saving others. Much love and respect to you :)",
            "score": 4,
            "author": "Hero667"
        },
        {
            "level": 0,
            "comment": "We thank you too. We do it for ours and for yours.",
            "score": 3,
            "author": "railenvost"
        },
        {
            "level": 0,
            "comment": "I needed to hear this SO MUCH. Lately, I've been feeling incredibly angry at all the people who just don't seem to care about anyone. To think that Mister Rogers, my personal hero, would be proud of my small act of solidarity means a lot.",
            "score": 4,
            "author": "whynotfreudborg",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When you are broke and absolutely need to work to live, and you dont have a luxury of remote working, its not possible to quarantine. \n\nI want to be in my home all the time. I want to be one of the heroes. Instead I have to go into bar after bar after bar and restaurant after restaurant after restaurant to do my job so I can still even have a home. \n\nI stay in my house pretty much always otherwise, though.",
            "score": 3,
            "author": "faster_than_sound",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wish I could afford to just stay home but you know, life.",
            "score": 8,
            "author": "2Alien4Earth",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m a T1D. I have two kids under 5, one of which is high risk. We live in a two bedroom apartment, and had to convert one room into an office for my wife and I. One of us is working while the other one is with the kids five days a week. On the weekends my wife works on her masters degree and I hang out with the kids. We haven’t gone anywhere since March. We haven’t seen friends or family in just as long. \n\nThis whole thing sucks. I hate it. My temper is short. I’m constantly exhausted and stressed. But I’d rather suffer through this than lose a child or loved one to COVID... I just don’t understand how other people are so caviler with their own - and other people - lives.",
            "score": 7,
            "author": "THE_Z0MBEE"
        },
        {
            "level": 0,
            "comment": "your intentions are good but the virtue-signaling in this post is appalling. everyone is in a different circumstance, it's extremely classist to just assume that every human has the ability to crawl into their cozy warm bed, watch netflix and just \\~StAy HoMe\\~ when some people don't even have a safe space to live in. a ton of people struggle with mental health problems and rely on interactions with others to keep them alive. some think this virus is a hoax. some pretend it's not happening. if you've stayed home since march and had the privilege to do so, congratulations but it's not heroic at all. on the contrary to your post, i think we need to accept that there are 7.5 billion people on this planet with a full range of feelings, views, ideologies and circumstances, who will all react differently to this. have compassion for everyone, we're all struggling on a societal level.\n\nlastly, those who aren't following the rules are not helping the situation but that's their lives, i don't personally know what they're going through. instead of passing judgement like the noble hero that i am (yes, i've quarantined since march), all i can say is: may the odds be ever in their favor.",
            "score": 33,
            "author": "canadianick",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! What about people who don’t have the luxury to work from home? They’re not hero’s because they have to make a living to survive? What about the people who are homeless? What about people who can’t afford to order every little thing online? \nSo basically, only the lucky few are hero’s? \nLike you, I understand the sentiment, but it’s unrealistic.  Most people are not purposely being selfish, they’re just trying to survive.",
                    "score": 9,
                    "author": "BooksThings",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes yes. 100% that’s exactly it. Congrats to those who CAN stay home, I guess? 🙄",
                            "score": 3,
                            "author": "canadianick"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I went to target today because my mental health is so bad I can’t stand to be in my house anymore - here come the downvotes. I bought things I didn’t need for serotonin. I can’t stand that people judge others for going to a restaurant just to try and feel joy in whatever way they can. So happy for these heroes, sorry I can’t be one. I’m doing what I’m doing to get by and survive. The judgement from others for people following the rules but not sitting in their house 24/7 is sad. Like you win a medal for how many things you don’t do, even if they’re open and sanctioned. I don’t feel bad anymore that I go to a store to shop or sit inside and eat. I wear my damn mask everywhere but I have to live, sorry. I’m not a hero but I have to survive in my own way. Congrats to all of you though.\n\nEDIT: I spelled medal “metal” - I blame Covid!!",
                    "score": 5,
                    "author": "obsessedwithitall",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Thanks for throwing this up here! I wanted to, but couldn't find the right words. I work for a large county fire department in CA, running 170000 + calls a year with over 1500 personnel. We have plenty of protocols (ppe restrictions) in place from station life to medical aids to after action reviews after structure fires and whatnot, when multiple companies are together... That large of call volume and that many floor employees and we've had 18 confirmed cases, all who have fully recovered. 18!\nThe majority of this thread acting like stepping out of their dwelling will result in certain death is alarming. From the mental health aspect, solitary confinement will kill you just the same, some of these folks are going to have some major problems for years. Put on a mask, socially distance, and get outside for a bit, you're body and mind will thank you for it!",
                    "score": 5,
                    "author": "thatsmyb1kepunk",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I fully agree with your first paragraph. We are all in different circumstances. I am a teacher who lives alone thousands of miles from my family. During remote working, I tried to kill myself (I’m ok now). I just couldn’t take it. I have since made a small circle of friends who also live alone. There are five of us, and we go do outdoor activities together regularly, like hiking, going to the park, having dinner on a patio. Tbh I would probably judge us if I were to see our little group. But we don’t know each other’s circumstances and shouldn’t judge at first sight. \n\nThat being said...\n\n&gt;those who aren’t following the rules are not helping the situation but that’s their lives\n\n\nThe problem is it’s NOT just their lives. So many people are being completely irresponsible (and you can’t always tell who is who). Now my county (Tarrant County, TX) of 2.7 million people is down to 18 ICU beds. Not 18,000.  E I G H T E E N. Denton county to the north (just over 1 million people) is down to 6 ICU beds. People’s actions do not just affect themselves. And therein lies the problem. This is not sustainable. We need to find a way to STOP the needless spreading from things like crowded bars and indoor dining. EVERYONE needs to do their part to limit the spread. But the best way to regulate that is problematic. I don’t know the right answer.",
                    "score": 6,
                    "author": "IthacanPenny",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Im confused as to what the rules are at this point because we do have restaurants that are open and i like to go meet up with my friends every now and then. We socially distance from other groups but this post certainly made me feel as if i shouldn't be going out at all",
                    "score": 5,
                    "author": "elusivewater",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve been scrolling through this feed and I can’t help but shake my head. It’s been almost a year and you’re still believing this the key to success? We’ve witnessed countless examples in other countries, including our own, that this behavior not only doesn’t fix the problem but it causes way worse ones. You can go outside and be safe. You can go to the library and be safe. You can go the store and be safe. You can go workout and be safe. This notion of you have to stay home is you just being sold a fear mongering propagandist mindset.\n\nTwo things.\n\nIf you’re over the age of 65, limit what you do. If you have pre existing conditions, limit what you do.\n\nIf those two things don’t apply to you then the death rate for your group is minimal. No one talks about that for some reason and the fallout from the mental health issues ensuing and economic destruction for those non in danger groups is infinitely more dangerous than covid.",
            "score": 14,
            "author": "Ssuuddssyy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 62,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like for real, like as long as you are safe about things, its ok to go outside! Go for a damn hike or something. Find activities that don’t require being around other people. Locking yourself in your house is not healthy for you, mentally and honestly physically.",
                    "score": 5,
                    "author": "BigBlueNate33",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 41,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How else are these people supposed to put themselves on the “moral high ground”?",
                            "score": 25,
                            "author": "RyanGosling13",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My sister in law is an RN and a director for a company that has multiple assisted living homes.  COVID has taken its toll on several of the sites and it's her job to go in and manage the response when there's an outbreak.  She's told us quite a few heartbreaking stories.\n\nWe only go out for essential errands.\n\nMy wife and I have not gone out to dinner since last February.  We do takeout from our local restaurants but that's it.  We didn't go anywhere to eat outside.\n\nWe would vacation and travel to see friends and that all stopped last year.\n\nI saw my mother last month for the first time since last Christmas when I did yard work and stayed outside.  I've only seen 2 of my 3 (adult kids) once each this past year and both times were outside.\n\nThe only family gatherings that we have attended was a funeral last June (all outdoors and distanced) and Zoom calls.  We have not celebrated birthdays, holidays, etc. since last year.   \n\nWe do this not because we are giving up our liberties or are sheep but because it is the right thing to do.  Many people who act like nothing has changed often say that their freedoms are being taken away from them because of masks, social distancing and modified behaviors.  What they fail to acknowledge is that with freedom comes responsibility.  We all need to work together and make sacrifices for the well being of everyone.\n\nEdit: my other SIL and her boyfriend mocked everyone who wears masks and is cautious. Guess who tested positive today?",
            "score": 6,
            "author": "aDirtyMartini",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well said!",
                    "score": 3,
                    "author": "RavenAva"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know plenty of healthcare workers who think people like you are propagandist shills.",
            "score": 7,
            "author": "Ssuuddssyy"
        },
        {
            "level": 0,
            "comment": "Yikes, I’ve been working this entire pandemic to support my family... guess I’m a bad guy",
            "score": 35,
            "author": "CrackaJacka420",
            "replies": []
        },
        {
            "level": 0,
            "comment": "But not a single word from either you or others on days like Black Friday or rioting days\n\nSo pardon me if I think you're full of shit",
            "score": 29,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just don’t leave my home so this quarantine didn’t ruin my life much lol",
            "score": 3,
            "author": "Sekushina_Bara"
        },
        {
            "level": 0,
            "comment": "I am also a healthcare worker. I would rather you support our economy and small businesses. It is not good for our society and mental health to shut down like this.",
            "score": 23,
            "author": "catshitthree",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My cousin who lives across the country was supposed to come visit me in March. I had a big vacation to Japan &amp; Korea planned for April. My dad was laid off from his job in airplane manufacturing. My 30th birthday was this August: I spent it at home watching Legion, didn't even bother getting a cake. I won't see my family for the holidays. I've lost a lot of strength from not working out since the spring. I've lost a lot of general motivation &amp; joy. And I feel like I'm constantly having to \"convince\" people back home that masks work and that the virus is serious. My parents already know several people who have died, yet they can't seem to persuade the rest of my family to care enough to quarantine properly. I'm not even sure how optimistic to be about 2021: I'm terrified that not enough people will take the vaccine to make a difference. I feel like my mental health would be in a better place if I were able to have faith in the actions of the American public, but I just feel let down by my communities over and over. All of this has been really hard. Thank you for recognizing this, and thank you for your perseverance too. I know it's trite and cheesy to say, but it's also true: we'll get through this together. 💪✨",
            "score": 15,
            "author": "ii_akinae_ii",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You missed: every lost job, every lost small business, every foreclosed home, every victim trapped with their abuser...",
            "score": 17,
            "author": "snazzypants1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "We were supposed to quarantine for 2 weeks, not 10 months. The goal was to keep hospitals from being overwhelmed and go over capacity. Doing this for so long has caused far more damage and destruction than the virus. This honestly angers me that you can’t see the harm this has caused.",
            "score": 15,
            "author": "samfishx",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know right. \nThe devastation caused to families from being financially crippled is horrifying. And these people rejoice in it so the 80 yr old people who are already on their way out can be a little bit more protected. It's ridiculous.",
                    "score": 12,
                    "author": "Shamedad101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They don't care. Obey your masters.",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lots of stupid in this thread.  Starts with the crowning jewel of the OP and then it's just diarrhea all the way down.",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It feels like posts like these are sought out and bot-upvoted by people with an interest in maintaining or increasing restrictions. People start to see the consequences of ongoing lockdown and that the most rigid leaders aren’t following their own rules, start questioning and pushing back, then are hit with a guilt trip that seems to get a lot of public approval.",
                    "score": 11,
                    "author": "nosleepforthedreamer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, and there's no getting through to them.  They're like grown toddlers, completely incapable of coherent thought or discussion.  No matter how politely, articulately, and delicately you put something, the response is \"DIE NAZI MISOGYNIST GRANDMA KILLER!!1!1oneone\"\n\nSo this is what keeps happening cyclically in human history.  It's amazing watching it close-up, it happened so fast o.O  Half the people just go crazy and decide the other half need to die, for absolutely no reason.  The witch hunts, 20th century communism in USSR / China, etc.",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it’s truly special if you can step back in your mind, and see all the bullshit that’s going around in the world. \n\nHonestly if independent journalists didn’t exist, I’d lose my mind. \n\nKnowing I’m not the only one seeing through the bullshit gets me through the psychological warfare.",
                                    "score": 6,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol oh fuck off",
            "score": 7,
            "author": "lsdhead"
        },
        {
            "level": 0,
            "comment": "K",
            "score": 7,
            "author": "infinite_fractal"
        },
        {
            "level": 0,
            "comment": "I know people in healthcare and all essential workers appreciate the small sacrifices. Rest assured that everyone who tries to do their part by isolating and being responsible appreciates your hard work, sacrifices and commitment. Unfortunately, it feels like a unilateral slap to the face when global political leadership (this is not about America, I'm European and ATM speaking about our own politics) will not try to protect either party and just assigns blame. I wish you and your family well, and to find it in your hearts to push through this thing.",
            "score": 4,
            "author": "Pavsters"
        },
        {
            "level": 0,
            "comment": "My husband had cancer surgery in January, so we've basically been in quarantine since then. The only time I leave is for work and I kinda resent it. I don't wanna catch covid while trying to pay my bills.",
            "score": 5,
            "author": "1thruZero"
        },
        {
            "level": 0,
            "comment": "This is disgusting",
            "score": 10,
            "author": "respect-thebeard"
        },
        {
            "level": 0,
            "comment": "I cried reading this thank you ❤️ and thanks for all the work you do",
            "score": 10,
            "author": "MAC_357"
        },
        {
            "level": 0,
            "comment": "I'm in an area of the country that doesn't take the virus seriously (ND now with the second highest number of cases per people). I have to constantly remind family and friends that I'm still not comfortable eating out. It's like they expect me to wear down and stop caring after asking for so long",
            "score": 6,
            "author": "emyahlee",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm doing my best. And thank you for the work you do, OP.\n\nMy sister is an ER nurse and I know the struggles she's been going through for the last 10 months or so. So I'm just going to continue to stay home, wear my mask, wash my hands, and hope this vaccine thing works out.",
            "score": 18,
            "author": "Finger11Fan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I would quarantine, but i would starve to death, i pass",
            "score": 6,
            "author": "the_nihil_goat"
        },
        {
            "level": 0,
            "comment": "Thank you for saying that.\nI have been quarantining since march. I live with my fiance and we have been trying out best to slow this thing down. \n\nSadly my family are Anti mask so its been a bit tougher then it should be not feeling like i can spend time with them because they are not taking precautions.\n\nBut thank you for all you are doing! Ty to all healthcare workers and front line workers.\n\nI wish you all would unionize once this slows down a bit.",
            "score": 9,
            "author": "ZIdeaMachine"
        },
        {
            "level": 0,
            "comment": "I know this post is three months old, but today I got my first shot and I know the end is near, but I needed to comment on this post because I now understand how much I needed to hear this thank you.",
            "score": 2,
            "author": "WiredCortex",
            "replies": []
        },
        {
            "level": 0,
            "comment": "i’ve been quarantined for so long! however, **THANK YOU** for putting your life on the line and your time to help those in need of help! Thank you!!",
            "score": 2,
            "author": "dayDreamingSoL"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 37,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Stay inside forever, watch netflix, consume products from amazon and uber eats, kill small businesses, make billionaires more billionairey by vaccine stocks going up, all to save 90 year old gramgram from the 99.7% survival rate spooky flu! My hero!!!!",
                    "score": 33,
                    "author": "Pm_me_vbux_codes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sure all the people who can’t pay rent because restaurants and small businesses were shutdown feel like Superman right now! They sit peacefully on their couch drinking hot cocoa while 5k in debt and their business lost forever, all for heroism of course\n\nEdited to add in how fucking pathetic it is that it means a great deal to OP that other people stay inside their homes for 10 months straight, what a god damn stupid mindset to have",
                            "score": 19,
                            "author": "trackedlysol"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Only Liberals would pat themselves on the back for sitting at home not working.",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who has not been in a store since February (curbside only), has not eaten takeout more than 5 times and explicitly requested the food be left at my door and then dumping everything out and baking it again, I have to say, it’s been so hard. I haven’t hugged my mom in so long, I haven’t had my daughter at my house since February either. I wish everyone would just do it so I can see my family again. My soul dies a bit daily. Thank you OP, for everything you and your colleagues are doing.",
            "score": 4,
            "author": "RosterBaiter"
        },
        {
            "level": 0,
            "comment": "It's been insanely depressing, frustrating, and lonely. It's been hard on my toddler in particular, since we haven't been to anything kid friendly since March. We've sacrificed every holiday, and only had one masked up visit with family all summer.\n\nI still feel like it's worth it, even if everyone else doesn't give a shit. I'm one fewer full bed in a hospital, and I'm not filling more beds by spreading Covid to others. We're in the home stretch before we're able to get the vaccine. I don't want to trip and fall this close.",
            "score": 3,
            "author": "figgypie"
        },
        {
            "level": 0,
            "comment": "I've pretty much been home since March. Started my new job a week before the work from home order and my company has delayed return to office plans until at least September next year. It also gives them more time to get our new building fully functional. I have gone out a few times when things were starting to open up before it got bad again, but now I don't go out at all anymore. I even started getting groceries delivered. \n\nThis is for sure going to be a hard habit to break. I am without a doubt in hermit mode and honestly I kind of love it. Fresh air is nice, but I do not need to go anywhere. My car also has a piece that I need to fix before I can drive it anywhere anyways. My house is my sanctuary right now. It would be nice if my bf and his son could cool it with the farting though.",
            "score": 4,
            "author": "Savage_Sarabi"
        }
    ]
}