{
    "id": "ou1qdd",
    "score": 41239,
    "title": "Marijuana is NOT harmless and anyone who says otherwise is dangerously misinformed.",
    "author": "threesmalldogs",
    "date": 1627578815.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/ou1qdd",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve smoked weed everyday for most of my life. I’ve always believed it to be a safer alternative to drinking alcohol. People say it all the time; nobody has died from smoking too much weed, you can’t get addicted to marijuana. I truly believed these things. But I WAS addicted and I almost didn’t make it to my 30th birthday today because of it. \n\nThe fact that I needed to smoke everyday just to feel normal is testament enough. I wasn’t smoking to get high anymore, I was smoking just to start my day. I felt like I couldn’t function without it. I couldn’t function at all and I’m only realizing this now. I wasted 15 years of my life being stoned and depressed on the couch. I had no desire to do anything that made me happy, I had no desire to do anything at all. Because of weed, I settled for mediocrity every day for 15 years. So much of my life, wasted. \n\nThen I got really sick - vomiting and nausea for two weeks. I lost 20 pounds in that time. The doctors told me to stop smoking and I didn’t listen. It can’t be the weed, I thought. It’s harmless. I choked it up to a bad bottle of wine. \n\nA couple months later, it happened again. This time, vomiting for 5 days. Again, I thought it was just a bad hangover and went to the doctor in hopes of getting an IV to restore my fluids. The doctor had one feel of my chest and I was rushed to the ER with Subcutaneous emphysema as a result of cannabis hyperemesis syndrome. Essentially,I had so much thc built up in my tissues from years of use, it was starting to seep into my digestive tract and it was making me sick. The extreme vomiting that resulted caused me to tear my esophagus which meant air was getting into my chest cavity. The doctor said that my X-rays showed so much air in my chest, that another day or two of vomiting could have resulted in my heart exploding. On my nephew’s first birthday, a week before my 30th. To think of what I could have done to my friends and family breaks my heart. \n\nCHS seems to affect some heavy smokers and not others. Doctors don’t seem to know why, but what my doctor did tell me is I was incredibly lucky to have stopped vomiting when I did. He also told me that nowadays, with weed being legal and THC concentrations being so high, MOST of the cases of nausea and vomiting that come into the ER is related to marijuana use. \n\nWeed is NOT a harmless plant. It’s still a drug, and like any drug there are consequences to its use. We need to be more honest about what these dangers are, both physically and mentally, especially with young people. I almost destroyed so many lives because of my habit. I could have ruined my nephews birthday for everyone, forever. I’ve already wasted so many of my best years being stoned. \n\nI’m quitting cold turkey. I’m not touching the stuff again. I’m just sorry it took this long. I’m celebrating my 30th birthday today SOBER and I’ve never been more excited about life.  \n\nIf you’ve been thinking about quitting, take this as a sign. Don’t let yourself waste away like I did.\n\nEDIT: Jesus fucking Christ. I came here as an addict to admit I have a problem with weed. The problem is MINE and yet so many of you think you can tell me what I’ve been through. I don’t care if you love weed or if it helped you, it didn’t help me. It was ruining my life. I’m glad I got rid of it and I’m happy to share my story. Call me lazy, call me a liar, say I’m looking for attention, It doesn’t matter. I feel better today because I cut weed out of my life. I have no intention of going back. I’m not saying the drug is evil, but what I am saying is we should be HONEST with ourselves and recognize that like any other drug, weed affects everyone differently and people HAVE and WILL CONTINUE To get sick from it. To say otherwise is crazy. CHS is real, people have died. It’s interesting how many people are experts when it comes to marijuana. Listening to a joe Rogan podcast doesn’t make you an expert. If you’re happy being a stoner, be a fucking stoner. In these comments there are enough stories to prove it’s not the miracle drug so many of you are defending it to be. If you’re trying to quit, please DM me. I’ll cheer you on.",
    "comments": [
        {
            "level": 0,
            "comment": "Glad you shared. Post back in 6 months when you're still sober. Not for us, but for yourself.",
            "score": 400,
            "author": "Spiker8420",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a great idea, it’ll be so satisfying to watch myself grow.",
                    "score": 233,
                    "author": "threesmalldogs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It will be! Lots of us are cheering for you OP.  :)",
                            "score": 28,
                            "author": "electricstaplerchan"
                        },
                        {
                            "level": 2,
                            "comment": "I know people who used too much marijuana and regret it. I think it took a lot of guts to share your experience and I recommend caution with pot or any substance really.\n\nBest o' luck to you.",
                            "score": 10,
                            "author": "Robinsuperhero"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I am on the opposite end of the spectrum when it comes to marijuana... (It saved my life. But that's for a different subreddit, a different post, and a different day.)\nHOWEVER, I'm proud of you for doing what's best for you and support this wholesome comment and idea 100%",
                    "score": 6,
                    "author": "thatk8girl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "CHS can also lead to CHARF (cannabinoid hyperemesis acute renal failure). The uncontrollable vomiting, severe dehydration and excessive/compulsive hot showers lead to the perfect storm to create kidney failure, in people without underlying diseases.\nJust happened to somebody I know in their late twenties and will have kidney damage for life. Scariest thing to happen and caused us to quit cold turkey.\nModeration is key people. PLEASE take this post seriously",
            "score": 70,
            "author": "Unicornsaregr8",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m a daily user, but this post and comment section have me pretty seriously considering cutting back substantially. It’d probably be better for my mental health and motivation anyway.",
                    "score": 28,
                    "author": "I-Fucked-YourMom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We were daily users as well, until this happened to us. We have completely quit cold turkey and hope to recreationally very sparingly in the future after taking an extended break. It is common to see CHS back in ER needing support therapy once the first episode happens.\nThere are some scientific studies being done and you can easily read these articles online. With weed being illegal in many places still, it is hard to fully study and understand why this only happens in some chronic users and treatment options, other than just quitting",
                            "score": 9,
                            "author": "Unicornsaregr8"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Compulsively taking lots of hot showers is a symptom of CHARF or a cause of it? I’m not sure how to read that!",
                    "score": 5,
                    "author": "lizziefreeze",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I give anesthesia for a living. I can tell you for a fact, people who use marijuana habitually require different amounts anesthesia than people who don’t. I see it regularly. It makes a big difference. This isn’t to say I don’t recommend it’s use. I’m just saying it changes things.",
            "score": 2465,
            "author": "YoureSoOutdoorsy",
            "replies": [
                {
                    "level": 1,
                    "comment": "As someone who woke up on the table during a colonoscopy, I concur.",
                    "score": 1169,
                    "author": "Tulas_Shorn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "whattttt?? did it hurt?",
                            "score": 250,
                            "author": "Somtimesitbelikethat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I couldn't feel much of the contraption, but I did have an incredible pain in my bicep on the arm they injected the anesthesia. I just remembering saying \"PAIN, 10, RIGHT BICEP, and seeing them get a little startled, then I went back under. Maybe the needle fell out and into my muscle? I don't know.\nIt was pretty sore for a few days after, and like randomly around the injection site for a few months.",
                                    "score": 479,
                                    "author": "Tulas_Shorn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As someone who has experience with an iv going into the muscle, that sounds exactly like what happened to me. Some of the worst pain that I've ever experienced in my life. Depending on how long it was in your muscle and how fast the iv fluid was pumping into your muscle, that makes sense. Plus the fluid may have caused irritation to your muscle.",
                                            "score": 180,
                                            "author": "Saldag",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep. I had an IV drip put in while I was awake and they got it in my muscle, I was in so much pain and told them but they were trying to move it around without taking it out and had multiple different doctors try before taking it out. That is the most pain I have ever been in, I don't even know how to describe it. Almost like when you randomly get those sharp cramps in your legs but it was in my arm and didn't stop, and just kept getting worse.",
                                                    "score": 89,
                                                    "author": "reallysadgay",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's just stupid. I get regular iv drips for a condition I have and the policy is that if the iv slips out you just redo it, cause ultimately a poke is way better than excruciating pain.",
                                                            "score": 77,
                                                            "author": "Saldag",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Honestly I think they retried it at least once however there was still way too much time of them just keeping it in with the fluids going. In reality it was probably only 5-10 minutes MAX however when you are in absolutely excruciating pain that feels like a long time. They ended up having to put the IV in my hand since I have scars from regular IVs on both of my arms",
                                                                    "score": 22,
                                                                    "author": "reallysadgay",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I hope I’m laughing with you. I read that story as something that could rival the waxing scene in the 40 Year Old Virgin.",
                                            "score": 19,
                                            "author": "localmom",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’ve woken up during a colonoscopy even before I started using marijuana. I woke up and thought my SO jammed his knee in my lower back (he sometimes sleeps in the fetal position) and I croaked out, “Ow, *SO’s name* stop.” Which in hindsight is hilarious because from their perspective they were rummaging around in my butt and I thought it was my SO, when really the pain was more in my back.",
                                    "score": 38,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "When I was smoking every day I also woke up on the table during a procedure (double mastectomy). Anecdotal but I thought it was worth mentioning.",
                            "score": 37,
                            "author": "octokit",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Before I even started smoking I was so underweight that the anesthesiologist in charge during my knee surgery in high school dosed me too low. Better too low than too high. Except I woke up on the table, intense burning in my knee. I screamed. One of the nurses said, \"oh, he's awake,\" and then a mask was thrust onto my face and I next remember waking up in my hospital room. Quite startling. \n\nBut every surgery I've had since I started smoking I've been asked to not smoke for 24 hours before the surgery. 48h if I could go that long would be better. But I did the 24h. Every surgery went without a hitch with the anesthesia side. Though when I had my cracked molar and a couple wisdom teeth pulled, I was \"knocked out\" though I assume it's more the type of drug that leaves you conscious but not able to remember what happens. Apparently while I was in roofied state I tried vehemently to get away from whatever pain I was feeling, and they had to literally hold me down. So hard was my struggle that a perfect imprint of a hand was left bruised into my thigh.",
                            "score": 50,
                            "author": "Lutrinae_Rex",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When receiving medication or drugs of any kind especially anesthesia or local anesthetic you have to tell them what drugs you do you have to be honest\n\nIf you do meth and go to the dentist you will die in the chair if they decide to give you numbing shots\n\nTHC requires more anesthetic in users",
                    "score": 170,
                    "author": "lizzyb187",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What causes death from meth use and the introduction of novocaine or other numbing drugs?",
                            "score": 44,
                            "author": "SentientOoze",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I really don't know",
                                    "score": 18,
                                    "author": "lizzyb187",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fair enough, I'll google it. I've never heard that before so I'm kinda curious about it",
                                            "score": 25,
                                            "author": "SentientOoze",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My dentist has a sign up in their office about it",
                                                    "score": 22,
                                                    "author": "th3worldonfir3",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Interesting, I don't know if I've ever seen a sign about it at my dentist, but I've also never really paid much attention to what's on the walls, I'm either looking at my phone before she starts working on me or falling asleep in the chair after the novocaine shots, I'll have to keep my eyes open next time.",
                                                            "score": 13,
                                                            "author": "SentientOoze",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’ve seen the same sign at my dentists office as well.",
                                                                    "score": 4,
                                                                    "author": "phuqo5",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I've seen the signs where I buy my meth",
                                                                            "score": 10,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Gonna guess it’s because many dental anesthetics contain epinephrine. Adrenaline + stimulant might cause heart/circulatory problems.",
                                                    "score": 49,
                                                    "author": "StumpyMcNubs",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What complications does it cause with anesthesia?",
                    "score": 49,
                    "author": "omgtehvampire",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea tell us more",
                            "score": 18,
                            "author": "Teuton88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Compared to other patients, cannabis users needed more than twice as much of the anesthetic propofol, the study found. Cannabis users also needed 14 percent more of the analgesic fentanyl and 20 percent more of the sedative midazolam.\"\n\nhttps://mobile.reuters.com/article/amp/idUSKCN1RR258",
                                    "score": 29,
                                    "author": "IamNotMike25"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "These individuals require more anesthesia for it to take affect",
                            "score": 28,
                            "author": "Kinda_Zeplike",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But if you’re honest with your healthcare provider, this is a nonissue. I’m a daily smoker and had a plate and screws put in my collarbone 3 months ago. I was open about the fact that I smoke, and I assume I was given a proper dosage bc I definitely didn’t wake up in surgery.",
                                    "score": 10,
                                    "author": "Loose-Ad7927",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As someone who puts plates and screws into people for a living, let me tell you that patients lie all of the time for different reasons. Good on you for being honest with your healthcare provider but that’s not always the case. And even when it is the case, anytime you have to use more of anything your are increasing risks for something to go wrong. Overall it’s relatively safe, but there is a reason you sign a consent form.",
                                            "score": 3,
                                            "author": "Kinda_Zeplike",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 23,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Abusing anything on a daily basis generally isn’t harmless.",
            "score": 7791,
            "author": "BenWallace04",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mediterranean diet is very healthy, Chug enough olive oil and you are gonna have a real bad time though.",
                    "score": 2216,
                    "author": "OwMyBalllz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 997,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is what I learned in AA. It is our own selfish ways that lead us to do so many uncharacteristic things. I’m happy I could get over myself and give help a chance. 12 years of alcoholism bc I couldn’t find peace about my brothers death. We are all susceptible to so many things. We’re fragile. Life is hard and we don’t innately know how to overcome all struggles and stresses. They lead to different coping mechanisms, when we find a release to those stresses, beyond resolving them, the dopamine reward system kicks in. The reward becomes avoiding the truth or facing it. Once faced we either solve it or perpetually run. I’m good at running from one thing but things tend to pile up, they come from different directions and then all the sudden you are trapped and now it’s suffocating and there’s not another step you can take. I’m just so happy to be alive. If I see something that I feel odd about I take a moment and say the only “prayer” I’m comfortable with. The serenity prayer. I’m not religious but damn that shit sets me straight. I gotta accept things I cannot change. I gotta have courage to change the things I can!!!! The hardest is getting the wisdom to know the difference between the things I can change and cannot. Every damn day I try and be in service of others be compassionate and try to help when it’s possible to make a positive outcome. I try and never have do something I’ll have to say sorry about. I’m not proofreading this shit bc just did it stream of consciousness.",
                                    "score": 380,
                                    "author": "merlinphoto",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Beautiful and wise thoughts. Congrats on your sobriety!",
                                            "score": 27,
                                            "author": "twiwff"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Godamn, are you me?!",
                                            "score": 11,
                                            "author": "collectiveradiobaby"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I don’t think that’s the point of this post, I think it’s just offering an opposing opinion and perspective to the common “weed is 100% harmless all the time every time” there’s a lot of “weed addicts” even though it’s not considered an addictive substance which is kinda where your making your point. I don’t disagree with you I just think that’s not the only point he’s making",
                                    "score": 129,
                                    "author": "csh4u",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For the record it is considered an addictive substance from a pharmacy perspective. People studied withdrawing from a tolerance of weed experienced agitation, sleeplessness, anxiety, and depressive symptoms.\nThere are studies outlining it's effected with continuous use (4 or more  days a week) effecting IQ in children younger then 23, impairment of short term memory, increased risk of paranoia, and increased risk of psychosis. \nAll of this is not to say that weed is evil, alcohol in the body is far more damaging, especially in addition, but this is my understanding of the topic of weed addiction as a pharmacy student.",
                                            "score": 54,
                                            "author": "SMG-11gobrrrrrrr",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Worth mentioning as well that something can be psychologically addictive without having any chemically addictive traits. Prime example: gambling.",
                                                    "score": 25,
                                                    "author": "Smitttycakes",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think the whole \"weed is 100% harmless\" sentiment is mostly an overcompensation for years of political exaggeration over the dangers of marijuana. It's true that some hardcore stoners genuinely believe it, but I can't say for sure how large that demographic actually is.  \n  \nI'd like to think most educated people know that even the softest psychoactive drugs like caffeine can be addictive and even fatal under the right conditions.",
                                            "score": 69,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is what happens when you have a fucking generation of Nixon Reefer Madness bullshit. They spread propaganda like the shit was worse than crack, like you'd come home and murder your parents and eat their brains, some real bath salts type shit.\n\nSo yeah, people figured out you could smoke casually and it be basically safer than alcohol which no one really cared too much about except in alcoholism cases. Yeah, weed is pretty fucking safe compared to other drugs, and alcohol. Yeah, you will very very likely be fine if you smoke once on the weekends every so often.\n\nThat doesn't mean sitting there staying high all day, breathing actual fucking smoke, isn't going to have consequences. You're still getting high. It should be a fucking luxury.\n\nThis is coming from someone who's bipolar and can't smoke or I'll get horrible anxiety attacks and likely get paranoid and shit for a day or two. I can absolutely say the shit isn't good for me and has a real effect on my brain, worse than some other drugs. I can't touch psychedelics like weed, shrooms, acid, not anymore at least. I see other people do fine, and I believe it can be pretty healthy if you don't abuse it like crazy, but it definitely does something to you that I doubt is fucking healthy, if only just breathing smoke. Thing is, we only live once, so do what you want, but recognize the risk when you decide to stay not sober for a year or longer.",
                                                    "score": 8,
                                                    "author": "taronic",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is an oversimplification of the situation. OP clearly says that weed was not as harmless as he believed. It’s not that helpful or mature to focus so much on your belief that someone could use it in moderation and be fine. \n\nImagine you posting your same comment to someone who has recently realized that cigarettes or alcohol or even food (as you mentioned) can be addictive for some people and was warning others (because it wasn’t common knowledge).",
                                    "score": 62,
                                    "author": "exploreamore",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same with water. Too much too quickly leads to water intoxication.",
                            "score": 35,
                            "author": "Bogsnoticus",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Well said about the olive oil,\n\n&amp;#x200B;\n\nkinda reminds of a guy, who smokes weed, crack and wine to self treat his depression, oh and he also sucks on bic lighters while doing it, for yearsssssss\n\nalways blames everything on something",
                            "score": 3,
                            "author": "billyaimbot",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, you can die from too much water or too much oxygen and both of those are considered \"harmless\"\n\nI still am of the opinion the weed isn't \"harmless\", I've read that it can create increased anxiety and your lungs aren't built to inhale excessive particulates",
                    "score": 871,
                    "author": "MrNebby22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure why but this has stayed in my mind 15 years later - Lets have a contest to see who can drink the most water… also known as who can drown first 🤷\n\nhttps://www.latimes.com/archives/la-xpm-2007-jan-14-me-water14-story.html",
                            "score": 165,
                            "author": "mallclerks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I remember when that happened. I was only like 13 at the time. Used to listen to that station with my mom all the time until they got shut down after that. They were back for a bit but are no longer a station anymore.",
                                    "score": 56,
                                    "author": "buggie_687"
                                },
                                {
                                    "level": 3,
                                    "comment": "I didn’t realize it was that long ago but I remember hearing about it and the “Hold your wee for a wii” title",
                                    "score": 12,
                                    "author": "ontario-guy",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "My home town. I remember seeing it on the news that night",
                                    "score": 18,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Fun fact! The DJ responsible for that stunt was Adam Cox, brother of Lori Cox Ryan Vallow Daybell, the bitch who was just charged with murdering her children. In true Cox fashion, Adams biggest regret about the incident was that he got fired.",
                                    "score": 68,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So I actually know Adam Cox personally and I can say the bit about his \"biggest regret\" regarding the whole water chugging competition is that he lost his job is incredibly unfair. It seriously effected him and I can tell even after all these years its still something that really haunts him. He's actually an incredibly cool guy to talk to in person and you can tell he really cares about people. Its really sad he has to live with this incident on his shoulders the rest of his life AND be associated with his sister.\n\nEdit: So before anymore of you respond with \"he died two years ago\", his brother, Alex Cox, died two years ago under mysterious circumstances. Adam Cox is alive and well.\nAlso note, my only argument here is that it was unfair of the original comment to claim the only thing he regretted about the situation is that he lost his job, which simply wasnt true.",
                                            "score": 70,
                                            "author": "QuoKlo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 72,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Best description ever",
                                                            "score": 6,
                                                            "author": "SnooPears754"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Weed is also psychoactive, which means it can be the trigger for things like bipolar disorder, psychotic episodes, personality disorders, etc. It acts on the brain in a way that most recreational drugs—alcohol, ecstasy, cocaine, heroin, etc.—don’t do, and it can cause very real and very serious problems for people with pre-existing or latent psychological conditions. I’ve had people with a family history of severe mental illness ask if trying weed would be okay, and I always always *always* tell them no, that it’s taking a huge risk with their mental health. I also know a number of people who have gone to therapy for depression/anxiety/related conditions, and their therapist immediately told them they can and will not treat them until they’ve stopped smoking pot, because it can be impossible to tell what is the drug, and what is the psychological condition. \n\nWeed is a drug. Less harmful than some, than most, really, but it’s still a substance that should be approached cautiously and with *full* understanding of the associated risks.",
                            "score": 239,
                            "author": "VOZ1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thank you for bringing this up, because it's really not talked about enough. cannabis research has indicated that it could potentially induce early onset of schizophrenia as well. it's treated so casually but, especially with how potent weed is now, thc is still a psychoactive substance and there just isn't enough research done yet to really understand how it can affect people psychologically long term.\n\nit's really important to be educated on the risks before engaging in constant, heavy usage because it absolutely can ~~cause~~ exacerbate severe mental health issues. i do hope in the future more people will speak up about it like op did.",
                                    "score": 92,
                                    "author": "okaydamn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "On the flip side it's been invaluable for my PTSD, depression, and back pain.",
                                            "score": 109,
                                            "author": "UncleTogie",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're lucky. I got some edibles &amp; oil for a vape to help with cancer pain &amp; all it did was made the pain worse, sigh.",
                                                    "score": 6,
                                                    "author": "Celticlady47",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "that's great and i'm really happy to hear that ! i worked in the industry for a few years and definitely saw people who suffered from serious conditions (including ptsd, cancer, and trigeminal neuralgia) see marked improvement from using cannabis. i also saw a lot of people have mental health struggles because of it. i myself had a nervous breakdown, and there were other factors but heavy cannabis use definitely contributed. i also had a few people who has chs, who continued to smoke and would wind up back in the hospital..\n\nit's such a mixed bag right now because of lack of research, which is really unfortunate because i do believe that it can be an incredibly beneficial component to modern medicine. prohibition blocked any significant breakthroughs for decades, and unfortunately the current market leads to a lot of exploitation that i think will sadly contribute to a lot of cases like op's before we really get to a place where it's utilised as a viable medical treatment in hospitals.",
                                                    "score": 31,
                                                    "author": "okaydamn",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean that's the definition of \"too much\".\n\nLiterally anything that is \"too much\" is bad.",
                            "score": 39,
                            "author": "titanicbuster",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That's why they call it \"too much\"",
                            "score": 34,
                            "author": "SquidToph"
                        },
                        {
                            "level": 2,
                            "comment": "Lot less harmless than spending time in jail for it.",
                            "score": 64,
                            "author": "tortugablanco",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Vast majority of people aren't able to distinguish between use and abuse for most things.",
                    "score": 115,
                    "author": "topfuckr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is the one. Do you think OP referred to this as abuse at the time? Of course not. No one abusing thinks they’re abusing while they’re abusing.",
                            "score": 39,
                            "author": "smrkk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's just not true. At least for other substances that are physically addicting. When I was at my worst for alcohol I'd wake up with the shakes and even though I didn't want to I'd start drinking again just to feel ok. I knew that needing a beer at 11am wasn't normal but had no idea how to break the cycle.",
                                    "score": 17,
                                    "author": "captainerect",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For real, it all comes down to moderation and self control.",
                    "score": 112,
                    "author": "Proud_East",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And easy access to mental health resources and support without harassment from the legal system and broader society.\n\nAddiction isn’t a personal failing.",
                            "score": 42,
                            "author": "betweenskill",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "if you're breathing anything other than air, it's not \"harmless\"\n\nthat being said, is it as bad as we were lead to believe? fuck no. Still not harmless though. excessive anything can be hyper lethal. A very good friend of mine died when I was young because of water poisoning. Not to mention, drinking too much water can lead to a shitload of other health problems other than just dieing because you drank too much water.\n\nEverything should be moderated to some degree, and smoking every day like that is bad. Not only are you inhaling plant matter (we have tobacco studies to prove why that's a bad thing), but like this person showed built up THC (which is fat soluable) can fuck you up. I wish OP the best of luck in the future, just keep off the daily smoking lmao (did that for a bit, my waistline hasn't been the same since)",
                    "score": 52,
                    "author": "spaxxor",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Physician here. The amount of denial I see in people with cannabis hyperemesis is unreal. Like 10 ER visits a month for puking, insisting it has nothing to do with marijuana, \"no one ever told me marijuana was causing it\" (on someone I've seen 5+ times for the same thing and told them it was likely the marijuana EVERY time). I've even seen someone who literally had a permanent IV port placed for fluids and IV nausea meds because they're absolutely unwilling to stop smoking pot. It's like clockwork: every time they go back to smoking pot they end up in the ER within 24 hours. \n\nYes, it has potential benefits. No, you're not a bad person for using pot. But if you're one of the unlucky people who develops cannabis hyperemesis, please stop denying reality.",
            "score": 1037,
            "author": "Irrelevant_username1",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re a doctor, so I’ll ask you. How much these people smoke a day that this happens? I’m a daily user...but some people are heavier daily users than others....",
                    "score": 139,
                    "author": "Ok_Equivalent_4296",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not a doctor, but I am a heavy smoker with CHS. I smoke a minimum of 2 grams of green a day. So yeah, heavy smoker. I don't dab, don't do edibles, and rarely vape. I almost exclusively smoked from a bong or bubbler. Going on day 2 of sobriety now and I'm really hoping I can stick with it this time, but I've failed so many times before I don't have a lot of faith in myself. \n\nI'm really glad this thread came up today. Feels like it was the exact thing I needed to read after being in an episode for the last week.",
                            "score": 265,
                            "author": "spotmouflage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Narcotics anonymous has really helped me turn my life around, I'm 30± days clean, I smoked around 2gs a day too, they do meetings on zoom now, try one see how it goes. Just Google Narcotics anonymous online meetings. Worst that can happen is its not for you. Hope it helps you 😉",
                                    "score": 58,
                                    "author": "Biddy_Bear",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nice one mate you've got this.",
                                            "score": 4,
                                            "author": "LogicalMeerkat",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If you haven’t joined yet, r/leaves is a wonderfully supportive community. 7 months sober from weed here.",
                                    "score": 85,
                                    "author": "skellehtun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Leaves is such a good play on words props to whoever thought of it.",
                                            "score": 45,
                                            "author": "urzayci",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dope name indeed",
                                                    "score": 13,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "10 months sober and r/leaves got me there and keeps me honest",
                                            "score": 19,
                                            "author": "a-better_me"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I am also rooting for you. Learning to have faith in your ability to choose to conquer that addiction is an extremely fucking liberating process.",
                                    "score": 7,
                                    "author": "Derek1937463",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "If you haven't yet, try checking out marijuana anonymous. AA but for weed.",
                                    "score": 5,
                                    "author": "e-s-p"
                                },
                                {
                                    "level": 3,
                                    "comment": "As an ex stoner myself, get ready to be bored - that’s your withdrawal and it can last a while (took me about 3 months to feel normal again). Expect it, accept it, keep away from the people places and things you smoke with.",
                                    "score": 6,
                                    "author": "Ferintwa"
                                },
                                {
                                    "level": 3,
                                    "comment": "That’s awesome man, I’m rooting for you",
                                    "score": 3,
                                    "author": "Beif_"
                                },
                                {
                                    "level": 3,
                                    "comment": "You got this buddy!",
                                    "score": 4,
                                    "author": "DasMess"
                                },
                                {
                                    "level": 3,
                                    "comment": "Good luck.",
                                    "score": 5,
                                    "author": "Buffalo-Castle"
                                },
                                {
                                    "level": 3,
                                    "comment": "Quitting smoking is a mountain. But I promise to your soul, it feels so damn good climbing and then getting over. Stay strong my friend. I want to see you on the other side.",
                                    "score": 4,
                                    "author": "scoot_roo"
                                },
                                {
                                    "level": 3,
                                    "comment": "Damn , I had the same habit as you and I’m almost 2 years off, I was missing weed last night but reading ur story reminded me why I stopped",
                                    "score": 3,
                                    "author": "fedsredsfjtje"
                                },
                                {
                                    "level": 3,
                                    "comment": "I believe in you and wish you the best of luck!",
                                    "score": 3,
                                    "author": "smallpolk"
                                },
                                {
                                    "level": 3,
                                    "comment": "You can do it! I don't know you, but the fact that you are sharing your history and journey means you are very aware of the harm it is causing. Just keep reminding yourself of that. Maybe use the money you would spent on weed for a new hobby that gets you out of the house. &lt;3 I know it doesn't mean much, but I believe in you. \n\nI don't pray, but I do like to give my lucky penny wishes to others. I'll keep you in mind.",
                                    "score": 4,
                                    "author": "kayisforcookie"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The majority tend to be daily users, but tbf tend to not be terribly specific when I ask the amount (and I suspect they may downplay how much they use). About the most specific I've been told is \"a bowl a day\". It can also be seen in people who are only weekly (but still fairly routine) users. \n\nNot everyone who is a daily user develops the syndrome. Some only do after decades (had a fellow in his 60s start getting it and he started in his teens). The reason why some do and some don't isn't clear yet, but there are likely psychosocial and genetic factors.",
                            "score": 54,
                            "author": "Irrelevant_username1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you see it only in people who smoke or from people who use in other forms such as vaping and edibles? \n\nAs marijuana is being used and prescribed medically, do you know how is CHS factoring into prescribing decisions? Are you seeing anyone with this syndrome who uses only for medical reasons and never used prior to being prescribed marijuana by a doctor? \n\nMarijuana would of course not be the first or only prescription drug with serious side effects, many common prescription drugs have serious side effects, but people get those drugs from licensed pharmacists with pharmacy degrees, not dispensaries.",
                                    "score": 11,
                                    "author": "NYSenseOfHumor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not the doc, but any form of THC no matter how consumed can trigger it if you have it. Even delta 8, no luck there",
                                            "score": 5,
                                            "author": "SissyHypno24",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hey Doc! Daily smoker here, have been at it longer than OP. Just have a few questions. I know you probably hate getting asked medical questions off the clock but I’ll give it a shot anyway. Don’t feel obligated to respond.\n\nIs there any standard on how much you have to smoke in a time period to develop CHS? It seems pretty varied from what I’ve seen. Though from what I’ve seen it looks like heavy users mostly. And, skinnier/underweight people seem more at risk. My guess is that due to them having less fat to absorb the THC and thus it’s seeping into their system faster.\n\nHow much if any research has been done on this? Are you aware of any scholarly work/papers addressing it. I’d love to read some of you could point me in the right direction.\n\nAlso, would it go away or lessen over time as THC content in your body goes down? Or is it irreversible once caught…acquired…developed?",
                    "score": 11,
                    "author": "uber-judge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not OP, but also a doc.\n\n\nIn my opinion, there is no “typical” cannabis hyperemesis patient.  And part of the difficulty in studying how it develops, or how much pot they use is that these patients in particular are in such denial about their condition that they rarely give you accurate information about how much they’re smoking.  I’ve had alcoholics actively withdrawing tell me how much they drink.  I’ve had hardcore fentanyl users tell me how much they shoot up/snort.  Trying to get a straight answer from a cyclic vomiting patient?  Good luck.\n\n\nThat said, I personally think CHS occurs because you have cannaboid receptors in your gut and at some point after long-term use (months/years), you just sensitize some of these receptors and cause vomiting.  And at that point, any additional weed is just going to eventually cause vomiting.  You have to quit weed.",
                            "score": 31,
                            "author": "wanna_be_doc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So for CHS or any issues with cannabis, I notice in most of the studies (if the data explains it at all) the user consumes cannabis via smoking. Any smoke inhalation isn't good. But is this issue lessened with edibles or other non-smoking means? Or does the saturation of weed in the body look the same regardless of the intake method?",
                                    "score": 7,
                                    "author": "OohYeahOrADragon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not the doc, but intake method doesn't matter sadly.",
                                            "score": 6,
                                            "author": "SissyHypno24"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As wanna\\_be\\_doc said, the amount needed is unclear. Probably it's variable between individuals. In general, it's a someone who uses cannabis routinely (weekly or more often). Psychosocial factors may have some role, and I suspect there may be a genetic element. Here's a couple links with more info:\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5330965/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5330965/)\n\nThe next article has a proposed theory on the mechanism of the vomiting, as well as a general review of the syndrome\n\n[https://jim.bmj.com/content/68/8/1309](https://jim.bmj.com/content/68/8/1309)\n\nOnce people have cannabis hyperemesis, it seems to recur. I've had some people who can go months between episodes, and others will immediately start puking as soon as they resume the cannabis use. There isn't a heck of a lot of data, though.",
                            "score": 13,
                            "author": "Irrelevant_username1",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "On the flipside, I had an appendix that was causing a ton of vomiting  and debilitating pain once a month for three years and ER doctors refused to believe that I don’t do marijuana at all. I honestly don’t, but they were so hyper focused on that but I never got a diagnosis for years. My appendix coming out totally fixed it. Now I love weed gummies once or twice a week",
                    "score": 20,
                    "author": "schru031",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I use it for the opposite consider this I have many autoimmune diseases eoe hard to keep any food down I'm allergic to most food marijuana has saved my life.   But yeah hyperemesis LOL I can't believe these kids can't figure that out",
                    "score": 5,
                    "author": "erio000000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No drug is harmless, and all drugs have side effects associated with use. The key is to find the balance and only take/use the amount that is beneficial for the condition that is being treated. For some, there isn’t a benefit from some drugs.",
            "score": 1695,
            "author": "obnoxiousdrunk77",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm addicted to dabs. Weed is addictive.",
                    "score": 423,
                    "author": "Own_General_5562",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Literally anything that causes a dopamine response can be addictive.\n\nBy that logic food is addictive, masturbation is addictive, shopping is addictive.",
                            "score": 378,
                            "author": "waldocalrissian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Food, porn/masturbation, and shopping/gambling are some of the most common addictions.",
                                    "score": 224,
                                    "author": "uptowngorl1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So I think there is misunderstanding occuring somewhere here. When people say cannibis is not addictive, they should specify that it isn't chemically addictive. For example opiates and nicotine use pathways that down regulate the body's production of endogenous agents that use the same pathways (like morphine and acetocholine, respectively). Which gives you withdrawal symptoms when you stop ingesting the drug. From my understanding, cannabinoids are produced in the body but they aren't downregulate or anything because you can have as much as possible and it doesn't kill you. So it does give dopamine just like anything can, but then the habit is more what's addictive that the direct drug. Please correct me if I'm wrong.",
                                            "score": 64,
                                            "author": "DblVP3",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, thats very true what you said. Video games are addictive, gambling is addictive. You laid it out very nicely.",
                                    "score": 56,
                                    "author": "OpenIgnite",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Which is why you see so many people in recovery groups switching addictions. AA meetings are full of people who gave up drinking but are addicted to sex to the detriment of their lives. Shopping is not a harmless addiction if it drives you to bankruptcy.\nWeed today, Kratom tomorrow. Alcohol today, porn tomorrow. Gave up smoking, gained 70 pounds because now addicted to food. \n\nWeed is addictive for some people. Even medical marijuana users who use as prescribed find themselves on waiting lists for inpatient substance abuse treatment in California.\n\nSame as people who use their controlled substances exactly as prescribed (ambien, hydrocodone) can become addicted.\n\nAddiction is not a moral failure. We don't know why some people become addicted to certain substances and others don't. I'd really love to see the stigma of addiction lifted. Only then will people who need help truly get it.",
                                    "score": 9,
                                    "author": "Mitchell_StephensESQ",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "There’s a real disconnect between people familiar or dealing with addiction and general society.\n\nPeople say “I love this game it’s so addictive” or “theses cookies are amazing I’m addicted to them” I say all the time that I’m addicted to Dr. Pepper.\n\nBut there’s a real difference between enjoying the fizz of a soda when I eat food, and crying in shame because, again, for the 100th time I’m too “weak” or “pathetic” to not [XYZ] and fighting myself is consuming my life and fundamentally changing me as a person..\n\nI’m not trying to police the word or anything, but when he says “addiction” he means the “all consuming despair” kind, not the “grumpy Monday without my coffee” kind..",
                                    "score": 29,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;crying in shame because, again, for the 100th time I’m too “weak” or “pathetic” to not [XYZ] and fighting myself is consuming my life and fundamentally changing me as a person..\n\nPeople can be addicted to food, masturbation, shopping, gambling, etc. in exactly that way. In my post I meant addictive in exactly that way that can ruin lives.",
                                            "score": 24,
                                            "author": "waldocalrissian",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah, I read it as dismissing those lesser examples because they too are dopamine releases but not the same as more typical substance issues.\n\nI got lost a bit in the replies and misunderstood, my bad.\n\nI just know people who have “odd” addictions and I’ve heard other people be pretty judgmental without truly understanding. Irks me I guess..",
                                                    "score": 6,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "idk why you got downvoted. Did people forgot what addicted means?",
                            "score": 128,
                            "author": "suitable-robot01",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some people don’t know the difference between physical dependency and psychological dependency.",
                                    "score": 26,
                                    "author": "4200years",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glad for you. Both for quitting and being honest with yourself  both are extremely hard. Good job and keep it up!",
            "score": 68,
            "author": "Donse_Far"
        },
        {
            "level": 0,
            "comment": "Great job sharing your story, it is obvious some effects of this substance yet the way it's glorified can be dangerous and from what you've shared surely is. Hope everything is better for you from this day forward",
            "score": 1171,
            "author": "smuggledgoats",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. I did expect these to be controversy over this post, but I didn’t expect to be called a liar or lazy. I used weed to help me get through a depressed life. I’ve been through a lot in my 30 years and weed helped to numb the pain. It’s clear from the comments that people still have a problem admitting that weed can be dangerous, and I really don’t feel like I need to justify myself to anyone on the internet. I just wanted to share my story in hopes that someone reading it who has been wanting to quit takes the chance for a better future. I know I did, and I’m glad I got to walk away relatively healthy and with a better outlook on life. Ya’ll can call me names till the cows come home, but I feel better today than I did yesterday and that’s what matters to me.",
                    "score": 603,
                    "author": "threesmalldogs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just want to say, I really appreciate your post. I’m 30, i’ve been smoking weed everyday since I was 19 or 20.  I’ve tried to stop 3 times. Each time for at least less then a month, longest was three but then the witcher 3 came out and I caved to going back to it. I’ve never met someone who loves it more than me. I do it completely alone and prefer it that way. I love playing just about every single type of video game but it’s gotten to the point I can’t enjoy them without smoking. I’m paralyzed by that fact. I never worried about it being harmful. I’m hoping your story can help push me to stop. Can I ask what did you normally smoke out of? I 90% of the time smoke out of a small pipe you could pick up for 20$ at a smokeshop. I never clean them I just replace them every 4 to 5 months.",
                            "score": 51,
                            "author": "Hour_Cartographer03",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Check out r/leaves. I was similar to you and have hit over 2 months with that group and a free app called Grounded. So much support is out there",
                                    "score": 6,
                                    "author": "PL4Y3R2"
                                },
                                {
                                    "level": 3,
                                    "comment": "Hey guy or gal. You didnt ask for it but here's my 2 cents. Quit smoking. Quit now. Quit like you should have quit when you were 21. Weed is the most peaceful life ruiner ive ever encountered. It makes doing absolutely nothing okay. It makes living a life absent of accomplishment, excitement, and memorable experiences just fine. Eventually you'll look back and ask, \"wtf did I do these last 3, 5, or 10 years?\" If you smoke weed every day(that includes if you smoke it only at night ie after work), i want you to think about what you look forward to in everyday life. OP is spot on and knows what the fuck they are talking about. Fuck weed. If you smoke weed every day, try breaking up with it. Try writing a letter to weed like its an ex you just broke up with. The details of that letter will tell you if you have a problem(do you miss it? Do you resent it? Are you better off without it?). Good luck",
                                    "score": 3,
                                    "author": "Turkoloo",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;I didn’t expect to be called a liar or lazy.\n\nYeah, no, *fuck* that.\n\nFirst of all, yes, weed can be incredibly beneficial to people suffering from mental illnesses like depression and anxiety. But it can also be incredibly harmful, especially when it becomes routine.\n\nI used to self-medicate my depression with weed, and at first it helped a *lot*. But then I got to the same point that you did (habit-wise, not medically), where I literally wouldn't feel normal if I didn't smoke. It was the first thing I did every morning. When I couldn't wake-and-bake because of work or school, I'd be irritable and spend the whole day just looking forward to getting stoned later. I had no appetite when I wasn't some level of stoned. I either couldn't fall asleep or couldn't stay asleep if I didn't have THC actively in my system. I knew people who smoked even more than I did because they literally couldn't function without it; they literally couldn't eat, sleep, watch TV, hang out with friends, play video games, or hold a conversation without being stoned. They were addicted. They couldn't even take tolerance breaks because they couldn't eat or sleep without the aid of weed.\n\nI knew people who had straight-up mental breakdowns solely due to weed. Myself included. \n\nNot even to mention that exclusively smoking weed can still very much lead to things like cancer, significantly decreased immune and respiratory system responses (you have a *much* higher risk of getting sick if you're a heavy weed smoker), chronic obstructive pulmonary disease, respiratory infection, increased paranoia/anxiety, dissociation/derealization, worsened depression, psychosis, bouts of mania, and hallucinations, just to name a few.\n\nLike, I'm not tryna shame anyone for enjoying weed, and I don't think you were (or did) either. But to insist that it's totally harmless and has absolutely no negative effects on the body or the mind, *ever*, is just straight-up ignorant and foolish.",
                            "score": 96,
                            "author": "DumpstahKat",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "There is a culture of \"weed is all good, fuck you\" on reddit. Whenever it gets brought up theres frequent jokes that pushes the agenda of weed is great and anything against that is downvoted. Glad you made this post OP",
                            "score": 62,
                            "author": "bigfatpeach",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Check out r/leaves",
                            "score": 7,
                            "author": "whk2382"
                        },
                        {
                            "level": 2,
                            "comment": "People calling you lazy or a liar are lying to themselves and pissed that you're speaking the truth they can't yet accept. Proud of you and keep it up. I'm 43 and still suffer from this crap, keep kicking it, then fall back in, rinse lathe repeat.",
                            "score": 8,
                            "author": "Roselia77"
                        },
                        {
                            "level": 2,
                            "comment": "The way I see it this is r/trueofmychest not r/pleasejudgeme yet we're humans and that's what humans do, like you said you don't owe them nothing at all so they can call names \"till the cows come home\" (great expression lol) so go , and let go what you got bubbling up and try to do like them teens on their insta bios and \"live your best life\" i love all three of you, keep it up dogs!",
                            "score": 138,
                            "author": "smuggledgoats",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How do you join r/pleasejudgeme??",
                                    "score": 17,
                                    "author": "tinatarantino",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm pretty sure it didn't exist before but it does now",
                                            "score": 2,
                                            "author": "ze_shotstopper"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I love seeing humanity in the comments. Thank you, undocumented goats.",
                                    "score": 71,
                                    "author": "threesmalldogs",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Totally agree with you on everything. I feel like those justifying and defending weed is due in part to it probably helping them cope with life an it's all they know how to do, they don't want to see anyone attacking their form of coping. It's a human thing but flawed too. Not every coping mechanism is healthy. Just like drinking.",
                            "score": 18,
                            "author": "Stolles"
                        },
                        {
                            "level": 2,
                            "comment": "Any one who says weed isn’t dangerous is crazy.\n\nSome people really just aren’t cut out for it, they don’t know anything about dosage or the side effects.\n\nWill you get heroin-like withdrawals? Absolutely not.\n\nCan it mess up your life? 100%\n\nBeyond that small % of people who are already mentally unstable and have big breakdowns because they just aren’t ready for what strong weed does to your mind...\n\nSmoking were changes a lot of people.\n\nNo drugs are harmless, and if you don’t respect that it will bite you.\n\nDrugs are like guns and fast cars.\n\nDon’t respect them and you’ll learn quickly and it might even be too late",
                            "score": 13,
                            "author": "SexySmexxy",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Hey thanks for sharing it with us. My partner is dependent on weed but is functioning. I will make him read your story in the hopes he may have others' perspective on it that it can be dangerous",
                            "score": 10,
                            "author": "shrty_undrcvr",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If its any consolation on quitting cold turkey, I did exactly that after smoking the greens (and tobacco) for 10 solid years- I felt the usual withdrawal sweats/agitated/couldn’t sleep properly for about 2 days but by the third day I honestly felt really great and had a bunch of energy and just… felt much better. Clearer?? Idk maybe I had just forgotten what it was like to NOT be stoned 😂 \n\n\nOfc I don’t know if it’ll be the same for you, but just wanted to add that lil anecdote to give you some extra hope haha; I hope your birthday is going great OP! Congratulations on making it to 30 and going sober :)",
            "score": 86,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also, dreams come back. For me, it was mostly black void when I went to sleep while I was smoking",
                    "score": 19,
                    "author": "atsilupes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I smoke every day, probably way too much. But I've never lost my dreams. I definitely still dream every night.",
                            "score": 6,
                            "author": "bonkysmymom",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What about gummies? Just curious. No, I don’t smoke or use, but know those that do.",
            "score": 176,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gummies can cause/influence CHS but I don't personally know anyone who developed it only taking gummies. Mostly as I dont know anyone who only took gummies. Although if you do develop CHS edibles effect the worst. Because the syndrome influences your stomach and gut so much something about the THC going there first makes the symptoms really difficult.",
                    "score": 128,
                    "author": "TerriTubeTop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can offer anecdotal evidence of feeling nausea after extended edible use. Went away after taking 1-2 month break. Dunno if it’s related.",
                            "score": 20,
                            "author": "Meat_Candle",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think it's too much of any thc. I recently was taking delta 8 thc and after a while of being fine...I got super sick again. I replied to the OP just now and in it I said that I still smoke sometimes and dont feel sick. But if i push it i get really really sick. I have a feeling that it happens when thc builds up in the system past whatever threshold of someone with CHS.",
                    "score": 15,
                    "author": "James_Embrace",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey. Props to you. This takes guts to admit and you did it. It's not popular but truth rarely is. Good luck.",
            "score": 14,
            "author": "13Luthien4077"
        },
        {
            "level": 0,
            "comment": "This just in, breathing smoke into your lungs is bad for you.",
            "score": 575,
            "author": "codyummk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah whenever my stoner friends say weed isn’t bad for you, I ask them to think about it for one fuckjng second. You are quite literally burning something and inhaling it directly into your lungs, many times without a filter.",
                    "score": 212,
                    "author": "NUPreMedMajor",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I think the main point of his post is raising awareness of cannabis hyperemesis syndrome, so many people don't know about it and it CAN kill you. It's rare, but it's some serious shit and the irony is that weed is known to *help* with stomach issues so those with CHS use even more not knowing what's happening.",
                    "score": 39,
                    "author": "WanderWut",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I stopped smoking weed after smoking something definitely laced (I think with pcp, but I'll never know for sure. Though I did pick it up from some sketchy drug addict..I know lmao) after I smoked it I went into a psychotic breakdown and saw demons and evil shit surrounding me at every corner. Ended up having some sort of panic attack and now can't even smoke for fun on occasion anymore without extreme paranoia. I was a heavy smoker for years and never once had a problem. \n\nBut congrats on quitting and enjoy your day!!",
            "score": 287,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey I was given weed laced with pcp at warped tour 2017... That was not a good time at all.\n\nEdit: I'm saddened this got so many likes... I'm really not proud of it.",
                    "score": 52,
                    "author": "EclipsedTheSun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was a good ass show tho!",
                            "score": 17,
                            "author": "VeryStone",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; smoking something definitely laced (I think with pcp,\n\nDidn't know you liked to get wet, dawg",
                    "score": 9,
                    "author": "randCN",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's Sherman Hemsley, Angel Dust, PCP.... Dave",
                            "score": 5,
                            "author": "MediumRarePorkChop"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had a similar experience thinking I smoked something laced but later learned it was actually just so damn dank that it triggered a PTSD flashback or whatever from my suicide attempt the year before. I overdosed on diphenhydramine like the dumb kid I was which, at the high doses I took regularly, is one hell of a nightmarish deliriant so when I smoked the most potent weed of my young life I unexpectedly ended up in full delirium and tried to claw my way out of my own body. \n\nI also don't smoke much anymore lol",
                    "score": 6,
                    "author": "TheeBlakGoatsDottir"
                },
                {
                    "level": 1,
                    "comment": "Interestingly, doc also informed me that marijuana induced psychosis is also on the rise with these highly concentrated products. I’ve also felt extreme paranoia from smoking. I’m glad you’re okay!",
                    "score": 111,
                    "author": "threesmalldogs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Someone's probably addressed this already but, I hope you're taking steps to work on your mental health besides just quitting smoking. It's a good start, of course, but it doesn't do anything about the root causes that got you here in the first place.",
                            "score": 41,
                            "author": "MaeBelleLien",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I have to be super careful with how much I consume to manage my anxiety, and can't have any if the anxiety and panic have already started, or yeah, there's that paranoia you mentioned. \n\nTaking CBD helps me come down quicker if I'm in that state, fwiw, but it's only happened, like, twice.",
                            "score": 14,
                            "author": "brainisonfire",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yup sounds like pcp with the demons and evil shit lol fuck that shits awful",
                    "score": 4,
                    "author": "foxglove333"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good luck in your journey. \nI am 115 days sober today after 5 years behaving exactly as you've described. I have begun CBT to help deal with overwhelming emotions and I can say my life has changed for the better. I am happier, more present, a better person all round.\n\nYou can do this and know you're not alone!\n\n/r/leaves I think? is a great sub for people going cold turkey. Keep a support network if you can 😀",
            "score": 22,
            "author": "wowmoggo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Already subscribed, thank you for your encouragement.",
                    "score": 11,
                    "author": "threesmalldogs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 373,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here is a list of medical journal articles that address CHS: https://pubmed.ncbi.nlm.nih.gov/?term=%22cannabinoid+hyperemesis+syndrome%22%5BTitle%2FAbstract%5D&amp;sort=date&amp;size=200",
                    "score": 11,
                    "author": "transferbinder"
                },
                {
                    "level": 1,
                    "comment": "It ruined my life, its like food poisoning on steroids. Cant eat, drink, lie down becuase the nausea and stomach pain. I lost 30 pounds during my worst epsiode. Its a tragedy its not more well known, the poor bastards out there who have no clue its the weed making them chronically ill.",
                    "score": 145,
                    "author": "oxgnyO2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can I ask how much weed you think you were smoking? I've been eating probably like 50 mg of THC a day for a long time and never come close to having this issue but it sounds really scary.",
                            "score": 14,
                            "author": "8Ariadnesthread8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "About 400-800 mg of THC per day for me",
                                    "score": 11,
                                    "author": "Own_General_5562",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh WOW. I've never met anyone who consumes more weed than me in person. And I've still probably maxed out at about 50 to 100 mg a day. I have no idea how a person would manage 400 to 800? Like in terms of actually how do you even consume that? And how are you able to measure it?\n\nI'm....shocked, but impressed.",
                                            "score": 15,
                                            "author": "8Ariadnesthread8",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I just dab a gram a day. It's about 800 mg per gram. Some days it's a half gram so about 400.",
                                                    "score": 8,
                                                    "author": "Own_General_5562",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wow. Do you know if there's a limit to what your body is capable of processing? Like is it possible that you're taking in more THC than you can process and therefore wasting thc? Like at what point do you just start pissing it out like vitamin c? Or does it not work that way? I know that because it's fat soluble it can accumulate in your system.",
                                                            "score": 9,
                                                            "author": "8Ariadnesthread8",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hey there! Currently on day 6 of a CHS episode. Day 2 of sobriety. I wanna die.",
                            "score": 33,
                            "author": "spotmouflage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Please stay hydrated, have a sip of gatordae every 5 mins and don't abuse the hot showers. Try having some toast and bannanas, chicken noodle soup etc. You need to give your body a chance to recover.",
                                    "score": 4,
                                    "author": "oxgnyO2000"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How common is CHS? I know *many* lifelong, everyday stoners (ranging from ages 25 to 65), but none have shown any symptoms of something like that, ever.\n\nIs it that rare? Or are all of them incredibly lucky?",
                    "score": 28,
                    "author": "SEND_ME_REAL_PICS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s mostly from concentrates and oils.  Just regular flower you don’t tend to see this because you can’t smoke a gram of fucking THC a day in flowers.\n\nIt’s like the difference between people drinking coffee and people ordering pure caffeine powder on the Internet.  Normally you wouldn’t want to drink a gallon of anything to get that much caffeine.  \n\nThey’re not even cannabis users they’re THC users.",
                            "score": 8,
                            "author": "fermafone"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah I’ve smoked since I was 16 and pretty much everyday since I was 18-19 (24 now ) never had that happen or knew anyone that happened to. It doesn’t seem common . But I don’t know anyone who’s dumb enough to think it’s harmless . It’s smoking . Why would it be harmless",
                            "score": 6,
                            "author": "dj9008",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It only seems to happen to people who are dabbing every day, or otherwise using highly concentrated forms of weed, and using it chronically (no pun intended).",
                            "score": 29,
                            "author": "Uncle-Cake",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I honestly had no idea this was a thing. That's crazy. Thank you for the info.",
                    "score": 4,
                    "author": "Robotchickjenn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m proud of you. Just because something is good for others doesn’t mean that it’s good for everyone. That’s why we have gene testing now for medications and shit. NOTHING in large quantities is harmless. Even things like showering or self care or eating or goddamn WATER is not good for you in large quantities. \n\nAddictions are hard to quit. I’m motherfucking proud of you. Good job. ❤️‍🔥",
            "score": 19,
            "author": "DEVILSPAWN-NIGHTMARE",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\n\"Harmless\" is usually meant in the context of drugs and the common reasons to be scared of them, not as a general catch-all health term.",
            "score": 152,
            "author": "ShitbirdMcDickbird",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, harmless compared to when I was a kid and adults told you that it would kill you",
                    "score": 43,
                    "author": "enadiz_reccos",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Literally 0 substances are completely harmless in all situations. It's all relative.",
                    "score": 38,
                    "author": "cicatrix1",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for sharing. Very glad you’re doing better!",
            "score": 5,
            "author": "taggartbridge"
        },
        {
            "level": 0,
            "comment": "I like when people actually tell the hidden truths of drug use. Moderation is KEY.",
            "score": 55,
            "author": "CortexCash",
            "replies": [
                {
                    "level": 1,
                    "comment": "everything in moderation, even moderation. Except heroine dont do that shit",
                    "score": 6,
                    "author": "ClinicalOppression",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or meth. Don’t do that shit either.",
                            "score": 2,
                            "author": "mrmeseeks805"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I went into kidney failure due to excessive use of high concentrate candy bars. I could have died. I was in the hospital 3 days on IV and potassium drips. I just vape my pax now in the afternoons. I agree with OP, watch how much your using with anything. If I slammed a whole 5th of Jack that would probably kill me too. Moderation with anything. Great post!",
            "score": 46,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Congrats on getting sober. I used to smoke from morning until night as well. Obviously was habitually addicted to the stuff (but that's part of my personality). Never had any health issues because of it, though. Quitting cold turkey was no problem for me after a week or so when I got into a groove of not smoking. You'll be amazed at how many dreams you start to have. At least I was. \n\nI assume you'll get a fair amount of hate here, but just ignore it. Focus on you. You told your story, people will listen or they won't. I tried to go back to smoking in moderation and ended up having panic attacks every time I did, so I cut it out completely. \n\nIf you ever want to talk about anything, feel free to shoot me a message.",
            "score": 102,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I never had a problem quitting weed at any point in my life until I started smoking the carts. Holy Jesus, it's crack oil.",
            "score": 90,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s the stuff my doctor warned me about. Cartridges and dabs- they can be as pure as 99% THC! great if you want to get high, not so great if you want to stay healthy.",
                    "score": 63,
                    "author": "threesmalldogs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m heavy on the carts right now. I think after reading this I won’t buy another one. Only bud",
                            "score": 13,
                            "author": "maddix82802",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It’s such a dirty head rush of a high no idea why people like it.  Not like flower at all.\n\nLike a cannabis whippet.",
                            "score": 4,
                            "author": "fermafone"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm so glad I stopped using those things. They're too convenient. If I was bored I'd just think \"might as well get high\" whereas I can't just smoke a bowl in the middle of my dorm room.\n\n\nThe mild inconvenience of solely using bud cut back my weed use so much",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was reading this post to my partner, and he literally looked at himself and asked me if he’s smoking too much. \n\nI put it in alcohol terms, and he was a bit like, “yeah, if you got drunk everyday that would be weird.”\n\nHe literally put his bong away to give it a rest for a while. Not quit completely, just take it easy. \n\nThanks for your story, it was definitely good talking point. Gave us something to think about.",
            "score": 5,
            "author": "teddingtonbear"
        },
        {
            "level": 0,
            "comment": "I should quit",
            "score": 16,
            "author": "Sooper_Glue",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes. And you can do it, I’m rooting for you!",
                    "score": 10,
                    "author": "threesmalldogs",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I swear I’ve read this before",
            "score": 4,
            "author": "catdog918"
        },
        {
            "level": 0,
            "comment": "Thank you so much for posting here. Sorry you’re getting so much shit for it. I’ve seen my nephew and many others go through the same. The statistics for chs and psychosis linked to high potency products are shocking and the MJ industry is only too happy to keep calling it medicine and raking in money without telling the whole truth. Everyone has the choice to use or not but they should know the whole truth about what they are choosing. I wish you well.",
            "score": 12,
            "author": "PotentialPassenger"
        },
        {
            "level": 0,
            "comment": "I really feel marijuana affects different people differently. I have gone and smoked for 5 years straight every single day and got my work done and functioned normally. Infact, just to give myself a challenge I haven't smoked in the past year and I feel completely fine. However on the other hand, I have seen people give into weed like a drug addict and have completely lost their way in life. So personally, if weed works for you and you have your priorities straight then it's all cool, otherwise step back.",
            "score": 137,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Weed was my lifeline for a time. It calmed my pain and chronic symptoms and made me able to go out and enjoy my life. It made life possible. Then one day someone gave me a blunt that was way too strong for my tolerance and I had an awful whitey all alone in a fancy hotel. I tried smoking again after a few weeks but the anxiety I get now is just not worth it. Really quite sad it was ruined for me.",
                    "score": 5,
                    "author": "Cloverfield1996"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 27,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeahhh I definitely think weed for most people is objectively less harmful but it very much is addictive and habit forming. There have been a few times in my life where I was smoking daily and felt like I couldn’t go a day without. It can be used medicinally but it’s not a miracle drug by any means…",
            "score": 17,
            "author": "PastaBod",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly while I agree with people saying that moderation is Important in making sure you’re smoking safely, but I think a massive part of keeping marijuana “harmless” and a fun thing to do is paying attention to how much %THC is in what you’re smoking. Personally when I was at my lowest I was smoking like above 50% THC several times a day and having horrible side effects whenever I was sober. I’ve since stopped doing anything with THC content above 10% And I’ve honestly seen such a drastic change in my approach to getting stoned. My impulses to smoke are 100% less frequent and less intense and I don’t feel like trash the day after. I think it needs to be clear to younger stoners who are getting into smoking and stuff how much THC content affects the kind of high you’re getting and That just because a strain has a very high THC doesn’t mean it’s actually gonna be fun to smoke cause I think a lot of people of my generation just think high THC = better more intense high And completely disregard anything with Thc contents of below 20%. Right now I’m smoking pretty often because it’s summer and I’ve gotten both doses so I’m seeing a lot of old stoner friends I haven’t seen in a while and I feel way more in control of my consumption on the lower thc stuff",
            "score": 27,
            "author": "thrwaway_wrm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Their mentality is the same as someone going into a bar and asking the bartender give them whatever has the highest alcohol content",
                    "score": 16,
                    "author": "Bigchiefngass",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I really enjoy dispensaries that have a good selection of very chill strains and low mg edibles. Where I’m at legalization is newish and the dispensaries still have very few options nothing with high Cbd to mellow a high no edibles below 5 mg. It’s all super intense and for someone like me who smokes infrequently it’s all too much and just not enjoyable.",
                    "score": 3,
                    "author": "781234567",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With you on that point. I dont understand why theres such a focus on making things more potent with higher THC levels. Wheres the appreciation for the terpens and esters in the bud itself, the other stuff from the plant that affects your high. \n\nIt's like wine vs. The highest proof alcohol. Most just wanna get fucked up. Weed culture is diverse but the chase for highest THC makes it seem monotonous. \n\nAlso, harm reduction education should be an obvious must. Dont start when you're in your teens, you will fuck yourself up.",
                            "score": 6,
                            "author": "caramelfappucino"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anxiety. I use to smoke to ease anxiety. 25 years later, I can’t leave the house if I smoke. Over time marijuana can cause mental issues.",
            "score": 3,
            "author": "Kevin3683",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It doesn't matter how much everyone here tell yourself smoking is harmless.\n\nCarbon monoxide, carbon dioxide, etc, in the lungs are never harmless.",
            "score": 3,
            "author": "affo_"
        }
    ]
}