{
    "id": "tajf2x",
    "score": 38698,
    "title": "My brother's flight got delayed 30 minutes and I'm terrified to tell my wife",
    "author": "unholy_mountain",
    "date": 1646864967.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/tajf2x",
    "media_urls": [],
    "other_urls": [],
    "postText": "Let me explain. I haven't seen my brother in two years. He is coming to stay in the town I live in for a few days for work and has plans of staying at my house for 1 night of his several night stay. We plan on getting a drink, a bite to eat then head back to my place to chill for a few.\n\n\nMy wife is very abusive, manipulative and controlling. She has spent the last few days berating me for seeing my brother (it goes against her evil agenda of trying to separate me from anyone and everyone I love). She has been making comments about how fucked up it is that I expect her to put two kids to bed tonight by herself. Her \"compromise\" is that I get home by 11 and help her with the kids if they aren't already asleep. Ive obviously been pushing back on this, since she is a grown ass woman and can handle putting the kids to bed by herself once (remember, haven't seen my bro in 2 years). His flight getting delayed 30 mins delays my plans 30 mins and I will be abused and berated for it. I hate it, I'm terrified of this evil bitch but I feel so stuck.\n\nEdit: Holy crap this blew up. Thank you to everyone for the kind words and support. I knew this wasn't normal behavior but needed to hear it, and the peope have spoken. My wife is BPD possible narcissistic and is very extreme in her responses to anything she doesnt like or agree with. Because of this, I have slowly been conditioned to let her have her way and abuse me. It happened so subtly and right under my nose. Abuse against men is real and I can't believe I let it get this far. I HAVE taken steps toward a divorce, but pulling the trigger on it has been hard, the idea of not seeing my kids everyday is terrifying but as many have pointed out, they'll be better off to get away from this environment. As for the people who told me to grow a pair or man up, I get it, and youre right. There is a responsibility on my part to establish boundaries but the consequences of attempting to do that at this point include her attempting to get me fired, trashing my office etc. She GOES there, and Im working closely with a therapist to navigate my way out with minimal collateral damage. Thank you to everyone who direct messaged me as well. I'll do my best to respond tomorrow, I will post an update tomorrow as well. Thanks again all.",
    "comments": [
        {
            "level": 0,
            "comment": "Lawyer up bro. Document everything. Call the cops on her if she freaks out again and file a police report. Work with your therapist and lawyer on crafting a case for full custody. Make an action plan to move with the kids back closer to your family/support system. Make a plan and then stick to the plan. When she blows up and tries to bring the kids in call the cops or create alternate response via therapist and lawyer. You got this. Get organized and take your life back.",
            "score": 7690,
            "author": "ChampThing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the support. This post is getting a lot of eyes and its the most confidence ive had in awhile.",
                    "score": 2900,
                    "author": "unholy_mountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s a couple of infamous posts made by a redditor who was planning on leaving his marriage that escalated into making national news. If and when you have the time, I suggest you read through them and see what steps you can make to safeguard yourself and children from the fate he suffered. I don’t mean to scare you, but I don’t know how abusive your wife is or what she may be capable of.\n\n[incident I’m referring to](https://www.reddit.com/r/TrueCrimeDiscussion/comments/nqdf6u/the_reddit_post_that_turned_into_a_horror_story/)",
                            "score": 616,
                            "author": "RidiPagliaccio",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow that was not a fun incident to learn about- biggest take away from that is if someone in your life seems to display sociopathic tendencies in any way and you’re about to take extreme measures, such as presenting divorce papers, be READY and be vigilant for the possibility of extreme reactions by the individual. OP, when you’re going to tell your wife your ready for divorce do it somewhere in public, have your kids posted up at your parents or wherever for the weekend, record everything, keep yourself away from her after the event. Keep recording everything she is doing up until then, take your time with any decisions you’re going to make, and please be careful.",
                                    "score": 299,
                                    "author": "AnyCatch4796",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "YES! Leaving an abuser is the most volatile and dangerous situation for the victim. So many women are murdered because they are terrified to leave, but if they leave, they're more likely to be murdered. I don't know if the statistics are the same on the men's side but ALWAYS be prepared, NEVER go alone. Hell, call the police and get an escort if you need to. Bitches be crazy.\n\n\n- abuse victim",
                                            "score": 204,
                                            "author": "ababyprostitute",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Spot on. I am so happy to see you got out of your situation. I am a researcher and have worked with abuse survivors....it takes an average of 11 attempts before a person being abused leaves for good. 19% of domestic violence ends up involving a weapon. I can't find the supporting stats right now, but the leaving time is the most dangerous. Have a plan.  An escape bag. Access to money that your SO doesn't know about.  DV shelters often advise moving out of your local area. Every DV non profit I have worked with have had male survivors living there or participating in offered therapy. Some of them had suffered extreme violence and trauma. There are resources and you aren't alone. Be safe!",
                                                    "score": 62,
                                                    "author": "wildmaja",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Read up on Borderline Personality Disorder.  I was in a similar situation with my now ex-GF.  There is a subreddit called BPlovedones.   Lots of support there.",
                            "score": 125,
                            "author": "bueller83",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your comment has opened a window into dealing with a difficult family member. Thank you.",
                                    "score": 26,
                                    "author": "MamaTexTex"
                                },
                                {
                                    "level": 3,
                                    "comment": "Based on the information OP has given and my own BPD diagnoses, this sounds more like narcissistic behaviour than BPD. Untreated BPD is a whole other nightmare and typically comes with some very strong symptoms. Fuck, even on meds I can be a massive pain in the ass. I could give a better guess if I had more info about her but I think it might be easier and extremely productive in OP's case to try and convince her to get a professional diagnosis.",
                                    "score": 40,
                                    "author": "ababyprostitute",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 20,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i think you should divorce",
            "score": 12437,
            "author": "june-bot",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is what I must do. Reading responses and facing some hard truths are giving me some confidence and reaffirming how fucked up my situation is.",
                    "score": 9058,
                    "author": "unholy_mountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You absolutely need to leave this toxic woman. She's unhealthy for you and your kids. Life is too short! Wishing you a future of happiness. \n\nEnjoy the time with your brother! And don't worry about her. Stand up for yourself until you manage to gtfo.",
                            "score": 2634,
                            "author": "sophia1185",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for the kind words",
                                    "score": 1230,
                                    "author": "unholy_mountain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No one should feel this way in their home with their family.  Bless.",
                                            "score": 481,
                                            "author": "No-Turnips"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "When you do leave do not let her know you'll be leaving. A lot of domestic violence murders happen when the victim tries to leave. \n\nI know you can't leave immediatly, so in the mean time document as much as you can. Keep a detailed journal of every occurrence and act of abuse - whether it be some small verbal remark or a physical assault- with a date, time, and as much as you can remember. If your state allows 1 party consent recordings then voice record as much as possible. \n\nI assume you want full custody of the kids. This is your best way to get that since it is so rare for fathers (assuming you're a man) to get custody of their kids. \n\nI know you may not think she will fight for the kids or try to kill you, but there was a time when you never thought she would abuse you. Do not trust her. \n\nDocument as much as you can. And have a game plan to get out. Speak with an attorney privately to get your affairs in order. \n\nI hope this works out the best for you. I'm so sorry you're in this situation. She is scary, wrong, not all there in the head, mistreating you, etc. You aren't crazy. She is. Be careful and take care of yourself and your kids.",
                                            "score": 1049,
                                            "author": "TwilightMountain",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also, if you can put some money aside where she will not notice it’s missing and cannot access it - in your brothers name or something. Make sure you have a nest so when you do leave (and i believe you will) you don’t have to return to that environment where neither you or your kids deserve to be. Kia kaha",
                                                    "score": 290,
                                                    "author": "sio_h",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Best advice! I called it embezzling my own money. I saved up what I could and kept it locked in my desk at work. It made leaving my ex-husband easier (never easy, even when they are unpleasant people). You have to try to eliminate all the ways they can guilt you into coming back. I had paid all the bills ahead too....even the ones he was responsible for.",
                                                            "score": 181,
                                                            "author": "CatCiaoSki",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You’re a hero!! Happy you made it!",
                                                                    "score": 50,
                                                                    "author": "yankeeuniverse",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Five years later, we've managed to coparent two well adjusted teens. I have a wonderful husband, my ex has a delightful wife and they have a baby together. We have exactly split custody, no money exchanges hands....if the kids need something, one of us buys it...no questions asked. \n\nI think there were a few things that kept me sane....\n\n- when I was ready to leave I left, knowing there was no turning back. I couldn't put my kids through a break up/make up cycle. They had a very solid family upbringing (their dad is an ass with a temper and I couldn't handle it)\n\n- when my ex took the low road, I took the high road, quietly. My kids knew his behavior was not ok at times, they didn't need nasty comments from me.\n\n- Don't engage. When the nasty texts and phone calls came from him in the beginning, I would let him know that I couldn't tell him how to expend his energy, but fighting is not where I'm expending mine.\n\nAre we all besties? No. Do my kids know their parents love them and they have two solid homes, yes! That was my desired outcome when this all unfolded. He's a good dad, shitty husband....I could never keep them from him nor would I want to.",
                                                                            "score": 15,
                                                                            "author": "CatCiaoSki",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Soooooooo I wasn't in a situation as bad as this BUT all the above advice is solid. Get some money put away. Document EVERYTHING. Fight your fucking ass off for your kids. You will pull the trigger on divorce and feel broken and empty. Fight through that. Fight for your kids. Took me 3 years to get mine back to joint. Anything and everything will be a battle. Have an amazing, wonderful wife now who supports and loves my kid. I fucked up the process along the way. She helped me through it. Again, the above advice is good. If you are feeling this way now, it will only get worse. Do what is good for you. Emotional abuse is still abuse my duder. Keep yourself healthy and keep your self safe. And always keep your kids future's as your priority. You got this. I have faith in you fellow anon.",
                                                                    "score": 37,
                                                                    "author": "acrazydude128",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I love this advice from another man",
                                                                            "score": 9,
                                                                            "author": "No-Vermicelli3787",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Totally agree I love how people have responded the support. I was hit in the face with landscape rock, shattered my cheekbone . Please be careful I say these words not to scare but you just never know what a person like that could or will do.I did underestimate how Caniving a person could be.Stay Strong and read these posts over and over if u need 2 BlessU and children.",
                                                                                    "score": 7,
                                                                                    "author": "Cheeky_mnky1953"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Pro-tip -  \n\nEvery time you go to the store, buy yourself a $20 gift card and/or take out $20 in cash and set it aside.  If you have a stash spot (closet at work, friend's house, etc.)  discreetly and slowly fill it with everyday items, rolls of TP, paper towels, canned goods, sheets, etc. Back up for your phone somewhere that is private.  Keep your notes on paper times, dates, any and all things you can think of.  Print out your text messages.  Retroactively write down your role in parenting, money making, managing the household, etc.  There are samples of home responsibility  distribution on-line to use to get your started of the kinds of things you should document.  Consult with all of the best divorce attorneys in your area, so if you do decide to get divorced, she can't use any of them.  Don't leave until you have your shit together.  When you know, you know.",
                                                                    "score": 79,
                                                                    "author": "RainbowsRMyFaveColor",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Careful with the consulting with all of the best attorneys thing - some judges consider that proof of malicious intent on your part and it can work against you.",
                                                                            "score": 31,
                                                                            "author": "ScrantonCranston",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "i suggest looking for a good female attorney specifically, i dont know why but it looks better to a judge.",
                                                                                    "score": 13,
                                                                                    "author": "[deleted]"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "And get all your important paperwork together in a safe place! Once you are out, immediately take steps to protect yourself financially.",
                                                            "score": 16,
                                                            "author": "Intelligent_Sundae_5"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "This is where i am now. I have videos of EVEEERRRRYYYTHINNNG.",
                                                    "score": 39,
                                                    "author": "Skitzophranikcow",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I hope you are able to get out safely. Sending love and positive vibes!",
                                                            "score": 24,
                                                            "author": "araquinar",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thanks. There are a lot of us out there in the same boat.",
                                                                    "score": 17,
                                                                    "author": "Skitzophranikcow",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I was there once, 20 years ago. I feel for you",
                                                                            "score": 10,
                                                                            "author": "araquinar",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Also documents like social security numbers and birth certificates, passports, things you need to prove your identity or that can be used to open accounts in your/ your kids names.",
                                                    "score": 15,
                                                    "author": "stitchplacingmama",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "So glad you said this, it was the first thing that came to my mind.  When I left my abusive ex he knew nothing.  I was terrified of him.",
                                                    "score": 10,
                                                    "author": "Magnolia_Willow",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "There are many shelters that help out BOTH men and women. They can help guide you with the process.",
                                                    "score": 23,
                                                    "author": "judgingyoujudgingme",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "don't lose hope! \nI read a study that it isn't actually the system that was biased against the men getting custody. It was that the men didn't put forth the effort to try. When they did try they were awarded custody at the same rate....it was really interesting...\n\nLet me see if I can find a link.",
                                                    "score": 49,
                                                    "author": "Raspberry_poop",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There is definitely truth to the bias, I've actually heard a judge say \"While her behavior has been erratic and the drug use is concerning, I would be doing irreparable damage to these children by not allowing them to live where children naturally belong, with their mother.\" \n\nCrazy story time (warning, this is long). This was a guy I worked with years ago who filed for divorce and custody of his two kids after finding out that his wife had cheated on him multiple times. She supposedly also got pregnant, had at least one abortion without him knowing and spent roughly $100K of his inheritance from his father without him knowing because she managed the finances. Turns out that she had a serious opiate issue that she hid for a few years until she graduated to Heroin, he claims he couldn't tell. He constantly gave her the benefit of the doubt, ignoring rumors and cutting people out of their lives. What blew it all up was when he was attempting to refinance their mortgage into better loan with like 2.5% lower interest rate and saving them like $1000/mo (which is HUGE), she kept fighting him on it, refusing to fill out paperwork, refusing or forgetting to sign things, he eventually checked their savings account to see what they had for loan collateral and realized that most of the money was gone. She lied to him for nearly a week claiming that someone must have stolen their identity and taken the money, and when the bank provided evidence of all of the transfers and withdrawals, she threatened to kill herself and he had to have her mother come talk her down and get her out of the house. \n\nThis lady completed a 45 day inpatient program and that was all the judge needed to see in order to determine that she was fit for custody. The guy did eventually get his divorce and the divorce proceedings went better for him, he was awarded the house and any equity due to the evidence of her draining inheritance money that he came into the marriage with. She lived with her parents for a bit but after the divorce, she dropped off the kids one weekend and was gone when he brought them back to her parents house, she actually drove across the country with her junkie boyfriend, didn't tell her parents or the kids that she was leaving. Asshole didn't call or speak to her kids for over a year and then came back one day and asked them if they wanted to move back with her at her parents house.\n\nThis was years ago, and those kids are now young adults, they know exactly who their mother is and what she did to them and their father. His oldest daughter actually slapped the shit out of her because the money she stole was meant to pay for a considerable part of her college, so she had to turn down her dream school because she couldn't get enough scholarships or financial assistance, and when she told her mother about it, her mother told her \"why do you care about college, I did you a favor, you wouldn't have made it anyway, just find a man and have kids\". \n\nThe sad part is, I'm sure there are people with worse stories of nightmare spouses and ridiculous custody battles.",
                                                            "score": 47,
                                                            "author": "SeanSeanySean",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "JFC. Thanks for the bedtime story.\n\nSome people are filth.",
                                                                    "score": 15,
                                                                    "author": "Banditkoala_2point0",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Please take this advice and try to put some money aside while you get your escape plan together. Take care!",
                                                    "score": 6,
                                                    "author": "Jolly_from_Oz"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Document with video and photo proof of everything she is doing. Save it. Make copies. Make copies of copies",
                                            "score": 15,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is the way",
                                    "score": 5,
                                    "author": "patty_OFurniture306"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 133,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Definitely shouldn't be this way. I was in a toxic marriage (on both sides) but she would never discourage me from seeing and spending time with my brothers. That is highly toxic!",
                                    "score": 49,
                                    "author": "ChoadyWalker"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yup she’s trying to make it a sides thing to enable controlling behavior. All the family, friends, etc. are painted as problems and you need to pick her side. You don’t? She’ll get irate until you do.\n\nYou do? Then the cycle feeds into itself because she’ll take that isolation and abuse even more. That’s why abusive relationships don’t improve over time, the abuser sees it as a reward for their isolation and does it more.\n\nOP cash out now it’ll be worth it. Call a domestic abuse hotline and let them know everything. She will only get worse. She’s not the exception to the rule. Every abuser claims to be.",
                                    "score": 35,
                                    "author": "bilbo_swagginz_boi"
                                },
                                {
                                    "level": 3,
                                    "comment": "I wouldn't dream of doing this to my SO. Go have fun boys✌",
                                    "score": 20,
                                    "author": "Significant-Mousse71",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know! Right?!",
                                            "score": 9,
                                            "author": "CommercialExotic2038"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I was in your shoes man. I filed the papers for my divorce yesterday and couldn’t be happier. You don’t deserve to deal with any of that. Good luck to you brother.",
                            "score": 71,
                            "author": "buskinking",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Talk to a lawyer first. Get as much abusive evidence as possible. You don't want to end up giving half your life away to an evil bitch.",
                            "score": 20,
                            "author": "evaneli13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He will give it away anyway, but it’s still a bargain.  I know firsthand.",
                                    "score": 6,
                                    "author": "AllReflection"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Be kind to yourself, you're literally being abused. Take a deep breath.",
                            "score": 34,
                            "author": "Reference_Stock"
                        },
                        {
                            "level": 2,
                            "comment": "You called your wife a bitch in a Reddit post. You know this marriage is over and you need to file for a divorce, before you both ruin each other's lives.",
                            "score": 191,
                            "author": "StressSufficient1386",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Holy shit thats a good point lol",
                                    "score": 117,
                                    "author": "unholy_mountain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Definitely work towards divorce.  Start by saving your texts including now when you tell her he’s running late.\n\nGood luck man, it will get better.",
                                            "score": 40,
                                            "author": "secondrat"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Make sure the kids are safe before you drop the divorce bomb. SOs, male or female, will lash out and could hurt them to get to you.",
                                            "score": 7,
                                            "author": "Sawgon",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I believe it was actually ‘evil bitch.’   I wouldn’t spend 5 minutes with someone I despised so much, let alone a lifetime.",
                                    "score": 94,
                                    "author": "FartOnAFirstDate",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There’s a book called ‘Stop Walking on Eggshells’",
                            "score": 10,
                            "author": "bpalmerau",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "A relationship should never make you feel guilty. Especially for loving your fucking brother. You need to go home, explain you’re divorcing her and go live with your brother if you have to. \n\nYou only have one life, one opportunity to love and feel happiness, stop waiting another second of it.",
                            "score": 10,
                            "author": "Joseph4040"
                        },
                        {
                            "level": 2,
                            "comment": "Dude. Divorce. WTF!!!!!!! I'm from a broken home and so glad my parents didn't \"stay together for the kids\" fuck that blink song lol",
                            "score": 21,
                            "author": "loneoperator88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That song is about what happens when you stay together for the kids. And arguably a banger",
                                    "score": 6,
                                    "author": "SamusTenebris"
                                },
                                {
                                    "level": 3,
                                    "comment": "Uhh the song is about why NOT to stay together for the kids",
                                    "score": 3,
                                    "author": "hop_mantis"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fuck it don’t go home at all. Chill with your bro. Time for real pushback.",
                    "score": 100,
                    "author": "buckshotbill213",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's what I think, OP and bro should just book a hotel and go and enjoy themselves for the 1 night, she's gonna be on his case either way! May as well be hung for a sheep as a lamb!",
                            "score": 39,
                            "author": "aine408",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Definitely. No one’s deserves to be treated like this.",
                                    "score": 10,
                                    "author": "buckshotbill213"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It seems tou have never dealt with legit crazy before. Say he does that, 11pm comes and goes... she then punches herself in the face and calls 911, cops arrive and she says he assaulted her and took off with his brother. Now theres a warrent out for his arrest, she then proceeds to file a TRO so he cant even enter his own home or see his kids. The day after he gets arrested, she goes to the bank and drains all accounts.\n\nSeen it happen with my own eyes. Only way to beat crazy is to be crazier. Best wishes.",
                            "score": 24,
                            "author": "stonky808",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have been in this situation though I was the wife.  The relief from not having to deal with another person being an abusive POS from normal every day situations is AMAZING. It is a rough path to walk but better on the other side I promise you. Your life doesn't have to be like this.",
                    "score": 12,
                    "author": "Bella_Climbs",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "OP I'm terribly sorry you're in this situation. Have you thought of seeking free mental health services?\n\nYou're in a very tricky spot with two young children with this woman and it will be in your favour to start discussing what is happening with professionals now, it could be what allows your full custody over your children and thus the saving grace they probably need to grow up peacefully.\n\nTake it from someone with abusive parents, if they grow up with that woman they will be learning to survive instead of taking the time to grow and it will set them up for bad relationships with friends, family and lovers for their whole lives.\n\nYou deserve better. Your children deserve better.",
                    "score": 10,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Get an attorney before you say a word of this. Do this immediately.",
                    "score": 4,
                    "author": "inscrutiana"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Run, I mean, like legally handle your shit, and then run. Take the kids.\n\nEdit: folks that’s why I said legally. Seems like lots of cynics here so I’ll elaborate. It’s not that hard in an abusive situation to get protection and also have that result in single father status. So if everything can be taken at face value, document the abuse, get a protection order and move on… legally, and fight to get the kids. I know a few single dads.",
            "score": 6025,
            "author": "jzclipse",
            "replies": [
                {
                    "level": 1,
                    "comment": "I recognize the abuse, and have even talked to lawyers but haven't pulled the trigger on divorce yet. Tbh, I'm terrified. Terrified of seeing my kids less often, terrified if the environment the kids would be subjected to living w her. She has successfully run my friends out of my life and now i live in a city with no support/friends/family and little to no confidence. Im working with a therapist to get thru it. Im a successful, fit and fun loving social kind of guy and am now a shell of that past self. Abuse against men by women is very real and creeps up on you until youre just a puppet.",
                    "score": 3545,
                    "author": "unholy_mountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As somebody that grew up in a household where two unhappy parents stayed together for the ‘well being of the kids’ the best thing you can do is go through the pain and suffering of a divorce and everything that goes with it because let me tell you the amount of pain and hurt you’ll save yourself and your two children will be worth it 20 times over",
                            "score": 901,
                            "author": "Typhurin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, this. These are the comments that are helping me mentally clear a path to what I know I deserve. Thank you.",
                                    "score": 592,
                                    "author": "unholy_mountain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know you're at like, 1400 comments and you probably won't read this. But I want you to know that parents model  relationships for their kids. If this is what your kids know, they're going to seek out unhealthy abusive relationships. In the long run moving to leave her will teach them that they can be better too.",
                                            "score": 240,
                                            "author": "jamminatorr",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "^^^ This. Listen to this one.",
                                                    "score": 45,
                                                    "author": "ElbowStrike"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I waited too long “for the kids” it took them finally asking me when I was gonna divorce dad. We are a full year separated and I wish so badly I’d done it sooner. I think staying together too long did way more damage to them. We are all in therapy now trying to undo damage that was caused from growing up in a toxic household. The kids need to see their dad for the man he is when he is himself. Not the man he is when he’s cowering under the rule of his wife. My girls have learned more about the real me in the past year than in the past twenty. I just was too afraid to rock the boat all that time. Best of luck. Get the true you back. Your children will be better for it.",
                                            "score": 22,
                                            "author": "orbit33"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I wish you nothing but the best, I hope you and your children live great lives devoid of any bad feelings. :)",
                                            "score": 45,
                                            "author": "Typhurin"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "By the sounds of it though, I wouldn't be surprised if the judge orders the kids to live with you. He/she should, in fact. You have every reason to be confident and stand up for yourself.",
                            "score": 688,
                            "author": "sophia1185",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you.",
                                    "score": 351,
                                    "author": "unholy_mountain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Be smart. You know you need to leave, but how your leave will change how your future will work. Start recording! This is evidence for you to gain, perhaps, full custody. Please, please, please think about how you can, long term, be free.",
                                            "score": 253,
                                            "author": "girlinanemptyroom",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Absolutely this. Document EVERYTHING. \n\nSend her a polite sms saying what’s happened and you’ll be 30 minutes late. Save her response.",
                                                    "score": 113,
                                                    "author": "TheGloveMan",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This! Also, if she berates or is verbally abusing your children, be sure to record it",
                                                            "score": 58,
                                                            "author": "Bob-bozo-4777",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Document everything! Record conversation so you have proof of how abusive she is. Create a secret email address and send all your evidence to that email account so you can delete it off your phone.",
                                            "score": 19,
                                            "author": "AdmiralCranberryCat"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Record any abuse that occurs often, before you make her aware that you’re seeking a divorce",
                                            "score": 12,
                                            "author": "Shmeckle_and_Hyde",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 83,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Holy shit. Im sorry to hear about this gross injustice.",
                                                    "score": 61,
                                                    "author": "unholy_mountain",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "what makes no sense is the comment you are replying to.  having the right lawyer can make a difference - but not that much of a difference.  friends and family always have a skewed picture of what's going on for obvious reasons, and everybody comes in with a story about their brother or their friend got this and that so that's the way it should go for them.\n\nalso don't try to \"keep eye contact with the judge\" or do anything else in court unless your lawyer tells you to.\n\nsource: have been a divorce lawyer for the past 12 years.  feel free to DM me btw.",
                                                            "score": 90,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "From bitter experience: if you decide to move out, remember that having a safe and sane home with you part of the time is better for them then watching you yield to their mother’s tyranny. This is 100% about your kids. Do not engage  in personal attacks or hostility, ESPECIALLY in writing. It’s just about the kids. You’re the grown up. They need you. I wish you the strength and fortitude to navigate whatever you decide. It’s a hard road, but there’s an ending to it. Best of luck.",
                                                                    "score": 39,
                                                                    "author": "39lab"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Perfect way to describe it… A “skewed” view. People outside the situation always run their mouths when they only have a tiny portion of the real story.",
                                                                    "score": 13,
                                                                    "author": "76ersPhan11"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It also sounds like if you call/ message your friends and let them know you've seen through her crap, apologize for anything you might have done or said to them because of her... you might be pleasantly surprised how many come back.",
                                                            "score": 24,
                                                            "author": "FlutteringFae"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Sadly, gaslighting narcissists present the most perfect face to the public, and twist the truth in ways that you can't dispute the facts, even though it's completely out of context and not near what actually happened. A skilled attorney and a strategy is needed rather than trusting that justice would clearly be served.",
                                    "score": 26,
                                    "author": "Current_Many7557"
                                },
                                {
                                    "level": 3,
                                    "comment": "Just make sure you record the the abuse somehow so it can be used as evidence to support you if you want custody of the kids.",
                                    "score": 5,
                                    "author": "SafariNZ",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My husband has a son with an asshole of a human.  It's a catch 22. But,  I guarantee if you stay,  you will not change the outcome for your kids while simultaneously destroying yourself.",
                            "score": 58,
                            "author": "Significant-Mousse71",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This! My husband stayed for ten years \"for the kids\" but destroyed himself in the process.\n\nBe smart about how you approach it. Verbal and mental abuse is hard to prove and the court system as a whole still leans towards mother knows best regardless of how old the kids are.",
                                    "score": 23,
                                    "author": "Department-Hungry",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also they don’t realize that it destroys the kids more too actually. It’s better theyre not around a bad toxic abusive person  as a parent and/or two ppl always fighting and engaged in conflict rather than a peaceful home w one parent",
                                            "score": 17,
                                            "author": "Chu1223"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 30,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Gather evidence. Anything that can be used in court is good. Documents, recordings. Anything that can give you a edge in court.",
                            "score": 7,
                            "author": "Nixter295"
                        },
                        {
                            "level": 2,
                            "comment": "With evidence you can make sure your kids are not subjected to her abuse. Work with the lawyer to gather what you need before pulling the trigger.",
                            "score": 7,
                            "author": "properlypetrified"
                        },
                        {
                            "level": 2,
                            "comment": "Even if she's cut you off from them, your friends/family will still support you if you reach out. They probably know exactly the type of woman she is. She wants you to think you have no support but that isn't the case. Your family will always have your back (assuming you were close before). Do what's best for yourself and your kids and get out. Write down anytime she's abusive to you or the kids so you'll have a record for court. Wish you all the best and stay safe brother.",
                            "score": 15,
                            "author": "neslo024"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been exactly where you are, and I stayed for longer than I should thinking it was better for the kids.  One night I was out of town on business and got a call from my 12 year old daughter at 3am, terrified and crying uncontrollably because she didn't know where her mom was.  My (now ex) wife left our 9 and 12 year old daughters home alone and went out drinking (and other things) with her friends while I was 9 hours away.  We had a very blunt conversation when I got back to town, in which I told her she would have to leave and couldn't take the girls.  She left 4 days later, we divorced and I got full custody.\n\nLife is too short my friend, you deserve better.  7 years later I remarried a wonderful woman that constantly amazes me with her kindness and understanding.",
            "score": 116,
            "author": "zantilley",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Contact you local domestic violence group. They can help you to document things and maybe help you with safety as well. I know several men who have used this service it is not only for women. They are sometimes  good to have your back in court as well.",
            "score": 102,
            "author": "russelch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay this...ive considered doing this many times but feel like id get shit on for being a man. I will 100% be doing this. Its nice to hear it has worked for other men. Thank you",
                    "score": 76,
                    "author": "unholy_mountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just let them know how uncomfortable it is for you to even be there. We are all mostly volunteers so if you don’t feel confident you can dm me and perhaps I can help. You may have to file a report with the police not sure where you are but we have been scammed by so many people we have guide lines now.",
                            "score": 27,
                            "author": "russelch"
                        },
                        {
                            "level": 2,
                            "comment": "but feel like I'd get shit on for being man\n\nI understand this, but please don't let it stop you from getting help to get out. It's the only way you can stand up to her abuse, and it may help you get full custody.",
                            "score": 10,
                            "author": "bowie-of-stars"
                        },
                        {
                            "level": 2,
                            "comment": "No actual mature, grown up human will ever shit on you for seeking help to manage abuse.  It’s wrong when *any* human abuses another, and if anyone gives you guff over your experiences, tell them not to negate or invalidate what you are going through - abuse is abuse.  \n\nUse all the resources you can get your hands on.",
                            "score": 7,
                            "author": "gussmith12"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I suggest that you fart in your hand and wave it in her face",
            "score": 2063,
            "author": "R_Banana",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a strong contender for my response to her",
                    "score": 1104,
                    "author": "unholy_mountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like you're gonna have fallout from having your brother visit either way. May as well enjoy yourself and make it as worthwhile as possible.",
                            "score": 216,
                            "author": "ChoadyWalker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely. Go get drunk and enjoy your brother.",
                                    "score": 15,
                                    "author": "whelp32",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well please post an update if you do",
                            "score": 50,
                            "author": "R_Banana"
                        },
                        {
                            "level": 2,
                            "comment": "My ex wife was like this. Constantly walking on egg shells, never knew what would set her off. I'm not placing complete blame on her, but I became a junkie to cope with her. Thankfully I left and got clean, but the constant anxiety and resentment eat you alive. I'm sorry you have to go through this, and having kids makes it even harder.",
                            "score": 30,
                            "author": "unholymole1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m proud of you. You matter, &amp; I just wanted to remind you that all of your effort is worth it. Sending calm peaceful vibes friend. 🙏🏻",
                                    "score": 8,
                                    "author": "kc_2525",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks, I appreciate it. Life's good now, my worst day clean is 1000 times better than my best day high.",
                                            "score": 5,
                                            "author": "unholymole1"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'd have to agree.  Please keep us updated.",
                            "score": 7,
                            "author": "messy_fart"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nah bro, this is one of those exceptionally cases when you fart on her balls",
                    "score": 13,
                    "author": "sdcmax",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Nope, fart under the covers ans then turn the lights on",
                    "score": 9,
                    "author": "bigboyssmalltoys"
                },
                {
                    "level": 1,
                    "comment": "I would just go all in and fart bare assed on her pillow",
                    "score": 20,
                    "author": "No_Air_1857",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's how you get pink eye!\n\nEdit: notwithstanding the ethical considerations of wishing pink eye on people, I'm just quoting *Knocked Up.*",
                            "score": 8,
                            "author": "Uncoolx2",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "👏",
                    "score": 5,
                    "author": "Kingicez"
                },
                {
                    "level": 1,
                    "comment": "I was not expecting this at all. A surprise to be sure, but a welcome one.",
                    "score": 4,
                    "author": "BambooBrady"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bruh, get out",
            "score": 500,
            "author": "ancientheathen",
            "replies": [
                {
                    "level": 1,
                    "comment": "This time, I will NOT take op’s wife.",
                    "score": 78,
                    "author": "Mono_831",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Make a plan with your brother to leave. I think you may have a strong argument for parental alienation from what you’ve said so you have a good shot at preserving access to the kids.",
            "score": 458,
            "author": "cbp26",
            "replies": [
                {
                    "level": 1,
                    "comment": "You! should start recording her verbal and /or physical abuse of you and your children if she abuses them.\n\nDownload a voice recorder app on your phone or get a mini tape recorder with plenty of tapes. Get used to carrying either / or both devices.\n\nIf you use tapes, get into the habit of taking the recorded tape to work to hide it. If you don't go to a workplace, obtain a security box at the closest bank and put them there. \n\nThe most important thing is PRACTICE turning on the app or recorder without being seen. Use a mirror to see yourself while practicing. \n\nIf you can't manage to be sneaky about using, say your phone, get the tape recorder  (they aren't expensive and can be bought at a stationary store or CVS, Walgreens, Walmart  or other drug store).\n\nYou can always start the recorder and leave it on pause. Get used to wearing pants or shorts with pockets. \n\nGood luck to you and your family.\n\nPlease start taping or recording SECRET videos ASAP. You will need the evidence during a divorce or custody hearing or both.",
                    "score": 154,
                    "author": "Muted_Caterpillar13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 82,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are correct.  Google it for either your state or country. \n\nDo it anyway. You can check with your lawyer afterward.",
                                    "score": 52,
                                    "author": "Muted_Caterpillar13",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah best advice I've seen for recording the abuse",
                                            "score": 14,
                                            "author": "LezBeeHonest"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is all excellent advice OP. Do as this man or woman says. Put cameras up as a guise to combat the “package thieves you’ve been hearing about”. Set them inside the house pointing out windows (so they don’t get “stolen” being outside of the house). Make sure you get ones that record good audio",
                                            "score": 6,
                                            "author": "YasMysteries"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Do it anyway.",
                                    "score": 44,
                                    "author": "TrueDivision",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re not stuck. What you need to do is collect evidence of her behavior (secret audio recordings, texts, video if you can.) and you file for divorce and use the evidence to free yourself from her. Play along for as long as it takes to get this evidence because she will make you out to be the abuser if you just try to walk away now.\n\nEdit: obligatory “Not A Lawyer” disclaimer for the upset randos.",
            "score": 152,
            "author": "PeteyPorkchops",
            "replies": [
                {
                    "level": 1,
                    "comment": "Make sure you’re not in a two party consent state for recording though\n\nBut yes this is what I did when I was being abused by my ex gf",
                    "score": 36,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Leave at your original time anyway to meet your brother. Sounds like you’re going to hear about it tomorrow anyway so go do what you want.  Wifey sounds insecure so tell her meeting your brother doesn’t diminish your love for her but her behavior certainly does and that’s gotta change or you’re going to start making additional decisions she won’t like.",
            "score": 227,
            "author": "nannymo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea exactly. Do what you want with your brother you haven’t seen in 2 years. Doesn’t matter how she reacts if you’re divorcing her.",
                    "score": 47,
                    "author": "FerociousPancake",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go out and enjoy your time with your bro! even if you came back \"on time\" you're still going to have some shit so kickit.",
            "score": 23,
            "author": "MRCLOTMAN"
        },
        {
            "level": 0,
            "comment": "Exit, stage right",
            "score": 22,
            "author": "tanstaaflisafact",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol, thank you this made me smile",
                    "score": 14,
                    "author": "unholy_mountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Glad to help, I'm going throughout it too. Plan and have an exit strategy before you tell her.",
                            "score": 7,
                            "author": "tanstaaflisafact",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why are you married to this toxic woman still. GTFO quickly",
            "score": 159,
            "author": "forthefofitall",
            "replies": [
                {
                    "level": 1,
                    "comment": "I, for once, *really* hope this one is fake. Because it it’s real and OP has actually been living like this for however long… hoooo boy…",
                    "score": 56,
                    "author": "daitenshe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately people will stay in a marriage even if it is bad. It beaten into us that you have to be in a relationship to be considered normal by society. Just like the you've been dating for 2 years when are you getting married. Another stupid rule of society. People just want to be viewed as normal even if they are miserable.",
                            "score": 26,
                            "author": "forthefofitall",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sir you are being isolated which is a clear sign of abuse. If you can ask your brother for help even if that means taking him taking you back with him.",
            "score": 19,
            "author": "jadethefirefox"
        },
        {
            "level": 0,
            "comment": "Please stay safe. Men get abused and manipulated too. Maybe try telling your brother about it and ask for advice and support.",
            "score": 16,
            "author": "s_tangerine",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dude, why the fuck are you still with her? Sounds like you need to go have fun with your brother and see if he can help you find a good divorce lawyer.\n\nFtr, I’m not usually one to tell people how they should handle their marriage, but it doesn’t sound like there’s anything there to salvage. I imagine kids must make things infinitely more complicated, but damn.",
            "score": 73,
            "author": "griffusu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good advice, and yes, I love my kids so much. It would crush me to not see them everyday.",
                    "score": 52,
                    "author": "unholy_mountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My parents got a divorce when I was 2, and I was still able to have a perfectly fine relationship with both of them. Yes, I missed out on some stuff that I wish I had, but being raised in a home with two people who hate each other would’ve been so much worse. Best of luck to you brother.",
                            "score": 56,
                            "author": "griffusu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you, this is the kind of insight I need to hear in order to take some next steps.",
                                    "score": 40,
                                    "author": "unholy_mountain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Op, start keeping notes of everything abusive she does, ie texts etc, even if it means making a daily journal. It's time to start an FU binder to help prepare for the inevitable divorce and custody battle. Good luck!!",
                                            "score": 7,
                                            "author": "SnooOranges3690"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Take screens shot of abusive text messages and make a secret yahoo or Gmail account that you log in via incognito browser and email them to that same account from that account (if that makes sense). Just in case she checks your phone. Also email any recordings of abuse to yourself on that email.",
                            "score": 7,
                            "author": "dorydorydorydory"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s not easy ,but please leave and take your babies with you if they aren’t already being abused they will be just for sharing your DNA and she will hold that against them/ resent them or use them as a tool to manipulate you into coming home….start recording her save any berating/abusive comments she texts you also.",
            "score": 15,
            "author": "Unlikely-Body-1061",
            "replies": [
                {
                    "level": 1,
                    "comment": "If she treats him that way she’s definitely fucking up those kids",
                    "score": 8,
                    "author": "FerociousPancake"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does she treat you like that in front of the kids?",
            "score": 14,
            "author": "shesavillain",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, and she emotionally abuses my oldest when i don't comply with her demands. When that fails, she trashes my office or tries to get me fired from my 6 figure job. Its crazy to me, she is a stay at home mom and tries to destroy us financially out of spite.\n\n\nFuck, this is better than therapy y'all, just saying this outloud to reddit strangers is giving me some confidence to take some legal steps to put an end to this.",
                    "score": 77,
                    "author": "unholy_mountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She abuses your children.  Say it again and let it sink in. SHE ABUSES YOUR CHILDREN.",
                            "score": 21,
                            "author": "spankthegoodgirl"
                        },
                        {
                            "level": 2,
                            "comment": "I really hope you do. And I hope you give us an update!",
                            "score": 11,
                            "author": "sophia1185"
                        },
                        {
                            "level": 2,
                            "comment": "She treats you like this and YOURE THE ONE WHO PAYS IT ALL? Nah bro leave her on the streets. Take your kids",
                            "score": 11,
                            "author": "rammyblacc"
                        },
                        {
                            "level": 2,
                            "comment": "Dude leave her ass.. You literally just said she relies on you for money, abuses your children, manipulates you, and destroys your property. How many more neon red flags do you need to see? If you don’t do if for you at least do it for your children, you’re literally enabling her to fuck their whole childhood up.",
                            "score": 5,
                            "author": "PaxTheHunter"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude FUCK THAT. Do what you want, you should stay at as late as you want with your brother, stay out until the sun comes up if you want to! Family is important. You have to cherish the time you have with him",
            "score": 13,
            "author": "Lord_Nord_2727",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dude! The fucked up thing is, my wifes brother literally died unexpectedly less than a month ago. She has accused me of using HER brothers death as a means to manipulate her into \"letting\" me see my brother. Thats the level of insanity Im trying to \"reason\" with.",
                    "score": 45,
                    "author": "unholy_mountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Uh, isn't that gaslighting? That isn't your fault. \nVirtual hug incoming!",
                            "score": 10,
                            "author": "D_i_a",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "There are no words for that kind of insanity. Was she always like this, or did it creep up on you? How long have you been with this person, they sound like an absolute nightmare",
                            "score": 8,
                            "author": "bowie-of-stars"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ugh. She is toxic. I want you to run, not walk, from her. But on the other hand, you have two innocent kids who need you, and who you will miss terribly (as I miss mine).  Sending love your way since I don’t know enough to give you clearer advice.",
            "score": 13,
            "author": "LiveWire_74",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the support. Honestly, this post kinda defines my relationship. Working with a therapist (and soon a lawyer) to find a means to an end. 💎👐",
                    "score": 16,
                    "author": "unholy_mountain",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why did you marry her?",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly? Didn't see it coming. We did rush a bit into things but I think i was the victim of love-bombing/a bpd person. At the end of the day it was still my decision and yea, there is regret there BUT I cant regret it fully, as it did result in my two beautiful children.",
                    "score": 38,
                    "author": "unholy_mountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was love bombed by a covert narc. When the masks drops, it’s brutal. Life is so much better after the divorce.",
                            "score": 11,
                            "author": "OutlandishnessIcy229",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I really hope you can protect your children from being victim to and witnessing her manipulation.  Document everything they are subject to in regards to her behavior - the date and what was said in front of/to your children and give it to your lawyer.",
                            "score": 5,
                            "author": "awolfsvalentine"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tell her that the flight is delayed by 30 mins and if she is insane about it , tell her!",
            "score": 9,
            "author": "Jiujitsuandchips"
        },
        {
            "level": 0,
            "comment": "Oh wow a situation I can relate to 100% with the mother of my kids.  Fuck.  That.  You’re allowing her to do this.  Record everything.  I mean.  Everything.  She says stuff?  Write it down.  She texts you?  Save it, screenshot it, send it to someone for safe keeping.  She especially says or does anything to your kids?  Report it.\n\nYou cannot, allow her, to have this power over you.  Because she will abuse that power like she abuses you.  She will take advantage of it, alienate you, say thjngs to dig at you in hopes to get a rise out of you.\n\nDo you want to know what will grind her?  What will cause HER to snap?  Smile at anything she says, and say “Yes dear.  Whatever you say, dear.  Of course dear, whatever you believe dear.”  Don’t say anythjng else.  She wants to be manipulative?  Pull it on her with kindness and watch, her, unravel.  Keep recording everything and you will absolutely win anything she attempts legally.  Would you like any ideas of what she will tell everybody?  How you’re abusive?  How you are angry?  How you don’t deserve your kids?  Because she absolutely will do this.  And the courts absolutely will believe her.  Because she is REALLY good at telling lies.  And she can turn a grain of sand of truth, into a mountain of a lie, but she says so in such a way you cannot help but believe her.  So nip that shit and kill her with kindness.  And watch her implode upon herself.",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "She is mentally ill and her unaddressed illness is causing you and likely your children a lot of pain and suffering. If you have a desire to try to help her and possibly work on things for your kids sake and you've never been honest or upfront about her behavior and how it affects you then I would start there.\n\nThen if she is unwilling to accept and address (get professional help) the truth of the elephant in the room, then I would let her know this is a condition that is unacceptable to you and grounds for divorce.\n\nCalm down, breathe, take it one step at a time.\nDon't go have drinks with your brother tonight and go home and ambush her with a divorce.\nThis situation didn't come about overnight.",
            "score": 8,
            "author": "flyingforsythia"
        },
        {
            "level": 0,
            "comment": "After reading your story and looking at your profile… you need to run bro.\n\n**YOU NEED TO RUN BRO**\n**RUUUUUUUUUUUUUUUUUUUUUUUUUUUUN**",
            "score": 19,
            "author": "Captain_Dva"
        },
        {
            "level": 0,
            "comment": "You need to do some serious thinking.",
            "score": 9,
            "author": "Zealousideal-Lie7255"
        },
        {
            "level": 0,
            "comment": "You need a divorce",
            "score": 7,
            "author": "geechee1"
        },
        {
            "level": 0,
            "comment": "Nah your wife belongs to streets, get rid of her.",
            "score": 6,
            "author": "Lotusbrush",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My wife hates me and treats me this way too",
            "score": 7,
            "author": "Lowiqpoopforbrains",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There is no shame in admitting that you are a man in an abusive relationship. \n\nIf anyone mocks you, ever, for this situation then they are a terrible person. \n\nTake care of yourself.",
            "score": 7,
            "author": "KnowMatter"
        },
        {
            "level": 0,
            "comment": "Jesus man.\n\nLet me come tell her you’re leaving for you.",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "All the unsympathetic \"grow some balls\" and \"man up\" posts here are a clear indication of how men, who are victims of DV, are treated.  Then people wonder why the men don't report it more...",
            "score": 7,
            "author": "eldred2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "love yourself, dump that bitch",
            "score": 7,
            "author": "Cronosovieticus"
        },
        {
            "level": 0,
            "comment": "I lived like that. Then my little brother married the devil in the flesh. I can’t even tell all of the evil things she did. She was beautiful and manipulative. She had 2 guys beat him till he was pissing blood. He died from a lung issue and our whole family although miss him, are glad he didn’t have to suffer. Once my manipulative wife was listing all of the things he was putting up with and she described me. The next day I told her. “You need to move out” and I repeated what she said. She said “I meant her” I said “I don’t care” and she said “Oh, you think it’s gonna be all roses for you and the kids?” I said as long as you’re gone, we’ll take our chances. Divorced 90 days later. I didn’t know who I was. I’m alright being me, her life support, bank, wallet, sounding board. \n\nAt the end of your life, you’ll be embarrassed you never got to know you.",
            "score": 7,
            "author": "coastalbachelor"
        },
        {
            "level": 0,
            "comment": "Please tell your brother and I hope he does [this](https://youtu.be/7nqcgUDoV_M) for you. I think you need it.",
            "score": 17,
            "author": "Dabeano15o",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ha! He has and does and thank you lol",
                    "score": 9,
                    "author": "unholy_mountain",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "F that. Why deal with that? Seriously, the sex can't be that good. Life does not need to be that hard bud!!!",
            "score": 21,
            "author": "Effective-Action5706",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sex? Whats that lol",
                    "score": 56,
                    "author": "unholy_mountain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My condolences sir! You deserve better! Just sayin!",
                            "score": 12,
                            "author": "Effective-Action5706",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The invisibility of men who are abused by women is astonishing. \n\nYou need to get your papers in order and run with the kids",
            "score": 7,
            "author": "beardedkingface"
        },
        {
            "level": 0,
            "comment": "Sounds like my wife, who has emotional disturbances in her past that cause her to have traits like these. This person needs therapy",
            "score": 5,
            "author": "_why_do_U_ask"
        },
        {
            "level": 0,
            "comment": "As a spousal abuse victim, I’m so sorry you’re having to go through this..\nPlease do anything you can to gather funds and try to find both a lawyer and an escape route as soon as possible. \nIf she’s abusing you this badly now, the future is going to hold horrendous things for both you and your children :( \nI’m rooting for you, my friend ❤️",
            "score": 6,
            "author": "justshiddedlmao"
        },
        {
            "level": 0,
            "comment": "Hey, we didn't get an update. Are you ok?",
            "score": 5,
            "author": "Fluid_clusterduck"
        },
        {
            "level": 0,
            "comment": "The fact you recognize this isn’t normal is amazing. My dad is so blind and has been abused like this for most of his life by my mom. We think if it is not an obvious punch to the face that it might not be abuse. I’d rather get punched in the face then go through the shit these people put others through.",
            "score": 5,
            "author": "ALonerInTheDark"
        },
        {
            "level": 0,
            "comment": "Best defense is a strong offense. I’d go right at it. Tell her “yeah his plane is late. So fucking what. If you can’t handle it, go to a motel &amp; fuck off!”",
            "score": 3,
            "author": "Steddie-Eddie",
            "replies": []
        },
        {
            "level": 0,
            "comment": "you are an abused spouse. you need out.",
            "score": 4,
            "author": "PrettyCoolBear"
        },
        {
            "level": 0,
            "comment": "Have a long, serious talk with your brother and tell him you need help to get out. Maybe he can help you devise a plan. Don't be too proud to ask for help and get out of this horrible situation.",
            "score": 5,
            "author": "dirtysyncs"
        },
        {
            "level": 0,
            "comment": "Serve this evil wench some papers. And have great time with your bro. You will need your family.",
            "score": 4,
            "author": "corrygan"
        },
        {
            "level": 0,
            "comment": "Leave! Parenting is team work and should be shared.\nMy fiancé had to work nights for his job for an entire week. That meant I was dropping the kids off at daycare, picking them up, cooking dinner and doing the bedtime routine by myself. \nI was absolutely exhausted yes but I couldn’t imagine blaming and getting upset with my fiancé over it. \nAlso we need breaks as parents and space so seeing your brother is the perfect opportunity for that, she should be supporting that. \nDefinitely controlling and is absolutely isolating you to make it easier to control you. \nEither couples counselling or divorce is in the foreseeable future for you.",
            "score": 3,
            "author": "BlackDawn93"
        },
        {
            "level": 0,
            "comment": "Fuck her. Go have fun and drink and eat until everything shuts down then deal with her. Sometimes you just have to say fuck it. What's she going to do divorce you. You're better off.",
            "score": 4,
            "author": "pirate8210"
        },
        {
            "level": 0,
            "comment": "Is this a troll post?",
            "score": 4,
            "author": "Cookiedoughjunkie"
        },
        {
            "level": 0,
            "comment": "She's a psycho",
            "score": 3,
            "author": "KazzaNamso"
        },
        {
            "level": 0,
            "comment": "Looking at your post history, you need to get out. It looks like you’ve already spoken to an attorney, you might want to follow up. I know it’s hard and things can be particularly tricky for men, but I suggest you start making moves towards leaving. This sounds so bad.:(",
            "score": 4,
            "author": "Dollhouse2005"
        },
        {
            "level": 0,
            "comment": "I'm with a narcist and it sounds like she maybe one also the man I'm with is abusive in every way possible and I feel like it's impossible to leave so I get the feeling stuck thing....seeing your brother is important by now you should know That she is going to punish you for it in some type way whether it be guilt tripping the silent treatment or maybe some other way regardless if you were on time or not...don't let her make you feel bad when she starts her shit don't argue don't try to explain your feelings people like her don't care just Grey rock the situation and say okay and then just pull yourself out of the situation mentally and realize she's just childish evil person and that she's trying to punish you  grown man like a child how stupid that in itself is something you can find humor in like who does that besides a basket case she's  pathetic and BTW I put 2 kids to bed by myself every night after working 10 hrs a day she is fine",
            "score": 5,
            "author": "Own_Captain_3062",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If your wife is that abusive leave. I know it’s not easy but, it would be in you and your children’s best interest to find a safe place",
            "score": 3,
            "author": "chtocc"
        }
    ]
}