{
    "id": "11agu1a",
    "score": 4,
    "title": "ADHD Evaluation/diagnoses on campus?",
    "author": "throwaway4stacysdad",
    "date": 1677207939.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/11agu1a",
    "media_urls": [],
    "other_urls": [],
    "postText": "title, looking for resources after recommendations to be evaluated. many thanks :)",
    "comments": [
        {
            "level": 0,
            "comment": "Campus doesn’t do evals for that but you can make an appointment through psych services to get a list of folks in town who do it, and see what your options are. Typically they also have a tough time w schedule 1 drugs like adderall but there’s other meds like strattera that they will fill prescriptions for. But they won’t write the prescription. Again, that’s an in town thing. Good luck!",
            "score": 8,
            "author": "margemead"
        },
        {
            "level": 0,
            "comment": "I looked into this about 3 years ago (still haven't done anything, whoops) but there is (was?) an on campus diagnosis program but it's like $300-400 (idr). There's also a guy in Endicott area, dr Mostera (or something close to that) as well as somewhere in vestal, 4 corners something. I think it's on main street in vestal??? I never ended up going oops. \n\nMostera has a self-quiz thing that I have filled out several times in the past couple years-- it's funny (sad) seing my answers get progressively worse 🙃",
            "score": 2,
            "author": "FunInTheShade"
        },
        {
            "level": 0,
            "comment": "You should contact the SSD office \n\nhttps://www.binghamton.edu/ssd/index.html",
            "score": 2,
            "author": "Emotional_Neck_8230"
        },
        {
            "level": 0,
            "comment": "Look at providers that work with your insurance, if you have any.",
            "score": 1,
            "author": "db678153"
        }
    ]
}