{
    "id": "11pmea1",
    "score": 5,
    "title": "Binghamton accounting (SOM)",
    "author": "Classic_Dinner1041",
    "date": 1678647079.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/11pmea1",
    "media_urls": [],
    "other_urls": [],
    "postText": "In terms of the accounting program, is Binghamton good compared to CUNY Baruch? I am deciding where to go for accounting. Is it worth it to go to Bing for accounting?",
    "comments": [
        {
            "level": 0,
            "comment": "SOM was ranked in the top 10 public business programs in the country this year.  It is an extraordinarily strong program with excellent graduation outcomes. More than 75% of SOM students have a post-graduation job lined up going into their senior year.",
            "score": 6,
            "author": "imstartingtohatesoup"
        },
        {
            "level": 0,
            "comment": "Som accounting is one of the best programs at bing. Solid job opportunities I would highly recommended it. Baruch is a solid choice as well but there is one downside in that I think you have to jump through some prereq hoops before they let you officially declare an accounting major. In binghamton you won't have to deal with that. Bing is also a smaller program which I think is a plus.",
            "score": 3,
            "author": "quincepapaya"
        },
        {
            "level": 0,
            "comment": "Im pretty sure the education youll get will be about the same at either school. You should think more about other factors like cost, location, dorming vs living at home, etc. I personally decided to go to a suny instead of a cuny because I wanted more of a college experience cause there isnt as much socializing at cunys imo. however I am now unsure if I made a wise decision cause of the cost difference\n\ngood luck!",
            "score": 2,
            "author": "holdmynugget",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly don’t want to commute. I don’t know if I would regret going to bing instead of baruch, or the other way around.",
                            "score": 1,
                            "author": "Classic_Dinner1041"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do you think it’ll be harder to land a job if I were to go to Bing?",
                    "score": 1,
                    "author": "Classic_Dinner1041",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "no itll be the same",
                            "score": 2,
                            "author": "holdmynugget"
                        },
                        {
                            "level": 2,
                            "comment": "The question is, what environment is right for your education. What do you need to be successful? I had to leave my hometown because there were too many people not doing anything with their lives, and very willing to pull me towards their shenanigans. Some people prefer to stay at home to be close to family. Going to SUNY or CUNY, you aren't breaking the bank like a private, so go where you think you will do the best academically and everything will work out. And if it doesn't work out, transfer.",
                            "score": 1,
                            "author": "karlkarlofson"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you get into SOM\n\nYou go to SOM",
            "score": 2,
            "author": "Own-Ad-1042"
        },
        {
            "level": 0,
            "comment": "SOM accounting pipeline to big 4 is strong, if that’s what u want to do Im sure Binghamton will do a lot more for you",
            "score": 1,
            "author": "persiansb777"
        }
    ]
}