{
    "id": "11y4cfe",
    "score": 10,
    "title": "Is there any way to get the Binghamton Fund to stop calling me?",
    "author": "turbulentmelon",
    "date": 1679453240.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/11y4cfe",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've blocked their numbers three or four times now, they called me again at almost 9pm tonight when I was in class, and they keep calling despite the fact I told them I'm not interested and don't have money to give away (I'm also still a student so it's honestly ridiculous that they're asking me for donations). It's incredibly annoying and I hope there's a \"Do Not Call\" list or something I could get on.",
    "comments": [
        {
            "level": 0,
            "comment": "One time I broke down in tears and told them that everything has been going downhill for me since college and they took me off the call list. Maybe try that‽",
            "score": 21,
            "author": "Yaboyhamz",
            "replies": [
                {
                    "level": 1,
                    "comment": ":(",
                    "score": 3,
                    "author": "kanekiix"
                }
            ]
        },
        {
            "level": 0,
            "comment": "yall dont google numbers you dont recognize and just let it ring?",
            "score": 7,
            "author": "BrianLkeABaws"
        },
        {
            "level": 0,
            "comment": "i used to work for them and if you tell them wrong number or something they’ll remove it. also be nice to them please it’s a bunch of undergrads working in the library basement for minimum wage and they don’t have a choice in what to say. we had to ask everyone for money no matter what or we get in trouble. usually our boss was listening to our phone calls. easily the worst job i’ve ever had; but money is money yk",
            "score": 32,
            "author": "ezk17",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also worked here and yes all you have to do is ask to be taken off the call list. There’s no reason to make mean or snarky comments to the students who are just doing their job to afford living expenses. It’s a really hard job and the mild annoyance of an unwanted phone call doesn’t give anyone the license to be rude to anyone.",
                    "score": 8,
                    "author": "Altruistic_Spring883",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I never said I was mean or snarky to people, I don't know why people are making that assumption about me. I just don't think the Foundation should require their employees to contact current students for donations. I'm not mad at the employees, I'm mad at who the Foundation puts on their call list.",
                            "score": 7,
                            "author": "turbulentmelon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "idk maybe the telemarketers are just upset you dont want to spend quality time with them anymore like you used to 😢 perhaps the telemarketers care for you more than you know",
                                    "score": 2,
                                    "author": "bing2026"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tell them you just got a new number so sorry but you don’t know who x is",
            "score": 4,
            "author": "brandtS"
        },
        {
            "level": 0,
            "comment": "Nope. ‘00 grad here and they continue to call 23 years later!",
            "score": 6,
            "author": "roblo3z",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same, def asked to be taken off the list many times over the past couple decades. They probably think/hope we’re rich by now. Every time I see a 777 number I “Nope” it away. \n\nI’ve gotta try the “sorry wrong number” next time.",
                    "score": 2,
                    "author": "surelyfunke20"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Genuine question, have you told them please don’t call me when they call you? Or ask them to remove you from the list? Worked for me….",
            "score": 3,
            "author": "biggy_P",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, been telling them for a while now",
                    "score": 2,
                    "author": "turbulentmelon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When they called me my senior year and asked me to make a donation I told them they could consider my current tuition payments my donation and that was all they were going to get and to never call me again. If you specifically say “do not call” they are required to take you off their list. If they don’t comply they can be forced to pay fines.",
                            "score": 2,
                            "author": "energeticallypresent"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's a [Do Not Call](https://www.donotcall.gov/faq.html) registry, but sadly it covers sales calls not charities.  Personally, I don't answer any call if I don't recognize the number.  If it's legit University business, they'll leave a message.",
            "score": 1,
            "author": "badwhiskey63"
        }
    ]
}