{
    "id": "128npkn",
    "score": 17,
    "title": "haven’t heard back yet :(",
    "author": "mulattoo",
    "date": 1680358600.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/128npkn",
    "media_urls": [],
    "other_urls": [],
    "postText": "i applied in early december and finished sending in all of my materials by late december. i still haven’t heard back and i’m super nervous is this a good or bad thing\n\nEdit: i got in for the fall semester!! yay!! thank you to those who gave advice/shared info! :)",
    "comments": [
        {
            "level": 0,
            "comment": "Decisions are still coming out. I just got mine late afternoon yesterday. Wasn't surprised to see i was rejected tho. \n\nI was also a transfer, application sent 2 weeks ago.",
            "score": 6,
            "author": "Student0010",
            "replies": [
                {
                    "level": 1,
                    "comment": "omg i’m also a transfer and cs major!! shitting myself bc cs is really competitive at bing (or so i’ve heard). good luck with your college search! :)",
                    "score": 3,
                    "author": "mulattoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It really is. I already didnt meet the requirements with a gpa of 3.0 and not having calculus done. \n\nBut i thought my participation in unibuddy (which was pretty well hidden), attendance of transfer tuesday, private meeting with a counselor, along with providing additional information about me would have helped. Guess not.",
                            "score": 1,
                            "author": "Student0010",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Popping in as a unibuddy, the university really doesn’t care if you participate in that, and they have no communication with unibuddys to see if you did participate. GPA is by far the most important thing. Good luck in your future endeavors",
                                    "score": 3,
                                    "author": "feartiime",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah it definitely is. I sent them my resume and portfolio too 😭  In hindsight it might have been a negative since both are more professional than student\n\n\nThank you",
                                            "score": 1,
                                            "author": "Student0010"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is it harpur you should be good",
                            "score": 1,
                            "author": "Vigilance1213"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To be a potential candidate you HAVE to have the gpa requirement everything else just helps strengthen",
                    "score": 1,
                    "author": "SML_BlackYoshi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i think u are very likely to be a spring admit if you haven’t heard back",
            "score": 2,
            "author": "TrashSensitive694",
            "replies": [
                {
                    "level": 1,
                    "comment": "really oh no!!! my major doesn’t even allow spring transfers:( is it possible to get accepted into the university but not your major?",
                    "score": 1,
                    "author": "mulattoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I heard back on the 4th and was accepted for the fall, also a cs major",
                            "score": 2,
                            "author": "Extreme-Principle559",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "me too!!! :D congratulations!!",
                                    "score": 1,
                                    "author": "mulattoo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "yes into harpur",
                            "score": 1,
                            "author": "YeetParadox"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Transfers are on a rolling admission basis, so you will not have the same April 1st deadline to hear back as the incoming first years.",
            "score": 2,
            "author": "imstartingtohatesoup"
        },
        {
            "level": 0,
            "comment": "Does anyone know what the chances are I get in through the waitlist?",
            "score": 2,
            "author": "chefdanny1"
        },
        {
            "level": 0,
            "comment": "I recommend you checking the status page.Also check your spam",
            "score": 2,
            "author": "Important_Goal_9951"
        },
        {
            "level": 0,
            "comment": "Same, applied in November, and I heard yesterday.   I noticed two weeks ago they updated the status page with a firm date that I would hear by April 1, and I did.  Check your status page if they gave you a date yet.  \n\nI was accepted conditionally via the BAP program, where you live in Binghamton dorms, but take classes at Broome college and they let you transfer after a year if you have a 3.0 or better.  I had a 94 average in NYC public schools, so maybe they hated I didn’t submit my SATs?\n\nBAP seems ok if you are really set on Binghamton.   For me,Binghamton doesn’t offer an architecture degree outside of their art history department, so I always preferred the BS Architecture offerred by University of Buffalo, who accepted me in December, so only accepting me into the BAP program was the deciding action that made it certain I wouldn’t go to Binghamton.  \n\nGood Luck.",
            "score": 1,
            "author": "ElectronicDiscoHouse",
            "replies": [
                {
                    "level": 1,
                    "comment": "they didn’t give me a date as far as i can tell, it seems like everyone got their decision yesterday which is making me extra nervous! congrats on getting into buffalo!! :)",
                    "score": 2,
                    "author": "mulattoo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m actually not sure, then again decisions are rolling so have faith, manifesting that you get in!",
            "score": 1,
            "author": "TrashSensitive694",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you so much!!",
                    "score": 1,
                    "author": "mulattoo"
                }
            ]
        }
    ]
}