{
    "id": "12byfm3",
    "score": 1,
    "title": "SOM EY Honors Program",
    "author": "LukeTCan",
    "date": 1680646107.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/12byfm3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am an incoming first year student at Bing and I was just offered a spot in the EY program. Does anyone have any personal experience within the program and how did you like it? Is it a prestigious program or is it offered to most SOM students? Please let me know if you can, thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "Your incoming class is the 2nd one into the program so it’s very prestigious and only offered to the top 10% of incoming freshman. I’ve really liked the program so far! It lets you network and meet professionals really easily as well as expose you to new careers. If you are already thinking of committing to bing, it can only help you!",
            "score": 1,
            "author": "lotsofgems",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your response, the EY program is definitely pushing me towards committing to Bing. How does it compare the the pwc program? Is one better than the other or are they just different in their own respective ways?",
                    "score": 1,
                    "author": "LukeTCan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d say they are different in their own respective ways. EY is more tech focused than pwc. EY is also smaller and newer- so you have more of chance to really shape what u want to get out of the program. I’m on the EY e-board so if u need more clarification pm me :)",
                            "score": 1,
                            "author": "lotsofgems",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok thank you",
                                    "score": 1,
                                    "author": "LukeTCan"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}