{
    "id": "12dvcbi",
    "score": 7,
    "title": "Spanish tutor",
    "author": "Crazy_Cake5756",
    "date": 1680809835.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/12dvcbi",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi there,\nTownie and Binghamton alum here wondering if any Spanish speaking students are staying in Binghamton over the summer and looking for a very easy gig.\n\nMy 3 year old (almost 4) has expressed that she would like to learn Spanish. I'm looking for someone who would come to teach her through play, an hour or two a week. Potential for some extra money through babysitting if she likes you.",
    "comments": [
        {
            "level": 0,
            "comment": "While waiting for summer you should show her señor wooly, it’s very fun way to learn some basic spanish.",
            "score": 3,
            "author": "cschillo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the tip, will do! \n\nWe aren't waiting for summer per se, some of our screen time is now dubbed in Spanish, but that's all I can do to help her. I was only suggesting summer because I know we're creeping up on finals and the kids are busy! So if you know anyone send em my way :)",
                    "score": 2,
                    "author": "Crazy_Cake5756"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It won’t let me message you, but I’m interested! I’ve been tutoring Spanish for years, and the youngest I’ve tutored was a kindergartener when I was in highschool (I’m working on my Master’s now)",
            "score": 3,
            "author": "Gloomy-Bug19",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh yay! It won't let me message you either. Hold on let me check my settings",
                    "score": 1,
                    "author": "Crazy_Cake5756"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hit me up if she decides she wants to learn Italian instead!",
            "score": 2,
            "author": "FunInTheShade"
        },
        {
            "level": 0,
            "comment": "you should check out lenguas club!",
            "score": 1,
            "author": "Adventurous_Brain934"
        }
    ]
}