{
    "id": "12vrigp",
    "score": 2,
    "title": "SOM Starting Salary",
    "author": "Own-Indication-8161",
    "date": 1682215015.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/12vrigp",
    "media_urls": [],
    "other_urls": [],
    "postText": "As I was researching my college options, I saw on Poets&amp;Quants that Binghamton SOM’s starting salary was 81k for 2022. Since this is a big jump from their 2021 starting salary, do you guys think it is accurate? If so, what do you guys think allowed for this improvement? How are the opportunities for the accounting and finance students?",
    "comments": [
        {
            "level": 0,
            "comment": "My accounting prof told me that she was notified that big 4 firms and possibly others are raising starting salary to 80-90k, no idea why or the source for that info but that could be it",
            "score": 3,
            "author": "Background-Ad-6485",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's crazy. It was like $50-65k for advisory positions for NYC offices back when I was a student. Advisory also paid more than audit and tax. \n\nCould just be adjustments on cost of living and inflation. $50-65k is not enough to afford NYC these days.",
                    "score": 3,
                    "author": "freeadvicetaker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree. It’s wayyy too expensive and the job market is super competitive. Especially NYC or anywhere in New York really",
                            "score": 2,
                            "author": "Background-Ad-6485"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She’s right. EY raised the salaries for A1s to 80k starting this year. It might seem amazing at first, but be aware that you will have a non-existent WLB working at the Big4",
                    "score": 3,
                    "author": "Depressedb291",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lolll true. That’s expected either way",
                            "score": 2,
                            "author": "Background-Ad-6485"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Opportunities in my opinion are great for accounting students. SOM career services are rly great and there’s s lot of resources, you should have no issue getting a job at a midsize or big 4 firm before or post graduation. Not sure about finance bc I’m an accounting major but should be pretty similar",
            "score": 2,
            "author": "Background-Ad-6485"
        }
    ]
}