{
    "id": "1332sf2",
    "score": 11,
    "title": "College in the Woods",
    "author": "Calypso602",
    "date": 1682792210.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/1332sf2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone! I’m an incoming freshman and I’m currently going through the housing process. I thought I wanted to room in CIW, but some people have told me negative things about it, or told me just not to room there period. I was wondering if anyone who lives there (or has lived there in the past) could give me some pros and cons about it. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Don't room in Oneida. When people talk about how shitty CIW is, they're usually only talking about Oneida. All the other buildings (Cayuga, Seneca, Onondaga, Mohawk) are fine though. Nothing fancy but nothing egregious either",
            "score": 17,
            "author": "HarmonicWalrus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait so if I’m a freshman do I HAVE to room in Oneida? Or is it just a freshman only option, but I can still room elsewhere if I wanted to?",
                    "score": 1,
                    "author": "Calypso602",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I roomed in Cayuga when I was a freshman. Oneida is freshman only, but you don't need to stay there to find friends or get acclimated",
                            "score": 2,
                            "author": "HarmonicWalrus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ohhhhhh ok that’s very good to know ty",
                                    "score": 1,
                                    "author": "Calypso602"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As another commenter said, Oneida’s the only really bad one. AFAIK it’s freshmen only, so they tend to market it as a first year bonding thing, but it’s just really not a great building. The other dorms in CIW are renovated, if still a bit old. Mohawk’s more modern compared to the other CIW dorms, but it’s also pretty disconnected from the rest of community.\n\nCIW has a super convenient location on campus since it’s so close to the everything. The only major downside is that the CIW dining hall is closed on weekends, but the Union/Marketplace is very close so it’s not the end of the world.",
            "score": 8,
            "author": "Apprehensive_Quality"
        },
        {
            "level": 0,
            "comment": "You smell a lot of weed, even if you did the chem free agreement because other people on the floor can still spread it. If you are uncomfortable with the smell, CIW is not a good place to live in.",
            "score": 4,
            "author": "contactdetails"
        },
        {
            "level": 0,
            "comment": "I currently live in Oneida, it’s okay, not horrible if you’re looking at it on its own. That being said though, there’s definitely better choices",
            "score": 3,
            "author": "ingird040317"
        },
        {
            "level": 0,
            "comment": "I heard that Oneida was getting renovated over the summer 🫢",
            "score": 3,
            "author": "feartiime"
        },
        {
            "level": 0,
            "comment": "It’s literally fine not the end of the world at all, ppl act like living in CIW is like living in a cardboard box under a bridge. I lived there and saw other communities and buildings too. Dickinson/mountainview are for sure nicer but CIW is harmless. The only thing that bothered me was that there’s not rly a communal “quad” if u care about that, and that the dining hall closed on Fridays at 1 and didn’t reopen until Monday morning. U had to travel to a different dining hall, and they aren’t far so it was ok but such an inconvenience. It’s cheaper to live in CIW too though",
            "score": 2,
            "author": "Background-Ad-6485"
        },
        {
            "level": 0,
            "comment": "It's just old, and a hike to the top but in the winter it keeps you warm.",
            "score": 1,
            "author": "katsbro069"
        },
        {
            "level": 0,
            "comment": "Oneida is p terrible but all of the other buildings have been recently renovated is the past couple of years so they’re honestly rly nice to live in! The community is rly open too and it’s very close to the union + library so it’s convenient. I live in cayuga, the bathrooms are really clean/modern and get cleaned everyday and I think it’s a similar situation for Onondaga and Seneca",
            "score": 1,
            "author": "pokyla",
            "replies": [
                {
                    "level": 1,
                    "comment": "are you in a suite in cayuga? how is it?",
                    "score": 1,
                    "author": "brandonennz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i live in a six person suite! the common room is nicely sized + we have a personal bathroom that gets cleaned weekly. i rly like the layout and it comes w some furniture too. the 4 person suites are smaller and im not sure if they come with a bathroom but they also have a common room, and if ur lucky you might get a suite that has the extended rooms",
                            "score": 1,
                            "author": "pokyla"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "youll be fine in any building besides oneida they're pretty homey",
            "score": 1,
            "author": "brandonennz"
        }
    ]
}