{
    "id": "136zeto",
    "score": 2,
    "title": "Is BA in econ worth it or should I go for a masters in business?",
    "author": "Famous-Writer-6258",
    "date": 1683147688.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/136zeto",
    "media_urls": [],
    "other_urls": [],
    "postText": "I can complete my psychology degree and graduate next spring or I can change my degree to econ and finish the year after. Are the job prospects for econ degree worth the time it takes to switch majors? Or am I better off getting a psych degree then going for mba?",
    "comments": [
        {
            "level": 0,
            "comment": "It really depends on your career goals, I would make an appointment with the Fleishman Center to discuss your options. Also consider things like student loans/debt - it may be advantageous to graduate with *a* degree with less debt than to take longer to graduate with an ECON degree and accumulate more debt.",
            "score": 4,
            "author": "turbulentmelon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Man at this point I'm open to any career as long as it makes okay money. I get my tuition for free due to financial aid but if I get masters I have to take loans so I'm not really sure which route to pick 🤔",
                    "score": 2,
                    "author": "Famous-Writer-6258"
                }
            ]
        },
        {
            "level": 0,
            "comment": "FWIW a big thing in the market research industry is hiring people with a psych background. The hours suck sometimes, but the pay is good. I don't know if you need to go the full MBA route though. If you do, try to specialize in marketing.\n\nGood luck",
            "score": 2,
            "author": "ute8888"
        },
        {
            "level": 0,
            "comment": "do an mba but do it from a well-ranked school nationally. ba in econ from a public school that most people outside of NY don't think of highly is not a great investment.  \n\nthe relevant question if you do decide to do an mba is what to do to position yourself well for admission to a top mba program and I think having relevant, interesting and strong work experience that will add to the classroom experience of your peers is the answer to that. but a run-of-the-mill econ ba from a poorly ranked school (outside of NY) won't impress employers.",
            "score": 2,
            "author": "Key-J-8169",
            "replies": [
                {
                    "level": 1,
                    "comment": "What if I plan to stay in NY",
                    "score": 1,
                    "author": "Famous-Writer-6258"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like Econ may set you up slightly better for an MBA if that’s the end goal compared to psychology. Honestly for psych you’d need to definitely go get a masters degree to land a really good job so if it’s money that matters I would say go with Econ.",
            "score": 1,
            "author": "Altruistic-Kiwi8911"
        }
    ]
}