{
    "id": "13deue1",
    "score": 17,
    "title": "Should I transfer out?",
    "author": "SlideMajestic9744",
    "date": 1683688791.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/13deue1",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a sophomore and I haven’t made much progress making friends here. I don’t think bing is the place for me and I just don’t have any good memories here. Would this be a valid reason to transfer out?",
    "comments": [
        {
            "level": 0,
            "comment": "Trust your instincts and follow your heart. Sometimes better things are waiting to happen when you take the chances. Change can be a positive thing! Good luck!",
            "score": 25,
            "author": "ParkingMotor9872"
        },
        {
            "level": 0,
            "comment": "Transferring out could absolutely help, as long as you make sure you can identify what specifically it is about Binghamton that you don’t vibe with and make sure you’re going to be transferring somewhere that really we’ll be a better fit. It will be a hassle though so I would advise that first you look into what you might be able to do at bing to make it a better experience. I know for me it wasn’t until a year in thatI found some extra curricular i liked and that I really started to find my groove. I would look into what’s available on/around campus and try immersing yourself in bing a bit more that way before throwing in the towel.",
            "score": 9,
            "author": "Afcmanchester"
        },
        {
            "level": 0,
            "comment": "It’s really up to you and what you feel comfortable and confident in, personally I’m transferring as junior ( more do to money and Binghamton not having major and not wanting to be forced to have my masters) and I love my friend group, and it took me a lot of deciding what I wanted to do for like this entire year cause like it’s difficult and you can just go back. The biggest thing is making sure it’s what you want/ need in your life cause then you can do it with no regrets. \n\nIf your looking for things/ people do a class or club or something that interest you or even is something you’ve always wanted to do. I’ve met my favorite people by taking a painting class on a whim and playing in club softball. Even a job that I got while here I met my closest friends ( on campus and off ) \n\nI’m sure you’ll be amazing where ever you go and best of luck where ever life takes you !",
            "score": 2,
            "author": "Craftyadhd"
        },
        {
            "level": 0,
            "comment": "I was in the exact same situation. Ended up leaving Binghamton due to depression frm isolation. Now that I'm almost 23 it's a lot harder to make friends when ur older. One of my biggest regrets is not trying harder to make friends and joining organizations",
            "score": 2,
            "author": "Famous-Writer-6258",
            "replies": [
                {
                    "level": 1,
                    "comment": "Were u happier at a different college?",
                    "score": 1,
                    "author": "SlideMajestic9744",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No. Not even being in a different country helped",
                            "score": 1,
                            "author": "Famous-Writer-6258"
                        }
                    ]
                }
            ]
        }
    ]
}