{
    "id": "13s4glu",
    "score": 5,
    "title": "Dental School and Housing",
    "author": "koalahugs_cabell",
    "date": 1685079635.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/13s4glu",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am currently a high school graduate and set to go to Binghamton University this fall (AUG22). I plan on majoring in biology and going to dental school after I graduate from Binghamton. Would the pre health program be the right way to go? Are there any suggestions that might help me along the way? Thanks in advance!! Also when can I start picking my dorm? It says an email will be sent at random but just wanted to confirm that’s how it works since my counselor didn’t really get it either.😬😬",
    "comments": [
        {
            "level": 0,
            "comment": "Pre-Health may be appropriate/beneficial as you'll take pre-requisite courses needed for entry into dental school, and having a declared pre-health area of interest will allow you to meet with the Pre-Health office as a Junior and Senior (there is Pre-Health advising for Freshmen and Sophomores but that's done through Harpur Advising). There's quite a bit of overlap between BIOL major req. and pre-health courses. Take a look at pgs. 5-6 here: https://www.binghamton.edu/pre-health/20212022freshsophhandbook.pdf (but this document is also very useful for pre-health students in general).\n\nRegistration is done after orientation from what I know. You should email Harpur Advising\nto ask what to do if you aren't attending orientation, as this may change when you can register (I don't currently know how they're doing it for people who don't attend orientation). \n\nAlso, this is more of a personal note, but I do recommend you attend orientation if you can because they do go over a lot of important info and there are presentations held on a lot of this stuff (like pre-health). I know a lot of people don't go simply because they don't want to but if you can attend, I do recommend it because I personally believe orientation was very helpful for me adjusting to college. I just stayed at a hotel with my parents because I didn't wanna stay in the dorms overnight lol, so this is an option too if you want to attend but not dorm for the night.",
            "score": 6,
            "author": "turbulentmelon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much this helped a lot. Also, I am going to orientation actually all the way in July but my dad did bring up a great point about how if students didn’t go to orientation how would they register for classes which made me wonder if classes were picked after orientation but thanks for the heads up!",
                    "score": 2,
                    "author": "koalahugs_cabell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Happy to help! Yea, they do registration after orientation, I guess just because you can use the info gained at orientation to give you a better idea of what courses you'll need/want. \n\nYou'll have to fill out an \"intake form\" before you can register, it's found right on the front page of the my.binghamton.edu portal, if you haven't already (I'm unsure if it's available yet, but pretty much everything you need as a new student is on the front page). The intake form asks about any credit you may be transferring over to Bing, like APs, dual enrollment courses, etc., and this form is really important because it lets advisors know what classes/gen eds you may already have credit for. \n\nOnce the form is done, you get an email (or two) response back from Harpur Advising, and then you'll schedule a 1-on-1 Zoom meeting with an advisor, and you'll register for courses during that meeting. The advisor will help guide you towards what classes you need based on major/intake form responses, but it will help to do a little bit of poking around on Bing's website yourself/BU Brain in case you see anything that looks interesting.",
                            "score": 3,
                            "author": "turbulentmelon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!!! I had no clue about any of this despite trying to search it up. So glad to hear about the Zoom 1 on 1, was very worried about what classes to pick and making sure I’m up to date with the prerequisites.😭😭",
                                    "score": 1,
                                    "author": "koalahugs_cabell"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a recent graduate from Bing and will be attending dental school this upcoming summer. I also majored in bio and was on the pre-health track. Feel free to pm with any questions!",
            "score": 2,
            "author": "xlaicheex"
        },
        {
            "level": 0,
            "comment": "im also an incoming freshman on the dental track!!",
            "score": 2,
            "author": "No_Grape6047",
            "replies": [
                {
                    "level": 1,
                    "comment": "YOOO LETS BE FRIENDS I’m gonna be so lonely in college 😫😫",
                    "score": 3,
                    "author": "koalahugs_cabell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}