{
    "id": "145adc7",
    "score": 6,
    "title": "Transfer Orientation",
    "author": "koobibfs",
    "date": 1686329383.0,
    "url": "https://www.reddit.com/r/BinghamtonUniversity/comments/145adc7",
    "media_urls": [],
    "other_urls": [],
    "postText": "The transfer orientation is listed as an one day event and i’m traveling from nyc w no car. is it absolutely necessary to go?? or can I sign up for classes online.",
    "comments": [
        {
            "level": 0,
            "comment": "Hi OP, I work with advising.\n\nIncoming students (at least for Harpur) now register for classes *after* attending orientation, through a 1:1 Zoom appointment with an advisor.  It is expected that students do their best to attend orientation as it helps with info and onboarding things. You cannot register for courses by yourself, you must meet with an advisor to do so. \n\nIf you can't attend orientation, you may have to register for courses later on (not sure how late), but IMO I would first email your advising office and explain your circumstances and see what they would recommend. \n\nThere's a lot of outdated info on here that is more than likely not applicable to you as some people transferred in here pre-Covid and our incoming student registration process changed because of the pandemic.",
            "score": 4,
            "author": "turbulentmelon",
            "replies": [
                {
                    "level": 1,
                    "comment": "hi, tysm!! will bing offer sleeping accommodations if i arrive a day earlier?",
                    "score": 1,
                    "author": "koobibfs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No they won’t. Already called and asked them the same question. The answer was they unfortunately don’t have the resources… They also clarified that although sign-in starts very early, the orientation itself doesn’t start until around 11AM, so there’s time to drive up from NYC and to leave at a reasonable hour instead of an ungodly early hour. \n\nIn any case, I’ll drive up the day before and my son will stay with me at an Airbnb.",
                            "score": 3,
                            "author": "Ecstatic-Shoe1467"
                        },
                        {
                            "level": 2,
                            "comment": "That I don't really know tbh, that's probably a good question for ResLife so I would maybe reach out to them and see if there's anything they can arrange",
                            "score": 1,
                            "author": "turbulentmelon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello, I transferred to Binghamton back in August 2019. They told us that we HAD to attend orientation for class registrations and to pick up our ID cards. I know a couple friends had to take the greyhound/coach busses from Port Authority. Unfortunately it does start in the early morning, so you might have to go up the night before, but I think they might have sleeping accommodations for you.",
            "score": 2,
            "author": "schen1435",
            "replies": [
                {
                    "level": 1,
                    "comment": "They changed orientation A LOT since 2019. Course registration no longer happens during orientation. Instead, it’s a week or so later during a 1 on 1 apt with an advisor",
                    "score": 2,
                    "author": "cosinetangentzoo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello, I transferred to Binghamton back in August 2019. They told us that we HAD to attend orientation for class registrations and to pick up our ID cards. I know a couple friends had to take the greyhound/coach busses from Port Authority. Unfortunately it does start in the early morning, so you might have to go up the night before, but I think they might have sleeping accommodations for you.",
            "score": 1,
            "author": "schen1435"
        },
        {
            "level": 0,
            "comment": "You don’t have to go. You wouldn’t sign up for classes at orientation, it’s just for information and campus tours.",
            "score": 0,
            "author": "feartiime",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you a transfer student? I was and we most definitely registered for classes at orientation and that was the only time and place we could do so.",
                    "score": 3,
                    "author": "energeticallypresent",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "did u meet w ur advisor in person to register ur class or was it online?",
                            "score": 1,
                            "author": "koobibfs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "From what I remember (it was several years ago) we didn’t meet with a dedicated advisor. There were student advisors there who could help but that was really it.",
                                    "score": 2,
                                    "author": "energeticallypresent"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i wasn’t sure since the site states “students must attend orientation in order to register for classes”. do they send a separate email after orientation about course registration?",
                    "score": 1,
                    "author": "koobibfs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hm i would try emailing them back and telling them that you aren’t able to travel there for the day due to transportation limits. They’ll most likely accommodate you",
                            "score": 5,
                            "author": "feartiime"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I called and they told me you have to go smh",
            "score": 1,
            "author": "Kind-Ambition5980"
        },
        {
            "level": 0,
            "comment": "I transferred last semester and personally thought it was a waste of time. I believe I got my id then but I’m sure you can get it at a later time.",
            "score": 1,
            "author": "Choice-Employment-60"
        },
        {
            "level": 0,
            "comment": "Na u don’t have to go to that shit",
            "score": 1,
            "author": "Late-Advantage7082",
            "replies": [
                {
                    "level": 1,
                    "comment": "when did u transfer to bing and how did u register for ur courses ?",
                    "score": 1,
                    "author": "koobibfs"
                }
            ]
        }
    ]
}