{
    "id": "13cfpiy",
    "score": 614,
    "title": "YSK to not disturb stones on top of grave markers!",
    "author": "mema2000",
    "date": 1683607579.0,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/13cfpiy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Why YSK: Inspired by the coins on a grave post, I wanted to add one that I was unaware of until adulthood. It is a common Jewish practice to leave stones/pebbles on top of grave markers, as a form of condolences or to participate in the burial mitzvah. The buildup of these stones can also represent the collective remembrance of the deceased. You shouldn’t ever disturb a grave marker, but please, especially do not move these!",
    "comments": [
        {
            "level": 0,
            "comment": "File this one and the coins under \"If it ain't yours, don't touch it\" segment of Basic Respect 095.",
            "score": 120,
            "author": "WhichLecture4811",
            "replies": [
                {
                    "level": 1,
                    "comment": "Always a good rule to have! In my other comment where I mentioned how I learned about this practice, I genuinely thought I was doing a nice thing by “cleaning” the 2-3 pebbles off the stone, but I did eventually put them back!",
                    "score": 37,
                    "author": "mema2000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember living next to a cemetery as a child, my parents would walk our dogs through there. Fairly common practice for the neighbourhood. One day my dad came back with a heap of mangoes. The cemetery has a large Chinese section. Apparently they leave food on the graves. I was perturbed.",
            "score": 206,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s not that bad. In Vietnam, it’s actually normal and acceptable to take food from the grave AS LONG AS you wait until the incense burns out. People expect the food to be taken. \n\nI haven’t been to a grave in the US so I don’t know if East Asian people still use incense or not. But if not, you are free to take after a few hours or so. However, NEVER eat at the grave, it’s hugely disrespectful, as much as taking the food early. \n\nSource: I went with my parents to our family grave every year when i was small and there were always little kids around. My parents gave them lucky money and told them not to take the food before the incense burns out.",
                    "score": 52,
                    "author": "nsyu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone who is Chinese, Vietnamese, and Jewish from the US, I can confirm that we use incense. I've had my share of visiting my Gong Gong at Rose Hills (in California) and my Bubby at a Jewish cemetery. We've done the whole gansa megillah of leaving the food out for offering and lighting incense. I did not know we have to wait until the incense burns out.",
                            "score": 11,
                            "author": "aMaIzYnG"
                        },
                        {
                            "level": 2,
                            "comment": "Now that i think about it again. My parents also prepared a small bit of food and incense for the surrounding graves. Because, in a sense, they are neighbors, and it would not be nice if you don’t invite your neighbors when you have a party (the food). Quite intriguing now that i think  about it. And the whole thing about waiting for the incense is because you are inviting your ancestors down to earth to enjoy the food. Incense burns out means they went back to the other side. Not really religious, just a culture thing that everyone understands and follows.",
                            "score": 8,
                            "author": "nsyu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How did he think that was okay? It's equivalent to taking flowers off a grave.",
                    "score": 54,
                    "author": "ffunffunffun5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Soooo my brother used to come home from work with flowers for my mom all the time (he was about 16- in the 80) yep, from a cemetery 🤦‍♀️🤷‍♀️😂 my mom had to explain 😂",
                            "score": 13,
                            "author": "spacemusicisorange"
                        },
                        {
                            "level": 2,
                            "comment": "Dead people don't eat mangos you clown",
                            "score": -26,
                            "author": "Affectionate_Cut_808",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do they eat flowers?",
                                    "score": 22,
                                    "author": "dr-Funk_Eye"
                                },
                                {
                                    "level": 3,
                                    "comment": "They don't interact with flowers a lot either, bozo.",
                                    "score": 11,
                                    "author": "ffunffunffun5",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Flowers eat dead people, Oleg",
                                            "score": 1,
                                            "author": "Scrub_nin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Some [flowers](https://villains.fandom.com/wiki/Audrey_II) eat living people.",
                                                    "score": 1,
                                                    "author": "ffunffunffun5",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No clown name? I’m slightly disappointed 😔",
                                                            "score": 2,
                                                            "author": "Scrub_nin"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know in Japan you can eat the food you offer to graves and shrines, but idk about Chinese practices.",
                    "score": 10,
                    "author": "DirtyDanTheManlyMan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In Asian countries, the poor and hungry eat the food.  In the states, some mourners eat it after leaving it out a little while others see it as abhorrent to do so for some reason.\n\nI feel it’s wasteful since we don’t have the hungry eating the food.  It all gets discarded",
                            "score": 18,
                            "author": "Tiny10H2"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, you family already walked the dogs on a cemetery in a communist of dog owner assholes who did the same disrespectful thing.\n\n \nYsk: keep your dog away from other people mourning places.",
                    "score": 4,
                    "author": "horsthorsthorst",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No.",
                            "score": -2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;One day my dad came back with a heap of mangoes.\n\nIt's worse than you think.  \\[Taking food from the dead is particularly disgusting and disrespectful because\\] Many cultures make a tradition of offering food to the dead.\n\nEdit: wow, I didn't think I'd get so much hate.  I wasn't trying to say the tradition of offering food to the dead was worse than u/Necessary_Scholar282 initially thought; ***I was trying to say the fact that his dad took food from the dead was worse than*** u/Necessary_Scholar282 ***initially thought.***  People should be allowed to pay their respects to the dead however they want so long as the method of paying respects would be considered appropriate by the deceased if they were still here with us, because everyone's feelings for their loved ones are valid.  This reply has been adjusted to better reflect the actual intentions of my original response with text added in brackets and a relevant quote.",
                    "score": -69,
                    "author": "Vector_Ventures",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;It's worse than you think. Many cultures make a tradition of offering food to the dead.\n\nIsn't that exactly what the person above thought? What other explanation was there?",
                            "score": 102,
                            "author": "UncleSnowstorm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s worse than you think",
                                    "score": 13,
                                    "author": "jdino"
                                },
                                {
                                    "level": 3,
                                    "comment": "Well I was trying to say the fact that his dad took food from the dead was far worse than u/Necessary_Scholar282 initially thought.  It's not as bad as outright desecrating a grave mind you, but taking food from the dead or any other form of undermining people's ability to pay their respects to the dead is still reprehensible.",
                                    "score": -1,
                                    "author": "Vector_Ventures",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But he mentioned a cemetery in his post, so surely he knew he took it from the dead?",
                                            "score": 4,
                                            "author": "UncleSnowstorm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, but the point is that being 'perturbed' might not have been enough of a reaction, as I feel the amount of disgust we should feel with taking dead people's food should be worthy of a bigger reaction akin to an outright gag reflex or something similar.",
                                                    "score": -6,
                                                    "author": "Vector_Ventures"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "😂 you don't say? 😂",
                            "score": 6,
                            "author": "AltLawyer"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -49,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've heard the same thing said about putting flowers or other ornaments on a grave.",
                                    "score": 37,
                                    "author": "LainieCat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At least flowers and ornaments are accomplishing the task they are designed for: decoration \n\nLeaving food attracts unwanted animals and wastes the food.",
                                            "score": -8,
                                            "author": "soapysurprise"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not necessarily a waste tho. Animals and birds will eat it.",
                                    "score": 19,
                                    "author": "Dangankometa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah. Think about the poor bacteria why don’t you!",
                                            "score": -2,
                                            "author": "TheRealSugarbat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not just that. People too poor to buy food can take it too.",
                                                    "score": 5,
                                                    "author": "Dangankometa"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Usually in their belief it's either to ensure the deceased has enough belongings to survive the journey to the otherside or to please the otherside's guard or something\n\nI don't practice it too but that's some cultural explanations",
                                    "score": 12,
                                    "author": "Virghia"
                                },
                                {
                                    "level": 3,
                                    "comment": "This logic should also apply to funerals and flowers then, but I'm guessing you're used to those",
                                    "score": 11,
                                    "author": "STlNKY"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wonder what the next “don’t touch x on grave” post will be",
            "score": 67,
            "author": "Bluelaserbeam",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unethical Life Pro Tip: Cemeteries are a great place to collect discarded coins, stones, and mangoes.",
                    "score": 97,
                    "author": "malogan82",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And an excellent source for free flowers.",
                            "score": 16,
                            "author": "ffunffunffun5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just in time for Mother's Day!",
                                    "score": 7,
                                    "author": "Callmedrexl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "just move the flowers to her grave!",
                                            "score": 5,
                                            "author": "John_Fx"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As long as they don’t interfere with my business reselling the free flowers and tiny flags from the graveyard, I’m okay with it. /s",
                    "score": 40,
                    "author": "SayethWeAll"
                },
                {
                    "level": 1,
                    "comment": "Ysk. Don’t take the jewelry often entombed with the bodies. Not only will you have to dig dirt (yuck!) but you’re committing the crime of grave robbing, which is when a living person steals something from the grave of a dead person.",
                    "score": 20,
                    "author": "iamsavsavage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Quick question how long do they have to be dead before it's considered archeology? Kind of need an answer I'm on the clock...",
                            "score": 4,
                            "author": "whyareyouaskingmeme"
                        },
                        {
                            "level": 2,
                            "comment": "You seriously need to tell us this?  Who mentioned (digging up type) grave robbing???",
                            "score": -6,
                            "author": "Samarack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Whoosh",
                                    "score": 5,
                                    "author": "BustyMcCoo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You should know not to put things on graves because people, mainly the people responsible for managing the burial site, will remove them in short order.",
                    "score": 4,
                    "author": "Rick-D-99"
                },
                {
                    "level": 1,
                    "comment": "LPT: You should never remove the golden fillings from the teeth of the dead! Their families may be perturbed because corpses are respected in many cultures, including Jewish.",
                    "score": 9,
                    "author": "ManitouWakinyan"
                },
                {
                    "level": 1,
                    "comment": "When a corpse comes climbing out of a grave and the zombie apocalypse has begun, run away",
                    "score": 3,
                    "author": "Conebones"
                },
                {
                    "level": 1,
                    "comment": "I saw a bird drop a rock on a grave. It can be anything at this point. A sleeping bum on a grave means you'll get 60 years of good luck. Like and subscribe.",
                    "score": 3,
                    "author": "ChingasoCheese"
                },
                {
                    "level": 1,
                    "comment": "Apparently Asians leave food.",
                    "score": -5,
                    "author": "OnePieceTwoPiece"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sorry? Did you respond to the wrong comment?",
                            "score": 1,
                            "author": "Bluelaserbeam"
                        },
                        {
                            "level": 2,
                            "comment": "Yes.  Apologies.",
                            "score": 1,
                            "author": "Walter_Piston",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re good haha",
                                    "score": 1,
                                    "author": "Bluelaserbeam"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Self",
                    "score": 0,
                    "author": "thechrismonster"
                },
                {
                    "level": 1,
                    "comment": "Can you link the last one? I can't find it.",
                    "score": 0,
                    "author": "Ahsoka_Tano07"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A stone marks the permance of memory.   And a pebble can be picked up and placed by poor or rich thus symbolizing that we when we stand in judgment before G-d neither riches or poverty matter.",
            "score": 52,
            "author": "LostInNorthIdaho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice but who is G-d?",
                    "score": 2,
                    "author": "Toast_2_Life",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is a censored way of writing \"God.\" Mentioning god by name is taboo in Judaism. By extension, this may be taken to apply to the word \"god\" itself.",
                            "score": 4,
                            "author": "NarrowEyedWanderer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank for explaining. I assumed it was “God”. However, I was ignorant, I never seen His name censored.",
                                    "score": 2,
                                    "author": "Toast_2_Life",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i blame Tipper Gore",
                                            "score": 1,
                                            "author": "John_Fx"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It is wtitten that way out of respect to prevent his name frrom being erased with out due care.",
                            "score": 1,
                            "author": "LostInNorthIdaho"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For example [Oskar Schindler's grave](https://upload.wikimedia.org/wikipedia/commons/b/b1/Schindlergrave2010.jpg).",
            "score": 9,
            "author": "ffunffunffun5"
        },
        {
            "level": 0,
            "comment": "This is why I would prefer cremation or alkaline hydrolysis.",
            "score": 6,
            "author": "Aggressive-Project-7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Totally fair, I prefer a form of cremation myself. For Jews though, I’m not sure whether you are or not, being buried “as you were born” (all organs intact) and in the ground (kevurah b'karka) is holy practice that allows the soul to reach Sheol, the darkness after death where souls wait for their judgement at the end of days.\n\nIf you’re Jewish, please correct me if I misspoke! I grew up Baptist, so I know very little first hand about Judaism :)",
                    "score": 9,
                    "author": "mema2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not Jewish either but \"wait for judgment at the end of days\" sounds a lot more Baptist or Muslim, than Jewish.  God judges people all the time and writes people into or out of the book of life every year rather than waiting for the end of days, and Sheol is often thought to be a permanent final destination rather than a waiting place ... At least those are my understandings ...",
                            "score": 2,
                            "author": "BreeParaconsistent",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some Jews do believe in the “end of days” (aḥarit ha-yamim/אחרית הימים), it’s when the Day of Judgement  (Yom ha-Dīn/‎יום הדין) occurs. It does differ across branches though.",
                                    "score": 6,
                                    "author": "mema2000",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No, not really. No one considers “Jews for Jesus” Jewish except themselves.",
                                            "score": 2,
                                            "author": "themeowsolini",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Like I mentioned, I’m not Jewish, my experience with Judaism was nannying for a Jewish family. The comment you replied to was based off of [this website](https://web.archive.org/web/20121013235945/http://www.askmoses.com/en/article/215,2097883/Will-there-be-trial-and-judgment-after-the-Resurrection.html) I found.",
                                                    "score": 1,
                                                    "author": "mema2000",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don’t know what that site is, but I would stop using it as your primary source for information about Judaism. You are spreading misinformation. Jews do not believe in resurrection at all. They don’t even believe Jesus was anything other than an ordinary human.",
                                                            "score": 1,
                                                            "author": "themeowsolini",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Uh, resurrection of the dead is the 13th of the Rambam’s principles of faith.",
                                                                    "score": 2,
                                                                    "author": "Sex_And_Candy_Here",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I’ve never come across anyone who believed it. As a kid I thought it was the coolest thing. I was like OMG you guys this is going to happen??? I started getting into sci-fi and fantasy novels so this seemed amazing, like real-life futurism or something. I wanted to know everything and I just couldn’t understand why no one seemed to care. It wasn’t ever a topic of conversation, and while it’s not like it was off limits, people didn’t want to talk about it. It’s similar to the way a lot of catholics react when you ask them if they believe they are actually eating the blood and body of Jesus. It’s uncomfortable because they don’t want to say they don’t believe it, but they also try to desperately avoid saying they do. Does that make sense? I never got the sense that anyone I asked ever interpreted that stuff literally. \n\nActually, I got that impression about a LOT of topics, to be honest. People cherry-picked what they wanted to pay attention to. Ultimately I decided as a teen that I didn’t believe any of it. While the culture is very important to me, I consider myself an atheist. I might be too cynical, but I think most people are, to some extent, pretending. Choosing to believe. Kind of like how Christians talk about faith as a choice. Jews don’t have that narrative, but I feel like they behave that way.\n\nAnyway, I’ll get off my heretical soapbox. I’m not trying to offend anyone.\n\nEdit: It’s only very tangentially related, but since I mentioned reading in the context of questioning religion, I think it’s funny. In fourth grade our class had a boxed set of the Narnia books. Our teacher for our secular subjects wasn’t Jewish and I think they might have belonged to her. So we were all reading them, swapping them around the class. I even did a book report on The Lion, the Witch, and the Wardrobe. I had no idea Asian was an analogue for Jesus until I was an adult. Now I find the memory of the rabbi’s son at his desk, in yarmulke and tzittzit, reading Christian fantasy propaganda to be pretty funny.",
                                                                            "score": 1,
                                                                            "author": "themeowsolini",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Oh I agree with what you’ve said here, I just think saying “Jews don’t believe in resurrection at all” is too definite of a statement.",
                                                                                    "score": 2,
                                                                                    "author": "Sex_And_Candy_Here",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’m not sure if you practice or not, but yes, some Jews do believe in resurrection [(source)](https://www.myjewishlearning.com/article/jewish-resurrection-of-the-dead/) Maybe your branch believes something different, I have no idea.",
                                                                    "score": 0,
                                                                    "author": "mema2000",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "This is a complex and nuanced thing that is easy to misinterpret. Jews are encouraged to question and pontificate and theorize. While we use original texts (there is only one version of the Torah) there are many different versions of texts, basically like “the Torah according to [x person], where they include their commentary and interpretations. There are also a ton of things that are taken as fact, as “rules,” if you will, but are actually just excepted practice (but often treated like rules. Like I said, complex and nuanced). \n\nAll that to say, I grew up ultra orthodox and never met a single person who interpreted that literally. When people “study Torah” they will pore over words and basically conduct literary analysis to the nth degree. This is different than asking someone on the street, “do you believe in resurrection?” It sounds like it’s like the Christian belief, and it is most definitely not. \n\nFinally, not being very familiar with Jews yourself, you may not understand where different groups fit into Judaism as a whole, and how they are viewed by the rest of American Jewery. So it may be easy to make sweeping generalizations that don’t apply to many people outside of your specific experience.\n\nLet me try an analogy. Would you say Christians face a direction to pray, as Jews and Muslims do? If you said “no,” you would be wrong. Coptic Christians do. But, although technically correct that “some Christians” do, it would be misleading to say that because it makes it seem like a much more do. Most would say “no” with the understanding that there is a “*” to cover the rest.",
                                                                            "score": 3,
                                                                            "author": "themeowsolini",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Interesting! Thank you for taking the time to type all of that up!",
                                                                                    "score": 1,
                                                                                    "author": "mema2000"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Interesting! Thank you for taking the time to type all of that up!",
                                                                                    "score": 1,
                                                                                    "author": "mema2000"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My dads bestfriend is the caretaker of a graveyard and when I saw the coin post I brought it up to him. He says he leaves most things like that. He's never really been sure of the meaning behind stones or coins but because he's seen it enough he just let's it be. A lot of the time they either fall off or go missing. \n\nThings like burning candles, food items or old wilting flowers are taken care of though for various reasons",
            "score": 7,
            "author": "PokeNToker"
        },
        {
            "level": 0,
            "comment": "theoretically, if a groundskeeper or whatever wanted to clean the stone, could they move them off for a little while without being considered rude? same situation but coins?",
            "score": 4,
            "author": "rallekralle11",
            "replies": [
                {
                    "level": 1,
                    "comment": "My understanding is that they will just remove things periodically, generally speaking.",
                    "score": 5,
                    "author": "SandysBurner"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The coins grave post was removed. Will this one be too?",
            "score": 5,
            "author": "51CK54DW0RLD",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hadn’t noticed that, I don’t think this breaks any rules. Maybe OP took it down themselves? I saw a lot of arguing in the comments lol",
                    "score": 0,
                    "author": "mema2000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This upsets me! Do people actually move the stones I’ve set?",
            "score": 4,
            "author": "AndShesNotEvenPretty",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did once as a kid, thinking that I was helping clean up a neglected gravestone. Luckily, I was able to go back to the cemetery and put them back, I even added my own as an apology.",
                    "score": 6,
                    "author": "mema2000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How often do you think people are going around messing with the gravestones of strangers?",
            "score": 40,
            "author": "rampampwobble",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did this, that’s how I learned. I was a young-ish teenager and I thought the little stones were debris from a recent storm. There’s also a growing trend of “grave stone cleaning”, where I’ve had to point out to people that they should replace the stones they removed in order to wash off the markers. Not everything is done maliciously, sometimes people just don’t know any better.",
                    "score": 67,
                    "author": "mema2000"
                },
                {
                    "level": 1,
                    "comment": "The number is substantial among those whose age has a 'teen' in it.",
                    "score": 18,
                    "author": "Quantum_Tangled"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why especially? Aren't all grave markers inportant to someone?",
            "score": 3,
            "author": "obsidianhoax",
            "replies": [
                {
                    "level": 1,
                    "comment": "Of course! These stones aren’t attached to the grave marker though, they’re usually just pebbles/rocks found and placed on top of the grave marker.",
                    "score": 4,
                    "author": "mema2000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ysk to mind ur business in the first place and not disrespect other people’s graves by touching anything off of them.",
            "score": 3,
            "author": "grounndhog101"
        },
        {
            "level": 0,
            "comment": "I think more cultures do it as well. I grew up Catholic and when ever we visited my great grandfather and grandmother we would leave small rocks on their headstone. And my grandmother would leave Guinness and radishes for her brother. I would never take anything though I have seen way too many horror movies.",
            "score": 3,
            "author": "bubbletea1414"
        },
        {
            "level": 0,
            "comment": "Interesting. I think I've heard of this using stones for grave markers from biblical times and in some Latino cultures. Or maybe I'm getting things mixed up.",
            "score": 2,
            "author": "ImprovementApart1336"
        },
        {
            "level": 0,
            "comment": "How about we don’t touch or move anything on a headstone as it may be there purposely.",
            "score": 2,
            "author": "bioschmio"
        },
        {
            "level": 0,
            "comment": "Not sure why you would want to move them.",
            "score": 2,
            "author": "WisconsinExPat",
            "replies": [
                {
                    "level": 1,
                    "comment": "The most benign reason I can come up with is that they think it's messy and they're tidying up, sort of like removing dead flowers.",
                    "score": 3,
                    "author": "ffunffunffun5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly what I did!",
                            "score": 1,
                            "author": "mema2000"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have seen Jewish graves with stones on top . I have wondered for years why someone would them place there. Thank you for the explanation.",
            "score": 2,
            "author": "Real_Border9457",
            "replies": [
                {
                    "level": 1,
                    "comment": "No problem! I think it’s such a neat practice, just wish I had known earlier 😅",
                    "score": 1,
                    "author": "mema2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is neat practice. Also when you think about it it’s  a great way to pay your respects and say goodbye at the same time.",
                            "score": 1,
                            "author": "Real_Border9457"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it common for people to touch graves???",
            "score": 2,
            "author": "opusbot"
        },
        {
            "level": 0,
            "comment": "How about don't touch others shit like in general? Or something that clearly looks done on purpose, like be a decent human even without these posts",
            "score": 7,
            "author": "M4NOOB",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, you don’t know what you don’t know. Not everything is done with malice. It’s better to inform than be an asshole and think everyone knows it all.",
                    "score": 3,
                    "author": "OnePieceTwoPiece",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't assume everyone knows everything, I don't even know why people put stones there, but I also don't really care. I just don't touch them because why in the world would I??\n\nSo if you see stones in an odd place where they wouldn't be able to get to by themselves, like ontop of a gravestone, maybe even multiple ones stacked or similar.. you'd just take them/throw them or whatever?\n\nAlso in general you would touch people graves or things on their graves?",
                            "score": 1,
                            "author": "M4NOOB"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And here I am against cemeteries completely. Land going to waste that could have been used for so much better stuff.  Have shrines in your house to honor the dead if you must, but graves are a waste of space and resources. The dead don't care if you respect them. \n\nI am also one to believe every dead body should be harvested for organs regardless of faith, religion or family wishes. Someone dies, take their healthy organs, burn the rest. Would reduce the organ waitlist to 0.",
            "score": 8,
            "author": "DankNucleus",
            "replies": [
                {
                    "level": 1,
                    "comment": "But it doesn’t work like that. When someone dies, there is a window of time to harvest the organs. Further, not all organs (especially in elderly or sick donors) are viable as their quality may be compromised. \n\nBurial isn’t all bad—often cemeteries have trees and wildlife and is left largely undeveloped. That’s not a bad thing in a world that keeps invading nature and destroying ecosystems. And while I agree that organ donation should be considered, it’s ultimately not my place (or anyone else’s) to tell you what to do with your body. Not in life or in death.",
                    "score": 5,
                    "author": "AndShesNotEvenPretty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Putting chemically preserved bodies in the ground is not environmentally friendly. If we were willing to let them rot that would be another matter.",
                            "score": 6,
                            "author": "ELEnamean",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jews are not supposed to be preserved, and are supposed to be in a linen shroud in a pine box. Not all burials are what you think they are.",
                                    "score": 3,
                                    "author": "AndShesNotEvenPretty"
                                },
                                {
                                    "level": 3,
                                    "comment": "You don't have to do that anymore.",
                                    "score": 1,
                                    "author": "No-Satisfaction1697"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am taking about those who die who have organs that can be harvested in time. I'm well aware this doesn't just work for everyone.\n\nThe dead don't care what you do to their body and it shouldn't be your choice what happens after you die. That's actually ridiculous. You don't matter when you're dead. Your wishes mean nothing, your opinion is mute and you have no voice. Heck most of us don't matter when we're alive even.",
                            "score": 2,
                            "author": "DankNucleus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But you matter to someone who has power of attorney so…",
                                    "score": 3,
                                    "author": "AndShesNotEvenPretty",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But their feelings don't matter. Power of attorney shouldn't lie with anyone emotionally connected after death. Before death, if you're on life support whatever, then let the people decide, but once they decide to pull the plug, the power moves to state, your body is collected and that's it.",
                                            "score": 0,
                                            "author": "DankNucleus"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Terrible take 👍🏻 Are you American?",
                    "score": 0,
                    "author": "mema2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "European. How is it so terrible to want to save lives? And this would save so many lives. So many..",
                            "score": 4,
                            "author": "DankNucleus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s easy to wax philosophical about all the lives saved, and I may get downvoted for this, but let’s be honest. There are neo-Nazis waiting on the transplant list. There are deadbeat parents. Wife beaters. Child abusers. Just because you need an organ doesn’t mean you are a good person and using your life for good.",
                                    "score": 0,
                                    "author": "AndShesNotEvenPretty",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Many that live deserve death. And some that die deserve life, can you give it to them? Then do not be too eager to deal out death in judgement.\n\n- Gandalf the Grey.",
                                            "score": 4,
                                            "author": "DankNucleus"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What you’re saying makes more sense knowing that you’re European, I’m being genuine. I’m American and we just have a much stronger sense of bodily autonomy, so what you said seemed so extreme to me. I do think it would do a lot of good, but I believe that letting people choose what happens to their own body is more important.",
                                    "score": -1,
                                    "author": "mema2000",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bodily autonomy after you are dead has to be a joke. It's not extreme because you're American, it seems extreme because it is. It goes against what everyone in modern society has grown up with and been thought, that we must respect everyone and their wishes and respect the dead. The greatest way to respect the dead imo is to let them save as many as possible. Letting people choose what happens to their corpses is ridiculous and one of the costliest affairs on the planet.",
                                            "score": 3,
                                            "author": "DankNucleus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean go off. Im an organ donor, but I don’t think it’s ok to forsake someone’s afterlife without their consent. I’m not religious at all, but I do respect that some people believe in that.",
                                                    "score": 1,
                                                    "author": "mema2000",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "How is forsaking their afterlife? You have to be joking right? We cremate people all the time, if that doesn't forsake their afterlife, collecting whatever healthy organ first would be no different.",
                                                            "score": 3,
                                                            "author": "DankNucleus",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No I’m not joking, some religious groups really do believe that remaining “whole” is a vital part of continuing to their afterlife. Usually, they make their wishes known before death. This is a big reason why forced cremation of Jewish bodies was a direct affront to the victims of the Holocaust, it was literally just another offensive way to treat Jews after their slaughter.",
                                                                    "score": 1,
                                                                    "author": "mema2000",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "And I believe that religion doesn't have a say in this. Anyone's faith is second place to the health and lives of everyone. This is the problem, people are too set in religious ways and we must adhere and respect people based on that. That in itself is a joke. The holocaust is a whole other topic. That was done in pure hate and disrespect, with no benefit to anyone. \n\nI'm just gonna say this tho, I oppose religious rights in society. Everyone should follow the same principles regardless of faith, but we have set specific rights and rules trying to please everyone. I'm not against having faith. Anyone is entitled to their religion, but religion has no place in the decisions of society as a whole.",
                                                                            "score": 1,
                                                                            "author": "DankNucleus",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "That’s a fucked way of thinking, but I’m glad you were able to get to the heart of your argument. Of course I agree that no one has the right to harm another in the name of their religion, but compelling people to “save” others with their flesh is an abominable thought.",
                                                                                    "score": 2,
                                                                                    "author": "mema2000",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What we have in America is companies feeding off the guilt of the relatives , to give their loved ones the best when they are gone. When my mom passed , she told me not to spend more than 150$ on an urn. She said that was ridiculous.And not to waste money on flowers. She wanted them when she was\nalive. I was much younger then and didn't understand just how practical she was being. Back in the 60-70s\nmedical schools would pre-pay you to leave them your body. Ah, the good ole days.",
                                            "score": 4,
                                            "author": "No-Satisfaction1697"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also coins. They have deep meaning to military personnel.",
            "score": 10,
            "author": "kerpwangitang",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was inspired by that post! I even gave it a little shout out 😅",
                    "score": 12,
                    "author": "mema2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But have you heard about coins?",
                            "score": 16,
                            "author": "blacklevv",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey you should know about coins",
                                    "score": 6,
                                    "author": "tuan_kaki",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You know, I have wares if you have coin",
                                            "score": 3,
                                            "author": "Bike_Chain_96"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "money has deep meaning to most people",
                    "score": 0,
                    "author": "John_Fx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should know this if you've ever watched Schindler's List. Even if you don't know specifically, you should know that it is wrong to disturb graves in any way. Even if you don't believe in any of the traditions/rituals/dogma around burials and graves, you should have enough respect for others to leave them alone.",
            "score": 2,
            "author": "movieguy95453",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was too young to have watched Schindlers List when I moved the stones without knowing. I thought I was being respectful by cleaning them off, but once I learned I put them back!",
                    "score": 2,
                    "author": "mema2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I guess I can see someone not having the life experience to understand the difference between random 'litter' and a purposeful tribute if the intent was just to clean off the grave. Part of a cemetery grounds keeper's job is to remove old flowers and other things which can deminish the sanctity of a grave.",
                            "score": 2,
                            "author": "movieguy95453"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just wondering how much of the viable planet surface we need to dedicate to the dead in the name of religion?",
            "score": -6,
            "author": "Fine-Thought3521",
            "replies": [
                {
                    "level": 1,
                    "comment": "I share your concern, but what does that have to do with taking coins off a headstone at an existing grave?",
                    "score": 6,
                    "author": "LainieCat"
                },
                {
                    "level": 1,
                    "comment": "Do atheists not get buried?",
                    "score": 2,
                    "author": "Snowsteak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Burial right being a cultural remnant of ..... R... Re... Rel...",
                            "score": 0,
                            "author": "Fine-Thought3521"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are you asking me? Because, uh… where else would we put dead people?",
                    "score": 1,
                    "author": "mema2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ocean, cremation, underground - but without huge areas dedicated for a century or longer to their memory, somehow bound to their bones.",
                            "score": 1,
                            "author": "Fine-Thought3521"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "LoL",
            "score": -11,
            "author": "No_Construction4954"
        },
        {
            "level": 0,
            "comment": "But I'm thinking why is it so??!! Why not flowers or anything that the deceased person liked??",
            "score": -9,
            "author": "Grouchy_Addendum_988",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seems there's lots of theories as to why. One simple reason could be that stones don't wither and they are easy to find.",
                    "score": 9,
                    "author": "yungrii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah that could be the very reason as to why tombstones  &amp; not made of concrete.. But in different cultures various things are offered to the deceased.. In India it's food, in Western cultures it's food &amp; flowers. The Egyptians offered cloth, perfume &amp; different exotic items.. But why the jews preferred stones over others..!! It could be an epithet but normal pebbles??",
                            "score": -4,
                            "author": "Grouchy_Addendum_988"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was always told that it had to do with how rocks are one thing that won’t rot or wither away like flowers or food. It’s a symbol that their memory and soul will remain as the rock will remain.",
                    "score": 9,
                    "author": "PlanetSchmanettJanet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think that flowers, food or any living or exotic things offered to the deceased's tomb is act of respect &amp; remembrance..Flowers are seeds of life..All these are organic in nature &amp; soon get stale &amp; die with time.. It's to show the phases &amp; process of life.. With this small beautiful token of gesture we show that though life has got to end but it's still culminating &amp; beautiful.. Life goes on.. On the other hand the Jews prefer to offer stones only.. It's a gesture of gratitude &amp; signify that life has the end . . They also participate  in the burial of mitzvah &amp;  show that the departed soul belongs to stones.. 🙂",
                            "score": -1,
                            "author": "Grouchy_Addendum_988"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One theory is that the “kosher” burial originally was to be laid on the ground and having earth and/or stones built on top of where the body would lay. Now most Jewish people (outside of Israel) are buried in coffins instead of directly into the earth, so this is one way to follow the mitzvah (kind of like a commandment).",
                    "score": 2,
                    "author": "mema2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "😊",
                            "score": 1,
                            "author": "Grouchy_Addendum_988"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It allows people to symbolically help bury the person and preserve their grave. It also doesn’t rot like a flower or food.",
                    "score": 1,
                    "author": "Sex_And_Candy_Here"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ysk- always leave the unopened Old Milwaukees on the graves! Those beers are not for yous! They are for my ole dead grandpa",
            "score": 1,
            "author": "PaMike34",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wish him crisp cold ones for the rest of his existence in the afterlife 🙏🏻",
                    "score": 1,
                    "author": "mema2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is all any man, woman, or other can ask.",
                            "score": 2,
                            "author": "PaMike34"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "and dont bring flowers you will upset the goyums",
            "score": -12,
            "author": "Haveuseenyoulately",
            "replies": [
                {
                    "level": 1,
                    "comment": "??? The goyim put flowers on graves all the time. Did I miss a joke here?",
                    "score": 4,
                    "author": "LainieCat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t think they know what goyim means, they just hear it and go “ooo funny Jewish word”",
                            "score": 3,
                            "author": "mema2000"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t care about some stupid religious bullshit.",
            "score": -2,
            "author": "ThoriumMaster",
            "replies": [
                {
                    "level": 1,
                    "comment": "Edgy",
                    "score": 2,
                    "author": "mema2000"
                }
            ]
        }
    ]
}