{
    "id": "13jj896",
    "score": 189,
    "title": "YSK: Double Up America connects you with markets that help your EBT stretch further",
    "author": "raptorclvb",
    "date": 1684275896.0,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/13jj896",
    "media_urls": [],
    "other_urls": [
        "https://doubleupamerica.org/)"
    ],
    "postText": "Why YSK: a lot of food insecure people are struggling to meet ends meet, even with EBT. [Double Up America](https://doubleupamerica.org/) shows you a list of farmers markets/grocery stores in your state that participate in the program, where they match your EBT dollars, allowing you to get access to more fresh produce at no extra cost to you. \n\nIt’s available in ~25 states.",
    "comments": [
        {
            "level": 0,
            "comment": "This is awesome, thank you so much for posting this. Already sending it to some of my peeps who use EBT",
            "score": 10,
            "author": "Bignamek"
        },
        {
            "level": 0,
            "comment": "What a great suggestion!",
            "score": 6,
            "author": "CampbellKitty"
        },
        {
            "level": 0,
            "comment": "Great idea, but in California, which is an enormous state, there are only three counties and very few places within them.  Maybe it's just getting going?",
            "score": 2,
            "author": "sfsolarboy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Perhaps. However, I looked at a farmers market in the area and their site mentions the [Market Match](https://seela.org/market-match/) program as well as the [GusNIP](https://www.nifa.usda.gov/grants/programs/hunger-food-security-programs/gus-schumacher-nutrition-incentive-program) program for LA county. I was not able to find information on GusNIP being statewide, but if you look into markets near you, perhaps there’s a similar program, or both these programs.",
                    "score": 3,
                    "author": "raptorclvb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's not even in my half of the state I live in.",
            "score": 1,
            "author": "karalmiddleton",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can also look into “food redistribution programs” for your state and that might yield some results for you",
                    "score": 6,
                    "author": "raptorclvb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you, I will look into it!",
                            "score": 3,
                            "author": "karalmiddleton"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's great to see programs that make healthy food more affordable!",
            "score": 1,
            "author": "RandomlyBrazenEnigma"
        },
        {
            "level": 0,
            "comment": "New Mexico is one of those states! Double-up food bucks at *all the local farmer's markets* in Albuquerque and elsewhere!",
            "score": 1,
            "author": "NCC-75633-A"
        },
        {
            "level": 0,
            "comment": "Yes! This is amazing and exactly what I was looking for! I just found a farmers market that will stretch my EBT and accept my WIC!",
            "score": 1,
            "author": "Automatic_Surround_5"
        }
    ]
}