{
    "id": "13jsb15",
    "score": 5603,
    "title": "YSK that a majority of cars in the US made since 2002 have a glow-in-the-dark handle that opens the trunk and is located inside of the trunk.",
    "author": "TheRealTengri",
    "date": 1684300675.0,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/13jsb15",
    "media_urls": [],
    "other_urls": [
        "https://www.ecfr.gov/current/title-49/subtitle-B/chapter-V/part-571/subpart-B/section-571.401"
    ],
    "postText": "Why YSK: So that if you get kidnapped and locked in a trunk, you realize how easy it is to get out compared to how movies make it seem.\n\nSource: https://www.ecfr.gov/current/title-49/subtitle-B/chapter-V/part-571/subpart-B/section-571.401\n\nEdit: If I was trying to help kidnappers, I would've put this on r/IllegalLifeProTips.",
    "comments": [
        {
            "level": 0,
            "comment": "A question: they are in the dark of the trunk. How do the phosphors get recharged? And yes I've seen the handle.",
            "score": 223,
            "author": "jfgallay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Someone please answer this question so I don't have to get inside my own trunk!",
                    "score": 104,
                    "author": "physarum9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don't have to get in your own trunk. You can get in mind. Just don't lie on the shovel or duct tape, not comfortable.",
                            "score": 21,
                            "author": "jfgallay",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You usually have to open the trunk to put something in it.",
                    "score": 56,
                    "author": "uncooked_macaroni",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah but the trunk will need to be open more than it's closed ?",
                            "score": 58,
                            "author": "MrAnonymousTheThird",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A tiny amount of Uranium would solve that problem. \nThe tiny amount necessary is absolutely benign but could make it glow for decades depending on the exact material composition and amount of Uranium used.",
                                    "score": 62,
                                    "author": "li7lex",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You don't need uranium. You can use those glowing tritium vials like they put on expensive flashlights (so you can find it in the dark to turn on) or some gun sights (so you can still aim in complete darkness). Those are completely harmless.",
                                            "score": 74,
                                            "author": "Elriuhilu",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;so you can still aim in complete darkness\n\nBut what are you aiming at?",
                                                    "score": 46,
                                                    "author": "dlove67",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\\&lt;X-Files theme plays\\&gt;",
                                                            "score": 30,
                                                            "author": "Elriuhilu"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The darkness, duh! /s",
                                                            "score": 7,
                                                            "author": "korsair25",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You don't need sights for magic missile",
                                                                    "score": 3,
                                                                    "author": "resonantSoul"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The burglar in your house with a flashlight.",
                                                            "score": 2,
                                                            "author": "Syn2108"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I put one of those in a model kit so it looked like the cannon was about to fire",
                                                    "score": 4,
                                                    "author": "C-C-X-V-I",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Gundam Gunpla?\n\nIf so, what kit?",
                                                            "score": 2,
                                                            "author": "THE_FREEDOM_COBRA",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They can release small amounts of radioactive material if the glass case is broken though.",
                                                    "score": 1,
                                                    "author": "Chesterrumble",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes, but the amount of gas in the vial is tiny plus it's a weak source of radiation so even if you somehow break a vial it's completely negligible. Beta radiation can be dangerous, but it depends on the energy of the particles and it's mainly if you ingest or inhale the emitter. In tritium's case the beta particles are low energy, meaning they don't penetrate the skin very much, so the main danger would be inhalation, but you would need to inhale the contents of hundreds (perhaps thousands) of vials on purpose for it to harm you.",
                                                            "score": 1,
                                                            "author": "Elriuhilu"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was thinking the same thing!! LOL",
                    "score": 9,
                    "author": "MsCndyKane"
                },
                {
                    "level": 1,
                    "comment": "I’m not an expert on the subject, but I was under the impression that these handles were made with trace amounts of radium so they could glow consistently",
                    "score": 3,
                    "author": "TheAnythingGuy"
                },
                {
                    "level": 1,
                    "comment": "A lot of trunks have a light that turns on when the trunk is open. That might do it. Otherwise hope there was outside light when the trunk was opened.",
                    "score": 1,
                    "author": "warpigz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s why I love my Toyota Corolla 1998!",
            "score": 1583,
            "author": "Carrot_Lobbyist",
            "replies": [
                {
                    "level": 1,
                    "comment": "*slaps hood*\n\nThis baby can hold so many babies",
                    "score": 149,
                    "author": "misterpickles69"
                },
                {
                    "level": 1,
                    "comment": "r/holup",
                    "score": 405,
                    "author": "Guywithoutimage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "r/nahkeepgoing",
                            "score": 106,
                            "author": "CatLover_801",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[̲̅$̲̅(̲̅5)̲̅$̲̅]",
                                    "score": 13,
                                    "author": "toinfinitiandbeyond"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "FBI OPEN UP",
                    "score": 14,
                    "author": "Sir-Simon-Spamalot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can't! (no handle)",
                            "score": 14,
                            "author": "Userm4x1"
                        },
                        {
                            "level": 2,
                            "comment": "I can't, there's no handle on the inside of this trunk",
                            "score": 5,
                            "author": "Theleming",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Criminal. Good thing i removed that first.\n\nStill protects against children locking themselves in the trunk as long as you don't remove or disable this feature.",
                                    "score": 3,
                                    "author": "thebudman_420"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "1990 Camry here 🤣 I should probably find out if I can even open it from the inside",
                    "score": 10,
                    "author": "michjames1926",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do not do it alone! I repeat, do NOT do it alone!",
                            "score": 21,
                            "author": "wolfpwner9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Too late.",
                                    "score": 10,
                                    "author": "Ok-Design-4561"
                                },
                                {
                                    "level": 3,
                                    "comment": "Haha, solid advice 🤣",
                                    "score": 2,
                                    "author": "michjames1926"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Your boyfriend sounds exciting",
                    "score": 20,
                    "author": "AbideMan",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "lol",
                    "score": 8,
                    "author": "rheetkd"
                },
                {
                    "level": 1,
                    "comment": "It can fit so many dead hookers",
                    "score": 1,
                    "author": "Kalkaline"
                },
                {
                    "level": 1,
                    "comment": "r/jesuschristreddit",
                    "score": 1,
                    "author": "Legitimate-Quote6103"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I also heard most of them also have a weak point where the tail light is so you can kick out the taillight so someone will know you're in there. It was recommended to do this when the car is moving so other vehicles could call it in.",
            "score": 374,
            "author": "squidwardTalks",
            "replies": [
                {
                    "level": 1,
                    "comment": "there was a story where somebody got to the tail light and made the bulb blink and sombody thought it suspicious. but no this is not a design feature sure maybe some could be kicked out but i can assure you this is just because of cheapness not by design.",
                    "score": 218,
                    "author": "probono105",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right?\nEver change a tail light bulb? They're bayonet twist lock, and the assembly is held together using clips. So kick it out and stick your hand out. You'll need to untie yourself first. \n\nYiu cannot make the light blink. The voltage to it is controlled by the break pedal switch. \n\nBut it might be more evident that someone is in a trunk if you just open the trunk while going down the highway and wave drivers for help.",
                            "score": 95,
                            "author": "Euphoric-Blue-59",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ever change a taillight bulb on a Nissan rogue?  You gotta remove the ENTIRE light assembly from the outside. Worst design I’ve ever seen. Granted, it’s not a trunk. But awful nevertheless.",
                                    "score": 33,
                                    "author": "orange_antelope",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As a owner of a Rogue who hasn't changed a bulb yet... fuck",
                                            "score": 12,
                                            "author": "BrockN",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Odds are the car won't last long enough to worry about that.",
                                                    "score": 16,
                                                    "author": "C-C-X-V-I",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": ":(",
                                                            "score": 5,
                                                            "author": "BrockN"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They make it sounds like a big deal but it's the same as a RAV4 it takes 2 10mm fastener and 30 seconds to remove the light",
                                                    "score": 2,
                                                    "author": "TheDevilPhoenix"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'd say I'm more suprised at Nissan still using incandescent bulbs in a car these days, but seeing the corners cut on my q60 I'm not really suprised.",
                                            "score": 4,
                                            "author": "C-C-X-V-I"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As a former Nissan owner, fuck Nissan - they do not care about making anything serviceable.",
                                            "score": 2,
                                            "author": "DamnIHateThat"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hah! Wow, well, I'd never buy a Nissan anyway. That's crazy!\n\nI changed all my lights on my Toyota Camry, Ann twist lock in place.",
                                            "score": 1,
                                            "author": "Euphoric-Blue-59"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;break \n\nBrake.  Also there's more than one car out there, not all are designed the same and I've never actually come across an assembly with clips.  A lot of them have voltage at the back that you could tap into, and constant 12v with ground switching is more common than you think on cars.  It's not the best choice by far but it's certainly not outside the realm of possibility in something older.",
                                    "score": 9,
                                    "author": "C-C-X-V-I",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ok, haha, thanks for the correction. Good points too. Some cars supply the voltage, some supply the ground. Toyota provides the voltage. I had a bad bulb and put meters on all of the connections and downloaded the schematics.  \n\nIn any case,\nI still say opening the trunk seems more practical... I'd your hands are free.",
                                            "score": 1,
                                            "author": "Euphoric-Blue-59",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You think that's why I said this isn't the best option?  Correcting misinformation isn't a personal attack, chill.\n\nEdit: hell of a tone change there post edit.",
                                                    "score": 2,
                                                    "author": "C-C-X-V-I",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You may have misinterpreted my thank you for being insincere.  I just thanked you. Sincerely.\n\nSo, accept a thanks when you get it. It's a fucking autocorrect that did it anyway, and i just didnt catch it. I don't take anything personally. I also agrees with you 100%\n\nGo get a cup of coffee and enjoy this nice sprung weather. The internet is getting to you.",
                                                            "score": -1,
                                                            "author": "Euphoric-Blue-59"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In theory you could make it blink by loosening the connection and wiggling. But like you said it would be both more effective and less effort to just kick it out altogether and stick your hand through anyway",
                                    "score": 6,
                                    "author": "-DoctorSpaceman-",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There’s this crazy story \n\nhttps://amp.abc.net.au/article/13119822",
                            "score": 29,
                            "author": "No_Rope_2126",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dont use amp link.  \n    \nhttps://www.abc.net.au/news/2021-02-04/nsw-two-women-charged-after-woman-discovered-in-boot/13119822",
                                    "score": 12,
                                    "author": "xswatqcx"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Never attribute to thoughtfulness that which is adequately explained by cheapness.",
                            "score": 5,
                            "author": "YouToot"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I remember seeing that in Psych.",
                    "score": 16,
                    "author": "LoveLaika237"
                },
                {
                    "level": 1,
                    "comment": "Henry Spencer?!",
                    "score": 7,
                    "author": "Bunselpower"
                },
                {
                    "level": 1,
                    "comment": "Let’s say a kidnapper throws you in the back of a trunk. Don’t panic. Once you get your bearings, find the carpet that covers the taillight, peel back the carpet, make a fist, punch the taillight out the back of the car, thus creating a hole in the back of the automobile, then stick your little hand out and wave to oncoming motorists to let them know that something hinky is going on.",
                    "score": 19,
                    "author": "Bobcatluv"
                },
                {
                    "level": 1,
                    "comment": "Yep my mom showed me how to get to the taillight on her 1990 Dodge Dynasty when I was little. It involved ripping back the felt padding and pushing a hand through the taillights housing, though I couldn't pop it off.",
                    "score": 5,
                    "author": "Blackfeathr"
                },
                {
                    "level": 1,
                    "comment": "With most new cars having LED taillights, that tidbit is not so useful anymore.",
                    "score": 2,
                    "author": "GeckoDeLimon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Curious. How is it going to get the 'charge' to actually glow in the dark if the trunk is closed most of the time?",
            "score": 185,
            "author": "Vyzantinist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely. Trunks are open for only a few minutes at a time. And that light is indirect at best.",
                    "score": 49,
                    "author": "Euphoric-Blue-59",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a kid I trapped myself in a trunk one time because I thought it would be fun to try and get into the passenger compartment by pushing the backseat seat down from the trunk I can confirm that the glow in the dark function works perfectly.",
                            "score": 54,
                            "author": "Dredgeon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good to know. I see you lived to tell about it\nBut as a kid, the trunk most likely was open for a bit. \nEven at night, while the trunk is open, typically there is a light. It don't need to be visible for days... let's hope right?",
                                    "score": 9,
                                    "author": "Euphoric-Blue-59"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The law says it just has to have *some* sort of lighting feature so it could be a regular light too.",
                    "score": 110,
                    "author": "Fjorge0411"
                },
                {
                    "level": 1,
                    "comment": "Probably a long lasting fluorescent pigment",
                    "score": 14,
                    "author": "SneakyDeaky123"
                },
                {
                    "level": 1,
                    "comment": "Is there a technology to charge \"glow-in-the-dark\" substances using electricity, or is it always light?",
                    "score": 3,
                    "author": "sje46",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "When they open it to put you in it...the light 'charges'.",
                    "score": 2,
                    "author": "Georgep0rwell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What if it's night?",
                            "score": 5,
                            "author": "dinomelia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then a dracula will probably get you.",
                                    "score": 5,
                                    "author": "_haha_oh_wow_"
                                },
                                {
                                    "level": 3,
                                    "comment": "Note to self:  Reschedule all kidnapping to nighttime.",
                                    "score": 1,
                                    "author": "Georgep0rwell"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Maybe it's simply connected to the internal car battery?",
                    "score": -10,
                    "author": "ozzeruk82"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Actually noticed this from inside a trunk",
            "score": 28,
            "author": "KimchiiCrowlo",
            "replies": [
                {
                    "level": 1,
                    "comment": "An elephant’s trunk I am inclined to believe that is?",
                    "score": -10,
                    "author": "StrawberryBitchcakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm pretty sure if someone has gone far enough to kidnap me and lock me in a trunk they'll have\n\n1. disabled/removed this lever\n\n2.  bought a car without it\n\nOr\n\n3. Tied and blindfold me so I can't see or manipulate it",
            "score": 350,
            "author": "other_usernames_gone",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think you overestimate the intelligence of an average individual   \nAfter my foray in true crime podcasts, the average individual is still leaps and bounds more intelligent than most of these idiots",
                    "score": 18,
                    "author": "pacothetac0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be fair you only hear the stories that fail",
                            "score": 7,
                            "author": "RRumpleTeazzer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was more thinking of the people that bumbled their way through the first murder, and ended up racking up multiple kills through dumb luck Or things like wrong color or make of vehicle claimed to have been witnessed detailing the investigation, or just Police laziness or ineptitude. \n\nDuring his killing spree, Charles Starkweather repeatedly got cars stuck in the mud returning to the ranch they had hid out.    \nWhen buying more ammo, suspicious clerk called the cops about two suspicious teenagers. Despite an APB out for two teenagers who killed a family earlier that week, Police didn’t care. \n\nOfficers gave back a naked and bloody 14 year old boy back to Jeffrey Dalmer after neighbors called the cops after seeing the intoxicated boy outside.",
                                    "score": 2,
                                    "author": "pacothetac0"
                                },
                                {
                                    "level": 3,
                                    "comment": "The ones that fail for reasons like not disabling the trunk escape lever?",
                                    "score": 2,
                                    "author": "resonantSoul"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The lever was mandated after political activism of a couple who escaped a trunk during a kidnapping. I’ll trust them",
                    "score": 161,
                    "author": "jwill602",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's also valuable for kids being stupid. When I was growing up there was a locally famous case of a kid who was shut in the trunk for a game he and his friends were playing. They couldn't get him out. It was a hot day and these kids didn't understand convection. A couple years before Punky Brewster's fridge episode. Anyway, by the time they were brave enough to tell an adult (since parents in the 80's didn't know any parenting beyond \"punish until your eyes bleed\", they were afraid of getting in trouble), the kid had been in there awhile and suffered massive brain damage. He survived, but his parents were vocal in the press for years about the need for escape handles (and teaching your kids about the dangers of locking friends into spaces for a game, of course).",
                            "score": 21,
                            "author": "catiebug",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is honestly probably why it was designed in the first place.",
                                    "score": 1,
                                    "author": "SaraAB87"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's only so much designing you can do against a wrench and time. The kidnappers have as much time as they want and whatever tools they want.\n\nIt's not like they're master engineers because they escaped a trunk during a kidnapping.\n\nThe lever would be useful if you get accidentally trapped in the trunk, not so much if you get kidnapped.",
                            "score": 101,
                            "author": "other_usernames_gone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As long as the kidnappers dont see this ama were good. So dont forward this to any kidnappers.",
                                    "score": 18,
                                    "author": "ncsbass1024",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Too late, I printed this whole post 74 times and am mailing it to all my kidnapper friends tomorrow. Your days are numbered. See you soon 😘",
                                            "score": 17,
                                            "author": "ShotenDesu"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You'd be surprised how bad people who kidnap people, think things through.\n\nOr maybe not surprised if you yourself thought about it. Lol",
                                    "score": 104,
                                    "author": "squanchingonreddit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah if you're resorting to kidnapping, chances are you're on the back of a chain of 20 or so stupid and poorly thought out decisions.",
                                            "score": 56,
                                            "author": "GlassHalfSmashed"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Oh, this won't work on every case so we just shouldn't bother!\"\n\nDo you realize how wrong that idea sounds? If it helps at least one person it's worth it, and for the situations where it doesn't work, you find more ways to help.",
                                    "score": 28,
                                    "author": "TellTaleTank",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's just weird to bill it as a kidnapping prevention mechanism when it really isn't. It's an if you get accidentally trapped in the trunk mechanism.\n\nKidnapping is super rare and even when it does happen there's a very good chance the person will be bound and blindfolded. Or unconscious.\n\nThis is only actually useful for kidnapping in a very small subset of cases.",
                                            "score": 3,
                                            "author": "other_usernames_gone",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "“There’s a very good chance the person will be bound and blindfolded”\n\nI mean do you know this or are you just making an assumption here? Seems to me many cases of kidnapping are done quickly and the kidnapper wouldn’t have time to securely bind and blindfold all their victims",
                                                    "score": 12,
                                                    "author": "Correct_Curve_2732",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Who's kidnapping someone and not securing them somehow? How would you kidnap someone without tying them or knocking them out?\n\nIf they needed to do it quickly they'd probably use a van rather than a car. Or hit you on the head with a big stick so you're unconscious, then they have all the time they need to tie you up.",
                                                            "score": -5,
                                                            "author": "other_usernames_gone",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Again you’re making assumptions here. Plenty of stories of people being kidnapped by just being shoved into a trunk. \n\nAnd knocking someone out doesn’t work like it does in the movies. You have a matter of minutes before the person gain consciousness again. They’re not out for hours or “all the time they need” Lol  not to mention they need to actually put the kidnapped victim in the trunk, hard to do if they’re just nabbing someone from a mall or parking lot or whatever.\n\nYou’re just making up scenarios in your head and acting like that’s the reality. All based on movie scenes. You don’t actually know what you’re talking about",
                                                                    "score": 10,
                                                                    "author": "Correct_Curve_2732",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Knocking out depends. Sometimes you're out for minutes, sometimes it's hours. Good thing we have this big stick handy in case they wake up too early. They'll have huge amounts of brain damage but presumably you wouldn't care.\n\nHow exactly are you kidnapping someone just by stuffing them in a trunk? They'd kick out whenever you let go and try to jam you from closing the boot and shout out the whole time.\n\nYou need to restrain them somehow to kidnap them long term.\n\nSimilarly if you're doing it quickly how are you stuffing them in a trunk? A van would be much better suited, especially because you can then hold them down and tie them up in the back of the van.\n\nEdit:\nFor the lever to be even vaguely useful you need to be conscious, untied and non-blindfolded. Who's kidnapping someone and misses all of these?",
                                                                            "score": -4,
                                                                            "author": "other_usernames_gone",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "If someone gets knocked out for hours, they've got bigger problems than being kidnapped.",
                                                                                    "score": 10,
                                                                                    "author": "TheSeldomShaken"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "For them to be knocked out for hours, wouldn't you have to injure them pretty severely?",
                                                                                    "score": 3,
                                                                                    "author": "manys",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You are making the assumption that all criminals plan their crimes out and would have thought of this.  What you said might be the case for organized crimes, people who have kidnapped a few times in their lives and know what the possible issues are.  \n\nBut most criminals aren't that intelligent.  Many don't plan things out, at all.  I don't think kidnapping is as common as people say, but when it does happen, it happens because of something unexpected (another crime gone wrong).  \n\nYou can google \"kidnap escape from trunk\" to see a few cases of people whose lives were saved likely because of this law.\n\nI don't know why you're dying on this hill.",
                                                    "score": 4,
                                                    "author": "sje46"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Also the person controlling the vehicle is going to remove ways for your escape. Such as this handle. It's just for the children who haven't learned not to get in the truck and close it.",
                                                    "score": 1,
                                                    "author": "thebudman_420"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You're assuming that they'd be super kidnappers",
                                    "score": 2,
                                    "author": "manys"
                                },
                                {
                                    "level": 3,
                                    "comment": "Agreed! 100% \n\nEven the stupidly-simple work around of wrapping the glowing bit in black duct-tape a few times and the. shoving it inside the deadspace of the metal nearby would hinder most panicking people.",
                                    "score": 3,
                                    "author": "Samilynnki"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You overestimate the intelligence of criminals. I'm sure this has already saved a few people.",
                    "score": 5,
                    "author": "DivineJustice"
                },
                {
                    "level": 1,
                    "comment": "Only if it's pre-meditated.",
                    "score": 3,
                    "author": "Firevee",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The first two give too much forethought to kidnappers.\n\n#3 is more likely. You're just doomed.",
                    "score": 3,
                    "author": "Euphoric-Blue-59"
                },
                {
                    "level": 1,
                    "comment": "I'm not important enough to get kidnapped by the kind of people to know how to take the proper kidnapping precautions to prevent me from escaping the trunk. My kidnapper is more likely to be a dumbass on crack who also stole my car and doesn't realize i'm napping in the backseat.",
                    "score": 3,
                    "author": "agabagadagabobaga"
                },
                {
                    "level": 1,
                    "comment": "Damn you must think a lot about yourself to assume still being alive",
                    "score": 5,
                    "author": "AbideMan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair point. More likely they'd just kill you first.\n\nAlthough then it's not a kidnapping, it's a murder.",
                            "score": 5,
                            "author": "other_usernames_gone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Way less risky than a flopping barracuda in the trunk",
                                    "score": 3,
                                    "author": "AbideMan"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don't underestimate the stupidity of criminals. Most of them aren't criminal mastermind.",
                    "score": 2,
                    "author": "edaduas"
                },
                {
                    "level": 1,
                    "comment": "I don't know why someone would think of this, especially if you're the kind of person to kidnap someone. I would be surprised if even 1% of people planned for that.",
                    "score": 2,
                    "author": "SvenyBoy_YT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was shocked when I watched Nobody on Netflix and its the first film I have seen where it shows the boot being able to be opened from the inside",
            "score": 11,
            "author": "GinPatch",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you, I was trying to think where I had seen that recently",
                    "score": 4,
                    "author": "Lasdary"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a friend who was car jacked, stabbed, and left in the trunk of her car when it was set on fire. She got out - and survived - by popping the trunk from the inside.",
            "score": 13,
            "author": "Small_Pleasures"
        },
        {
            "level": 0,
            "comment": "You should know: \n\n\nIf you ever find yourself trapped in a vehicle ( like submerged in/under water), you can pop off your headrest &amp; use the metal prongs to bust out the windows/ windshield... 🤷🏽‍♀️",
            "score": 14,
            "author": "miltf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also - the weakest point of most glass is where it is secured - not at the middle. Break windows at the edges where the glass cannot flex and will shatter instead.\n\nThe things you get trained on now when you work in schools in the US",
                    "score": 5,
                    "author": "SulkyVirus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The tailgate on my truck was locked, so I waited for the sun to go down so I could find this handle when it started glowing. I had zero luck. If you are stuck in the trunk of a pickup, I recommend just climbing over the side.",
            "score": 43,
            "author": "DastardlyDirtyDog",
            "replies": [
                {
                    "level": 1,
                    "comment": "One of my many moments of shame: \n\nI was cleaning my SUV after using it to haul a bunch of stuff, and had to wipe down the inside of the hatch. It was a PITA to try to reach up to do it, so I climbed in the back and closed the hatch. Finished it up and for the first time, I noticed there wasn’t a handle on the inside. \n\nMy immediate reaction was: I’m locked in the trunk. \n\nThen I realized how much of a dip I am, and crawled over the seats. \n\nWould it have been nice if there was a latch? Yeah. Is it necessary? No…",
                    "score": 4,
                    "author": "muddyrose"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember a study at the time where little kids thought glowing meant \"hot\" and wouldn't reach for the handle to escape.",
            "score": 20,
            "author": "21_MushroomCupcakes",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's dark",
                    "score": 4,
                    "author": "BigFatBlackCat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's why you snip the wire handle before kidnapping.",
            "score": 9,
            "author": "GruntSyCi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of them just pop off",
                    "score": 4,
                    "author": "C-C-X-V-I"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For people who end up getting stuck in trunk:\n\n\"Im trapped in a trunk and there is a glow in the dark handle.  Of course, I am going to pull on it\"\n\nFor people who trap people in trunks:\n\n\"Noted.  Now I will disable it!\"",
            "score": 5,
            "author": "adams_mike333"
        },
        {
            "level": 0,
            "comment": "On our certified used car inspections, that is one of the 160 things we're supposed to check. The first one I ever checked was broken, and the next thousand have all worked perfectly.  And for those asking how it's illuminated, it's just glow in the dark plastic.",
            "score": 6,
            "author": "krunkytacos"
        },
        {
            "level": 0,
            "comment": "How will a glow in the dark handle charge up in a trunk?",
            "score": 2,
            "author": "starion832000",
            "replies": [
                {
                    "level": 1,
                    "comment": "USB",
                    "score": 7,
                    "author": "turbo_dude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah of course. How silly of me.",
                            "score": 8,
                            "author": "starion832000"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So make sure to open your trunk daily to charge the glow, or don’t if you a bad guy.",
            "score": 5,
            "author": "Ck1ngK1LLER"
        },
        {
            "level": 0,
            "comment": "How can it glow in the dark if it has no sunlight to absorb all the time?",
            "score": 3,
            "author": "Dumbassahedratr0n",
            "replies": [
                {
                    "level": 1,
                    "comment": "One way it could is if it's powered by radiation, like from tritium, but I don't know if any of them are or not.",
                    "score": 3,
                    "author": "radditor7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Spiderman intensifies](https://m.youtube.com/watch?v=BfsMNtIDWbc)",
                            "score": 1,
                            "author": "Dumbassahedratr0n"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Glow stuff can work pretty decent in pitch black conditions once your eyes adjust. Trunk lights can give it a minor charge.",
                    "score": 1,
                    "author": "Iforgotmyother_name"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean if you’re locked in the trunk you’re going to see it. This really helps the people that are going to kidnap someone so they know to cut it off lol",
            "score": 3,
            "author": "narwaffles"
        },
        {
            "level": 0,
            "comment": "I have never ever seen one and I have driven dozens of models since 2002.",
            "score": 7,
            "author": "analbumcover69420"
        },
        {
            "level": 0,
            "comment": "Surely you would discover this while sitting in the trunk pondering your existence? \n\nDo people really need to be told to look at something that is glowing when they are in a dark enclosed area?",
            "score": 3,
            "author": "Apidium"
        },
        {
            "level": 0,
            "comment": "glow in the dark handle\n\ninside the trunk\n\nwhere it gets no light and so won't glow",
            "score": 3,
            "author": "Zooshooter"
        },
        {
            "level": 0,
            "comment": "There also usually a bunch of shotguns and stuff back there, too.\n\n/source ; I have watched american films",
            "score": 2,
            "author": "Chelecossais"
        },
        {
            "level": 0,
            "comment": "*takes notes* must.. occur.. at night..",
            "score": 2,
            "author": "TypicalViking"
        },
        {
            "level": 0,
            "comment": "What a world we live in to need glow in the dark kidnap trunk release handles.",
            "score": 2,
            "author": "spyderspyders",
            "replies": [
                {
                    "level": 1,
                    "comment": "This isn't really a problem in the civilised world.",
                    "score": 1,
                    "author": "ThatMakesMeTheWinner"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t glow in the dark surfaces require a period of exposure to direct light in order to “glow”?",
            "score": 2,
            "author": "Nitroburner3000"
        },
        {
            "level": 0,
            "comment": "Now all the kidnappers know. Way to go dude.",
            "score": 4,
            "author": "TheWalrus101123"
        },
        {
            "level": 0,
            "comment": "Seems like something you *dont* need to know cause if you did get kidnapped then you'd see the glow in the dark handle, regardless of your previous knowledge of its existence.",
            "score": 4,
            "author": "SheriffHeckTate",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are people out there who wouldn't pull it because they didn't know what it did.",
                    "score": 3,
                    "author": "C-C-X-V-I",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So your argument is that they'd just lay their docilly for fear of accidentally damaging their kidnappers car?",
                            "score": 1,
                            "author": "SheriffHeckTate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No. I dont think theyd be worried about that. Im questioning if that is what you believe because you said that if people didnt know what the lever did ahead of time then they wouldnt pull it. Hence my assumption that YOU think they would be worried about damaging the car.",
                                            "score": 1,
                                            "author": "SheriffHeckTate",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How many of those vehicles have you been trapped in the trunk by someone who is kidnapping you and you are desperately looking for a way out? I'm assuming none, but in the unlikely even that it has happened to you, and you saw this glowing handle in the dark then would you pull it or just sit there cause you didnt know what it did?",
                            "score": 1,
                            "author": "SheriffHeckTate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not saying it's bad or harmful. I'm saying it's isnt helpful. It's a fact, but reading this thread is likely to have no effect on the life or safety of anyone who reads it.",
                                            "score": 2,
                                            "author": "SheriffHeckTate"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YSK that the majority of cars used to kidnap people likely have this handle removed. Probably. Also, glow in the dark needs time to recharge, so... Where is the glow coming from?\n\nSource: I made it the fuck up.",
            "score": 3,
            "author": "sufferingplanet",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;YSK that the majority of cars used to kidnap people likely have this handle removed\n\nWhy is that likely?  Criminals are often pretty fucking stupid.\n\nIf it's the mexican cartel kidnapping you, they probably checked things through.",
                    "score": 3,
                    "author": "sje46",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Check my source, it explains everything.",
                            "score": 2,
                            "author": "sufferingplanet"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's also a great way to great way to get into crown vic's in junk yards. Smash out the pass side taillight in the middle of the housing, put your hand thew the hole and reach around for the pully thing. Truck opens.",
            "score": 2,
            "author": "Lazy_Preference3418",
            "replies": [
                {
                    "level": 1,
                    "comment": "Makes complete and total sense to me!!",
                    "score": 1,
                    "author": "StrawberryBitchcakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For some reason my S-10 doesn't have this feature...",
            "score": 1,
            "author": "PURPLEPEE"
        },
        {
            "level": 0,
            "comment": "If I was going to kidnap someone I'd check for this. If the car I was gonna use had one I'd clip the cable then tie the glow in the dark handle to a piece of sheet metal that would be affixed to the car. So when they pulled on it it'd make a loud sheet metal sound letting me know they're awake and/or managed to get untied. The metal sound might give them the impression the trunk is almost opening inspiring them to pull it more vigorously. I may even glue a razor or nail under the handle so they'd cut themselves trying to pull it (depending how much I wanted to hurt them or be okay with the car getting blood on it). I'd also put some razor wire or a wood block behind the lights in the trunk. I've heard if you're in a trunk you can knock out the lights and use the newly created hole to seek help. Not sure how accurate it is but might as well make it a little harder to accomplish.",
            "score": 1,
            "author": "OhTheHueManatee"
        },
        {
            "level": 0,
            "comment": "Thanks I’ll remember to cut the cable\n\n(Why the fuck is this a “you should know”?)",
            "score": -1,
            "author": "631-AT"
        },
        {
            "level": 0,
            "comment": "If I get kidnapped, I'm just joining them.",
            "score": 1,
            "author": "Euphoric-Blue-59"
        },
        {
            "level": 0,
            "comment": "“Glow in the dark” things only glow for a few minutes after having light shined on them.",
            "score": 1,
            "author": "Uranus_Hz"
        },
        {
            "level": 0,
            "comment": "This is exactly what i would tell someone if i wanted to kidnap them",
            "score": 1,
            "author": "penis-coyote"
        },
        {
            "level": 0,
            "comment": "Yes I know my 2016 bmw 528 has that! Very cool.",
            "score": 1,
            "author": "yesorno12138"
        },
        {
            "level": 0,
            "comment": "When I was a kid, I had a plan for in case of kidnapping.\n\nPut my current phone in my right pocket and another phone in my left pocket.\n\nIf I were kidnapped, the kidnappers would take one of the phones but wouldn't think to take the other. So I'd call 911 with the other phone and tell the kidnappers \"hey I'm getting hungry. Can we stop at that McDonald's over there? OK, maybe that Subway, then? 7-11's fine, too. Oh by the way, this is a nice Toyota\" in the hopes that 911 can get some information about where I am.",
            "score": 1,
            "author": "Comprehensive-Ad3963"
        },
        {
            "level": 0,
            "comment": "I'd bet this has already made its way to illegall pro tips lol",
            "score": 1,
            "author": "snafe_"
        },
        {
            "level": 0,
            "comment": "The older cars were a lot tougher to get out of, and I suspect real bad guys disable those....",
            "score": 1,
            "author": "Difficult_Pay_1751"
        },
        {
            "level": 0,
            "comment": "I remember seeing one of these in my grandmother's car when I was loading or unloading the trunk. I asked her what it was, and she explained it to me pretty well.\n\nI mean, she didn't specifically mention kidnapping, because I was like 5 years old, but the general idea was still there.",
            "score": 1,
            "author": "OptimusPhillip"
        },
        {
            "level": 0,
            "comment": "What I've always wondered about those things is don't most glow in the dark things need to be charged by light? The trunk of a car doesn't get much light. They're generally not left open for light to shine in. So how do they glow?",
            "score": 1,
            "author": "OhTheHueManatee",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But where does the light to charge them come from? Trunks tend to be dark.",
                            "score": 1,
                            "author": "OhTheHueManatee"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should also know that some batteries are in the trunk. \n\nYou should also know that the 2010 dodge challenger doesn’t have a keyed entry to the battery, only a little battery operated button. \n\nFinally, you should know that the back seats fold down and you can pull this to gain access. \n\nDon’t ask me how I know this.",
            "score": 1,
            "author": "Relign"
        },
        {
            "level": 0,
            "comment": "I see you saw that tiktok too and decided to use it",
            "score": 1,
            "author": "Ok-Amphibian5196"
        },
        {
            "level": 0,
            "comment": "Not if they take it out before hand lol",
            "score": 1,
            "author": "phoenixblaqk"
        },
        {
            "level": 0,
            "comment": "Or maybe you shouldn't know this.\n\nIf you get locked in a trunk, the lever will be pretty obvious. It glows in the dark, after all.\n\nIf you are locking people in trunks, you might not have known, allowing your victims to escape. Now that you know, you can disable it.",
            "score": 1,
            "author": "CornerOk3299"
        },
        {
            "level": 0,
            "comment": "STREET SMARTS!",
            "score": 1,
            "author": "NationalSafe4589"
        },
        {
            "level": 0,
            "comment": "The same car industry that fought tooth and nail to avoid adding airbags, seatbelts and bumpers.",
            "score": 1,
            "author": "happyhorse_g"
        },
        {
            "level": 0,
            "comment": "I've only ever heard of people refer to this handle as \"the sopranos handle\"",
            "score": 1,
            "author": "FuriouslyListening"
        },
        {
            "level": 0,
            "comment": "If someone throws me in the trunk you better believe I'm cropdusting them before I make my escape: I'll even fold the seat down and be like, \"Hey, guess what?\"\n\n*toot*\n\n\"That's for you. Kbai!\"",
            "score": 1,
            "author": "_haha_oh_wow_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That’s why I paint them. I wouldn’t want my kids getting out.",
            "score": 1,
            "author": "bitenmein1"
        },
        {
            "level": 0,
            "comment": "Slight correction: this is Federally mandated, so it is for *all* (not a majority of) passenger cars sold in the US.\n\nhttps://www.federalregister.gov/documents/2000/10/20/00-27038/federal-motor-vehicle-safety-standards-interior-trunk-release",
            "score": 1,
            "author": "nosecohn",
            "replies": [
                {
                    "level": 1,
                    "comment": "All passenger cars, but that doesn't mean all cars in general, meaning most cars are like this.",
                    "score": 1,
                    "author": "TheRealTengri"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It was for children who might trap themselves",
            "score": 1,
            "author": "ineedatinylama"
        },
        {
            "level": 0,
            "comment": "YSK that since 2015 rear view cameras have been a requirement for consumer cars in the US as a safety feature. Do not think that it's a feature that you should be marketed on.",
            "score": 1,
            "author": "SulkyVirus"
        },
        {
            "level": 0,
            "comment": "I've discovered mine was broken. To be fair the entire truck latch mechanism was fucked at that time, you could open the trunk when the car was locked.",
            "score": 1,
            "author": "paganisrock"
        },
        {
            "level": 0,
            "comment": "That’s why I love diagonal cutters.",
            "score": 1,
            "author": "poop_helper"
        },
        {
            "level": 0,
            "comment": "K but my car has power locks... so when the battery dies will it be able to open?",
            "score": 1,
            "author": "Jazzlike-rhubarb"
        },
        {
            "level": 0,
            "comment": "and if you are drowning remember to swim in an upwards direction",
            "score": 1,
            "author": "John_Fx"
        },
        {
            "level": 0,
            "comment": "You could pop a trunk from the inside pretty easily before that as well, but that made it easier.",
            "score": 1,
            "author": "Grace_Alcock"
        },
        {
            "level": 0,
            "comment": "I just cut that off with wire cutters when I buy it.  Works wonders.",
            "score": 1,
            "author": "IembraceSaidin"
        },
        {
            "level": 0,
            "comment": "No trunk in my van.",
            "score": 1,
            "author": "Commercial-Army2431"
        },
        {
            "level": 0,
            "comment": "Don't glow in the darks have to charge from light?",
            "score": 1,
            "author": "ScuzzBucket317"
        },
        {
            "level": 0,
            "comment": "I always have a friend stand by with a key while I lock myself into my trunk and pull the handle. I don’t know if I’ll ever need it but it works",
            "score": 1,
            "author": "gothiclg"
        },
        {
            "level": 0,
            "comment": "My car has one of those",
            "score": 1,
            "author": "BobBelcher2021"
        },
        {
            "level": 0,
            "comment": "It was thought up after a couple was locked in their trunk in a carjacking, and their child was in the car with the kidnappers. https://www.washingtonpost.com/archive/business/1999/06/19/carjack-victim-succeeds-in-fight-for-safety-latches-in-trunks/f88e8f8c-257b-4cef-b45a-fb11921fde83/",
            "score": 1,
            "author": "goodbyebluenick"
        },
        {
            "level": 0,
            "comment": "Seems like someone going out with the idea of kidnapping someone would just cut the trunk release off with wire cutters. I work on a lot of machines with door release wires and those things break pretty easy because they're usually latched with plastic connectors and handles. Usually have to use some pliers to grab the wire after the handle falls off.",
            "score": 1,
            "author": "Iforgotmyother_name"
        }
    ]
}