{
    "id": "13tmdgj",
    "score": 2896,
    "title": "YSK animal shelters in California and many others waive adoption fees for veterans",
    "author": "Darogaserik",
    "date": 1685232669.0,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/13tmdgj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Why YSK: We took my nana today to pick out a dog, and they waived all the adoption fees and provided a free neutering because she was a veteran. You can also call your local VA office to see if they provide training for a puppy to become a service animal. \n\nI looked it up for other places, most shelters in California offer this and the humane society also offers this. \n\nGo find a friend!",
    "comments": [
        {
            "level": 0,
            "comment": "I’ve never adopted a veteran but getting one free could make me consider it.",
            "score": 503,
            "author": "lolsalmon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, its me. A veteran.",
                    "score": 92,
                    "author": "Campeador",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you cute and housebroken?",
                            "score": 60,
                            "author": "lolsalmon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lets just say I cant walk through a bingo hall without getting my cheeks pinched.",
                                    "score": 73,
                                    "author": "Campeador",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "…which ones?",
                                            "score": 27,
                                            "author": "lolsalmon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "yes",
                                                    "score": 10,
                                                    "author": "satpin2"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Are you good with cats? If so you're in baabbyyyyyy!",
                                            "score": 11,
                                            "author": "Brickfrog001",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[Im great with cats](https://imgur.com/a/UorVBlB)",
                                                    "score": 16,
                                                    "author": "Campeador",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Are you vaccinated against rabies? It's a prerequisite for importing livestock into the UK.",
                                                            "score": 7,
                                                            "author": "CherylTuntIRL"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Time to get neutered for free",
                            "score": 7,
                            "author": "dropkickoz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Free neutering too 👍🏼",
                    "score": 21,
                    "author": "markyminkk"
                },
                {
                    "level": 1,
                    "comment": "Will you feed me and pet me and tell me I am a good handsome boy!?!?!?!?",
                    "score": 5,
                    "author": "SweetTeaRex92"
                },
                {
                    "level": 1,
                    "comment": "They come already well-trained, too! A great bonus! 😆\n\nIt would be amazing if they waived adoption fees for veterinarians as well. They would make valuable additions to pet families.",
                    "score": 3,
                    "author": "davga"
                },
                {
                    "level": 1,
                    "comment": "Make sure it's neutered. I read that they can do it for free if you get a veteran.",
                    "score": 3,
                    "author": "milanistadoc"
                },
                {
                    "level": 1,
                    "comment": "Is this a switcharoo?",
                    "score": 3,
                    "author": "AnimationMeister"
                },
                {
                    "level": 1,
                    "comment": "Make sure they get to see a veteranarian regularly",
                    "score": 2,
                    "author": "TheOneTrueSnoo"
                },
                {
                    "level": 1,
                    "comment": "Halp lol",
                    "score": 1,
                    "author": "LTWestie275"
                },
                {
                    "level": 1,
                    "comment": "Still considering?  You could just have yourself a gaggle of veterans.",
                    "score": 1,
                    "author": "OriginalBrowncow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I picked up a full bird Marine colonel last week.  He is a little rough around the edges, but we are working it out.  Took to paper training right away.  Ate *every* crayon in the goddamn house.  The nice thing is, you never have to put them down because technically they aren't *allowed* to die and \"their ass belongs to the Corps.\"\n\n...was the first thing I thought of when I read that headline.",
            "score": 250,
            "author": "zyzzogeton",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry I probably worded that funky!",
                    "score": 44,
                    "author": "Darogaserik"
                },
                {
                    "level": 1,
                    "comment": "You should train him in bird law.",
                    "score": 22,
                    "author": "KellyTheET"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just picked up a kitten last week this month they have promo free 1 st wellness check voucher and follow up free went to petco picked up adoption booklet with tone of coupons",
            "score": 47,
            "author": "miguel2419",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! She got a voucher good for any of our veterinarian offices for a wellness checkup too! \n\nHe’s had all his shots and he’s getting neutered on Friday all for free. We didn’t know that when we came, I actually made a joke about her being a dog owner veteran and they said, “Wait, you’re a veteran? We waive all the fees in that case.” She just had to show her card.",
                    "score": 15,
                    "author": "Darogaserik",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes my kitten was neutered as well and microchipped already but he had a minor eye problem vet gave him some drops all better now😺",
                            "score": 7,
                            "author": "miguel2419",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Awe, I’m glad to hear! Give it some loving for me! &lt;3",
                                    "score": 8,
                                    "author": "Darogaserik"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some shelters are partnered with Pets for Patriots. They can waive adoption fees and pay for medical bills.",
            "score": 17,
            "author": "hyperventilate"
        },
        {
            "level": 0,
            "comment": "I might need one, thanks!",
            "score": 13,
            "author": "CedarWolf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would you look at that, all of the words in your comment are in alphabetical order.\n\nI have checked 1,538,994,585 comments, and only 291,387 of them were in alphabetical order.",
                    "score": 20,
                    "author": "alphabet_order_bot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*Quelle surprise!*",
                            "score": 8,
                            "author": "CedarWolf"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is wonderful news.",
            "score": 21,
            "author": "ReincarnatedInc"
        },
        {
            "level": 0,
            "comment": "Guess I gotta enlist now",
            "score": 20,
            "author": "armyofmoose9",
            "replies": [
                {
                    "level": 1,
                    "comment": "Scam alert! The US govt is modernizing recruitment tactics",
                    "score": 29,
                    "author": "123bpd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's also free neutering and whatchamacallems for females in some of the less fortunate areas through the SPCA around here.",
            "score": 7,
            "author": "parabolaralus"
        },
        {
            "level": 0,
            "comment": "Dear lord. \n\nI hope my wife never finds this out or we’ll have another dog and an infinite number of cats.",
            "score": 8,
            "author": "BlahBlahBlankSheep"
        },
        {
            "level": 0,
            "comment": "If you can't afford the adoption fee can you afford the pet?",
            "score": 24,
            "author": "TrikkyMakk",
            "replies": [
                {
                    "level": 1,
                    "comment": "We had the money, but when they realized my nana was a vet they waived the $200 adoption fee. It’s to help veterans who need emotional support.",
                    "score": 21,
                    "author": "Darogaserik"
                },
                {
                    "level": 1,
                    "comment": "Some times $200 up front is a bit much, but this could be a consideration for some people to swing the tide in the pet's favor.   If you can't afford the hospital fee, can you afford the kid?",
                    "score": 2,
                    "author": "king-cobra69"
                },
                {
                    "level": 1,
                    "comment": "If it’s a shelter, honestly there shouldn’t even be an adoption fee. It should be free. \n\n200$ is so ridiculous it’s basically a scam.",
                    "score": -24,
                    "author": "JehovasFinesse",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The adoption fees pay for the care of the pet prior to adoption, and ensure that only serious adopters get the pet.\n\nSpay/neuter, vaccinations, vet wellness checkups, blood tests, deworming etc costs **way** more than $200 USD.",
                            "score": 9,
                            "author": "pinupcthulhu"
                        },
                        {
                            "level": 2,
                            "comment": "How do you think the shelter pays for all the dog food, all the staff, the building, etc?",
                            "score": 29,
                            "author": "Crystal3lf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Let alone medical care, vaccinations. This mindset is madness.",
                                    "score": 18,
                                    "author": "PBnPickleSandwich",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "All vaccines, a collar and tag, the dog is licensed to our county, neutering, nails are clipped, and a wellness checkup are all provided aside from money needed to keep the shelter running. \n\nIt’s a great deal, I have spent way more on a puppy that didn’t have any of these things.",
                                            "score": 5,
                                            "author": "Darogaserik"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Adoption fees also probably discourage people from collecting random free animals for fighting rings and other gross environments.",
                            "score": 2,
                            "author": "halberdierbowman"
                        },
                        {
                            "level": 2,
                            "comment": "Usually the adoption fees barely even cover the cost to spay/neuter, nonetheless all the other costs of operating the shelter",
                            "score": 2,
                            "author": "djaybakker"
                        },
                        {
                            "level": 2,
                            "comment": "The crazy adoption requirements including the high fees make sense when you realize most of these shelters are more or less just animal hoarders with extra steps. The insane fees are only the start of the problem, they also demand random home inspections for life, and booklets of paper for a single adoption.",
                            "score": -2,
                            "author": "OutlyingPlasma",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Insane fees? Buddy if you can’t spend $200 you shouldn’t get a dog.  That’s about as much as what you’ll have to spend each year on vaccinations alone.  Especially considering the cost to the shelter of getting the animal ready for a home and the relative amount (usually four figures) getting one from any reputable breeder would cost",
                                    "score": 1,
                                    "author": "djaybakker"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do any shelters not automatically spay/neuter every animal that goes through them?",
            "score": 2,
            "author": "SwissyVictory",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some smaller shelters that don't have in-house surgeons or partnerships with local vet offices to provide surgeries to their animals opt to minimize the length of stay by not holding animals just for sterilization, if they're otherwise fully adoptable. A lot of times they'll offer vouchers for free or low-cost spay/neuter at a particular clinic, as a way to encourage adopters to get it done, but it's not a legal requirement in all areas, unfortunately. It's ultimately better to get the animal out of the shelter environment as soon as possible - not because the shelter is *bad*, necessarily, but it's not a \"home like\" environment. The sooner a pet can resume being a pet, in someone's house, the easier time they'll have making that adjustment; animals that have been in shelters for a long time have a harder time learning or re-learning how to be pets, and unfortunately not all adopters are equipped to help their new furry friends make that transition successfully. I used to work at a shelter; so, so many people don't know shit about dogs or cats and think they come fully trained out of the box, no work needed on the part of the humans.",
                    "score": 4,
                    "author": "tehzephyrsong",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They asked my nana a whole lot of questions about how she would care for him and showed her a list of their most common reasons for adoptees being returned. A lot of it was basic dog care, and not liking the facts of puppy life, not liking the dog’s shedding, chewing on items, potty training, etc. Thats how we learned about the Veteran thing. I said, “Don’t worry she’s a veteran.” She’s a military veteran too but it’s not what I meant at the time lol.",
                            "score": 1,
                            "author": "Darogaserik"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are so many homeless animals looking for a place to give their love.  We have always had dogs of \"mixed\" marriages. They were the best even the pitbull mix who had been abused.",
            "score": 2,
            "author": "king-cobra69",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree. All of my animals are rescues, and they are the sweetest things ever despite everything they went through before they became a part of our family.",
                    "score": 1,
                    "author": "Darogaserik"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can adopt veteran animals?",
            "score": 2,
            "author": "dexede",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know you're joking, but yes you actually can adopt veteran doggos:\n\nhttps://www.petfinder.com/dogs-and-puppies/adoption/finding-a-dog/military-dog-adopting/",
                    "score": 6,
                    "author": "pinupcthulhu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's so bogus when companies and organizations give idiots who signed up for the military special treatment over the smarter people who didn't.",
            "score": -6,
            "author": "BigThunderian",
            "replies": [
                {
                    "level": 1,
                    "comment": "They came to my nanas high school and told her they would provide her with a free education and she would be a certified nurse when she came out. She went to Vietnam. It’s pretty predatory in my opinion to prey on young kids who don’t yet have a sense of direction and offer them the world.",
                    "score": 6,
                    "author": "Darogaserik"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's awesome and definitely utilise this feature if it will help you. Keeping in mind the initial costs are the smallest when it comes to pet ownership.\n\nBut also, pay what you can, if you can. Shelters barely make enough to cover food, medical, etc and it's often volunteer foster carers paying out of pocket. I don't think a lot of people realise that 100,000s (no exaggeration) of healthy pets are put to sleep each year in most Western countries and no kill shelters are the only thing stopping this needless waste and suffering from growing higher.\n\n#adoptdontshop",
            "score": -1,
            "author": "PBnPickleSandwich"
        },
        {
            "level": 0,
            "comment": "Trying to kill off veterans with pit bulls and pit mixes. Shameful.",
            "score": -11,
            "author": "dcgregoryaphone",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not just veterans. Single woman, single men, small children, teens and young adults!",
                    "score": -4,
                    "author": "FurRealDeal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I find it ironic that animal shelters want to charge me money for taking an animal that is not wanted.",
            "score": -12,
            "author": "gringgo",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s so people don’t abuse it or the animals.",
                    "score": 27,
                    "author": "moogly2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then they should have regulations and background checks. All this does is ensure poor people don’t get the animals big rich people can pay it and abuse them all they want. \n\nFee makes no sense.",
                            "score": -6,
                            "author": "JehovasFinesse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A) there are costs to shelter an animal before it finds it's forever home.\nB) It's is exponentially harder to rehome an animal for a second or third or fourth time in the case that someone can't afford basic care.\n\nThis is very simple logic and everyone sounds entitled with all this \"it should be free\" nonsense.\n\nA few hundred bucks is NOTHING compared to what shelters and fosters put in. In fact, become a foster carer first and see how much it costs you - sans adoption fee - to have that animal in your home.",
                                    "score": 7,
                                    "author": "PBnPickleSandwich"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Some charges can be monthly aside from food like heart worm prevention, and flea/tick medication . And you may want a booster for snake bites if you live in an area with rattlers in the summer.",
                                            "score": 1,
                                            "author": "Darogaserik"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And a veteran could never",
                            "score": -2,
                            "author": "xXyeahBoi69Xx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I never disagreed with that, I didn't make that other comment.",
                                            "score": 1,
                                            "author": "xXyeahBoi69Xx"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They do anyway. You're not saving one, single, animal.",
                            "score": -10,
                            "author": "gringgo"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 0,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How much do you think it costs to feed, house, give medical care to an animal for months before it is adopted - particularly an older or ill-but-curable animal?",
                    "score": 7,
                    "author": "PBnPickleSandwich"
                },
                {
                    "level": 1,
                    "comment": "They have to find their services somehow. And it's way less than you would ever pay to a breeder.",
                    "score": 17,
                    "author": "nothingweasel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My tax dollars fund these services, with the exception of the nonprofits.",
                            "score": -12,
                            "author": "gringgo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But that money means they can help even more animals find homes.",
                                    "score": 13,
                                    "author": "Hessa-",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep, you're helping the cause.",
                                            "score": -5,
                                            "author": "gringgo"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "the fees of a shelter are nominal. just enough to show you can have the money available to support the animal. if they were free and i was a monster i could eat cat haunch for every meal.",
                    "score": 2,
                    "author": "DrMoomoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To support the animal and to keep the shelter running. Ours not too long ago asked for food donations with the shelter being at full capacity. They had 2 to 3 dogs per kennel when we went this morning.",
                            "score": 2,
                            "author": "Darogaserik"
                        },
                        {
                            "level": 2,
                            "comment": "I think you're missing the point.",
                            "score": -2,
                            "author": "gringgo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There is no point to be missed 🤦🏼‍♀️",
                                    "score": 1,
                                    "author": "djaybakker"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shelter in place.",
            "score": 0,
            "author": "frealfr"
        },
        {
            "level": 0,
            "comment": "Be careful if you adopt an infantryman we will dig so much that your huskies will start to... get ideas.",
            "score": 1,
            "author": "Coggs362"
        },
        {
            "level": 0,
            "comment": "Some shelters are partnered with Pets for Patriots. They can waive adoption fees and pay for medical bills.",
            "score": 1,
            "author": "ArtisticSeating"
        },
        {
            "level": 0,
            "comment": "Sorry I probably worded that funky!",
            "score": 0,
            "author": "LiveEmu1905"
        }
    ]
}