{
    "id": "fi1pfi",
    "score": 53506,
    "title": "YSK: Installing a bidet attachment to your toilet is super easy and probably cheaper than stockpiling a ton of toilet paper.",
    "author": "Velexria",
    "date": 1584114555.0,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/fi1pfi",
    "media_urls": [],
    "other_urls": [],
    "postText": "And it feels cleaner too!",
    "comments": [
        {
            "level": 0,
            "comment": "I'm just gonna pull the garden hose through my bathroom window",
            "score": 6209,
            "author": "tamadrum32",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or, just get a hose attachment for your shower and stick it straight up.",
                    "score": 2874,
                    "author": "micahamey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Excuse me they have what...",
                            "score": 672,
                            "author": "Stoney-Stark",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://enemasupply.com/products/clean-stream-shower-enema-set?variant=35314090450&amp;currency=USD&amp;gclid=Cj0KCQjw3qzzBRDnARIsAECmrypnBjCZoEydTDFrUXwGtAbd19dYPpoY8MYO0wnJ_3ZGmMk3t5Aw-TQaAkmjEALw_wcB",
                                    "score": 407,
                                    "author": "micahamey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Committing to shitting in your shower is kind of amazing.",
                                            "score": 479,
                                            "author": "sleepwalkermusic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Gotta practice your Waffle Stomp first.",
                                                    "score": 597,
                                                    "author": "Philsie",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Or install a Clarkman.",
                                                            "score": 112,
                                                            "author": "Oilfan94",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 60,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don't know what a Clarkman is and I don't know if I want to.",
                                                                    "score": 42,
                                                                    "author": "2th",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "https://www.youtube.com/watch?v=15puo-dSEIY",
                                                                            "score": 44,
                                                                            "author": "Oilfan94",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I had totally forgotten about that.",
                                                                                    "score": 17,
                                                                                    "author": "2th",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Naw, just have it run to your toilet.",
                                                    "score": 8,
                                                    "author": "micahamey"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "1/30 have apparently tried doing it in the shower",
                                                    "score": 8,
                                                    "author": "best_jerky"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Fairly popular in the gay community. And no, that’s not a joke. Source: am gay",
                                            "score": 61,
                                            "author": "Triairius",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": ".... I thought I knew this from somewhere",
                                                    "score": 13,
                                                    "author": "MPT1313",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Forgot his address?",
                                                            "score": 5,
                                                            "author": "MomOf2cats",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It’s on sale too!",
                                            "score": 10,
                                            "author": "swagasus"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You know what, I was gonna clown this but the reviews seem like this helps a lot of people so I wont.",
                                            "score": 10,
                                            "author": "TreChomes"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hijacking top comment for some bidet advice...\n\nI moderate r/CrohnsDisease and we’re very familiar with bidets over there. Here are answers to some of the top questions...\n\n-\tDo I still have to wipe? It’s less of a wipe, and more of a gentle blot to dry the area. It only takes a few squares of toilet paper, far less than what you’d typically use to wipe.\n-\tAre they just for the butt? It depends on the model you get. Some also offer a “female mode” that changes the angle of the stream.\n-\tIsn’t it cold? Again, depends on the model. You can get a model that only has cold water for around $20. It taps into the toilet’s clean water line. For slightly more (~$60-80) you can get a model that also has a hot water line hook up. This is only efficient if your sink/shower/tub is on the same wall as your toilet since it will require tapping into a hot water line. This is also not ideal if it usually takes more than 20 seconds for the water in the bathroom to get hot when you turn it on. It only takes a few seconds of water to clean yourself, so you’ll be done before the hot water even gets there. And to be honest, it’s such a short blast of water you barely have time to feel it. For $300-1000 you can get a bidet that requires an outlet and cold water line and will heat the water on-demand the same way an electric kettle does. The Toto s550 is the top of the line model with many additional features like a sanitizer, air dryer, and remote control.\n-\tI’m not very handy, is it hard to install? Nope, super simple and involves a wrench and about 10-30 minutes depending on which model you buy.\n-\tI rent so what are my options? All of the bidet seat attachments are non-destructive so you can install it and then uninstall it when your lease is up.\n-\tWhat about when I’m not home? There are portable bidets for $5-80 on Amazon. On the low end, you can get a plastic nozzle that screws onto standard Poland Springs/Dasani-type water bottles. On the high end, you can get an electric Toto that you fill in the sink and then use. It’s a little bulky so it’s not ideal to carry around, but it’s great to keep at work or in your hotel bathroom when traveling.\n\nOverall, bidets are one of the best quality of life improvements you can make for the least amount of money and effort. You’ll kick yourself for not getting one sooner! Luxe Bidet and Toto are the brands I have experience with and can personally recommend.",
                    "score": 389,
                    "author": "covercash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've been fighting UC for the past, almost, 2 years.  I was having to go 26+ times a day for a few months.  My ass was raw.  That convinced me to get a bidet.  Took me all of 10 minutes to install.  One of the best purchases I have ever made!",
                            "score": 52,
                            "author": "Geawiel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same, there was a time I was going 30 times a day and just sleeping on the toilet. I wasn’t eating so it was mostly blood. But yeah, bidet life is best life. I also no longer have a colon. ¯\\\\\\_(ツ)\\_/¯",
                                    "score": 32,
                                    "author": "covercash",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm quickly approaching that.  I have two more meds to try.   After that, it's removal time.",
                                            "score": 17,
                                            "author": "Geawiel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you ever need them, r/ostomy and r/jpouch are good resources.",
                                                    "score": 9,
                                                    "author": "covercash",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 28,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Until you have used one it's hard to comprehend just how much better it is.  I have ptsd and my stomach is fucked as a result (nerves), and a bidet has made taking a dump so much better.  DOesn't matter how it comes out, a bidet will clean you without leaving you chapped, or raw, or needing to wipe fifty times.  Best investment I've made in terms of hygene.",
                                    "score": 75,
                                    "author": "Claybeaux1968",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes. You can do a little butt wiggle and sort of get around the edges. Since perfecting that move, I rarely get toilet paper that is anything but wet.",
                                    "score": 17,
                                    "author": "covercash"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How do u not spray shit everywhere. I understood it as u wipe the bulk first then spray then wipe and dry",
                            "score": 38,
                            "author": "buickandolds",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You don’t wipe first. Your skin in the area provides enough cushion to absorb the stream’s energy and the water just kind of falls back into the toilet. Then just blot dry. I keep a bleach spray near the toilet and give the bowl a spray after I flush.",
                                    "score": 67,
                                    "author": "covercash",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ahhhh ty",
                                            "score": 7,
                                            "author": "buickandolds",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Absolutely don’t wipe first. Spray away and then when you’re done, look at all the shitticles in the bowl. Those were what you used to just smear around all over your ass before you found your common sense and bought a bidet.",
                                    "score": 37,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Americans: fuck that sissy French bidet, I’ll just run my pressure washer through the window, at least it can handle my huge American size dumps.",
                    "score": 109,
                    "author": "ricklegend",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When using the pressure washer, you don't need the poop knife.",
                            "score": 63,
                            "author": "froh42",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know you thought you were being super clever.  But, in parts of Asia, they use kitchen faucet-style $5 sprayers inline with the toilet water feed.  You just grab the little handle from the holder and clean yourself with water.  Not as hands off as a $25 Amazon bidet, but still better than a quarter of a roll of paper on those difficult days.\n\nThe US is so backwards.",
                    "score": 65,
                    "author": "Phil_T_Sanchez",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "$50 now",
                            "score": 10,
                            "author": "dianalau",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I miss a lot about Cambodia, but bum guns may be the biggest from a quality of life standpoint.",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do it! Just be mindful of the pressure.",
                    "score": 11,
                    "author": "zninjamonkey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I swear I thought you said be mindful of the *pleasure*",
                            "score": 23,
                            "author": "A_Goon",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I am just going to use my neighbours garden and cat",
                    "score": 9,
                    "author": "ModsNeedParenting",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Just drop anchor outside",
                    "score": 11,
                    "author": "my_non_fap_account",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "When it comes to coronavirus prep, you just have to take it day bidet.",
            "score": 6610,
            "author": "LucidLeviathan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bidet, good sir.",
                    "score": 712,
                    "author": "melance",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bidet to you, too.",
                            "score": 237,
                            "author": "Ihavesubscriptions",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah I see a man of scrubs.",
                                    "score": 64,
                                    "author": "akash261022"
                                },
                                {
                                    "level": 3,
                                    "comment": "Do you bidet your thumb at me, sir?",
                                    "score": 34,
                                    "author": "JukeBoxDildo",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "/r/criticalrole",
                            "score": 36,
                            "author": "Emiliovaslord",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see you too walk with the Traveler.",
                                    "score": 17,
                                    "author": "melance",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The Traveler is my Copilot.",
                                            "score": 18,
                                            "author": "Emiliovaslord",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My other car is a ~~Squ~~Balleater.",
                                                    "score": 10,
                                                    "author": "Ares54"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You've got to be kidding me, I just watched that episode for the first time. And now I see this reference for the first time.  What are the chances of that happening?",
                            "score": 9,
                            "author": "Ikkkou",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "r/angryupvote",
                    "score": 91,
                    "author": "lillium_x"
                },
                {
                    "level": 1,
                    "comment": "i hate and love you",
                    "score": 28,
                    "author": "Saint-Typhoon"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 36,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hint: it didn’t",
                            "score": 15,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "I just recently learned how to pronounce bidet YEARS after reading it as Bid-det as in cadet... Nobody really just brings up bidets in a conversation lol.\n\nEdit: it's pronounced like bid-day if that wasn't clear from the original comment",
                            "score": 27,
                            "author": "Regnarg",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have no experience with a bidet, but don't you still need to dry our butt with something afterwards?",
            "score": 517,
            "author": "fried_eggs_and_ham",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not if you get one of the fancy models with a dryer\n\n\nhttps://www.brondell.com/bidets/bidet-seat-comparisons/\n\nBut even without that, one or two squares to dry is way better than 15 to 30 squares to wipe",
                    "score": 441,
                    "author": "ElectronGuru",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You got something wrong with you if you're using 15-30 squares to wipe",
                            "score": 389,
                            "author": "CowboysSB82Champs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[Uhhh..](https://i.kym-cdn.com/photos/images/original/001/471/227/dd0.png)",
                                    "score": 267,
                                    "author": "PURRING_SILENCER",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This has got to be the highest resolution I’ve ever seen for this meme",
                                            "score": 18,
                                            "author": "Jsouth14",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "https://i.imgur.com/7dig2uO.gif",
                                    "score": 67,
                                    "author": "Kinky_IT"
                                },
                                {
                                    "level": 3,
                                    "comment": "How do you wipe with just 15-30 squares? I make like a little ball or pad which is usually at least 10 squares. Then I'll need 2-infinite amount of those depending on how messy it was. Is this not the norm?",
                                    "score": 191,
                                    "author": "Me--Not--I",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You are getting shit on in the comments but I feel you, I could easily go through a roll in a day if I have to go 4-5 times.",
                                            "score": 110,
                                            "author": "mooimafish3",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"If\"? Shit, I'm 4 to 5 times before lunch",
                                                    "score": 27,
                                                    "author": "InvalidWhistle",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I make a pad with 4 squares and it’s almost too thick at that point. A bad shit I need to do that 2-3 times tops.\n\nIf you need 10 x 2 x infinity you need to improve your diet. My roommates eat shitty frozen meals all the time and are always using TP at stunning rates.",
                                            "score": 64,
                                            "author": "Bionic_Bromando",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're going to sit here and tell me you've never had a \"never ending wiper\"? I grew up with really thin bad TP so I probably developed a habit of using too much from that.",
                                                    "score": 88,
                                                    "author": "Me--Not--I",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"How is there MORE shit on the TP than there was 3 wipes ago?\"",
                                                            "score": 130,
                                                            "author": "MinimalPuebla",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This could be the title to my autobiography",
                                                                    "score": 34,
                                                                    "author": "ecish"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It's like wiping a marker!",
                                                            "score": 33,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "https://i.imgur.com/yZtAhbg.jpg",
                                    "score": 13,
                                    "author": "mochacho"
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean, 15 really isn't outrageous. I use 4 per wipe. Folded in half, then in half again. Prevents accidental penetration. I typically go anywhere from 2-4 wipes per shit depending how messy things get, then finish it off with a baby wipe for that minty fresh feeling. That's 8-16 squares per shit plus a baby wipe or two. And that's the average. Sometimes more, sometimes less.\n\nThere are also the bundlers, don't forget about the bundlers. I'd have to imagine people that do that use a much less efficient amount of TP than folders.",
                                    "score": 21,
                                    "author": "32BitWhore",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For me i use just a few squares to dry up which can be a lot less than if it was a messy poop. You also have the option of a tower if you're confident you got all the poop but i haven't become that bold yet.",
                    "score": 20,
                    "author": "Me--Not--I",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I just let it dry naturally. Dries pretty quick and I don't live anywhere warm.",
                    "score": 6,
                    "author": "pharmaninja"
                },
                {
                    "level": 1,
                    "comment": "I got a $20 bidet off amazon about a year ago. You can use something to dry or just hangout on the internet for a few more minutes and air dry yourself.",
                    "score": 13,
                    "author": "murppie",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "We bought a couple dozen washcloths from the dollar store and keep a folded stack of clean ones next to the hamper for the used ones. We wash then separately from other clothes out of an abundance of caution even though they usually look pretty clean after using.",
                    "score": 4,
                    "author": "Lanbhatt",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "YSK there is no need to stockpile toilet paper now.",
            "score": 386,
            "author": "QueenAlucia",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's such a weird situation because I don't want to be stupid about it but when I was running low yesterday and went to get a normal amount, they were sold out at several stores. I kind of felt dumb not getting some earlier but then I would have been part of the problem.",
                    "score": 181,
                    "author": "ShakeNBakeSpeare",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you had bought your normal amount slightly ahead of schedule I don’t think that makes you part of the problem. The people buying 15 mega packs are.",
                            "score": 121,
                            "author": "savageboredom",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Just wait until there's a run on other hygienic products...",
                            "score": 22,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 28,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bought one and installed it yesterday. Only issue is that toilet paper completely falls apart when your ass is that wet. Also, I was thinking it would really cut back on how much tp was needed, but so far it seems to basically just cut it in half.\n\nEdit: bonus: my fiancee tried it and her aim was off so it just completely soaked her clothes and she had to change. It was worth it just for that.\n\nEdit 2: I have had my fair share of inbox blowups but I never thought it would come from a poo comment. I don't live in the US and we don't have Charmin. When this whole toilet paper thing dies down, I will find a stronger brand. I was having a poo when I made this original comment and I had another just now and it is indeed getting easier every time. I'm not currently willing to get a towel. Perhaps after getting the technique right. Currently, I'd have to toss the towel after one use. Thanks for all the feedback everyone.",
            "score": 1223,
            "author": "CraptainHammer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Serious questions, but...\n\n&amp;#x200B;\n\n1) How does the water not splash disgusting poop particles everywhere? I mean, wouldn't the water make it get all over your butt/balls/wherever? \n\n&amp;#x200B;\n\n2) Does the water make the TP stick to your ass hairs with greater affinity?\n\n&amp;#x200B;\n\nNot joking with these questions. I really want to know. Have had a bidet for a few months and haven't installed it yet.",
                    "score": 534,
                    "author": "lift_fit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1) for the one I have, it shoots straight out so you can direct the poop downwards. \n2) cannot answer that myself but fiancé with butt hair loves the bidet and promises never to go back. You might end up with tissue particles but at least it’s not poop particles\n\nETA: I should clarify, I use a hand-held bidet and it’s basically a high pressure water gun and you can hold it at an angle to direct the poop downwards.",
                            "score": 318,
                            "author": "giantsockmonkey",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Interesting. Unfortunately, I'm too scared to nair my butt hair, so I'll just have to ass-blast it.",
                                    "score": 163,
                                    "author": "lift_fit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "DO NOT ever shave or nair your butt hair, you will regret it.",
                                            "score": 266,
                                            "author": "melance",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Its a mistake everyone has to make once to understand",
                                                    "score": 110,
                                                    "author": "Me--Not--I",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I always thought about doing it but now I'm curious about what happens",
                                                            "score": 34,
                                                            "author": "HeathenMonk",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The first day maybe 2 you'll be like, that guys an idiot this is great but then it'll start to grow back. It's been like 10 years since i did it so I don't remember everything but I can tell you it'll itch like nothing else and it'll be very uncomfortable to sit down",
                                                                    "score": 95,
                                                                    "author": "Me--Not--I",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Ohh I see, I had to shave my leg once and if it's the same kind of itch but in the ass, then I'll think about it more",
                                                                            "score": 37,
                                                                            "author": "HeathenMonk",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You'll realize just how often your cheeks are rubbing together while walking too",
                                                                                    "score": 32,
                                                                                    "author": "Me--Not--I",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[deleted]",
                                                                                    "score": 63,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The thing is, you realise why the hair exists there in the first place once you get a bit of a sweat going. That is a strange feeling",
                                                                                    "score": 32,
                                                                                    "author": "AfterDinnerSpeaker",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You ever shave your pubes? You know the 2nd or 3rd day when the stubble of your sack rubs your inner thigh constantly? I imagine that's what it's like, just in your buttcrack.\n\nAnd you can't make your farts silent for a good while. Far from it, apparently. Just a big, \"no thanks\" from me \n\n*itches freshly trimmed balls*",
                                                                                    "score": 14,
                                                                                    "author": "JudgeDreddx"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I have no Idea where this story originates from but it's still relevant\n\n&gt; STOP! Before you do, read this. You may change your mind.\n\n&gt; I have recently made a mistake in my life, and I offer my story to all though tasteless, that you may learn from my error. It all started, as many things do, with me having trouble pooping. No, I was not constipated; this was not a regularity problem but a matter of technique. It seems my ass-hair had grown to such a length that tiny grogans were constantly getting tied up in the matted jungle between my asscheeks. It led to much frustration, with me KNOWING that I still had something to drop, but unable to shake the tenacious turd loose from its butthair dwelling.\n&gt; \n&gt; Eventually I would have to do two things: either reach down with somepaper and try to pinch off the lingering loaf (which required careful precision to avoid smearing the creature all over my rear, especially since I had no way of seeing what I was doing) or just go for broke, start wiping, and hope that I could remove all the leftover fecal matter before the toilet paper reached its Can't-Be-Flushed threshold. I was contemplating this problem, when I had what seemed at the time to be a bright idea. \"Hey, this is my butt and my butt-hair, right? So why don't I just eliminate all the hair, and then my grogans will flow out like beer from a keg!\" I said to myself. It is a statement that will go down in history with a lot of other regretted statements. \"How many Indians could there be?\" said by General Custer. \"Looks like a good day for a drive!\" by JFK. \"There! America On-line now has complete Usenet access!\" by some idiot system tech. Such was my anal shaving idea.\n&gt; \n&gt; I performed the operation that night, with a cheap disposable razor and a towel to sit on. Starting from the bottom, and shaving from the crack to the cheeks, I began the arduous process of ridding my ass of hair. Occasionally, I would have to clean the razor of accumulated hair, which I did by wiping it on the towel. Slowly, my twin mounds and the between-ravine began to resemble the hairless cheeks of a newborn babe. Finally, I wiped the razor one last time, and surveyed my work. The towel was covered with a pile of hair. My ass was smooth as ivory. I smiled, satisfied, thinking my troubles were over.\n&gt; \n&gt; Little did I know. I now have a great respect for anal-hair. Like everything in this world God created, it has its mighty purpose in existence. It was only after I had removed it that I started to learn how much I had been taking it for granted. For one, it provides friction. I learned this the next day, when I walked out into the sun heading for class. After climbing two flights of stairs and starting to sweat, I started to notice something unpleasant. The sweat was accumulating in my crack, and was causing the unpleasant sensation of my two asscheeks sliding past each other with every step. I thought about going to the bathroom and wiping it off, but had to get to class. Eventually, I thought, it would dry. Unfortunately, it did dry, but only after mingling with the microscopic poop -molecules lingering around my brown starfish. When I stood up after class, my cheeks were stuck together with a slimy sticky poop/sweat combination. As I made my way back to my dorm, it started to itch. God-DAMN, did it itch! Felt like a swarm of ants was making its way up and down my crack. Fighting to keep from jamming my hand down there and scratching away, I rushed back to the dorm. Unfortunately, this exertion caused me to sweat, and when I finally reached my room, my cheeks were sliding back and forth against each other like a pair of horny cane-toads. I quickly dropped my pants, and attempted to dry my ass off by sticking it in front of a fan and spreading my cheeks.\n&gt; \n&gt; As I pulled the two mounds of flesh apart, a horrible stench burst free and filled the room. Every dog within a 4 block radius started to howl. I had it worst of all, as the ripe aroma of festering poop/sweat went into the fan and blew back into my face. I fought to keep from heaving. And as I sat there, fighting vomit, my ass cheeks spread and dripping, with the concentrated aroma of my body odor mixed with the tangy smell of my own poop blowing right into my face, I had only one thought: \"It will be like this until the hair grows back. Weeks.\" Later on, trying to deal as best I could, wiping my ass at every opportunity, I discovered another wonderful use for ass-hair - ventilation. I attempted to launch a fart, only to have it get stuck between my asscheeks.\n&gt; \n&gt; Apparently, with no hair, the two pink twins can get vacuum sealed together, and the result was a frustrating fart that slid up and down between my cheeks like a lost gerbil. As if that wasn't enough, I am now enduring further torture. As anyone who has ever shaved anything knows, when hair is first growing in, it comes in as stubble. Imagine your ass having the texture of a brillo pad.\n&gt; \n&gt; Well, that is what I am dealing with now. It is a hellish torture, and there are many times when I just look out the window and contemplate why I shouldn't just jump out and get it all over with in one fleshy splat, rather than endure this constant agony.\n&gt; \n&gt; Friends-DON'T SHAVE YOUR ASS-HAIR!",
                                                                    "score": 64,
                                                                    "author": "CGA001",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Ctrl-F \"gerbil\"\n\nYep, there it is.",
                                                                            "score": 8,
                                                                            "author": "p0diabl0"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 76,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "but do you do it by applying chemical burns?",
                                                            "score": 25,
                                                            "author": "jerrrrryboy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "some people are more sensitive than others.  You don't go full brown eye and sac on day 1.  start with a small bit on your arm or leg.  Foll the instructions and set a timer.  Wait a day and see how it turns out.  Move so a slightly more sensitive area.  try again.  Try a little bit on your taint or somewhere, wait.  If youre all good there, just go to town after.",
                                                                    "score": 31,
                                                                    "author": "CongressmanCoolRick",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I use kids paper scissors and I only cut the long parts \n\nBeen doing it for 8 years",
                                                    "score": 16,
                                                    "author": "PeekPlay",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Stay the fuck out of the pre-school Jeoff, how many times do I have to tell you?",
                                                            "score": 17,
                                                            "author": "lvlemes",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If I see a child running with scissors I'm taking that shit and shave my ass with it",
                                                                    "score": 14,
                                                                    "author": "PeekPlay",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If you’re gonna do anything, wax it. That way the hairs grow back soft and tapered instead of blunt cut and prickly. But go to a professional, do NOT try to wax your own butthole because you’ll never be able to go through with it after the first test tug. Take it from someone who attempted to clean up her bikini line at home with wax and deeply regretted it.",
                                                    "score": 12,
                                                    "author": "rileyjw90",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Eh, depends on your skin really. I do mine semi-regularly and have never had any issues. People need to read instructions on hair removal cream, buy one for sensitive skin and not leave it on longer than the instructions state. \n\nPeople getting the stuff that’s meant for your legs and then leaving it on for way too long is bound to cause issues. With shaving I’m not sure why you’d regret it unless you have seriously poor technique with a razor.",
                                                    "score": 8,
                                                    "author": "Boristhehostile",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean it does splash them... Into the toilet. You still wipe afterwards to be sure, but you drastically cut down on how much TP  you have to use, especially on messy days (shout out to the mornings after heavy drinking)\n\nDefinitely never noticed much TP sticking to hairs, and I'm decently hairy. Typically you drip dry for a few seconds... Never had the issue of TP falling apart like the op on this comment chain.\n\nJust install it and try it out! If it doesn't work for you, you can take it out or just not use it.",
                            "score": 137,
                            "author": "cubedude719",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Honestly, your comment about the convenience of a bidet for the beer shits is the most compelling argument I've heard on the topic.",
                                    "score": 12,
                                    "author": "JudgeDreddx",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That's true. Without the bidet, poop is everywhere anyways. Guess I'd just have to get used to wiping everywhere else, where poop usually wouldn't get, from the water splashing it.",
                                    "score": 17,
                                    "author": "lift_fit",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My gf has one. Gotta say, life changing. It's like going from the stone age into the modern era.\n\n1. My misconception about bidets were that they have the water pressure of a water fountain. They do not, it blasts your ass with holy water, and all the junk back in the toilet. \n\n2. No, not at all. I dab the water off first then check for cleanliness, or air dry for a second and check.",
                            "score": 30,
                            "author": "LordDoombringer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sorry if this has already been answered in the thread (it’s a long fuckin thread - who has the time?!)... but doesn’t the water blast the poop particles right into your vag? Like the bidet version of the ill-advised practice of wiping back to front? This is probably a question best addressed by your girlfriend so please commission her to help respond if you so choose. Thanks!",
                                    "score": 12,
                                    "author": "Secular-Flesh",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 31,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "1) You definitely need to get the aim right and set your butt up accordingly. It may depend on your installation. On the one I've got, I have to scoot my butt forward a bit or the spray goes to my nuts. Once you get the aim right, the water splashes right back down into the toilet with everything else.\n\n2) good toilet paper is key. I have to deal with this issue myself. If you're of particularly hairy nature, you might have to jiggle a little to get most of the water off first. Good solid two ply paper can usually handle some wetness. If it's really bad, you can usually pat dry with a small bit of TP and then wipe dry with a second small amount. But, that only tends to happen with lower quality TP.\n\nMy wife and I go through about a roll of TP every 1.5 - 2 weeks or so. That's for a cotonelle roll that's pretty fat, so if it were a more standard roll of paper, it would probably last us a week or so, and it's mostly her that uses the paper.",
                            "score": 5,
                            "author": "FacundoAtChevy"
                        },
                        {
                            "level": 2,
                            "comment": "1) when I use mine I shuffle my bottom around a bit to make sure the water stream gets everything.\n2) You don’t need to wipe with the toilet paper, just dab it around to get all the water. If you just dab it’s less likely to leave tp bits all over the place.",
                            "score": 11,
                            "author": "hplcman69",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "1 - yes that is exactly what happens. Every time this gets posted someone posts the studies showing all the poop-sprary under ultraviolet light. Shit is like a crime scene.",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You have to use the dryer part of the Toto Bidet Seat. It really is the greatest thing I have bought for my house. That and my Tankless Water Heater.",
                    "score": 33,
                    "author": "crashkg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mine has been a jump to conclusions doormat",
                            "score": 30,
                            "author": "cubedude719",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tom that is the worst idea I’ve ever heard in my life.",
                                    "score": 11,
                                    "author": "BombAssTurdCutter",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 44,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; Only issue is that toilet paper completely falls apart when your ass is that wet. \n\nI'm from one of the many bidet / hand shower using countries in the world.\n\nYou DO NOT NEED to use toilet paper after using a bidet. You're just wasting paper mate. Let your butt cheeks dry, it only takes a few seconds.",
                    "score": 6,
                    "author": "saadghauri",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Get textured TP that's thicker...it helps a lot and you're using less of it.",
                    "score": 5,
                    "author": "pawsitivelypowerful"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had one in my Amazon cart since before this blew up. Price went from $38.99 to 79.99.......",
            "score": 71,
            "author": "Smitten_Kitten666",
            "replies": [
                {
                    "level": 1,
                    "comment": "That happened yesterday. Bought one in the afternoon. When I looked at it again last night they had all doubled in price or were unavailable",
                    "score": 21,
                    "author": "McGoobington"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Suggestions for a good bidet? They range from 25 bucks to almost a grand, what do I get? I want to be rid of ass smell dammit.",
            "score": 74,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Luxe bidet off Amazon",
                    "score": 41,
                    "author": "Brainkandle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Acceptable.  Upgrade the hoses.",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Liked it so much, I bought one for my other bathroom and another for the future in-laws.",
                            "score": 6,
                            "author": "dmf109",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Any of the Brondell ones are pretty solid",
                    "score": 11,
                    "author": "gloonge"
                },
                {
                    "level": 1,
                    "comment": "Paid 25 on Amazon four years ago and still works perfectly. I wouldn’t let longevity be a factor over price and functionality.",
                    "score": 21,
                    "author": "Lucavious",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I have the luxe bidet. Cheap and would recommend.",
                    "score": 6,
                    "author": "conman_127"
                },
                {
                    "level": 1,
                    "comment": "These are good:\n\nhttps://www.brondell.com/bidets/bidet-seat-comparisons/\n\nGet the spray width option if possible\n\nThis one is good if you just want basic\n\nhttps://bidetking.com/alpha-one-non-electric-bidet-seat.html",
                    "score": 15,
                    "author": "ElectronGuru",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shit if I’m position that much for a bidet it better give me a colonoscopy while it’s at it.",
                            "score": 9,
                            "author": "andysaurus_rex",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "**Toto Washlet. The ROLLS ROYCE of bidets...**\n\nhttps://youtu.be/U8KyBlGWI2k",
                    "score": 9,
                    "author": "return2ozma"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 158,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why are people hoarding it again? Serious question.",
                    "score": 37,
                    "author": "tankage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm pretty sure that a couple crazy people went and bought cartfulls of TP in preparation for the apocalypse.  A few other people said \"I'd better stock up too\" and then a bunch of other people decided to stock up before it was all gone.\n\nThen the rest of us sane people are looking for our normal supply and there's none on the shelves.",
                            "score": 30,
                            "author": "mxzf",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I was talking with someone and they mentioned that they thought it was caused by Australia. Australia apparently sources quite a lot of their toilet paper from China, and when China got hammered, they naturally bought stocks of toilet paper pending supply issues. Americans and others saw this happen and followed suit. We don't have that issue in the United States.\n\nI'm not sure how accurate this is, but it made sense to me.",
                            "score": 38,
                            "author": "Cforre",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But we produce our own toilet paper here",
                                    "score": 9,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 11,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do bidets have filters? \n\nWe filter all our taps including the shower as our water is pretty bad. I dont mind squirting water on my asshole but im curious if there are filtered options",
            "score": 195,
            "author": "RaoulDuke209",
            "replies": [
                {
                    "level": 1,
                    "comment": "I too, only bidet with britta",
                    "score": 166,
                    "author": "dreeeewk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "only the finest filtered water for my shitty asshole",
                            "score": 122,
                            "author": "halloway14",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes it’s all plumbing so companies make options like these with external cartridges \n\n\nhttps://www.brondell.com/swash-bidet-filter-group/",
                    "score": 81,
                    "author": "ElectronGuru",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awesome! Thank you!",
                            "score": 17,
                            "author": "RaoulDuke209"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol you absolute madman. It’s an asshole. It’s filled with shit. You don’t need to reverse osmosis your butt wiping water.",
                    "score": 48,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can absorb contaminants very easily through your rectum.\n\nDon’t bidet with lead-contaminated water.",
                            "score": 24,
                            "author": "su_z",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 17,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This has been posted every day the past week. No offense to op, just ffs.",
            "score": 569,
            "author": "greystar07",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea, Reddit has a long running fascination with bidet's.",
                    "score": 252,
                    "author": "nolan1971",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you’ve never used one, it’s a huge difference. One of the best purchases I’ve ever made. \n\nYou’re much cleaner, it’s cheaper in the long run, and it’s better for the environment. Lots of wins.",
                            "score": 173,
                            "author": "Drdps",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you have a special towel to dry off or do you just use whatever is closest or...?",
                                    "score": 57,
                                    "author": "Starfish_Symphony",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I thought the same thing until I got one. Most of the water just falls back into the toilet and all other water can be wiped away with a single wipe of toilet paper. I use 95% less toilet paper with the bidet. (I am a VERY hairy male)",
                                            "score": 117,
                                            "author": "trent6295",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Do you get poop water on the bidet?",
                                                    "score": 29,
                                                    "author": "bazilbt",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Not really. It also has a self cleaning mechanism. All this for $30 on Amazon.",
                                                            "score": 33,
                                                            "author": "trent6295",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I been eyeballing that but I have a question - how does it not freeze your bits off? My toilet aint got heated water and the hot water bidets look to run close to $100",
                                                                    "score": 15,
                                                                    "author": "Benjammin1391",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Mines not heated. You get used to it after 3 ish uses. Also the power level is insanely high haha I started off at the lowest setting but now use the highest",
                                                                            "score": 17,
                                                                            "author": "trent6295",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Mine has the settings called out as 'fairy whispers' for the lowest setting and 'mega ass-blaster' for the highest. I'm somewhere in the middle.",
                                                                                    "score": 23,
                                                                                    "author": "load_more_comets",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's not a big deal, you don't use a ton of water so it's mostly room temp. Get one, normal toilets seem insane after you're used to it.",
                                                                            "score": 10,
                                                                            "author": "daversa"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The hot water on mine comes from the bathroom sink, maybe there’s a hot water pipe you’re overlooking in your bathroom?",
                                                                            "score": 5,
                                                                            "author": "EuphoriaII",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Also hairy male. You not only get a much better wipe job done down there but you use a fraction of the TP you'd normally use (like 3-6 squares and mainly just for drying off). It's no competition especially if you're like me and tend to do the \"wipe until it's red\" method it's just a straight up time saver.",
                                                    "score": 11,
                                                    "author": "MrT-1000"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Let the wind blow across your asscheeks",
                                            "score": 29,
                                            "author": "Asian_dodo"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "At first we just used a few squares of toilet paper, but these days we have some rags/towels designated for drying off. \n\nOnce you learn how to use the bidet there’s no poop left so it’s not much different than drying your butt after a shower.",
                                            "score": 22,
                                            "author": "Drdps",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 12,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "hmmm...if only there was some kind of material in the bathroom that I could use to dab my delicate anus dry with, and if it could be disposable that would be awesome...oh well",
                                            "score": 13,
                                            "author": "toorad4momanddad"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Probably because we're all assholes.",
                            "score": 8,
                            "author": "Beatiford"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know ffs I keep seeing repeat posts everywhere.",
                    "score": 14,
                    "author": "saltlemon",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mine gets hot water from the sink and allows for custom temperature control. Just be careful you don't get it too hot I  lazarbeam my asshole with scalding hot water and scream like a little girl.",
            "score": 19,
            "author": "skatetilldeath666",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Once you go bidet you don't go back.",
            "score": 18,
            "author": "WatchmanVimes",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As an Arab I have been called goatfucker several times, but I've always laughed knowing that the person saying that relies on toilet paper to clean his butt. All that's separating the shit and his fingers is some white sheets of paper, which he then disposes of to form a big pile of stinky crumpled up stained brown white paper. Honestly, how have western countries and the entire world as I assume not caught on to using water to clean your asshole? You use water to wash your hands and body, why not you butt? It's cheaper and less disgusting. Get a portable bidet and stop freaking out.\n\nEdit: even if super thick toilet paper exists, what do you  guys do when you have diarrhea?",
            "score": 15,
            "author": "HamunCencer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "YSK that these postings done all effin week has caused people to buy all the bidets available online so thanks for that.",
            "score": 52,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The $600 bidets are still plentiful",
                    "score": 8,
                    "author": "jeffreywilfong",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The expensive ones are magical. Those ones you can adjust the heat and pressure and it's almost as if it zeros in on your asshole.",
            "score": 16,
            "author": "Satansharelip"
        },
        {
            "level": 0,
            "comment": "A tushy [bidet](https://hellotushy.com/products/warm-water-bidet-tushy-spa) with temp control is only $109, I've been wanting one forever but didn't have access to particular water pipes I needed in my apartment",
            "score": 52,
            "author": "nikkizkmbid",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm having the same problem. We live in NYC and it's not normal household plumbing. It's more like what you see in old hospitals. There's no toilet tank, just a pipe that goes directly into the wall. I've been trying to find a bidet but I have no idea how to install that.",
                    "score": 17,
                    "author": "BronxBelle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can't even begin to imagine how hard it is dealing with housing in NYC, are you talking toilets like in elementary schools where it's a pipe and you push a lever on it and have to reach super far back?",
                            "score": 8,
                            "author": "nikkizkmbid",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love bidets. If you get shit on your arm, do you just wipe it with some toilet paper?",
            "score": 134,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you, that is always my selling point as well.",
                    "score": 73,
                    "author": "s2wjkise",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How often do you shit on your arms?",
                            "score": 26,
                            "author": "PmMeTwinks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Once jumped off my mate's trampoline, fell over and slid through dog shit.\n\nIt went alllllllllll the way up my arm, that wasn't fun",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Easy fix.  2 or 3 squares of paper towels and you are back to normal.",
                                            "score": 13,
                                            "author": "s2wjkise"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No but just a bit of water wouldn’t be sufficient either.",
                    "score": 11,
                    "author": "andysaurus_rex",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Most toilets in the US only have a cold water tap to connect the bidet up to. Does that mean you're shooting freezing water up your butt? I just don't see how that could be pleasant. Unless they have some sort of instant heating function, like those instant hot-water taps I see now and then.",
                    "score": 3,
                    "author": "Stony_Logica1",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve read in a couple of places that they can cause some problems for the ladies. Any girls here that can chime in on how that works without introducing bacteria to your lady parts?",
            "score": 26,
            "author": "echoglow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Installed one 3 years ago. Wife reported UTIs went down. And cleanups are easier, periods, sex etc.",
                    "score": 31,
                    "author": "ElectronGuru"
                },
                {
                    "level": 1,
                    "comment": "Have been using a bidet for a few years now, and I've not had any issues. Only fresh butt and bits, ahhhhh thanks bidet. I use the Luxe Neo 120. The water splashes off my b-hole into the bowl, I've never noticed it running north unless I intentionally maneuver to get my front butt.",
                    "score": 11,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "it comes out at an angle, and you can adjust the strenth of the flow, or wiggle around to get it where you want it. it really is not an issue, most of the world has been using them forever.",
                    "score": 10,
                    "author": "boscobrownboots"
                },
                {
                    "level": 1,
                    "comment": "In Turkey every house has it and no one has problems with it.It’s the regular toilet style, I was shocked when I found out that many other countries don’t have them in all houses.Also it feels amazing and you cut your paper usage greatly.",
                    "score": 13,
                    "author": "TanerKose",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I recently did that on both my toilets and will never go back. If I have to only use toilet paper for an extended period of time I feel like a barbarian.",
            "score": 24,
            "author": "hplcman69",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I literally just helped my girlfriend's father install a Toto bidet seat an hour ago. It was way easier than I thought.",
            "score": 11,
            "author": "partypantaloons"
        },
        {
            "level": 0,
            "comment": "Shit in the shower or S.I.T.S.",
            "score": 33,
            "author": "eledad1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Pulled the trigger on this. Heads up! It is super easy under perfect circumstances. If your bathroom is like mine you will spend two days taking apart and reassembling 90 year old plumbing.",
            "score": 20,
            "author": "FoxHarem",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 28,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just got a bum gun. Which I actually ordered online before all this mayhem. What gal doesn't enjoy a good gun to the bum.",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It will change your life, for the better.",
            "score": 7,
            "author": "Ronoh"
        },
        {
            "level": 0,
            "comment": "Wait a minute... That's really what bidets are for? Spraying your asshole? What?",
            "score": 7,
            "author": "SmithWiIl",
            "replies": []
        },
        {
            "level": 0,
            "comment": "legit question, how does one dry their ass? is there an air attachment or something?",
            "score": 11,
            "author": "Chemicalredhead",
            "replies": [
                {
                    "level": 1,
                    "comment": "A little bit of TP is what most of us use.  Far less than usual, just enough to dry.",
                    "score": 10,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My name is Joe Bidet and I'm running for US Senate.",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "A shower works too. We have a detachable showerhead. My wife uses it to masturbate, I use it to clean my starfish.",
            "score": 5,
            "author": "Guardian_Isis"
        },
        {
            "level": 0,
            "comment": "I installed one two days ago! Nothing to do with Coronavirus, just fell in love with a Muslim and wanted her to be comfortable at my place. Was incredibly easy, took like 5 minutes and cost $30 online.",
            "score": 5,
            "author": "hornwort"
        },
        {
            "level": 0,
            "comment": "\nWhat the fuck is up with Reddit's obsession with bidets",
            "score": 21,
            "author": "TurgeonS",
            "replies": []
        }
    ]
}