{
    "id": "hdlkpi",
    "score": 64158,
    "title": "YSK if your kid doesn’t leave their room often, you shouldn’t make a scene out of it when they do",
    "author": "obliguity",
    "date": 1592801616.0,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/hdlkpi",
    "media_urls": [],
    "other_urls": [],
    "postText": "My dad always did this to me and it made me never want to leave my room and walk by him. Making seemingly small comments like, “look who finally came out of their cave” can be taken as being shamed for staying in their room which makes them leave their room less often to avoid the shaming.",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4964,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m in my 30’s and still get this from both sides, my family and my in-laws. How am I only now relating this to my fucked up eating habits?? \n\nMy own family are exceptionally plain eaters - Eeww did you just order a burger with all the disgusting stuff on it?? Eewwww you’re so disgusting these days! My in-laws - omg did you just order a burger with all of the dressing?? That’s not like you at all, I thought you were still so picky, I’m shocked!!!! \n\nCan a bitch please just eat her burger however she wants it without all the commentary?",
                    "score": 847,
                    "author": "ButtonsMacBoots",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We have a saying in my family:  \"Mind your own plate\".",
                            "score": 371,
                            "author": "youfailedthiscity",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s actually a great response to give one of these commentators.",
                                    "score": 163,
                                    "author": "rta84293492",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was raised it was rude to “ewe” something someone was eating. I’m sorry y’all have any negative feelings or side effects around food- it’s to pleasant to shame-",
                                            "score": 46,
                                            "author": "TreeStandFan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "“Don’t yuck other people’s yums.”",
                                                    "score": 24,
                                                    "author": "PatchySmants",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Same here. I read somewhere on the internet a story about a father who was teaching his son why he should never say \"ew\" to someone else's food. The father basically said that you have no idea what that dish could mean to someone. It could be a special dish from their culture, it could be the food they ate all the time growing up, or it could simply be something they're trying for the first time. Some foods from my culture can seem a little unusual to others and I always felt very hurt when my roommate said ew to my food.",
                                                    "score": 43,
                                                    "author": "jaydashnine"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My dad would say (who got it from his dad) \"Who's eating it?\"",
                                    "score": 20,
                                    "author": "SynV92"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The commentary and scrutinization needs to die.",
                            "score": 159,
                            "author": "rta84293492",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Every time I go to eat with my family all they ever talk about with me is how they don't know how I can eat the things I eat.\n\nI have Celiac's disease and that means I can't eat gluten and generally need to eat some vegetables with my meal to not feel sick after eating. Pretty easy.\n\nThe \"ewwww, I can't believe you can eat that stuff\" (beans, rice, vegetables outside the potato/root family) gets old real fast. \n\nThey're also all fat as hell. Not a shocker.",
                                    "score": 106,
                                    "author": "show_me_the",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I always say \"because I didn't nuke my taste buds with soda and Doritos. You ever tasted a blueberry?\"\n\nThen when they come to my house I will literally give them blueberries. They say they're disgusting. I pop 10 in my mouth. I taste sweet blueberry. I tell them \"it tasted like a flavorless gritty water ball to you didn't it?\" \"Yeah! *How do you eat this stuff!*\" \"BECAUSE I CAN TASTE SOMETHING YOU CAN'T. GO ON A DIET.\"\n\nI have no problem with anyone who's overweight. But when fat cunts make me out as a bitch for eating healthy I'm going to roast them. They don't get to judge me when I can smell them after they get out of my car.",
                                            "score": 64,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I love this comment! Made me laugh. It’s especially important how you’ve distinguished between over weight people in general and ignorant fat folk who are in no position to shame someone else’s diet.",
                                                    "score": 8,
                                                    "author": "amyjoel",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I felt that was important too. It is NOT okay to shame people. It IS okay to defend yourself within reason. Feeding someone blueberries and asking if the natural flavor is still there or if it tastes like wet sand is what I consider in reason!",
                                                            "score": 7,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have an animal fat intolerance and have to be vegetarian. Family knows this and knows of the things I had to do to manage it (including gallbladder removal) but still get the disdain \"its *vegetarian*\" or the frowns when I fry greens and start crunchin away on it. Theres more to life than meat, potatoes, and corn",
                                            "score": 26,
                                            "author": "A_ChadwickButMore",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 51,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For real like who are these people?! Getting shamed for loading up a burger? Grown adults with kids of their own should not be proud of somehow retaining the palate of a 7 year old.",
                                    "score": 47,
                                    "author": "HaxRus"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My husband was the pickiest person I’d ever met (well, until I met his mom) and once we moved in together, he slowly started trying more things. We’ve been together nearly 15 years and his family has always made a huge deal of what they see him eat. We’ve lived in a different state from his family for 2 years now and his palette has remarkably evolved even more in that time. I’m so proud of him.",
                    "score": 101,
                    "author": "T8rthot",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I feel you. Till this day whenever we go out to eat my dad orders my food \"without anything green on it\". I am almost 30 FFS and I love spices and \"green\" stuff but I just let him have his fun. Now having a baby he makes a huge fuss that I give her fruit and veg to eat because I \"never touched that stuff\". Since I moved out I eat very differently but never tell him.\n\nEdit: apparently many are surprised my dad orders my food. At restaurants he always orders for everyone we eat out with. We tell him what we want and he talks to the waiter. Maybe it is weird. Maybe it is normal where I come from. Either way, no need to be rude about it.",
                    "score": 604,
                    "author": "tehvan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just tell him, bud.",
                            "score": 210,
                            "author": "NedDeadRedemption",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If they’re anything like my parents, neither telling them nor them seeing it for *3 years* will stop them from making a big deal out of it. Every. Single. Time.",
                                    "score": 60,
                                    "author": "danjo3197",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My parents still bring up my needle phobia whenever I mention getting a flu shot etc. I cured myself of that fear by giving blood... *fifteen years ago*.",
                                            "score": 50,
                                            "author": "jamjamjaz"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This! I haven't eaten pork in 5ish years. (I have on occasion, but avoid it at all costs due to digestive issues) and my family always acts like it's a brand new thing and \"I must be a Muslim\" \n\n\nI live in the South and pork is literally a food group of it's own. And bacon is used in everything. It makes family holidays with food very difficult, so I always bring a dish I can fill up on.",
                                            "score": 37,
                                            "author": "marymayhem96",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My stepdad said the Muslim comment to me, too. I also mentioned to my mom that pork makes my stomach feel funny and stepdad said, \"no it doesn't\" with an attitude. It's so irritating.",
                                                    "score": 7,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It gives me the screaming shits and severe stomach cramps, Rick. But maybe you're right, it's just in my head! \n\n\nPeople are just shitty.",
                                                            "score": 7,
                                                            "author": "marymayhem96"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I did. Multiple times. I just gave up trying.\n\nI also told him how it makes me feel and he got angry and didn't understand.",
                                    "score": 101,
                                    "author": "tehvan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 57,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think folks are pointing out that it’s odd your dad orders for you more because the combination of him ordering for everyone in the group and him deciding for you what you do and don’t like in food is really controlling behavior. Is his ego fragile enough that he needs to be the voice of the family and can’t stand change in the form of independent, heretical food ordering?",
                            "score": 24,
                            "author": "pronetofitsofidiocy"
                        },
                        {
                            "level": 2,
                            "comment": "That’s funny! I moved out and started eating almost entirely vegetarian (except for chicken a few times a week under the advisement of my doctor). When I was living with my parents for awhile during COVID, I made it very clear that I intended to keep eating that way. I had lost weight in a good way, had more energy, and had fewer stomach issues. But I can’t tell you how many times my parents would tell me how gross my vegetarian food is. God, it’s pasta without meat. How gross can it be?? But my point is, I made it very clear to them that I am an adult, and I’ve made positive change in my lifestyle with the help of my doctors. I want them to be aware of and accepting of the way that I’m growing up and changing when I’m not with them.",
                            "score": 10,
                            "author": "MrPotato2753",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Why is your dad ordering your food if you're almost 30?",
                            "score": 51,
                            "author": "_linusthecat_",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This hits too close",
                    "score": 21,
                    "author": "PaulieVideos"
                },
                {
                    "level": 1,
                    "comment": "Exactly the same thing with me. Whenever they made a big deal about me eating something, I would just flatly say “this is why I don’t try new things.”",
                    "score": 20,
                    "author": "6pt022x10tothe23"
                },
                {
                    "level": 1,
                    "comment": "I was today years old when I realised why I hated eating out with family so badly as a kid, omg. What a fucking revelation! Seems like something I should have put two-and-two together on but yes, this.",
                    "score": 35,
                    "author": "RavenMay"
                },
                {
                    "level": 1,
                    "comment": "Omg same. My parents always did this if I wanted to try something new. They also never forced me to expand my palette while growing up (which is fine because being pushy isn’t good either), but then if I thought I wanted to try something it felt like I was being made fun of, so I just never did around them. Wasn’t until I moved out and started living on my own that I became a more adventurous eater.\n\nAnd then three days ago I made steamed mussels for dinner. It looked good so I sent a pic in the family chat so my sister could see. My mom on our next phone call: “Oh my Goooosh when did you start eating mussels? I didn’t know you liked mussels!”\n\nI’m fucking over 30 maybe it happened sometime in the last 15 years, jeeze.",
                    "score": 29,
                    "author": "ijustwanttobeinpjs"
                },
                {
                    "level": 1,
                    "comment": "Yeah, I used to be real picky too but I started expanding my diet in high school because my friends would go out to eat at fast food places with food I didn’t eat and I wanted to hang out with them more than I didn’t want to try something new. So I went and got a burger with them and hey it was actually pretty good.\nMy brother started dating this girl recently who is really really picky, like as picky as I was in middle school. We had them over for a big dinner with my uncle and cousins and my uncle was kinda roasting her like he used to roast me. Gave me flashbacks, was exactly what used to happen at every family dinner and was why I hated family dinners.\nBecoming not a picky eater is just something you’ve got to decide to do, all the pressure from my family just made me want to try things less and they always made a big show about it when I did try stuff. I’m glad I had my friends around in high school because otherwise I wouldn’t be where I am. They never gave me too much shit about it but always encouraged me a bit to come with them and try something. I’m glad they were there for me :)",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Turns out the reason I was a picky eater is because all the food my family makes is bland and terrible. I was afraid of living on my own, I didn't know what I would eat. Then I moved overseas and discovered that flavourful food is amazing and all the crap my family gave me over being a picky eater is because I actually have a functioning palette and not just a food hole.",
                    "score": 35,
                    "author": "HandicapperGeneral",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My parents didn't have bland food but they had a ton of drive through takeout/fast food. I didn't want to get a stomachache so I only ate bland food. Adult now and getting tested for a gallbladder issue. My parents thought I was just picky but turns out I have an actual medical problem and do very well with fresh food!\n\nAlso my son is still an infant and eats fresh whole food. My dad is shocked at his palate (not only flavor but textures like fish) and tells me at his age I was eating basic baby purees. 🤦",
                            "score": 9,
                            "author": "BostonPanda"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've spent like... 25 years not wanting to do anything out of the ordinary (for me), just so no one would make a comment. Positive or negative. Just... no attention, please. \n\nI'm very happy to say that at 37, I'm now in the idgaf category. I will wear my big floppy hat, yes I will. I don't care who sees me. I like it. It protects me from the sun. It makes me feel like a movie star.",
            "score": 1853,
            "author": "serume",
            "replies": [
                {
                    "level": 1,
                    "comment": "im glad im not the only one that. I hate trying new things or doing something \"out of character\" because my friends and family always have to make some kind of comment. they can't just play along as if it was normal. once they point it out, I shrink back into my shell",
                    "score": 364,
                    "author": "mayplemoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've done this my entire life and now in my 20's I feel like I have no idea who I am and I still do the same shit...\n\nIt got me into some bad habbits, like not trying because trying and failing is more embarrasing than not trying and failing.\n\nTurns out, if you never try, you never go anywhere and just end up miserable, depressed and alone.",
                            "score": 143,
                            "author": "SuspiciousDriver1",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s currently the same with me. I’m still living with my parents and I feel like anything I do that’s not in ‘routine’ will be the end of the world, even though it really isn’t, I still feel anxiety doing anything different. I’ve always thought that once I move out I’ll be able to move more freely and it’s so nice to see confirmation of that.",
                    "score": 48,
                    "author": "oofreddit7002"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t punish the behavior you wish to see.",
            "score": 15421,
            "author": "907nobody",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly.",
                    "score": 3106,
                    "author": "obliguity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Problem is they don't see it as a punishment, just some light teasing, but to the child (or hell, many adults) it's often pointing out an irregularity even they recognize - making their actions feel shameful.  \"Look who finally came out of their cave,\" will only keep them from leaving next time, as explained.  See also, \"Look who's got/is xhe your a girlfriend/boyfriend?\"  Apparently One has to be a weirdo to have friends of the opposite sex with no want to perform the act of making babies (hopefully this perspective opens some eyes.)  And a personal favorite, \"why is she naked\" as I'm in the early stages of drawing something.  Now I don't like letting anyone know I'm drawing at all and it honestly makes the act itself feel somewhat scary and shameful.  It's fucking stifling.\n\nWorst of all, it's hard to confront these people because the defense is always \"Geez, it was just a joke!\"  Now the defendant is the bad guy for getting pissy, and a calm respectful tone does not automatically equal \"not pissy\" to the hazing party.\n\nTL;DR: People need to stop shining a spotlight on good if out-of-character behaviors.  Doing so just encourages many individuals to continue to conform to their or an accepted public image so as to avoid feeling embarrassed and ridiculed as an abnormality.",
                            "score": 1199,
                            "author": "Littleman88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 451,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Why don't you practice piano in the evenings anymore?\"\n\n\n\"Idk Mom, maybe it's the requests to play louder so you can hear from the kitchen, questions about why I repeat tricky sections, or the times you come stand behind the bench and try and follow along with the sheet music.\"",
                                            "score": 309,
                                            "author": "Purple__Unicorn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So my mum is a piano teacher and has this extremely annoying habit of singing the “right” note at me if I made a mistake and it’s like - I KNOW. MY EARS KNOW WHAT ITS SUPPOSED TO SOUND LIKE BUT MY FINGERS AREN’T THERE YET YOU ARE NOT HELPING",
                                                    "score": 10,
                                                    "author": "Totorosie_"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Dude, I love my parents but they did this to me and I stopped drawing and playing music. I didn't even hide it anymore because we lived in such a small house. I do miss doing both.",
                                            "score": 72,
                                            "author": "Aletesi",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I dunno I think it's a valid question if you're practicing an instrument.",
                                            "score": 50,
                                            "author": "onemanandhishat",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Similarly, i loved to read as a kid. My preschool encouraged kids to bring in their favorite books to read during story time. I brought in my favorite book, titled \" do not open\". It was a variation of pandoras box. My teacher refused to read it because of the title. He was joking, i know that now, but as a kid it really upset me and I never shared a book with the class ever again. He didnt  hurt my love of reading but he destroyed my confidence in sharing things that were important to me.",
                                    "score": 148,
                                    "author": "tinaxbelcher",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "From the time I was about 8 til I was about 20 and stopped giving a shit about what people thought, I kept my love of comics and Star Wars almost hidden from public view because I knew I would get shit on for my likes. The last 10 years has been my golden era lol. I also proudly wear my Batman death eater and Star Wars tatts (34 now for reference)",
                                            "score": 40,
                                            "author": "acwrensolo1285",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Reason for this comment is don’t feel ashamed of what you like, it makes you you",
                                                    "score": 18,
                                                    "author": "acwrensolo1285"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Old friend of mine was really into Harry Potter and even made their own wand during woodworking sessions at school.\n\nOur teacher decided their \"obsession\" was unhealthy so she flatout banned my friend from being a fan of it and even stole their self-made wand during recess which they never got back.\n\nIdk if it's the same but it still pisses me off thinking about it",
                                                    "score": 10,
                                                    "author": "Martina313"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;\"why is she naked\"\n\nIt wasn't until I showed someone my figure drawing sketchbook that I realized how awkward most people are around nudity lmao\n\nI'm completely used to seeing random people naked by now  \n\n\nLittle do they know I'm learning all this to draw smut &gt;:)",
                                    "score": 81,
                                    "author": "HermanManly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So long as it doesn't involve hand holding it's fine.",
                                            "score": 38,
                                            "author": "MrGrizzlyy"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Response to \"Geez it's just a joke\" :    \n\n\n\"No, jokes are funny and that wasn't.\"",
                                    "score": 20,
                                    "author": "poeticdisaster"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; Problem is they don't see it as a punishment, just some light teasing, but to the child (or hell, many adults) it's often pointing out an irregularity even they recognize - making their actions feel shameful. \n\nthis is why i hate people, i just cant stand that light teasing crap cause it never feels like teasing.",
                                    "score": 40,
                                    "author": "vistianthelock",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "God , I wish my mother could read this. She feels she has to express every thought/opinion (judgement really) in her head and it isn't always necessary.\nShe thinks her comments are witty, but sometimes they're just really fucking irritating and not what I want to hear at the moment. I've also begun speaking up about it which is something I never did.\n\n\nEdit: words.",
                                    "score": 34,
                                    "author": "LameNameUser",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I always ask \"Porn or form?\" When I see someone drawing naked people. If it's porn, cool you can make a ton of money doing that. If it's form, cool it's always good to practice the human form",
                                    "score": 23,
                                    "author": "ragn4rok234"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 965,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Like I haven't spoken to them in a while and I call and they're like \"look who bothered to call us\".\n\nAnd I'm going to hazard a guess they rarely, if ever, bother to try and call you?\n\n'cos I'm familiar with that particular suck salad",
                            "score": 544,
                            "author": "Aksi_Gu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mine use to do this. I am 100% emotionally fucked because of their upbringing. Be the bigger person, call them once a week. Same time, same day.\n\nIf not, ask why they never call you. Failing that, say to them genuinely \"Have you ever thought there's a reason I don't call..\"",
                                    "score": 207,
                                    "author": "OptimusSpud",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; If not ask why they never call you. Failing that, say to them genuinely \"Have you ever thought there's a reason I don't call..\"\n\nOr don't, apathy definitely seems like an equal and appropriate response. Unless you actually like talking to awful people then I guess do what you like.",
                                            "score": 108,
                                            "author": "NaiveMarionberry1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep, nope, I hopped off that toxicity train a while ago. Couldn't be happier.",
                                                    "score": 40,
                                                    "author": "purpletortellini",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yaaasssss just ghosted my abusive parents finally at the age of 26. I even tried sitting down and talking to them and got the classic “well idk what you expect me to do about it”. Kudos for also getting off the train to hell!",
                                                            "score": 23,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That is exactly how my experience was haha!! Tried to have a heart-to-heart with my mom about spending more quality time together now that I've moved out. \"Why are you attacking me?!\"",
                                                                    "score": 14,
                                                                    "author": "purpletortellini",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "OMG that’s what happened to me! My mom told me that I was “Attacking her” for trying to talk about why I don’t come around much and then hung up on my because she was done listening. Blocked. I can’t wait for it to really sink in that they have no access to me anymore. \n\nWish you the best on your journey! Remember, we don’t need them!",
                                                                            "score": 14,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Apathy can seem cold to outside observers but it is absolutely the appropriate response to some of these situations. I haven't spoken to my mother or most of her family in years. Best decision of my life. There is no anger or animosity about it.",
                                                    "score": 26,
                                                    "author": "Balls_Mahony",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;  Best decision of my life. There is no anger or animosity about it.\n\nYup, just relief of burden.",
                                                            "score": 13,
                                                            "author": "NaiveMarionberry1"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "At some point \"being the bigger person\" is just next-level pettiness.\n\nLet that shit go, forget it, and be free.",
                                                    "score": 13,
                                                    "author": "DownshiftedRare"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\"Be the bigger person\"\n\nThat's not being the bigger person that's being their bitch. \n\nI think a lot of y'all are vastly over-estimating how much you need your parents.\n\nFact is if you just save up money and keep working you'll survive on your own. \n\nDoes that mean you lose the luxury of moving in with family if your work sucks? Sure. But if your family is bad enough it's better to just eat shit at work and look for anew job then quit and depend on assholes again.",
                                            "score": 41,
                                            "author": "BrandNewWeek",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Let me preface by saying I cut my family out at 18 and have been all the better for it.\n\nI think a lot of people struggle with this because they do genuinely love their parents, and/or their parents are aging and they don’t have much time left with them so they put up with a lot of shit.",
                                                    "score": 17,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I have an aunt who I haven’t talked to since November. She was the last one to text, so she goes to all of my relatives saying she’s tried contacting me but I don’t reach out. And it’s why I don’t reach out. Fucking infuriating.",
                                    "score": 16,
                                    "author": "hkpp"
                                },
                                {
                                    "level": 3,
                                    "comment": "I've been in that situation, and they were never the ones to call. I tried asking, but the usual response was \"Because we don't know when/if you're available.\"\n\nI dreaded every time I called and heard \"Oh he's still alive and bothered to call?\"",
                                    "score": 8,
                                    "author": "Lethargic-Happiness",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "When my mom did that to me, i just hung up and called her again a few hours later. Everytime she said it. She stoped and asked me about it and i explained it to her and that was it.\n\nSame with leaving the room, my siblings and my parents said it, but after a while i didnt even bother coming down when they came over to my parents, they stoped saying it after a while. I even just came down, heard them say it and then just left again.",
                            "score": 56,
                            "author": "nonamefounder",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That sounds like dog training. It's like a positive reinforcement approach.",
                                    "score": 35,
                                    "author": "KittyChaton",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I do ABA therapy, which is therapy that is designed for teaching kids with autism, and positive reinforcement is our primary approach. If you want a behavior to occur more often, you reward it. We very rarely use punishment and I've never been on a case where it was used (it's only used in cases where the child's behavior is harmful to themselves) but punishment would be used when you want to see a decrease in a specific behavior. The therapy is rooted in behaviorism. Dog training, and as far as I know all animal training, is rooted in behaviorism. Behaviorism is a very basic view of learning, but it also holds up the best to scientific testing and it's results can be generalized with good accuracy across species.",
                                            "score": 8,
                                            "author": "ScipioLongstocking"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m 55. When my parents did this to me, I reminded them that the phone I bought them could also be used to make calls, not just accept them. They’re getting old now, and I can’t get back to their country to see them right now, so I’m glad I let go of being chuffed at their annoying humor and took the high road.\n\nEdit: I did tell my parents that this comment was annoying, and they explained that they never called me because I was “so busy.” I think it was their way of telling me that they wanted to hear from me more. They still wait to hear from me, and they are always so happy to get a call from my kids...but they still never initiate it.",
                            "score": 21,
                            "author": "onegoodear",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Have you tried telling them that such comments have an opposite effect? I'm with you that in most cases, people who make such comments do it with the best intentions and think it's awkwardly funny and thus see no harm in it. They'll never stop doing it if they don't know it's bothering you though.",
                            "score": 23,
                            "author": "Nikittele",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Every time I see comments like this it makes me feel so spoiled. I call my mom once or twice a week and she always says \"thanks for calling\" at the end. My grandma always makes a big deal about thanking me and how much she appreciates talking to me, and I'm always just like \"Grandma, i enjoy our conversations too!\"",
                            "score": 11,
                            "author": "thewormauger"
                        },
                        {
                            "level": 2,
                            "comment": "I'd go with \"Those kind of comments make me not want to call you, and I don't want to feel that way.\"\n\nBe assertive.",
                            "score": 8,
                            "author": "Healthy_Platypus",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Is your mom Livia Soprano?",
                            "score": 24,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wish the lord would take me now",
                                    "score": 21,
                                    "author": "fannyfox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh poor you",
                                            "score": 12,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Your mudda, singing the blues with a Virginia ham under her arm. When my brother Johnny died, he was a man amongst men, he left her a packet that would choke a fucking camel!!!\"",
                                    "score": 8,
                                    "author": "OptimusSpud"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There was so much stuff I wanted to do as a kid but I didn't because it'd be \"out of character\" and I knew my parents would make me feel embarassed about it.",
                    "score": 120,
                    "author": "Dexiro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Hey, I want to do this, but my dad's gonna razz me about it\"\n\n- The TLDR on why I have no hobbies other than staying inside and keeping to myself",
                            "score": 69,
                            "author": "ClubMeSoftly",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Same. My mom would always make a 'big deal' out of anything 'out of character' so I just didn't bother.",
                            "score": 31,
                            "author": "Italiana47"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 178,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Still trying to wrap my head around it. I mean I get it but I feel there is a DEEP meaning here.",
                            "score": 51,
                            "author": "hurcor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Look into behavioral psychology, esp. Skinner, to see the depth.\n\nNot an easy read, mind, but a transformative one.",
                                    "score": 11,
                                    "author": "BewareTheGiant"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Totally, but I think the issue is likely people who do this don't see it as punishment. I feel like there's a gap in understanding here that needs to be discussed for the parents to understand.",
                    "score": 108,
                    "author": "Starkandco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s not a punishment in the traditional sense of the word, but it is a very effective deterrent to the behavior you think you’re encouraging when you say things like that.",
                            "score": 95,
                            "author": "907nobody",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's passive-aggressive. The parent harbors a negative opinion about the amount of time the child spends in their room and, instead of finding a healthy way to approach it, they make jabs at the child. If the parent doesn't get the desired smiles/laughs or doesn't draw others in the room in to make similar comments, then the jabs are sometimes followed by \"you can't take a joke\" and similar gaslighting statements.",
                                    "score": 61,
                                    "author": "Bubblykettle",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep lol. Immigrant parenting ftw. My parents would mock THE FUCK out of me when I'd speak to them in our native language like they always wanted. I no longer speak our native language to them.",
                    "score": 52,
                    "author": "pm_me_badgirlbutts",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That’s a good, succinct way of expressing it",
                    "score": 23,
                    "author": "PwnasaurusRawr"
                },
                {
                    "level": 1,
                    "comment": "I was never allowed food in the room because I never clean up. Problem is when I have a cup of water or eat something in here I used to bring the dish out immediately only to get in trouble for cleaning up. So eventually I started letting the dishes pile up.",
                    "score": 20,
                    "author": "SuperCosmicNova",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "My dad always did this. Not that it was malicious necessarily, he thought he was being funny. Like I was a fucking joke or something.",
                    "score": 34,
                    "author": "TippyBooch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Ohhh, look who finally &lt;thing&gt;, congratulaaaaaation\"",
                            "score": 18,
                            "author": "vintagecomputernerd",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mom does (sort of) the opposite, if we've been holed up and finally come out she'll be like \"hey, I haven't seen you in a while, how are you doing?\" just friendly like it's normal small talk, or ask if we've gotten breakfast/lunch/dinner yet depending on the time of day. It's very low key and makes me more inclined to come out more often, and is one of those things I appreciate more as an adult back living with my parents again. Gentle encouragement works so much better than making snarky comments.",
            "score": 2017,
            "author": "cerwytha",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow. Points to your mom. That's how to be a caring parent. Not being condescending about it and showing genuine curiousity about how you're doing. Good for you my man",
                    "score": 758,
                    "author": "obliguity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My parents have recently been giving me these comments &amp; asking why I don’t want to go outside/are upset at how content I am\n\nI can’t believe I had to tell my parents who work in the fucking medical field that THERE IS A GOD DAMN VIRUS AND ONE OF YOU IS IMMUNOCOMPROMISED DUE TO BREAST CANCER IF I GO OUTSIDE AND CATCH SOMETHING WE ARE GUARANTEEING A NEW FUNERAL WHAT THE FUCK \n\nThen I got yelled at for being “unreasonable”",
                            "score": 141,
                            "author": "Domonero",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I worked in bone marrow transplant for a hot minute and a lot of times family DOESNT GET how compromised someones immune system is. Good for you for getting it and caring honestly. Even if they don't understand, you do and you're doing everything in your power to keep her safe :)\n\nOutside IS okay just avoid the humans. Cause they tend to be loud and annoying. Oh and the virus.",
                                    "score": 27,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, she sounds amazing. Having grown up in a home with absent/abusive adults, comments like these fill me with envy and inspire me to wonder how much more effective I'd be as an adult if I'd had the benefit of thoughtful parenting in my early development.",
                            "score": 9,
                            "author": "nonsensepoem",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "your mom sounds lovely. I'd like to buy her a nice, crisp salad.",
                    "score": 47,
                    "author": "10daysofrain",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I do the same with my daughter, i tell her i missed her . . . Because i do",
                    "score": 19,
                    "author": "LogicalOrchid28",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 27,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "People still do that to me and I'm 36.",
            "score": 710,
            "author": "Vyzantinist",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 204,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oy same",
                            "score": 100,
                            "author": "DaemonOwl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oy... nothing really, just wanted to say Oy\n\nOy",
                                    "score": 104,
                                    "author": "Not-The-AlQaeda",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Dada day dada OY OY OY OY!\nhttps://youtu.be/omNpug66xm8",
                                            "score": 23,
                                            "author": "Anglofsffrng",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well nice to foycking see you",
                                                    "score": 22,
                                                    "author": "astrom0m",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh! Look who came out to comment on a post!",
                    "score": 68,
                    "author": "mr_jiffy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Ditto, and I'm 60.",
                    "score": 35,
                    "author": "peckerbrown",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "shit it never ends huh",
                            "score": 12,
                            "author": "bloodflart",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm the same age, and live with my sister and nephew. My tv, xbox, books, tablet, weed, and expensive(ish) scotch are in my room. Of course I never leave it, I got everything I need in one 15x15 part of the house!",
                    "score": 46,
                    "author": "Anglofsffrng",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same, all my stuff was in my room. If I did come out and sit in the living room with my parents then one was usually on their computer and the other watching TV and doing that annoyed face-scrunching thing without looking away from the TV if tried to just make a quick comment, like the TV was saying something really important (while talking incessantly straight over anything I would watch).\n\nIf I brought my laptop or book with me then it would just be the same as me being in my room, and if I left anything downstairs for even an hour then it would be passive-aggressively put by the stairs back up to my room.\n\nAnd they wondered why I stayed in my room.",
                            "score": 30,
                            "author": "krittish"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a dad of 3 girls and my oldest is turning 12 and she is in her room all the time. I have been doing exactly what you are talking about......until now. I didn't think about this from this perspective. I just made comments trying to be funny and deep down wanting to hang out with her more.",
            "score": 1039,
            "author": "gwellsjr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe go to her and ask her to hang out? Give her some warning \"hey I was thinking of going for a walk this evening wanna come?\" But don't mention all the time in her room. \n\nMy dad was relentless with the \"jokes\" regarding how much time I spent in my room so I spent my teens avoiding my parents, even though I did enjoy going on walks with my dad.",
                    "score": 570,
                    "author": "flowerpuffgirl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And don't give up asking every once in a while if she says no. She'll appreciate the option even if she doesn't feel like taking it right now.",
                            "score": 264,
                            "author": "The_Modifier",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This, don't insist.  Let it be an option, but don't give up on them because they keep saying no.",
                                    "score": 131,
                                    "author": "Littleman88"
                                },
                                {
                                    "level": 3,
                                    "comment": "And if they’re a gamer, well, don’t expect them to drop what they’re doing to just walk out and do nothing with you. Maybe you want them to watch tv with you because that’s what you’re doing. Well maybe they don’t want to watch tv. Why should they always have to pass the time doing what you like to pass time with?\n\nYou’re gonna have to play games with them once in awhile. Ask for suggestions on something you can play together. If you’re not a gamer, don’t expect to play competitive things with them like fortnight / overwatch etc, unless they can play unranked games. MMOs are great for families, or creative games like Minecraft.\n\nAlso for the last time, they can’t pause online games.",
                                    "score": 26,
                                    "author": "BrassMunkee",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Girl dad, you have a wonderful opportunity to bond and empower her on the sly through household maintenance.! Tell her you need assistance on the most simple of chores- replacing lightbulbs, air filters, adding salt to water softeners. All the while explain the different kinds of tools you’re using; change one light bulb, then let her climb the ladder &amp; do the next on her own. Praise her, and then go get ice cream after. \n\nTeens are tricky. They clam up when approached directly. But they will let their guard down during activities and if you listen closely, sometimes share their likes, experiences, etc in conversations while doing other things. \n\nMy dad had me “help” work on cars and around the house at that age. Because of this I learned how to check my oil, use a mitre saw and what a shim is. Mostly I just remember hanging out with him feeling helpful. \n\nGood luck!",
                            "score": 129,
                            "author": "Popnursing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Girl dad, you have a wonderful opportunity to bond and empower her on the sly through household maintenance.! Tell her you need assistance on the most simple of chores- replacing lightbulbs, air filters, adding salt to water softeners. All the while explain the different kinds of tools you’re using; change one light bulb, then let her climb the ladder &amp; do the next on her own. Praise her, and then go get ice cream after. \n\nI love this comment so much. I'm a girl who grew up without a father and I wish so badly that I had a male role model to teach me about household appliances or tools or cars or whatever. Shit, I wish my mom had taught me about that stuff but she was too busy just trying to survive as a single parent. I feel like I missed out on so much practical knowledge that would traditionally come from a male role model and I'm still really salty about it even in my thirties.",
                                    "score": 36,
                                    "author": "apathetic-taco",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "My dad did the same and I learned how to do basic maintenance with cars.\n\nExcept changing a tire. I was literally jumping on the lug wrench to try and loosen it (per his instructions) and I wasn’t strong enough/heavy enough to get it loose so that is forever unfinished since he had to do it for me with his own body weight lol",
                                    "score": 11,
                                    "author": "brendaishere"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;hey I was thinking of going for a walk this evening wanna come?\n\nthis is a good idea, but also being direct and honest would be useful too. He will have to decide which is best. Being passive can sometimes not work and being direct can sometimes not work, depending on the mood of the child. /u/gwellsjr, just force yourself to overcome the mental blockade if you have one (maybe you dont know how to bring it up to her? I dont know your situation just guessing)",
                            "score": 16,
                            "author": "Nerdthrasher"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This LPT works for a lot of things. Also; clothing choices. If you have girls, please take this into consideration.\n\nMost of us have our own “style” when it comes to clothing, and, I’m sure a lot of us felt very strongly about what we wore as teenagers. Whether it’s whatever’s “in style” at the mall, sports themed clothes, band T-shirts, vintage, whatever. If your girls start wearing a particular style by default, apparently that’s their thing. If it’s not your cup of tea, try to come to an understanding about what it might mean for them. And for the love of god, don’t make a huge deal about it if they change or branch out!\n\nI preferred jeans and T-shirts’ and my hoodies. Sort of a tomboy aesthetic. Anytime I even tried something more “girly,” my dad made a huge deal about it! Well, that was a sure fire way to make me feel self-conscious and guarantee I would never wear that skirt or that pink shirt again.\n\nAlso, and I say this over 20 years later and I’ve long-since realized that my dad is just super awkward and he meant well, but at the time, my teenage moody self also felt that it was too “perv-y” that he would complement me if I wore girly clothes. He’s definitely not a creeper, but to a teenager, it doesn’t take much to make them feel like a parent has crossed a line for anything. My dad telling me “that outfit shows your body” wasn’t him being a skeeze, he was trying to say that it was a really different look than the baggy T-shirt I always wore which hung to my knees.\n\nBut again, I was a moody teenager who never left my room. Don’t give your girls any extra ammo to think their dad isn’t cool.",
                    "score": 47,
                    "author": "ijustwanttobeinpjs",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Thank you. It'll mean a lot, even if she/they don't say anything. You can just ask them to hang out and please please please *get interested in their interests.* I feel a little stupid saying all this as someone who doesn't have kids but this is what I wish my parents did so hopefully it'll help you. Snarky comments like that to a kid will really break the relationship with enough time, especially at her age. Thank you for being understanding.",
                    "score": 87,
                    "author": "kerenzaboy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude sharing an interest is so key! My dad and I have very little in common, and we certainly had/have our share of disagreements even now. But the one thing my parents shared with me is a love of live concerts. Not the music necessarily. I was into early 00s Alt-Rock and I wanted to go to concerts and festivals like the Vans Warped Tour. It blew my mind when my parents were actually just like “Hell yeah let’s go to the show!”\n\nMy mom drove me to all my concerts and she was my main concert buddy before I got my own car and started driving with friends. She was bummed the first Warped she didn’t go to and realized she missed seeing Joan Jett and the Blackhearts. My dad worked so he didn’t go as much, but he did sometimes.\n\nWe fought most of the time, like a lot of teens and parents do, but if there was a show coming up, we were always good.",
                            "score": 21,
                            "author": "ijustwanttobeinpjs"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you want to hang out with your kid the first step is to stop expecting them to hang out with you on their own. I mean she's 12 not 3. At that age she realizes you and her have little in common. She's also beginning to realise your a person not a magical super hero. \n\nYou need to find a shared interest. That, or become a safe of wisdom. A father's true wisdom is knowing that what he wants for his children doesn't matter. What matters is seeing your child get what they want for themselves.",
                    "score": 55,
                    "author": "BrandNewWeek"
                },
                {
                    "level": 1,
                    "comment": "Awesome of you to see a flaw in your parenting and wishing to correct it, I know too many parents that refuse to change their ways with evidence of them further hurting their children.",
                    "score": 17,
                    "author": "bit32x"
                },
                {
                    "level": 1,
                    "comment": "I remember so many fights starting between me and my dad at that age over things he found “funny”\n\nIt’s not that they weren’t funny (they totally were) but I was just so not in the mood for tomfoolery at the time. I love my dad’s humor, but 12 year old me was too moody to deal with it sometimes.",
                    "score": 10,
                    "author": "TheBonesRTheirMoney"
                },
                {
                    "level": 1,
                    "comment": "I don’t think most parents do things like this in a malicious way. I understand that being a teenager is challenging mentally and emotionally. I always try to remember how I felt during that time but I still fall short. My go to is that if my daughter says that I am embarrassing her or asks me to stop then I will. \n\nIt’s hard to navigate though. Once after she got back from horseback riding lessons I told her that she looked good. We were at home and it was just me and her little brother. She bawled and said that I was embarrassing her. It sounds asinine on the surface but I imagine that she wasn’t feeling her best about her lesson or had an embarrassing moment so it felt like I was chastising her to her. If that isn’t the case then I have no idea! Haha!",
                    "score": 9,
                    "author": "SouthernNanny"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you. I jokingly tell my son this fairly often. After reading your post I will no longer do it again.",
            "score": 389,
            "author": "spen7",
            "replies": [
                {
                    "level": 1,
                    "comment": "As someone who deals with this multiple times per day, thank you",
                    "score": 122,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[Everyone liked that]",
                    "score": 175,
                    "author": "PaulieVideos"
                },
                {
                    "level": 1,
                    "comment": "Thank you! My parents would do this all the time.\nI'm pretty introverted and perfectly happy being alone for good stretches of time and the reason I stopped coming down went from \"because I'm happy being in here right now\" to being \"I'm unhappy being down there.\"",
                    "score": 51,
                    "author": "Unfriendly_Giraffe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want to expand this idea well into adulthood and say that parents should make it \"easy for kids to return to them\". I don't just mean physically move home, but if your son hasn't called in a month, don't mention the absence. Don't put a hurdle there and make it uncomfortable. Just jump straight into talking about good things as if no time passed at all. If there's something deep you need to talk about, do it later. When a pilot is coming in for a landing, just try to make it a good landing.\n\nOtherwise, if you make a big deal about the absence, then the next time will be worse because your son will be thinking about how to explain the absence. So skip right over that. Be welcoming. That way your son will think, \"Oh, it wasn't a big deal at all.\" It needs to be easy for your kid to call you or text you even if it's been a while.\n\nIf every time you call your mom there's a few minutes of feeling guilty and explaining why you haven't called your mom lately, then it adds more strain to what is obviously an already-strained relationship. The result is that you're probably going to call your mom less and less, rather than more. Because that's the way guilt works.\n\nIf you're reaching out to your kid when you haven't heard from them in a while, don't say, \"Haven't heard from you in a while,\" and put that guilt on top of whatever shit they are going through. Instead, pretend the absence didn't happen and ask a question that is easy to answer and has absolutely no consequences like, \"Hey you want our old futon?\" Or, \"I wanted to ask you for TV show and book recommendations. You got any for me?\"",
            "score": 277,
            "author": "CurlSagan",
            "replies": [
                {
                    "level": 1,
                    "comment": "This so much, I've had periods of time during uni where I couldn't even pick up the phone when my mom called because of lingering guilt, only to feel miserable and call back after a couple of days of building up courage to get scolded for my radio silence (before the subject went to how poorly I was doing in college of course)",
                    "score": 68,
                    "author": "Pixel-1606",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; but if your son hasn't called in a month, don't mention the absence. \n\n\"oh, you remembered you have a mother?\" - every time.",
                    "score": 37,
                    "author": "FoleyisGood",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 21,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So don't? No sense in setting yourself on fire to keep them warm.",
                            "score": 32,
                            "author": "PlNG",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For friendships too! If I've been busy and unable to see you or take your calls for a while, don't give me a truck load of guilt when I do connect with you.",
                    "score": 14,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same. With me it was sleeping too long though. Was shamed for not sleeping normally.",
            "score": 92,
            "author": "Cr00kedKing",
            "replies": [
                {
                    "level": 1,
                    "comment": "As long as it wasnt getting in the way of anything then its alright. I can see expressing concern over sleeping too much but not being shamed for it",
                    "score": 40,
                    "author": "obliguity",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im 21, hispanic and my family do this all the time, from when I come out og my room, or clean something, or cook something.\n\nAnd they wonder why I never do those things, I want to, but I cant be fucked to hear \"Oh look who is making something, hope he doesn't burn the house down haha\" every time I TRY to cook.\n\nAnd I love when they say: \"Oh I wonder what you would do when you'll move out and live by yourself, what are you gonna do? Call mom?\"\n\nTired.\n\nI love them but fuck off.",
            "score": 90,
            "author": "tom_w45",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same for me (but not Hispanic). My mom was *so* worried that I’d starve when I went off to college because I never cooked at home. There were many reasons for not cooking at home and one of them was the attention I’d receive. “Oh look! She’s cooking!” Joke was on her though. Colleges come with dining halls!\n\nAlso it’s so easy to look up recipes online and follow the directions. So I do that.",
                    "score": 8,
                    "author": "aerialariel22",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Being told to do something right when you’re about to do it makes me not want to do it.",
            "score": 69,
            "author": "TigerGrubs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was always like that too, especially when my younger sister would tell me to do something. Immediate shutdown. Even if I knew I’d get in trouble for not doing it. I’ve always wondered if it was just me or if other people felt that way too",
                    "score": 12,
                    "author": "Songbird1529",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is an actual psychological explanation for this, and it's more common than you think. I can't remember what it's called but I'll try to find it.\n\nEDIT: I believe it's called a reactance, and it's the reason why reverse psychology can sometimes work. Basically you do something of your own free will, but when someone orders you to do it, it limits you to that task, and you no longer choose to do it. It's pretty common in people of all ages, but like most things, an extreme amount of it could be classified as a disorder.",
                            "score": 15,
                            "author": "Gertrude_Thundercunt",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel this so much....\"all you do is stay in that *dungeon* all day\".....smh 🤦🏼‍♂️🤷🏼‍♂️ I don't know how many times I hear that from my parents. I hate I had to move back in with them, but I shall have my own domain again before long! Keep it real OP!",
            "score": 619,
            "author": "Corvum_Cernis",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see that you're the master of your domain.",
                    "score": 121,
                    "author": "ani625",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you want someone to change their behavior, dont shame them when they change their behavior. Used to have an aunt that did this all the time when i would show up to a family party \"oh wow nice you finally made it out to see your FAMILY\" - \"Wonder why YOU never come to visit us\" .. well maybe because i disagree with everything all of you say and dont understand how i came from a family with this level of intelligence?",
            "score": 348,
            "author": "AlarminglyConfused",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I had an aunt that would always demean me and mock me. Around the age of 14 I took a stand and refused to leave my room when she came to visit. My parents came in and told me to “come say Hi” and I explained that I didn’t want to because she would be mean to me. They argued that “no, she doesn’t do that!” I walked out of my room and the first words out of her mouth was “Geez! Nice of you to finally come out and join us!” Without saying a word or changing my pace, I turned around and went back to my room.",
            "score": 48,
            "author": "bendcomedy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea and that's how you found out that part of the family isn't needed. I hope things are better with you and your parents at least.",
                    "score": 16,
                    "author": "Dcm210",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My mom’s side of the family uses shame to communicate and my dad’s side uses guilt. Neither of them are taking the pandemic serious. I haven’t spoken to them in several weeks.",
                            "score": 13,
                            "author": "bendcomedy",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah. I'm a night owl so I usually wake up at like noon (actually my mom wakes me up at noon, which is an entirely different thing that I want to complain about, but that's not what this is about) and Everytime I get up she'll say something along the lines of \"oh you're alive\" or \"look who's finally out of their cave\". I get that it's just a little joke, but it's not funny if you make it literally every single day. Also it makes me not want to get up before noon if I do happen to wake up early (it happens occasionally)",
            "score": 216,
            "author": "ByroniustheGreat",
            "replies": [
                {
                    "level": 1,
                    "comment": "In my situation it's a mix of attacking something I'm insecure about and being way too often. If nothing else it's just annoying to have a little jab taken at me every time I walk through the house. It's not like I haven't made my feelings about it clear to him.",
                    "score": 99,
                    "author": "obliguity",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Noon? Thems rookie numbers",
                    "score": 34,
                    "author": "Greasy_Goon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "3pm gang checking in",
                            "score": 12,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Man I really resonate with this. The extra funny/sad thing is if I fall asleep at 5 and get up at 12, and my schedule allows it, that’s usually less sleep than the other people in the household but they still act like it’s lazy and sleeping in.",
                    "score": 9,
                    "author": "DrainTheMuck"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\\&gt;Make fun of good behavior\n\n\\&gt;Good behavior happens less\n\nSurprised pikachu.jpg",
            "score": 150,
            "author": "FunnyObjective6",
            "replies": [
                {
                    "level": 1,
                    "comment": "\\&gt;Parents: *Treat children like shit\n\n\\&gt;Children: *Turn 18, move out.\n\nParents: Surprised pikachu.jpg",
                    "score": 73,
                    "author": "OoopsAlreadyTaken",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What about positive comments like \"it's good to see you\"?\n\nOr just don't draw attention to it?\n\nI'm honestly curious as this wasn't an issue in my house growing up.",
            "score": 44,
            "author": "fantasynerd92",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not drawing attention is preferable if you’ve previously been a dick about out. A positive comment will just come across as condescending or sarcastic.",
                    "score": 28,
                    "author": "sylbug"
                },
                {
                    "level": 1,
                    "comment": "To me these are the way to go",
                    "score": 24,
                    "author": "obliguity"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tried explaining this to my parents, but it made their comments even worse. They now passive aggressively say stuff and then pretend they never said it.",
            "score": 35,
            "author": "NetherFX",
            "replies": [
                {
                    "level": 1,
                    "comment": "Uh... Isn't that gaslighting?",
                    "score": 21,
                    "author": "ksmith1994",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I guess it is",
                            "score": 11,
                            "author": "NetherFX",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel the same way about clothes/style choices. I pretty much exclusively wore jeans and tshirts up until college, when I finally had the courage to wear skirts, crop tops, makeup, etc. But then anytime I visited family, it would be a whole ordeal. “Ooooh, look who finally got dressed up!” “Why’re you all dolled up?” “Wow! It’s a girl!” Like, I’m still the same asshole regardless of clothing, please stop.",
            "score": 36,
            "author": "sardonicspaceman",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I wish my mom knew this when I was younger",
            "score": 31,
            "author": "TheNerd669"
        },
        {
            "level": 0,
            "comment": "My dad did this to me constantly. He would always go “HE’S ALIIIIIVEE” like in the Frankenstein movies",
            "score": 53,
            "author": "bananabrains9816",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, same here.",
                    "score": 14,
                    "author": "obliguity"
                }
            ]
        },
        {
            "level": 0,
            "comment": "honestly, screw anybody that comes into this comment section and tries to tell you to “toughen up” or “get a life”. i’ve been trying to tell my family this for so long, and they still have yet to grasp it. social anxieties are real, and they prey on your mind and eat away at your conscious. \n\ni can’t tell you how many times i used to lay in my room at my parent’s house, wanting to get up and grab a snack or go to the bathroom or just even step outside. but the pure dread of potentially facing that kind of comment and worrying over and over again what someone might say to me or think about me forced me to stay in my room.\n\nnot just that, but the constant noise of thoughts and worries over what people perceive you as, what they think of you, and fear of facing awkward situations makes going through life a chore sometimes.\n\ni hate having social anxiety, but it’s not a choice. i didn’t just say one day “hey let me try this out”. it sucks, and i wish i knew better ways to communicate to others about how i feel and what i experience.",
            "score": 258,
            "author": "ThatGuy5632",
            "replies": [
                {
                    "level": 1,
                    "comment": "Therapy. \n\nI suffered throughout my entire childhood and seriously never functioned properly until I started seeing someone. If you keep sitting there and using anxiety as an excuse not to do things, you'll be in a rut until you die. I used to hear people tell me that and say shit like \"yeah I'll just *stop having severe anxiety*\" and get angry about it.\n\nBut really. You have to do it yourself. If you don't, you're building your own prison for yourself. You may need intense therapy, you may need a new routine, you may need medication, or you may need fuckin' LSD. The important thing is to keep fighting against it and remove it from your life as well as you can. \n\nAnyway, I believe you can do it, and I'm coming from a good place. I wanna say I understand your struggle, but as a person who suffers from a cocktail of mental inconsistencies, I know for a fact no two struggles are the same. But please don't give up.\n\nEdit: someone gave me an award but I just want to point out that I'm not a professional and I still struggle daily. Please don't take my \"you may need fuckin LSD\" seriously because I don't advocate using any kind of drugs in an unhealthy or unguided way",
                    "score": 112,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I completely agree. I grew up in a decently small town, and went to a very small school (only a K-8 with around 10-15 people in each class). My childhood wasn't exactly filled with meeting new people. Then when I went to high school at a much bigger school it took a long time to find the small circle I fit in with. When I got my job as a cashier I got thrown into the ringer. It went from meeting 0 new people to meeting 100 new people a day. I hardly said a word my first day. I didn't go to therapy, I just had to work through it. It wasn't easy, fast, and I'm certainly not 100% cured, but for me it was the practice that helped a lot. I completely agree with you saying you're the only one that can actually do anything about it. A therapist can tell you as many ways to deal with it as you can remember, but if you never challenge yourself, it'll never improve.\n\nKeep going /u/ThatGuy5632 you got this",
                            "score": 39,
                            "author": "obliguity"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That totally hits home, i would feel such relief when they would go out so i could actually go do things around the house freely.",
                    "score": 17,
                    "author": "DamianWinters"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mom used to do this any time I wore anything even slightly outside of my normal jeans and a black t-shirt. It was so awkward that it took me basically moving away to college to start branching out into other clothes. Even now, years later, I still know she's going to say something when I wear anything even slightly trendy.",
            "score": 20,
            "author": "MsYeti909",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’ve never related to anything on this website as closely as this",
            "score": 18,
            "author": "nanimaal"
        },
        {
            "level": 0,
            "comment": "Same with healthy eating. Every time I attempted to eat well my ex would touch my head and ask me if I was sick.",
            "score": 16,
            "author": "pavlovasavage",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My dad did this while I was growing up, with singing in church. Mocking my bad voice (I’m a pianist) and saying stuff like “stick to the keyboard”. 20 years later, I’m a musician/music instructor and I still don’t sing in front of him.",
            "score": 16,
            "author": "pianomasian",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My parents seperated when I was 1year old. Growing up my dad would barely call me. Whenever I called him he would say \"hey there's the stranger\". It just made me feel like my dad didn't know me, I didn't know my dad and then I'd get pissed because why the fuck wouldn't he call me to talk to me if he felt like we were strangers. He obviously didn't want to talk to me that much so I don't need to talk to him. I don't tell him shit now.",
            "score": 15,
            "author": "irlnerd"
        },
        {
            "level": 0,
            "comment": "Or just because they left their room doesn’t mean you should should immediately shove conversation down their throat. I’d leave my room and as soon as my mom would see me it’d be “hey” followed by some question for me or a story about some mild drama/annoyance she’s dealing with. Trying to make some food? Conversation. Heading to the bathroom? Conversation. Grabbing a glass of water? Conversation. Trying to leave? Conversation. I wish so much I could’ve just been in her presence and not have to talk. Dated a girl who’s family was like that. Everyone would just pass through or hang out in the same room and just mind their own business. It was fucking bliss.",
            "score": 33,
            "author": "metolius",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Same with ‘oh so you CAN talk?’ with shy kids!",
            "score": 33,
            "author": "lkap28",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have to point out that I feel exactly the same way",
            "score": 13,
            "author": "ToastMaster0011"
        },
        {
            "level": 0,
            "comment": "I mean, this applies to adults too. At work we can start (pre-lockdown I mean) between 8 and 9am, so if I generally arrive for 8:30 and then one day arrive at 8 or 9, there will be comments from one particular person. It's banal and unfunny yet it never stops. It's not even shaming at this point. It's beyond trite.",
            "score": 13,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "One of the best times of my life was right after I moved out and had a place to myself, because I was finally **allowed** to be things and try things.",
            "score": 13,
            "author": "eekozoid"
        },
        {
            "level": 0,
            "comment": "My parents never did this, but during lockdown i stayed in the living room as much as possible. Initially i thought that this would be awkward as i used to spend whole day in my room, but turns out this was actually fun. Had long talks and discussion with dad, watched tv together, had a few laughs, played some board games with family. I mean it wasn't a 180° change, i still use my phone most of the time and read some books but it was a nice change that's all.",
            "score": 22,
            "author": "RAZORthreetwo"
        },
        {
            "level": 0,
            "comment": "Dude yes. \n\n\"Look who decided to join us\"\n\n\"It lives!\"\n\n\"Glad to see you came out of your dungeon/cave/fortress of solitude\"\n\nI miss my dad though and he had a good sense of humor. He always ragged on me for two reasons though: to desensitize me to getting picked on and because he literally didn't understand. \n\nWhen he was a kid, staying in your room was more of a punishment when you weren't somehow nerdy and playing with chemistry sets or reading. He also grew up poor without any technology or even electricity in his house until he was around ten or eleven. So I feel like a lot of that was just him being concerned as a parent, not being able to understand that I was perfectly happy sitting in my room and reading.\n\nHe also didn't understand depression or anxiety because those were things his parents didn't care about. \n\nI dunno, man. I'm 26 and look back on how my parents treated me a lot, and sometimes they were pretty bad which makes stuff like this seem worse. But when I think about certain stuff that used to annoy me - like my dad intentionally embarrassing me in public or getting mad because I skipped school - I have to have some understanding. I feel like if I'd done that at the time I would have learned a lot and avoided some bad feelings.",
            "score": 39,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When I was a teen I got into computers in a big way. I was already an avid reader so I'd spend AGES in my room reading or playing computer games. I'm naturally very fair and pale skinned and my Dad used to call me 'Ghost' because 'I was so pale from never going outside and came down to haunt them once in a while'. Every time I came downstairs he'd gasp and pretend to be shocked at 'the ghost'. Got old real fast.",
            "score": 8,
            "author": "mythic_hypercurve",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Same goes if you have a picky eater. If you give your kid something they're skeptical about eating and they like it, just be cool about it. If you make a big deal out of it, they won't try things out of fear that they'll like it and being told \"See, I told you!\"",
            "score": 7,
            "author": "MTRsport"
        },
        {
            "level": 0,
            "comment": "Adding onto this - don’t do it to your roommates either. I sometimes get periods of bad depression where I stay in my room most the day if I don’t have to work. When I finally come out, it makes it 100% worse when my roommate is like, “Good morning!” at 3pm or, “Good to see you!” All it does it give me anxiety on top of the depression.",
            "score": 14,
            "author": "crazydaisy8134",
            "replies": []
        },
        {
            "level": 0,
            "comment": "All. The. Time.\n\nOr if I decided to fill the dishwasher or put on laundry, they'd always say \"are my eyes deceiving me\" or something similar. Then I'd just stop and go back to my room.\n\nIf you want someone to do something, why would you mock them when they do it?",
            "score": 15,
            "author": "whistnow",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Oof. I might be guilty of something like this. I always joke around whenever somebody does something stereotypical of them (eat ice cream, take selfies, etc). I’m pretty sure I’m not making them uncomfortable, but now I’m not sure. You guys think I should stop, or am I overthinking?",
            "score": 8,
            "author": "purplesaber-0617",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ask the person you do it to, some people can take jokes about their behavior better than others. Sometimes people need reassurance that it's not an attack, but a light hearted joke.",
                    "score": 8,
                    "author": "Overlord_Orange",
                    "replies": []
                }
            ]
        }
    ]
}