{
    "id": "hmnhgu",
    "score": 39917,
    "title": "YSK that no matter how close you are with your children, you should not share the details of your marital problems with them.",
    "author": "qrushqueen",
    "date": 1594095117.0,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/hmnhgu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Trust me. They may seem very intelligent, mature and understanding and they may be so too but you can do your children a very great favor by not blurring this line, or else, without you even realizing it can become an immense and distressing burden for your children.\n\nEdit: Wow I did not expect this post to blow up like this but I am very glad it did. Thank you so everyone who is sharing their personal stories, the fact that you went through all this and it’s negative impacts on you is a testament to why this advice matters.\n\nAlso thank you so much for all the awards.\n\nSome people seem to be missing my point or perhaps he I could’ve been clearer. So there are a couple of clarifications:\n \n• this post in no way suggests that you should lie to your children and pretend like everything is okay when it is not\n• there is a middle ground between lying to your children, pretending there is no problem, and evading any questions they may have and sharing way too much and even unintentionally putting all the baggage on them and feeling like it’s their responsibility to fix it.\n• this post does suggest that you should not, no matter the maturity intelligence level of your children, you should NOT put the burden of your marital/divorce-related problems to the children, do not mistake them for your marriage counselor, or your best friend, or your confidante.\n• you may be alone, go make friends or talk to a therapist, please\n• not dumping every single emotional baggage on your children IS different than having a conversation with them  and talking with them about the issues that may affect them on a need-to-know bases \n• also, abuse is a human rights violation is different than cheating and smaller fights, and requires a separate consideration along with any other safety threats. \n\n\nFor those of you who are asking what this post is based on, or what is the psychological backing...  Please look into terms “parentified child”, “early parentification”, “emotional (covert) incest” and “triangulation”. \n\nPlease read u/sassatha ‘s comment on this thread where they briefly explain emotional incest.\n\nSending everyone love and kindness. You can unlearn and learn the healthy ways, and to establish new healthy boundaries.",
    "comments": [
        {
            "level": 0,
            "comment": "Both my parents told me about their problems with each other from when I was seven. At fourteen I drew the line when the pressure of keeping my family together pushed me to a really dark mental place. My mum completely withdrew and started forcing me to confide in her. My dad started blaming me whenever anything went wrong.\n\nNow I take responsibility for everything (even being born and limiting my parents’ prospects), find it difficult to set boundaries without feeling guilty, I struggle with confiding in people, have too many repressed memories to count and I’ve distanced myself from basically everyone because I feel guilty for not being able to solve everyone’s problems.\n\nI knew at age 8 that my parents were going to divorce at some point and that it would be my dad leaving my mum in the dust because she’s too scared to.\n\nObviously there are other issues in my parent’s relationship. Leaning on me when I was just a child damaged me beyond anything else.\n\nDon’t do the same to your children.",
            "score": 371,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "How can you tell if you have a repressed memory? Asking for a person who sees themself in your story",
                    "score": 37,
                    "author": "brallipop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s one person in my life who has been there when the events happened and remains with me now who remembers parts of things I’ve told them. I only remember the full story when he tells me the parts of it he remembers, or when I’m so emotionally worn down that I can’t hold anything back.\n\n‘Opening up’ is a really apt phrase for me - once I start remembering something, the memories keep coming and coming like a flood. I keep talking until I can’t remember anything more.\n\nThen I forget again. I remember saying the story, but I don’t remember what it was about unless someone who heard it says part of it. Rinse and repeat.",
                            "score": 42,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I feel you.\n\nI'm 21 now and my parents separated 5 years ago. My dad left the house and my two brothers (and me and mum obviously) and I've been told every detail about what happened/what's going to happen as they aren't divorced yet.\n\nI feel like im helping my mum by listening to her but and I genuinely don't mind listening and helping her out, but then I find myself more easily incumbered when something at work happens or I get remotely stressed. Like it's so much easier to feel burnt out or stressed. It's only nowadays I think I realise this and honestly, I need to find some way of telling her I really don't want to hear about it.",
                    "score": 6,
                    "author": "ajc123456_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It depends on what you mean by the \"details\" because you absolutely should show your children, by example, that even healthy relationships will have disagreements. And then you should follow that up by showing them how healthy people in relationships resolve conflicts.",
            "score": 2362,
            "author": "keith_richards_liver",
            "replies": [
                {
                    "level": 1,
                    "comment": "My parents didn’t do this and all four of us have had major relationship problems. Only two of us have gone to therapy for it, so it makes family gatherings super difficult now that *my dad is getting remarried to the woman he cheated on my mom with* **whose son is dating my sister**.",
                    "score": 143,
                    "author": "reagsters",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've seen so many documentaries about your family on PornHub.",
                            "score": 178,
                            "author": "coldfu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's even a anime made on his family (domestic girlfriend)",
                                    "score": 19,
                                    "author": "k110111"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree with you. I was more so getting at details that  you don’t need to know to see and understand threat there are problems. I think what you are saying is very important, I wish more people ended their marriages when it’s not working because in the long run it’s just harmful to everyone.",
                    "score": 561,
                    "author": "qrushqueen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see what you're trying to say but it's a little bit problematic. It's from the perspective of people who are looking at an unhealthy relationship. \n\nHealthy people can air all the dirty laundry out in the open and it's not damaging because healthy people are honest, constructive, and empathetic. The details aren't damaging. And they aren't going to resort to petty name-calling, attacks and hurtful criticism. That's what unhealthy people do, and those are the \"details\" that are harmful for children to hear.\n\nSo you're really only speaking to unhealthy people, it's the proverbial band-aid on a bullet wound. If you are confiding in your children that the other parent is a lying whore, you've got much bigger problems than just leaving the details out.",
                            "score": 310,
                            "author": "keith_richards_liver",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This, exactly! My parents have a reasonably healthy relationship. There are definitely areas that need improvement, but it's working for both of them and they're a pretty cute couple. But if they hadn't made an effort to be transparent with us growing up, we would never have guessed.\n\nNeither of them is really emotionally intelligent at all and they both have some stuff they have not worked through at all. So they tend to bottle up negative emotion and then blow up. They're not violent, just kinda have a meltdown: yelling, crying, complaining etc. Then the other one tries to help, and sometimes it works, and often it doesn't change anything.\n\nBut sometimes the other parent gets sucked in and now both of them are having a mutually reinforcing meltdown/fight. Again, no physical violence, no name calling, but every single dumb petty grievance and feeling and miscommunication gets shouted at full volume. Usually with some stomping and loud housework. We lived in a bungalow and we weren't deaf, so yeah, we knew what was going on. If that was all we'd seen, we would have been seriously messed up.\n\nBut thankfully, every time that would happen, as soon as my dad would cool off a bit (usually way before my mother), he would take us for a long walk and explain that this was not ideal, but it was just a bump in a road they had both chosen. And that, even when they were flaming mad, they still loved each other and were all in. And then we would get back, and all calmly sit on my parents' bed and talk about what adjustments needed to be made to resolve the issues that had been brought up. And then we would all hug and cry it out.\n\nAnd every day, they would flirt at the kitchen table, and compliment each other on everything, and do sweet things for each other, and talk about their days. There were lots of PDAs, but also harmless pranks and jokes. They had a rule that if either of them felt attracted to someone else, they told the other person. That way jealousy and secrets wouldn't fester. When we were older teenagers, they started doing it in front of us, just so we had a more realistic picture of what was going on.\n\nSo yeah, their unhealthy bits were impossible to hide, so thank goodness they made sure to show us their healthy stuff. I'm definitely working on my emotional intelligence and communication because blowouts suck and I don't want them in my relationships. But on the whole, there's a lot from their marriage that I want to emulate.",
                                    "score": 114,
                                    "author": "MathAndBake",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My fiance and I grew up in pretty dysfunctional households. His mother is a narcissist and they never talked about feelings or anything. My mom yelled about everything, my dad never got involved. We would stop fighting and \"make up\" but nothing was ever resolved. It was a huge mindfuck having to apologize for something you didn't do.\n\nWe both brought our issues into the relationship but over the years we have become such an awesome pair. We don't fight. We have disagreements but we always resolve them and they are always constructive. It blows my mind that good communication is possible. Honesty is possible. We can communicate without calling each other names or putting each other down. Im sad that I missed out on it growing up but it's a beautiful thing to have now. I know that I'll mess my kids up somehow but it won't be because of a toxic home.",
                                            "score": 19,
                                            "author": "northdakotanowhere"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You're very lucky",
                                            "score": 15,
                                            "author": "Dingleberrydreams"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think there are so many mother scenarios and specific events/problems that can happen in between the two categories you mentioned such as healthy people and name calling/attacks etc which are the  obviously bad things. I think not sharing every little thing is a way of the healthy dealing part. In marriage-divorce related trauma, your child shouldn’t be your confidante, best friend or counselor",
                                    "score": 59,
                                    "author": "qrushqueen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; your child shouldn’t be your confidante, best friend or counselor\n\nThat I 100% agree with.",
                                            "score": 99,
                                            "author": "keith_richards_liver",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I can very much relate to your original post and agree with it. As a 10 year old kid I feel like I didn’t need to hear “your dads a worthless piece of shit who doesn’t make any money” on a daily basis.",
                                            "score": 8,
                                            "author": "Comrade-Cohaay",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You definitely should not have. If there was a need to communicate his problem behavior, that wasn’t it, I am sorry you had hear to that.",
                                                    "score": 8,
                                                    "author": "qrushqueen",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": " Lumping people into healthy and unhealthy overlooks that literally everyone has baggage that they cope with differently. In this context healthy is a spectrum that means a person has mostly acknowledged their baggage and unhealthy means a person is more oblivious to it... but both of these types of people are capable of overstepping a parent-child boundary in different situations based on their experiences. This advice really applies to all people who have a tendency to vent, and not just in the extreme scenario of calling the other parent whore, but including all minor criticisms.",
                                    "score": 13,
                                    "author": "Trumpsbuttholemouth"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I grew up with a mother that told me every problem she had with family members, friends, and my dad. She explained at length why my dad wasn’t there for her emotionally and why she hated his mother, etc.. As a tiny child this was incredibly damaging. I can’t agree with OP enough on this subject. I will never let me children see or experience my issues with my spouse or family members. I see my mom now as incredibly selfish and self serving not to mention manipulative. I don’t care how lonely you are, children are not wired to understand adult problems. It’s reasonable to let kids know conflicts can be resolved but I don’t agree that kids should witness conflict among their parents and family members.",
                            "score": 6,
                            "author": "Ohmydoornutz",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also talk to them about finances.",
                    "score": 13,
                    "author": "coldfu"
                },
                {
                    "level": 1,
                    "comment": "Basically this. I'm recall psychologist Scott Peck did work on this back in the 70s and his work showed you shouldn't hide such problems from kids as they sense it anyway causing even more damage.",
                    "score": 17,
                    "author": "rcx677",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "But come clean if they ask as a teenager or adult. Having secrets kept from me really fucked me up in high school, esp when I sniffed around and found some things out later on.",
            "score": 5581,
            "author": "Polar_Reflection",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think even then you need to set boundaries as a parent. Tell your kids what's going on, but don't turn them into your buddy for venting. I think the term in family therapy is triangulation. \n\nI had a similar experience when I was a teen, except when I found out, my mom vented all her marital problems to me and our relationship became really toxic.",
                    "score": 905,
                    "author": "SillyOperator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My mum used to sit me down when my dad went out with his friends (on a rare occasion) and would tell me we we having “girl talk” which basically meant her shitty on my dad for three hours without asking any questions about me or my life",
                            "score": 321,
                            "author": "touristmeg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My dad did and still does shit like this to me. Just complaining about how my mother cares about the dogs more than he does her and she just sits in bed watching TV instead of helping out around the house. It put a pretty big strain on me when I was a teenager because I was already a pubescent emotional wreck, and he put even more weight in my shoulders",
                                    "score": 91,
                                    "author": "kanyetothee"
                                },
                                {
                                    "level": 3,
                                    "comment": "God, my parents divorced when I was 8 and that’s all I heard for the first year when I’d see either of them. They’d just vent at me about how shitty the other one was. Now I can’t really stand either of them, still see my mom but now she vents about her boyfriend and how shitty he is. Ruined my perception for what relationships (romantic or otherwise) were supposed to be. Don’t understand why people make themselves miserable hanging around those who make them unhappy",
                                    "score": 4,
                                    "author": "brahmen_noodle",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It can also become what’s called emotional incest, where the child becomes the emotional support for the parent.  I don’t know when it started for me (it might’ve been elementary school but I know for sure my mom was telling me shit I never should’ve heard in middle school).  It fucks you up royally.",
                            "score": 145,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It really does...my mother started telling me serious things when I was in elementary school...",
                                    "score": 51,
                                    "author": "nudesgrl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same here. Really made me feel fucking weird towards my mother. Even as a small kid, it felt like this wasn't what mothers were supposed to do.",
                                            "score": 41,
                                            "author": "MotherfuckinRanjit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's crazy how much this is happening... I'm sorry :/ at least we can learn from their mistakes and try to raise mentally stable kids, unlike us..lol. All joking aside, I do hope you're in a good place.",
                                                    "score": 24,
                                                    "author": "nudesgrl",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "100% this. I'm a parent and I read posts like this and make mental notes of things to be aware of! It's much easier to talk online about these kinds of emotional burdens we have as children and I just hope really hard that the people sharing this get some kind of release by talking about it but also that people can learn from it too",
                                                            "score": 6,
                                                            "author": "ramazra",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My parents hid those things from me, but I knew something was wrong (didn't exactly take a genius with all the screaming and stuff being broken, walls being punched). I found 4chan when I was like 9 or 10 to help cope with how crazy my home life was coming. You can imagine that fucking a little kid up even more.",
                                    "score": 21,
                                    "author": "Polar_Reflection",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly this. When I was a teenager I was my mom's confidant for all of her mental issues and it fucked me up a lot. \n\nProbably the worse is when we lost everything because of her white collar crimes, we were forced to move all the way across the country to live with family members. My sister decided to move back across the country to live with our father, I stayed with my mother. She then told me at age 17 if I had left that she would've killed herself. I was struggling a lot with my own mental problems, especially not having any friends or other family members, at the time. I didn't need to be told that and didn't need that kind of pressure.\n\nNever make your damn kid your therapist.",
                            "score": 49,
                            "author": "vessol",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This. Hearing my parents screaming they would rather be dead due to Bill's not being able to be paid before leaving to school and having absolutely nothing I can do about it really made me uncomfortable. I felt bad that they had to provide for me even though I didn't ask to be born.",
                                    "score": 11,
                                    "author": "hannibalecter237"
                                },
                                {
                                    "level": 3,
                                    "comment": "I feel a bit of this too.  I remember talking my mom down from suicide when I was in middle school because she couldn’t control herself and my dad didn’t want to deal with it - so it got left to me.  It fucks you up hearing your mom say “I have nothing” when there’s you and your two little brothers.",
                                    "score": 5,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm an adult and my mom complains to me about my dad. She apologises sometimes saying she shouldn't and I'm the one who tells her it's ok. She has noone else to talk to. My dad is an asshole but is dependent on her. She loves him and can't leave him. It would be better if she did. If she told anyone else what she tells me they would tell her to leave him. I'm the only one who understands how she feels. It's also a binding thing for us to complain about him. She almost left him (I was convincing her) 2 years ago but then he got sick and we got to where we are now. I don't live in the same country and don't spend that much time with them so it's easier.",
                            "score": 9,
                            "author": "boo29may"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree. I found out stuff about my parents when I was in 4th grade! They were hypocrites and I hated that they were not honest with us kids about things going on in their marriage, that we secretly found out about ! We weren’t stupid! We knew but no one wanted to “talk about it”! It really messed me up a lot! Secrets are never good! While I certainly don’t share details about our sex life, we are very open with our kids about our marriage even when we have disagreements. It teaches our kids to be honest &amp; to see that things get tough in relationships but we work through it. We are also open about finances, after all we want to teach them the right way to handle money and we talk about getting old and handling our inevitable death. We talk about things like a family. Together. The older they get, the more we share &amp; teach. Never ever keep secrets in the family! Inevitably they will come out and it will only lead to distrust, pain, &amp; anger.",
                    "score": 14,
                    "author": "Thisismyusername89"
                },
                {
                    "level": 1,
                    "comment": "I can imagine that must be difficult too. I would say share what is needed to prevent the stuff you’re referring too, but I am still on the side of nothing more than what is absolutely needed.",
                    "score": 918,
                    "author": "qrushqueen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would say answer questions that are asked and don’t hold secrets (as reasonable as can be), but mainly don’t use your kid as your friend you vent to, or your psychologist you work through your mental/emotional issues with. They are obviously unprepared for such heavy discussions and like OP said, is a huge burden for a kid to have to deal with. \n\nBut I’d also say keeping secrets from your kids when they are asking questions could be equally traumatic because then they are constantly wondering what their parents are keeping from them, and your imagination can run wild with that shit.",
                            "score": 799,
                            "author": "roklpolgl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I went through that and I’m still fucked up",
                                    "score": 73,
                                    "author": "lucius_566",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same and I’m almost 30 at this point.",
                                            "score": 21,
                                            "author": "SparkleTheElf",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Same. Made me want to be truthful to my future kids",
                                                    "score": 6,
                                                    "author": "WhiteHairedWidow",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I can attest to this. My parents kept me in the dark as a late teenager during the 2008 recession... Despite frequently asking questions, their \"white lies\" and denials destroyed any trust I had for them.  It makes you feel like you don't deserve to the share the burden with the rest of your family.",
                                    "score": 10,
                                    "author": "NotIanAnderson"
                                },
                                {
                                    "level": 3,
                                    "comment": "Am I the only child who doesn’t mind being vented to?? I’ve always been more understanding for my age, like I just grasp stuff easily. I’m able to not feel burdened by it, so I’d say if your child wants to help, doesn’t feel burdened, then you can absolutely talk to them.",
                                    "score": 21,
                                    "author": "helloxlol",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think for me, as a child, I didn't mind listening to my parents vent because it made me feel useful and important. At the time, I didn't realize that I was really being made responsible for their emotional regulation. There was no way for me to know that it would be harmful to me later. And now as an adult, I see those tendencies playing out in trying to regulate my partner, not having personal boundaries for when someone is leaning on me to an extent that's harmful to me, etc.  \n\nI think age is something really important to consider - I was not able at like 7 years old to tell my parents that some conversations would be better suited for a friend or therapist, but that is something that I could have said at 18.",
                                            "score": 44,
                                            "author": "great-expectations77",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My parents were constantly in a state of conflict and always pulled me into it. It was really stupid and seriously messed me up. As an example, my stepmom would \"make\" my dad spend time with me. He'd usually spend the time confiding in me, seeking advice about how to fix things with her, pr venting. I was 10. Now, as an adult, I can't seem to figure out how to break up with people, and seem to find myself in stupid enmeshed relationships with hysterical women, or in exploitative friendships with mildly psychopathic men who are usually a decade or two older than me.\n\nI'd argue for a middle ground between the two positions.\n\n1. Don't try to confide in your kids or turn to them for support when things go wrong in your relationship.\n\nBut...\n\n2. Don't pretend like everything is okay when it isn't.\n\nHere's what I'd do, now that I've lived a while.\n\nI'd tell my kids about serious problems in my relationship with their mother. But, I'd tell them so that they understand what's going on, and not to seek their support, nor in hopes that they try to so something to fix things. I'd emphasize that I'm telling them so that they know what's going on, and so that I can be there to support them if they ever feel affected by the conflicts their parents are having.",
                            "score": 151,
                            "author": "ayeuio",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I remember my parents were having issues and my mom was threatening to leave my dad to get her way. Before they had the conversation she manipulated me into responding to her when she asked \"If Dad and I split who do you want to stay with\". Told me to say I want to stay with her.\n\nHow fucked up of a person do you have to be to do that. To try and manipulate your husband by making your child say that. It's no wonder I avoid her as much as possible and get insane anxiety whenever I have to be around her. She fucked me up good and at 30 I'm still suffering",
                                    "score": 22,
                                    "author": "Xerosnake90",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I am sorry you went through that.  I grew up in an emotionally and physically destructive house and was consistently, starting at around 12-13, the one who had to calm things down and get things moving again.  I found myself in relationships like you described and it didn’t change until I went to therapy.  \n\nI didn’t intend to go to therapy for that, since I didn’t even recognize it as a problem.  Went in for unrelated issues due to having ADHD, but ended up learning negative patterns I had in relationships and how to set boundaries and actually live with my boundaries.  It changed my life for the better.  Hope this is helpful.",
                                    "score": 8,
                                    "author": "dumptrucklegend"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you can't share an *accurate* depiction of what your relationship is like, how can you expect your kids to form an accurate understanding of what relationships look like?\n\nMy parents did this and I'm well into my 30s and have fucking given up on getting this from my dad (mom has passed). All I have is therapists to help me now.\n\nDon't do that shit.",
                            "score": 14,
                            "author": "Jbliu"
                        },
                        {
                            "level": 2,
                            "comment": "\"Nothing more than what is absolutely needed\" is too subjective. There's so many factors you have to account for such as context of the situation, subject in question, culture of the family, how it affects the child, how it affects home life, etc. \n\nI understand your opinion is coming from a good place, but I feel like using a blanket statement like that could hurt a child the same way it could help them. \n\nWhat does \"absolutely needed\" mean to you? Why would knowing more about your parent's marriage become a burden?",
                            "score": 64,
                            "author": "InterwebCat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There should be clear boundaries between a parent and child. Search up enmeshed boundaries on Google and you'll see why over sharing can be detrimental to childhood development. It leads to codependency, anxious or avoidant attachment styles, and a skewed vision of what love/intimacy means.\n\nKids are curious and deserve to know age appropriate answers. I agree that blanket statements are in practice inaccurate or even harmful. A good thing to ask yourself when talking to your children is \"why am I telling them this? Is it because I feel like I have no one to turn to? Am I using my children to get my emotional/intimate needs met? How will this information change how they view my spouse?\" etc etc. \n\nChildren who become \"therapists\" for their parents often learn that performing emotional labour is the only way to receive love. This leads them to choose partners who mistreat them or need \"fixing\".",
                                    "score": 93,
                                    "author": "r3dgoos3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is what happened to me. I was used as a therapist by both my parents, and a few of their friends.\n\nI have become emotionally stunted; I constantly think of how others feel and help others work through things, yet I don't even know how to handle my own emotions - and I'm in my 20s. Its pathetic.\n\nDo NOT do this to your children, please.",
                                            "score": 37,
                                            "author": "ApprehensiveMoth",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Their friends too...WTF",
                                                    "score": 13,
                                                    "author": "willfully_hopeful",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"She gives really good advice for a 10 year old!\"\n\nIf a child is speaking and acting \"beyond their years\" it becomes really easy to think of the child as an adult. Its fucked up.",
                                                            "score": 18,
                                                            "author": "ApprehensiveMoth"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "My mom did/does this and still can't understand why I don't want to talk to her ever. \n\nMaybe because I don't want to hear what she thinks of my dad's penis...",
                                                    "score": 10,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Their should be clear boundaries. But there are also situations that can arise where the child becomes affected and aware that secrets are being kept. Sometimes that lack of information and them trying to figure out whats happening or coming to their own false conclusions can be much more dangerous than just letting them in on the world around them a little bit.   \n       \nBlack and white rules generally dont work well with raising kids. Being concious of your decision making when it comps to setting boundaries and trying your best to be aware of what your kids currently need and are going through should generally supercede arbitrary rules imo.   \n      \nSaying this as in addition to what you said, not as a counter to it.",
                                            "score": 7,
                                            "author": "benigntugboat"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As a kid it really helped me to understand the details of my parents' failed marriage. It made me understand them both better as people, too. They both did some fucked-up shit, and I feel it was important to know this side of them to get closure. And I still love them both.\n\nSo I really don't think your advice is the right one in every case.",
                            "score": 19,
                            "author": "xrimane",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep same here. It depends on whether your parents are able to frame the discussion without toxicity or antagonizing each other, but instead as factual with an explanation of why.",
                                    "score": 14,
                                    "author": "nwatn"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think it's a mix of both. With more leaning toward to not too much details.\n\nMy mother did talk to me before their divorce to make me understand that this is their decision and I appreciate that.\n\nBut later on would lay down all the things he has done or not done in their marriage. It was clear she was trying to win the divorce and did influence me as a kid. \n\nWhich is unfair if the other side is good to the children, they might be a shitty husband/wife, but still a good father/mother. \n\nI mean, come on, it's the parent's mistake and that got corrected, sometimes more, sometimes less, but the children are forced to live with the consequences forever.",
                            "score": 9,
                            "author": "naux_gnaw",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm with you that the kids should at least be aware of what is happening, but they should not be forced to be included in the fighting/disagreements on a particular side.\n\nMy parents are still married and there is no way for them to hide their problems because they're constantly screaming at each other. So it's not like they ever tried to keep their problems a secret. I love my dad and he has never mistreated me or my siblings, but he is abusive to my mom and has thrown things like dishes/chairs in our house. My mom made my siblings and I clean up the broken dishes and reaffirm her that our father is an evil man that deserves to burn in hell. Anytime they fight, my mom immediately tries to justify herself to the kids and forces us to agree that our father is terrible and that he deserves to die.\n\nThat has screwed me up emotionally and I wish my parents would just get divorced, so I wouldn't have to deal with my mom forcing us to agree with her anymore.",
                                    "score": 6,
                                    "author": "juice_box19",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I completely agree.  My parents both constantly keep things from me and it honestly just makes me feel like they think im immature and dumb.  I want to feel like im respected and in the loop, too! Honestly I want to know about these things, not telling me is just hurting both of us.",
                    "score": 20,
                    "author": "DJBacon724",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Same. I thought my parents’ marriage was fine, and then shortly after my 18th my mom got me up one morning to tell me she was leaving my Dad. Took a long time for that sucker punch to wear off.",
                    "score": 6,
                    "author": "BarBro94"
                },
                {
                    "level": 1,
                    "comment": "I am thankful that my father has been open about their marital problem when I was a teen, even consulting me on some decisions. Otherwise, I would be a naive and oblivious person that I am not today.",
                    "score": 7,
                    "author": "swiftrobber",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This also applies for single parents who are dating. \n\n&amp;#x200B;\n\nMy mother would often confide in me about all of her dating issues. Paired with the fact my dad passed away not even a year before she started dating again. I was dragged along for \"meeting \\_\\_\\_\\_'s kids\" all the time. It took a toll and as i got older, anything i was to share about my life turned into her venting to me about every small detail in her dating life.\n\n It ruins the relationship with your child. They become more mature and closed off from the parent because all that can be spoken is the dating/parental/marital problems. \n\nKids are not therapists!",
            "score": 111,
            "author": "Hidden_Armadillo",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Kids are not therapists” so much yes to this!!! They are neither certified mental health professionals nor emotional dumpsters (even if you feel like you’re just having a deep conversation with your mature child)!",
                    "score": 39,
                    "author": "qrushqueen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Truth. I'm an only child to two friendless, lonely adults in a rocky marriage. I love them and want to help them, but being the only confidant for both of them really messes with me.",
            "score": 779,
            "author": "AdorableParasite",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am so sorry you’re going through that. I hope you are taking care of yourself. Even though it may be difficult, I think setting healthy boundaries help a lot.",
                    "score": 182,
                    "author": "qrushqueen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you. I try to set boundaries, but I know what it's like to be depressed and lonely with no one to talk to. I can't just shut them out.\nI'm on medication these days and fortunately live somewhere else, so at least it's easier for me than it used to be during my teenage years.",
                            "score": 81,
                            "author": "AdorableParasite",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am glad to hear that you have your own physical space from them. No matter how much you love them, in situations like these that can be extra helpful. I understand what you mean, you can’t shut them out but you can’t necessarily be asked to be in the role you were put in either. that’s why it’s unfair :( but I am glad things are a little better for you now, I wish you all the luck.",
                                    "score": 30,
                                    "author": "qrushqueen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you so much, and thanks for spreading this advice. Have a nice day.",
                                            "score": 16,
                                            "author": "AdorableParasite",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just gonna pitch in having been in this exact situation as well (only child, two parents together but also tending to be loners, and using me as their therapist/mediator). Get a therapist when you can - I’m 24, and even after 2 years of therapy, am still uncovering a lot about the impact of this dynamic in my relationships.",
                                                    "score": 22,
                                                    "author": "elusive_1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm on it. Unfortunately I haven't found the right one yet, but they have to be out there somewhere.",
                                                            "score": 9,
                                                            "author": "AdorableParasite"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I recently read a book called silently seduced which was an eye opener on this exact situation. Helped me to process a lot",
                                                            "score": 9,
                                                            "author": "sassatha",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I just read a synopsis of that book on Amazon cuz it sounded interesting but I don't think I would go far as sexualized relationship with my parents. Or even romantic. It was, at least for me, like I was their therapist.",
                                                                    "score": 3,
                                                                    "author": "elephantpoop",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yes, and where do adults usually get their therapy from? They usually get that from a spouse. The term incest has all kinds of connotations, and I think that word being part of it is very off putting. The way I thought about it was this. If overt incest is asking a child to meet sexual needs a parent would usually get from a spouse then emotional incest is asking a child to meet the emotional needs an adult would usually get from a spouse. They both do untold damage. I bought the book because I realised I was in a situation where I didn't want to \"be mean\" to a nice person I am close with by putting my needs first. Traced this back to sitting in the car with my dad whilst he went on and on about his problems and I'd sit there feeling trapped, uncomfortable and guilty that I wanted to tell him \"I don't care, I want to go\" ultimately, my dad was confiding his inner emotional world with me and it felt icky. It felt icky because an emotional boundary was crossed. It's the kind of opening up people do in romantic relationships. He didn't do this on purpose, he likely didn't realise what he was doing. He was just broken after an abusive relationship. But it had a big impact on me. Reading the book also helped me to connect the dots on some stuff with my mum and stepdad too, such as refereeing an argument. I didn't even relate to all the stories, just enough to help me understand how my past dictated my actions in the present. This is basically a lot of words for saying \"don't let the word incest put you off\" you were probably drawn to the book for a reason. I'd really recommend it for anyone who played therapist. Also, fucking sorry you had that crap as well, you were let down.",
                                                                            "score": 39,
                                                                            "author": "sassatha",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ve been in exactly the same boat since I was 19. My parents were very obviously unhappy, but I really wish I hadn’t opened that box. One fateful night after my mum was complaining about something my dad had done (again) and her wistfully staring into the distance as she did so, I took a breath and asked “how... _are..._ things between you and dad?” and the floodgates opened. I was a teenager and didn’t have any good advice, so all I said was something like “you shouldn’t be with someone who makes you unhappy”, which is objectively true. But apparently that little shred of validation was all my mum needed to leave my dad. They’re now not together, and my mum takes great pride in painting me as her saviour, with the story having been embroidered regularly over the years so that her version now reads as “I had NEVER considered it until ONE DAY my INSIGHTFUL daughter stood up and said ‘Mother how DARE you still be with that GHASTLY man when you deserve SO MUCH MORE’ and I gasped as I realised how right she was!!!” when that’s absolutely not what happened. I know they’re probably happier now but selfishly, as the first Christmas with them apart is approaching (they’ve remained friends until now) the child in me still selfishly wish mummy and daddy were still together. I know I shouldn’t, but I wish I hadn’t spoken to her about it — or rather, that she hadn’t involved me even if I had. I’m now a lot closer to my dad when I absolutely wasn’t before, simply because he’s never badmouthed mum the way my mum does to her. For what it’s worth, I think she was worse to him than he was to her anyway.",
                    "score": 22,
                    "author": "bellends",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is a huge cross to bear, so put it down!! If your ONE comment to your mother \"led to them breaking up,\" then their breakup was inevitable and had nothing to do with your comment!!! There's nothing my kid could say to me or my husband that would make us decide to separate. So, if there IS something that a person's child could say that would lead to a separation, it's definitely because the relationship is at it's inevitable end - not because of what their child said.",
                            "score": 8,
                            "author": "Name_Not_Taken29",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hugs! I was my mom's confidant as a kid. She legit asked me if she should divorce my dad when I was somewhere between 7-10, it was pretty constant bad mouthing about him, although he wasn't a great dad or husband anyway and her complaints were legit. I feel like she should have spoken more neutral about him to me, called out specifically the behaviors that were wrong as a lesson on how not to behave, not just go off ranting about him, or actually take action herself to show his behavior was unacceptable and should be stood up to, not just talked ugly about behind his back. That it's okay to leave and stand up for yourself and your kids.\n\n Then as an adult settling into our new house and literally just having a baby, my parents divorce and my mom starts over sharing WAY too much about her new boyfriends and relationships, and dad who has no friends decides I'm the one who should hear all his horrible misogynistic and possessive opinions on my mom's new independent life. \n\nFelt like I was tossed into the middle of some crazy drama that honestly would have had no effect on my own life if they had just acted like normal adults with boundaries. \n\nI'm finally hitting the \"fuck this\" stage and distancing myself from them a bit. I'm tired of feeling like I have to listen to their drama and be their therapist because they don't have anyone else to vent to. I have my own life, family, and marriage to focus on without adding their crap to it and being pulled between them.",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "hi i have been in exact situation as yours..i have been off them for quite awhile meanwhile recovering from the emotional trauma and guilt. however I realized I was acting as a meditatorz trying to help rhem come up as a healthy couple which they never cared. i am back to my parents who are the same but after understanding I ain't responsible, plus how i can actually help is becoming independent, its really helping ever since. i recommended you read co dependent no more, in case you are feeling like responsible for them, as it happened in my case.",
                    "score": 8,
                    "author": "uphillswapnil",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This. This messed me up so much. I am your kid, not your BFF confidant who you share everything with at 17. I was dragged into my parents marital fights when they were considering divorce, and my involvement helped them to seek therapy and try to work it out, but it has irreversibly damaged my relationship with my mother. On the other hand, my dad and I don’t completely hate each other anymore, so I guess that’s a plus",
            "score": 185,
            "author": "HatPoweredBySadness",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel you. You did the best you could, waaaay more than it should have ever be asked of you (directly or indirectly it doesn’t matter) I wish parents would give therapy a chance on their own as responsible adults. I am sorry you had to deal with everything, but you are not alone.",
                    "score": 29,
                    "author": "qrushqueen"
                },
                {
                    "level": 1,
                    "comment": "im currently in this situation. sometimes my parents argue and they both tell me their sides. i mostly hear my moms side since she is at home most of the time but in truth i dont want to be involved in it at all. when i say that my mom says its affecting your future",
                    "score": 6,
                    "author": "ashbasket"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My dad let's me know the bare minimum so I'm not left in the dark, and if I have questions he'll answer them. Thats just with any problem, not just his marriages.\n\nMy mom on the other hand.. flat out said \"You're the reason me and [stepdad] are having marriage problems!\" because some of my grades we're slipping.\n\nDon't be like my mom, guys. She told me that months ago and I think about it all the time.",
            "score": 46,
            "author": "youcantfindme_7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Remind yourself every day that what she said is not true. Don’t take it, don’t believe it.",
                    "score": 20,
                    "author": "AMerrickanGirl"
                },
                {
                    "level": 1,
                    "comment": "Your mother is wrong.  Your grades are slippimg because she is not providing you with the proper parental support that you need at this very important time in your life.\n\nYou did not ask to be born.  She did, and now she is trying to blame you for her own failures.\n\nIt's not your fault.  Grow up to do great things in spite of her.",
                    "score": 12,
                    "author": "cantthinkkangaroo"
                },
                {
                    "level": 1,
                    "comment": "Wow you're mother is a garbage person.",
                    "score": 9,
                    "author": "kayb1987"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is a term for this sort of dynamic called emotional incest or covert incest. It's very, very damaging and leaves people with people pleasing tendencies, sexual problems, problems identifying their needs and a whole host of other problems. Children are not supposed to be emotional fulfilment for their parents, and they are not supposed to carry the emotional load that their parents need relief from. Children are very fragile during development and mistakes will cost them self esteem and relationships for a lifetime until they gain insight into what happened to them and the results. Some don't get that chance of healing and true happiness. For anyone affected by this I highly recommend the book Silently Seduced as a resource to help you understand what happened to you, and more importantly the issues it has left you with. It can be overcome, as with any faulty programming we receive in childhood",
            "score": 49,
            "author": "sassatha",
            "replies": [
                {
                    "level": 1,
                    "comment": "People who’re asking for the psychological backing to this post, please read this comment!! ^^^",
                    "score": 10,
                    "author": "qrushqueen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had this problem with my mom. Around the time I turned 16 she started developing into more of a friend first parent second type mom and while it was no secret that my parents weren't going to last much longer the way it was brought up to me was pretty fucked up. When I was 18 My mom was planning a trip alone down to Illinois to \"visit her parents\" a day or two before she left she felt it neccessary to inform me that the true purpose was to go and cheat on my dad with some dude from her highscool back in the day. I didn't take that well and screamed that she needs to talk to my dad and not tell me this. So she told my dad what she was doing and went anyway. Probably the second hardest thing I've had to watch my dad go through. After she came back like a week later she kicked him out, and continued trying to tell me about how shitty my dad was. And as an added bonus felt like enlightening me in great detail about her craigslist hookups. Needless to say I moved in with my dad as soon as he had a place.",
            "score": 42,
            "author": "EpicSlothToes",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hopee ure in a better place. And I agree, dont know what ure mom was thinking telling u that.",
                    "score": 10,
                    "author": "Karam2468"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a very blurred line. Don't turn your child into your marital problems counselor -- sure. Lie to them that everything is fine when things are really, really bad... a very doubtful idea IMO. (But then again if things are that bad you better get a divorce -- it'll be healthier for all parties.)",
            "score": 270,
            "author": "kinoida",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was definitely getting at making your children your martial problems counselor and even a like third person in a way. That’s why I said details, I also do not support lying at all.",
                    "score": 77,
                    "author": "qrushqueen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One of the names for this is literally emotional incest.",
                            "score": 7,
                            "author": "sluttypidge",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A lot of it comes down to when and how they express it. Kids should get an opportunity to learn about navigating relationships, but that means talking about it when you're calm and can explain. If you're coming to your kid DURING a fight, in tears or purple-faced screaming, that's super distressing and unhelpful. Save talking to the kid about it for when you're ready.",
                    "score": 4,
                    "author": "circa_diem"
                }
            ]
        },
        {
            "level": 0,
            "comment": "yeah! it really sucks when BOTH of your parents dump all their problems on you and also make you their messenger during arguments. I felt like I was responsible for my parents’ problems when I was waaaay too young to have to worry about anything, especially my parents’ toxic relationship and money issues. Their drinking didn’t help either. I think when this happens it’s called being a parentified child.",
            "score": 57,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m really sorry you had to deal with that m, that’s not fair at all. If you’re gonna have kids, I hope you get to be parent and they get to be children. Sending you my best wishes.",
                    "score": 14,
                    "author": "qrushqueen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "aww, thank you! that’s really sweet 💖",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meanwhile my dad, shows the text messages of my mom's affairs since I was 10. They're still together, and we are one happy dysfunctional family",
            "score": 29,
            "author": "yilliz",
            "replies": [
                {
                    "level": 1,
                    "comment": "spoiler alert, we're not",
                    "score": 26,
                    "author": "yilliz"
                },
                {
                    "level": 1,
                    "comment": "Same here but instead of dad, it was mom showing the texts of Dad’s affair. Even gave me screenshots for safe keeping. I don’t know if damaged me directly but I low-key developed anxiety disorder. I am trying to sort through it with my shrink. Seek help if you feel like it.",
                    "score": 9,
                    "author": "bowtuckle",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who is still experiencing this (28) with my parents, I have to agree.",
            "score": 27,
            "author": "nicholiss"
        },
        {
            "level": 0,
            "comment": "Introducing a kid to the cost of adult heartbreak, grief, anguish--making them empathize with you because they love you and they want to understand--it robs them of innocence and shortens their childhood.",
            "score": 69,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "From the age of 11 to 13 my parents fought nonstop. Day and night they’d argue and slowly just move throughout the house doing it. They’d yell and slam doors. One would occasionally leave the house in the car and not return for a day. \n\nThey’d forget to pick us up from school on time or from friends’ houses. They’d get caught up in their argument and forget to cook us dinner or come watch our sporting events. Or worse, they’d show up and attempt to pretend everything was okay while barely speaking to one another.\n\nMy siblings and I often camped out in each other’s rooms on the bad nights or would communicate using our Nintendo DSs since we didn’t have cell phones then. \n\nThe worst night of all was the first night my mom came down the hallway to our rooms at 3am announcing that she was leaving our dad. She called out that she was packing a bag and staying the night in a hotel tonight and that if any of us kids wanted to go with us, we could pack a bag now. She was asking us to take a side. Paralyzed with fear, none of us moved and pretended to be asleep despite all their shrieking.\n\nWhen they were around us they always vented about the other parent. I remember one oh so popular question they’d ask us...”What do I do?” Little preteen me would try my best to come up with solutions. I’d try to use what the one parent had told me their frustrations were to suggest improvement in the other parent. I’m sure I was less than sneaky because then the parent I was talking to would angerly ask if “mom/dad told you that??” Or shoot my ideas down with “then mom/dad will just say or do blah blah blah so it won’t work. What do I do??”\n\n“What do I do?”\n“What should I do?”\n“What can I do?”\n“I don’t know what to do.”\n“I don’t know what else to do.”\n“I don’t know what else I can do.”\n\nSo, so many more stories from that time that still fill me with pain and anxiety. It wasn’t fair to us kids. We were just kids. \n\nMy parents never divorced and after 2 and a half years, things started to get better. It’s been close to 15 years now and I think they’re content. Happy would be a stretch.",
                    "score": 18,
                    "author": "Polkaspotgurl",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My parents fight a lot and I have to be the mediator because it fucks up the environment in the house. I don't have faith in marriage. I will never get married because I feel that's how my marriage will turn out and even though I know it's wrong to feel like that I can't really help it. So yeah, please don't share your marital problems with your children. It will fuck them up big time.",
            "score": 20,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "No, really. In a heated moment with my mom sobbing in a chair to the side, my grandma aired out all the dirty laundry of my parents divorce to me and my little sister. We were maybe 9 and 11. It fucked me up irreparably especially in my middle school years.",
            "score": 20,
            "author": "dippindotsdisco",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s very unfair and I’m so sorry you had to experience that, there is no justification for it, I hope things are better now.",
                    "score": 11,
                    "author": "qrushqueen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 19,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm glad your parents got roasted by the therapist for using you as an emotional clutch.",
                    "score": 8,
                    "author": "Amethyst_Necklace"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mom leaned a lot on me during my parents’ divorce and beyond. Can confirm it’s too much for a kid to handle. (I was 7 when it started) In my case it caused depression, overeating, withdrawing from social interaction, alienation from my dad, etc. Got therapy as an adult. I’m okay now, and my relationship with my dad recovered just last year, but I can’t help thinking all this drama could’ve been avoided. \n\nParents... please don’t assume your kids are adults. That’s all I ask. Tell them things they will understand (because it makes them feel safer to know at least something) but leave the grownup-talk at the door.",
            "score": 39,
            "author": "Ganon_Fodder",
            "replies": [
                {
                    "level": 1,
                    "comment": "The part about the kids feeling safe, I felt that deeply.\n\nMy parents sat me (age 12) down and explained that they weren't happy with each other recently, but they we trying to work through it. It was a somewhat hard truth to deal with at 12, but at least I knew what was going on and why they were sneaking around having serious late night conversations. It still hurt when they eventually divorced, but I'd rather have that knowing that they were unhappy, than having my entire happy family illusion being shattered at once.",
                    "score": 8,
                    "author": "MonkeyBananaRainbow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so true. Throughout my teen years my parents barely spoke to each other but they sure did talk to me about how shit the other was. \n\nGuess what! Now I’m an adult who can’t identify feelings, who has no relationship, dependency or respect for them, and no interest in a spousal relationship or children!",
            "score": 31,
            "author": "lfd04",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wait, do you think my mom treating me like her therapist after my dad left and she started seeing other men was not her smartest move? Cause yeah, hearing about all that from the age of eight onward left me pretty fucked up.",
            "score": 43,
            "author": "astrocactus14"
        },
        {
            "level": 0,
            "comment": "Reading the comments, there seem to be a lot of terrible parents in the world.",
            "score": 16,
            "author": "gofortheko",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As a child who grew up with a parent who confided everything in me, I agree. It does more harm than good.",
            "score": 15,
            "author": "ferretsonaplane",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was severely emotionally stunted by my moms dependence on me during her divorce to my shitty ex stepdad. Our relationship is better now, but I was only 16 and dealing with my own unchecked mental illness that was in no way helped by her holding me emotionally hostage due to a lack of support from peers. \n\nI get it was hard for her. But damn, for a long time my problems didn’t matter and I was struggling with severe mental illness that ended up putting me in the psych hospital 6 times in the span of a year. \n\nJust don’t do it. Find someone else to talk to, ANYONE. For your kid’s sake.",
            "score": 14,
            "author": "princessofstuff",
            "replies": []
        },
        {
            "level": 0,
            "comment": "teaching your children what it's like to be married? absolutely fine.\n\nventing to your children about it? ehhhhh.....\n\nusing your child as some sort of emotional punching bag for your problems? absolutely fucking not.",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Now that I’m 25, my mom and I talk a lot about marriage and our relationships. It’s actually really helpful for me because most of my social circle isn’t married, or got married because of accidental kids or religion, which changes the game significantly. I don’t really have many people I can relate to about marriage and relationship problems, and it’s nice to have a trustworthy source of support. \n\nFor reference, my parents are happily married, and my mom and I have a very good relationship. I fully understand this isn’t the case for a lot of people.",
            "score": 55,
            "author": "WanderingDoe62",
            "replies": [
                {
                    "level": 1,
                    "comment": "But you’re an adult so it’s ok. Your mother didn’t use you as her personal therapist when you were 14.",
                    "score": 25,
                    "author": "AMerrickanGirl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I still don't think you should burden your personal problems onto your (adult) children if they are not exclusively asking for you to do so.\n\nParets will always be in the parental role and also as an adult you may no be able to handle the different view.",
                            "score": 7,
                            "author": "Enderwoman"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s definitely a different dynamic but it sounds like you two have found a health balance as two adults so I’m glad that’s case for you.",
                    "score": 14,
                    "author": "qrushqueen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree somewhat.  If your partner was abusive, you should explain that the abuse was not acceptable.",
            "score": 9,
            "author": "curious_cat123456",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My dad did this too me when he and my mom were splitting up. He would tell me about how she cheated on him and treated him poorly and was this terrible person.  I was too young to realize my dad was hurt and was not telling me both sides of the story. I resented my mom for years afterwards and never realize that she was dying inside cuz she knew I was upset at her.\n\nMy mom and I are on good terms again and I'm glad I was able to see through the BS. I'm not sure how it effected me but I know that it was a very hard time for me. I felt as though it was my fault I couldnt mend their marriage.",
            "score": 10,
            "author": "staggmpg"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yearn to play sports*\n\nNot urine, urine is pee.",
                    "score": 5,
                    "author": "Distinct_Recognition"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A caveat tho:\n\nIf your child sees an unhealthy or abusive relationship dynamic and wants to speak to you about it, do not lie to them or gaslight them. It will ruin your relationship.",
            "score": 9,
            "author": "pugnacious-puggles",
            "replies": []
        },
        {
            "level": 0,
            "comment": " And please, please do not share the details of your sex life. Not just your marital sex life; but your entire lifelong sex life.\n\nIt does put teenagers off wanting to have sex themselves; so, there's that.",
            "score": 7,
            "author": "Elelavrie"
        },
        {
            "level": 0,
            "comment": "\nGrowing up my parents kept their business to themselves. However, I remember kind of hoping they would divorce. They didn’t fight. Never raised their voices to each other. But the tension and the silence were thick. Most of the time they looked miserable. \n\nWhen I was around 40 years old I went to visit my parents. They had retired and moved to a beautiful island. I asked that my dad spend the day with me exploring local caves and do some hiking. Best day I ever had with him. We were never close. Never had deep conversations. \n\nDriving back to their house he confided to me, “I don’t know how I wound up married to your mother. We have nothing in common. She would never take a walk with me or do any of the things I enjoy. She doesn’t like people.” \n\nIt was the first time I felt sorry for him. He’d spent decades not enjoying life. It was sad. Then I thought of how sad for my Mom to be with someone who had these private negative thoughts about your marriage. \n\nI’ve thought a lot about that conversation through the years. Next month they will have their 54th wedding anniversary. He won’t remember because dementia is chasing him down. She’ll be sad because he won’t remember and resentful that everything has fallen on her. \n\nNow that my Mom is in her 70’s she has begun using me as a sounding board for her marriage troubles. Some times she goes into TMI territory and I have to tell her to put the brakes on. I’m still her daughter and don’t need to know. I don’t need to know about your sex life. I don’t need to know about the affairs you think my Dad had or the illegitimate kids you’re trying to find. Because he’s losing his memory she’s making it her mission to quiz him often about his past. Trying to catch him in a lie. I. Don’t. Want. To. Know!",
            "score": 7,
            "author": "LJ1205E"
        },
        {
            "level": 0,
            "comment": "This is a really good thing for parents to follow. My parents (unfortunately) vented a lot of their frustrations with each other to me---my brothers were kept in the dark---and this kind of affected me a lot. \n\nNow, I'm trying my best to be a more healthy adult, but it's hard to get out of the swamp of unhealthy coping/relationship skills that are so ingrained in you.",
            "score": 16,
            "author": "Spamiard",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel you... but even the fact that you are aware of this and trying your best is so important promising. I am wishing you all the best. You can break the cycle!",
                    "score": 4,
                    "author": "qrushqueen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "100% agree. \n\nLong story short my mother told me how my dad was cheating on her back in middle school. She had me look at his convos with other women, &amp; I saw pictures that I should’ve never seen. Fucked  up my relationship with my dad. I entered the worst depression but couldn’t tell my parents bc they never listened to me. Began to think about death a lot. They ruined my whole life tbh...\n\nJust graduated college, did pretty well, but my brain is literally fried. I think I been mentally fucked up for almost a decade and I’ve never had help. It sucks ass and I wish I could tell someone. I tried talking to my mom once about it but she dismisses everything. \n\nSo pls if y’all gonna have children don’t tell them about ur fucking problems. Y’all deal with it and leave ur kids alone, don’t get them into ur shit. If they are of age and mature then maybe explain the situation but don’t tell them how much u fucking hate ur spouse and ur life??? Thanks lmao",
            "score": 14,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Mrs. Doubtfire handled this well at the end of its movie. \n\nIt doesnt sugarcoat the reality of something like divorce, but it also makes it clear that it's not the children's fault. It explains it in an extraordinarily gentle way.\n\n\"Sometimes parents get along better when they don't live with each other. Sometimes they get back together and sometimes they don't. And if they don't, don't blame yourself.\"\n\nIt's this level of gentleness that needs to be employed.\n\nThere's no nasty details.\n\nThe kid doesnt feel like they have to play therapist.\n\nIt's the truth distilled to its purest essence.\n\nUnfortunately, there will be ugly situations such as parents cheating on each other, which may not be able to be as gently explained.\n\nKids arent stupid. My stepdad once cheated on my mom, and as a kid I knew. My mom would dress completely in black and always appeared angry. I knew something had happened, and so I of course eavesdropped through the door.\n\nThat's when I found out.\n\nAnd I never brought it up to either of them. They never brought it up to me, since they stayed together.  (They did split up, but not because of that)\n\nSometimes...parents just can't win. Kids can just tell when bad things have happened, and for me I chose not to ask questions.",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My mum used to always talk to me about any problems she had with my dad (alcoholic, emotionally abusive) . I was always worried and stressed that they'd split up.\n\nI felt like it was my responsibility to try fix their issues. They're still together and happier now that he quit drinking but damn, my childhood was stressful.",
            "score": 8,
            "author": "pickled-Lime"
        },
        {
            "level": 0,
            "comment": "My parents had nobody else in their lives growing up, so I ended up being taught that loving someone meant having no emotional boundaries, and trying to take on emotional problems I was not equipped to handle. On the rare occasions my dad would get desperate enough to try to talk to me, he would try to pit me against my mom after I'd just witnessed him abusing her or being a fucking Asshole to her in some way.\n\nNeedless to say this has fucked up my adult relationships.",
            "score": 8,
            "author": "Metawoo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My parents didn't begin their divorce until I was 24 but I had about 12 years of this shit beforehand. It really fucks with you trying to deal with such adult problems and then try to explain why you can't concentrate in school without saying too much and feel like you're betraying both of your parents at the same time. While I appreciate my parents tried to keep it real with me so I knew what was going on in the house, there were several discussions I was inappropriately privy to just by sake of being the eldest child",
            "score": 7,
            "author": "stampyboots"
        },
        {
            "level": 0,
            "comment": "I still get flashbacks on the time my dad owed my mom money for bills, but he had spent some money on a claw machine and got me a stuffed bunny. I was about 5 at the time and he told me to keep it a secret and why, but I didn’t... of course I got shamed for it. I’ve often thought back like wtf, who does that with a 5 ur old.",
            "score": 6,
            "author": "Srirachaballet",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I agree with this so much. My narcissistic mom used me as her confidant and when I was living under her roof she told me that I “would never be her friend”. But now that I moved out she likes to say I was her “best friend”. \n\nThat along with telling me out of nowhere that suddenly her and my abusive father were getting a divorce and spilling all the beans in an hour long phone call... don’t treat you kids as your confidants, no matter what.",
            "score": 6,
            "author": "plo_ska",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My parents were having money problems at one point and nearing a divorce. My dad would call me every other day to complain about my mom. He didn’t have a lot of people he could talk to about it—sure, but it made my life a living hell. I was in the middle of a pretty stressful semester in college and it’s been about a year since it happened. I haven’t been the same mental health wise since",
            "score": 7,
            "author": "mrgiblette",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Can you tell my mother this please??? I have known way too much my whole life.",
            "score": 7,
            "author": "stefffiii",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sometimes, you can only be safe if you know who your parents truly are.",
            "score": 11,
            "author": "CzarTanoff",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a good point, safety issues are an important consideration. I guess I wouldn’t lumped that together with a general marital problems term but I definitely see what you’re saying.",
                    "score": 3,
                    "author": "qrushqueen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Agreed. Simply agreed.",
            "score": 19,
            "author": "OlympianBattleFish"
        },
        {
            "level": 0,
            "comment": "I’m gonna have to say that my parents refusing to share anything about their relationship is ultimately what led to my three siblings’ lack of understanding of a healthy relationship. My parents shoved their marital problems down so deep that their misery created a toxic environment for us to grow up in; they decided to “stay together for the kids”, and we didn’t have a damned clue about it until a year or so ago. \n\nIn the end, the only example we had of a healthy relationship was a toxic one in disguise, and I firmly believe their refusal to be honest and open about their relationship has done more harm than good. \n\nThat being said, I understand where your advice comes from and believe that over-sharing can have the same consequence. If our parents are supposed to both educate us and possess authority over us while we are children, a boundary between the two must certainly be set - but a boundary too far in one direction will cause damage.",
            "score": 5,
            "author": "reagsters"
        },
        {
            "level": 0,
            "comment": "My mom says the she tells us their marital problems so we know what type of person my dad is. Which kind of sounds like she wants to protect us??? But at the same time it destroyed my relationship with my dad so much faster because I felt that I had to fight my mom’s battles. She feels that she can’t talk to anyone about their problems so it tends to fall on us (her kids). Sometimes I wish she had found a good therapist instead. My mental health suffered a lot because of having to hear about everything.",
            "score": 5,
            "author": "trevorteam",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is so true. My parents are still together, but growing up, they'd full on argue in front of my siblings and I. Last year, my parents almost got divorced for the 100th time and my mom called me and said that she's so happy to get away from him, that he's awful, that he has probably cheated on her, probably has stolen lost jewelry from her, ect. She really made me see my dad in a whole new way. A week later she called and said they're not getting a divorce. I'm 20 and I don't live with them anymore,  but not matter what, don't use your child as your own personal therapist.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This applies post-divorce, even with adult children. My parents got divorced 15 years ago and my mom never stopped trying to make me her therapist for the whole thing. At first it was frustrating, then I was depressed, and now I just cringe.",
            "score": 5,
            "author": "TaxAvoision"
        },
        {
            "level": 0,
            "comment": "Can confirm, it'll fuck a kid up for life. Both my parents just fucking bashed one another to me after they split. It fucking sucked. A child shouldn't have to take sides. I'm sorry you hate my mom, but, I love her. Don't compare me to her. I'm sorry you hate my dad, but I love him. Dont compare me to him.",
            "score": 6,
            "author": "ChickenNougatCream",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. Being forced to pick a side screws you up emotionally for sure.\n\nMy parents are still married, but they are abusive towards each other. After every screaming match, my mom will come to my siblings and me and explain that our father is an evil man who deserves to die. She would then force us to affirm and repeat what she said. Sometimes after they fought, my mom would not allow us to speak to my dad even though he has never mistreated the kids.\n\nI moved out for college, but I'm back with my parents for the summer and I'm realizing how toxic that environment was for me growing up. It screws up a child in ways that my parents never considered.",
                    "score": 4,
                    "author": "juice_box19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Especially unsolicited. My mom told me repeatedly during middle/high school how much she hated my dad, and how they would get divorced if it weren't for me and my brother. \n\nOh cool, thanks for the pep talk mom.",
            "score": 6,
            "author": "dumbledorky"
        },
        {
            "level": 0,
            "comment": "This is a form of emotional abuse. Relying on children as emotional support (instead of therapy or another adult) really fucks them up.",
            "score": 5,
            "author": "countrymouse"
        },
        {
            "level": 0,
            "comment": "My mum told me if it wasn’t for my brothers or I she’d have taken her life by now probably \n\nThat hurt knowing she was fine just leaving my dad behind- he’s not perfect, but that was a heavy weight on my shoulders to know. Also stressed me out b/c what if one day I’m also not enough for her to stay? She also laments about how she wishes she could go back &amp; do things differently marriage wise, how she kinda blames him for why our family is not as close as it could be...its weird hearing those things and then having to put on a smile when I see him so as to not hurt his feelings. I wish my parents believed in counseling vs. just wading in their feelings and doing nothing about it b/c “thats the way it is”. It’s not their faults entirely, they had rough upbringings, but that generation trauma man...I’m so afraid to pass it onto my kids if I ever have any (doubtful, giving birth looks incredibly painful lol)",
            "score": 5,
            "author": "yourelovely"
        },
        {
            "level": 0,
            "comment": "I’m currently my mother and father personal marriage counselor",
            "score": 4,
            "author": "PinkWhitey",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Theres an old saying \"familiarity breeds contempt.\" It comes from this idea the more you know someone, the more likely you are not to like them. It was advice for parenting to tell parents not to let kids be too famliar because at point they can grow to disrespect u.",
            "score": 5,
            "author": "lawziet"
        },
        {
            "level": 0,
            "comment": "As the oldest child I 100% have suffered from this and conpletely agree.",
            "score": 3,
            "author": "traveller_k"
        },
        {
            "level": 0,
            "comment": "100% true.",
            "score": 4,
            "author": "Pipkin81"
        },
        {
            "level": 0,
            "comment": "My parents telling me at age 12 that they were a bit unhappy and trying to talk through it - best thing that happened before/during/after their divorce. I understood that relationships need work, but sometimes even best intentions are not enough.\n\n&amp;#x200B;\n\nMy mum venting to me about how unhappy she is without a boyfriend when I was age 17-(still going on) - not what I have ever needed. It's mentally hard for a child not being able to help their parent and knowing that you're not enough to make them happy.",
            "score": 5,
            "author": "MonkeyBananaRainbow"
        },
        {
            "level": 0,
            "comment": "Also, unless you are really really good at faking it, your kids know when you are staying together just \"for them.\" \n\nI grew up listening to my parents scream at each other, my dad screaming at me, and knowing that he had zero respect for my mom, but hey - it's all ok because I \"got to grow up in a house with both parents,\" amirite?",
            "score": 5,
            "author": "AggravatingCupcake0"
        },
        {
            "level": 0,
            "comment": "Say it louder for those in the back! \n\nMy parent had me and my siblings right in the middle of it all. I wouldnt wish that on anyone",
            "score": 5,
            "author": "FauxMango"
        },
        {
            "level": 0,
            "comment": "Exactly. It’s selfish of adults to do this to the children. At any age.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "If only someone had sent this to my mom before she used me as a therapist since i was six :)))",
            "score": 4,
            "author": "uglyandumb"
        },
        {
            "level": 0,
            "comment": "My dad constantly vented to me about my mom. So much so that I began to resent her too. I really wish he hadn’t. Amazing father for the most part, but this particular thing was a huge issue.",
            "score": 5,
            "author": "_matt_hues"
        },
        {
            "level": 0,
            "comment": "I appreciate everyone commenting their experiences with parents who confide too much in their children. It's so insane and sad how often this happens.....my goodness...\n\nMy mother started telling me intense stuff when I was 7... She still does it and I'm 25 now. I just don't know how to get her to stop...I love her and don't want to make her feel like I don't care about her feelings. but honestly it's just too much to handle when she starts venting...\n\nMuch love to everyone out there.",
            "score": 4,
            "author": "nudesgrl"
        },
        {
            "level": 0,
            "comment": "Therapist here, can corroborate this 100%. Let your kids see you work through conflicts like responsible adults, but for the love of god never make them a key player in that conflict. They can easily learn to feel responsible for keeping the peace, or that your love for them is dependent on playing that role. That's a horrible place to be as a kid, and leads to all kinds of problems as an adult.",
            "score": 4,
            "author": "Miqueas_Fox",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"Go talk to your dad and see if maybe you can convince him to see what I mean. Tell him you don't like it when we argue.\" - Actual, tear-filled words from my mother pretty regularly after the screaming matches when I was a kid",
            "score": 3,
            "author": "Spiffy313",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Or any hard to handle \"adult problems\" for that matter. As I child I was constantly being exposed to intense worries of money problems, obviously its good for me to be aware of these issues (even though they are fairly obvious without being told) but the extent with which I was burdened by the details instilled so much anxiety in me as a child, that Im not sure ill ever be able to get rid of the fear, no matter how well off I am.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yeah my parents got me involved in their divorce at 12 years old fucked me up for years",
            "score": 4,
            "author": "ya_boi_t-word",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I wish my parents had learned this.",
            "score": 4,
            "author": "litterbawks"
        },
        {
            "level": 0,
            "comment": "TRUTH. both of my parents have privately told me that they want to end the marriage so every time I see them fighting I just die a little bit inside.",
            "score": 4,
            "author": "SkottyBoi"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly, it is not fair and it makes establishing healthy boundaries when it comes to helping people very difficult.",
                    "score": 6,
                    "author": "qrushqueen",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My parents have never told me anything about what was going on, why are they fighting or anything, and hearing them scream at each other while acting like everything is fine in front of my sister and I is really tiring. \n\nIt's better if you don't hide everything from them as teenagers but don't blur all the shit out too.",
            "score": 3,
            "author": "Wicha20005"
        },
        {
            "level": 0,
            "comment": "I agree. I love my parents very much but they both do this and I don’t like it. My dad just needs someone to talk to and it’s sad, but it affects my relationship with my mom because it makes me realize that she isn’t a good wife and that makes me think a little less of her even though she’s the best mom.",
            "score": 3,
            "author": "natsugrayerza"
        },
        {
            "level": 0,
            "comment": "How do I tell my dad that telling us about how he’ll go ahead and get an apartment so we can get away from my drunk mother won’t help, or at least not help me? Like, I always shrug it off and tell him ‘yea yea yea’ and stuff like that, trying to make it seem like I don’t care, hoping he goes and realizes it’s not really benefiting me talking about it.",
            "score": 3,
            "author": "SeaSaltSaltiness"
        },
        {
            "level": 0,
            "comment": "this is true. sometimes it feels like I have to parent my own parents and it drains me out",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Well, my parents fucked this one up about 8 thousand times lol",
            "score": 3,
            "author": "ostrichual"
        },
        {
            "level": 0,
            "comment": "Facts\n\nParents divorced and all i got in my ear from my mum for 6 years straight (11 to 17)was how all men are useless and worthless and all they wanna do is fuck and blah blah blah\n\nAm 31 now and still messed up kinda\n\nI dont speak to her and have a good very relationship with my dad which only came back around maybe... 2 years or so ago",
            "score": 3,
            "author": "Qinjax"
        },
        {
            "level": 0,
            "comment": "My mother started talking shit about her marriage right AFTER she got married, i was 10 and it lasted until i moved out, she really ruined the way i saw marriage, until i met with couples who have a healthy marriage:)",
            "score": 3,
            "author": "Isabellake1"
        },
        {
            "level": 0,
            "comment": "I'm going through this right now. My parents have been together for 30+ yrs and have had four kids but now their marriage is on the rocks.\n\n On one hand, I have my dad- who's not really the type to share anything- venting to me about what's going on and how he's feeling. And I know I've told him I'm here if he needs someone to lean on, cause he doesn't really have anyone else...but I'm not use to seeing him this...vulnerable and helpless... It's starting to weigh on me cause I can't do anything to help him feel better or fix it.\n\nAnd on the other, I have my mom who's not telling me anything at all. I tell her everything and she knows she can tell me anything...we're really really close but now she's been so secretive and distant... Like she doesn't really care about her relationship with my dad or her kids. And I feel like I'm having to beg her to remember we're important to her. Its messing me up really bad.\n\nI'm 24 and I thought I was grown enough to handle this but it feels like this shit has set me back to 13. I don't know what to do. I feel so helpless and sad that the most important thing to me is falling apart and I have no one to talk to. I don't feel like putting more weight on my dad's shoulders than he has already and my mom's been so distant I don't feel...secure..talking to her anymore.\n\nOther factors come into play too. But this is the gist...Sorry for the long comment that no one asked for lol. This post just really hit home to me.",
            "score": 3,
            "author": "BonBriBri"
        },
        {
            "level": 0,
            "comment": "Or financial problems you as an adult are having.",
            "score": 3,
            "author": "pensacolahoedown"
        },
        {
            "level": 0,
            "comment": "As someone who played councilor to my parents from the time I was 13, for the love of god listen to this person.",
            "score": 3,
            "author": "FxHVivious"
        },
        {
            "level": 0,
            "comment": "Yes exactly!! Idk if this is an unpopular opinion but occasionally my parents “rant” to be about their issues and it kinda weighs down on me and makes me feel like I’m their emotional support thing",
            "score": 3,
            "author": "Capitol_Death"
        },
        {
            "level": 0,
            "comment": "I can back this up. When I was in my older teens, my parents starting fighting really bad and really often. Being older (16-17) my mom started to console in me. Then my dad. Then it basically turned into them bashing the other parent when they weren't around and asking if I agree. It felt like they were subconsciously asking me to pick a side, whilst also attempting to quell their petty squabbles. One day when my mom was ranting to me I just broke. Told her it felt like I was part of their fucked up relationship and that I had never felt more stressed. That was a huge eye-opener for them, and they lightened up super heavy on talking to me about their marital problems afterwards.",
            "score": 3,
            "author": "Iyamani14"
        },
        {
            "level": 0,
            "comment": "Yeah. Even as a 22 yr old its highkey fucking with me how much of my parents divorce related and causing issue they share with me. Like. It makes me feel like im either being a poor son by not agreeing and being a sympathetic ear. Or like im being turned against one or the other. \n\nKids. Teens. Adults. Doesn't matter. Y'all got married. Y'all got problems. As much as possible, and unless it involves/effects us, leave us out of it please.",
            "score": 3,
            "author": "pyric_lancaster"
        },
        {
            "level": 0,
            "comment": "My mom used to do this to me when I was younger, she kept complaining about the failure of her marriage and always blamed my dad for it, now, I’m not saying that I hate my dad because of her but my perception of him wouldn’t be the same if she hadn’t complain about him during my whole childhood.",
            "score": 3,
            "author": "drivingtotahiti_"
        },
        {
            "level": 0,
            "comment": "My mum shared all her marital problems with me  from a very young age. I was one of those seemingly ‘mature’ kids. Whilst it never made me take sides or feel anger towards my dad, it did skew my idea of what a healthy relationship looked like in my early adulthood.",
            "score": 3,
            "author": "angethebigdawg"
        },
        {
            "level": 0,
            "comment": "It should be 100% silent",
            "score": 3,
            "author": "-Listening"
        },
        {
            "level": 0,
            "comment": "I had a girlfriend that I dated for 4+ years and her mom would vent to my girlfriend and her twin sister after every fight the mother and father had. It got to a point where my girlfriend was playing referee between the two parents during arguments. It was the most bizarre and weird and toxic thing I’ve ever witnessed or been a part of - effectively attempting to pit your children against your spouse...Could not agree with you more.",
            "score": 3,
            "author": "_savs"
        },
        {
            "level": 0,
            "comment": "Fucken yes. For as long as I can remember, my mum would bitch to us about our dad. How he never did anything, how the reason we were poor was because he didn't get a decent job after graduating uni, and on and on. Of course, we were never allowed to tell him what she said. It had to be kept a big secret (or else...). I didn't realise it wasn't normal, and because we were homeschooled, it didn't kick in that this was so damaging until I was much, much older. \nShe also told us if we stressed him out too much he'd have a heart attack and die. She's all kinds of crazy. Don't talk to her too much these days.",
            "score": 3,
            "author": "lunettarose"
        },
        {
            "level": 0,
            "comment": "As both of my parent's emotional therapist, this is very real. I feel so isolated from my parents sometimes because of this.",
            "score": 3,
            "author": "zeph0d"
        },
        {
            "level": 0,
            "comment": "I wish someone told my parents about this. My mom would discuss their marriage and sexual problems to me at a young age.",
            "score": 3,
            "author": "kayb1987"
        },
        {
            "level": 0,
            "comment": "HAHAHAHHAHAHAHA i had to deal with this at 12 (17 rn)",
            "score": 3,
            "author": "wereyena"
        },
        {
            "level": 0,
            "comment": "When my parents were fighting pre-divorce my mom would frequently say that I’m the only one she can talk to and that I need to support her by listening to her problems. It really messed me up, in addition I was also basically taking care of my siblings because my parents were busy working/fighting. Read somewhere that it’s actually a form of emotional abuse because you’re flipping the parent-child dynamic around.",
            "score": 3,
            "author": "reelru"
        },
        {
            "level": 0,
            "comment": "Nothing beats your mom raging and lecturing for hours of how much of a loser your dad is, while he is in the hospital getting close to death. The evening I saw him, he was in coma gasping for air, and died in half hour. Mom: no remorse, business as usual. Both are losers and they have this loser child typing this who should not have been born if their union was such a mistake.",
            "score": 3,
            "author": "fliesonastick"
        },
        {
            "level": 0,
            "comment": "This shouldn’t be needed to be added but: especially not your sexual marital issues. \n\nMy dad used me as his confident to air his woes about his sexless marriage since I was 11 and it really fucked me up.",
            "score": 3,
            "author": "[deleted]"
        }
    ]
}