{
    "id": "i7y8ow",
    "score": 39708,
    "title": "YSK that the term “non-GMO” is essentially an advertising ploy. GMOs have no established health risks in humans.",
    "author": "dogeman87",
    "date": 1597173918.0,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/i7y8ow",
    "media_urls": [],
    "other_urls": [
        "https://www.washingtonpost.com/news/speaking-of-science/wp/2016/06/29/more-than-100-nobel-laureates-take-on-greenpeace-over-gmo-stance/)).",
        "http://sitn.hms.harvard.edu/flash/2015/will-gmos-hurt-my-body/)"
    ],
    "postText": "I expect comments might say this is common knowledge. I will point out that a lot of people don't know about GMOs or science in general, including some of my own friends and family. This post is meant to address those people.\n\nThe only legitimate controversies over GMOs involve ethical or environmental concerns. One example is Belgian Blue, a breed of cattle that contains extra muscles. Critics say it is unethical to create that kind of cow. Note that the issue here is NOT human health. The cows themselves are perfectly safe to eat.\n\nI will repeat what I said in the title: GMOs have no established health risks in humans. In some cases, they are actually beneficial to humans. Consider golden rice, a modified version of rice that contains added precursors for vitamin A. This was meant to combat vitamin A deficiency in Asia, which can lead to blindness. The public’s perception of GMOs prevented golden rice from succeeding, as was addressed in a letter from over 100 Nobel prize laureates (discussed [here](https://www.washingtonpost.com/news/speaking-of-science/wp/2016/06/29/more-than-100-nobel-laureates-take-on-greenpeace-over-gmo-stance/)).\n\nGMOs do not cause cancer. They are created by inserting a non-naturally occurring gene or mutation into an organism which is then consumed by humans. While it is established that genetic modification can cause cancer, that would occur in the original organism, *not the consumer*. Genetic modifications are not passed between organisms. If you find yourself questioning that statement, consider the fact that genetic diseases are not transmissible.\n\nThere is an article from a Harvard blog that reinforces a lot of what I have said. [Check it out](http://sitn.hms.harvard.edu/flash/2015/will-gmos-hurt-my-body/) if you’re interested, and I encourage you to do your own research as well.\n\nEdit: I'm seeing a lot of people address the bad business models (mainly Monsanto and overuse of pesticides). These are all valid complaints. I merely wanted to address the public illusion about the GMOs themselves.",
    "comments": [
        {
            "level": 0,
            "comment": "The best is “non-gmo” salt...salt is a fucking mineral.",
            "score": 1447,
            "author": "jbboney21",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's why I only buy free range salt. I want my salt to have experienced the world's oceans and to impart its wisdom to me when I sprinkle it upon my oatmeal.",
                    "score": 736,
                    "author": "lickedTators",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I prefer the low fat, 0 calorie salt, personally.",
                            "score": 75,
                            "author": "RollingZepp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Salt Zero.",
                                    "score": 42,
                                    "author": "fj333",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I can see a new product: diet salt.",
                                    "score": 7,
                                    "author": "LiveMeALoan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now gluten free",
                                            "score": 7,
                                            "author": "They_Call_Me_L",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I am hypertensive so I use the salt-free saltener...",
                                    "score": 5,
                                    "author": "trumpisbadperson",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Salt In oatmeal, you monster",
                            "score": 90,
                            "author": "why-not-spaces",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you don't put a pinch of salt in you're just torturing yourself for no reason",
                                    "score": 85,
                                    "author": "7456312589123698741"
                                },
                                {
                                    "level": 3,
                                    "comment": "It makes it sweeter.\n  \nThat's why every single cake recipe or waffle or pancake recipe has a pinch of salt in it. It makes it sweeter.\n  \nAnd it's a neat little trick for coffee too, if you like your coffee sweet. You put in the sugar or sweetener, and a tiny pinch of salt, and the salt removes any bitterness in the flavour.",
                                    "score": 31,
                                    "author": "AnorakJimi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don't wanna be that guy but technically it makes it less bitter, not sweeter.",
                                            "score": 39,
                                            "author": "aztec_mom",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But bitterness is combated with sugar (sweet) not salt.",
                                                    "score": 3,
                                                    "author": "chefontheloose",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And salt as well. There's something about salt that blocks our ability to perceive bitterness.",
                                                            "score": 6,
                                                            "author": "aztec_mom",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Salt thrives best in it's natural habitat, the tears of redditors",
                            "score": 6,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Drives me nuts. It doesn't have genetic information to modify. Of course it's not genetically modified.",
                    "score": 51,
                    "author": "persondude27",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Almost as good as gluten free corn.",
                    "score": 152,
                    "author": "Bluehyway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Actually this is legit. People with celiac disease can have a flare up from a naturally gluten free item such as oats or cornmeal that has been processed on equipment that also processes gluten containing grains. \n\nSource: Nurse with a public health graduate degree",
                            "score": 95,
                            "author": "padmalove",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 36,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes! It might say gluten free, but actually be full of gluten :(",
                                            "score": 14,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not full of, but literally a single tiny crumb can set off some coeliacs. My partner is one, and so I've discovered that there's a ridiculous amount of foods that do not contain gluten as actual ingredients that we still can't eat because they \"may contain traces of gluten\". That phrase is my nemesis now. Also I feel like some brands put it on all their products just to as a generic way of avoiding responsibility if someone ever did get glutened",
                                                    "score": 15,
                                                    "author": "owheelj",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I am Celiac as well. There’s no telling how much cross contamination there is a in a product. It could be trace amounts, or there could be so much it makes me wonder why the FDA allows them to say gf on the front!",
                                                            "score": 3,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "GF just stands for gluten-full at that point",
                                                                    "score": 3,
                                                                    "author": "Putalittlefence",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In all honesty, the gluten free label is necessary for people with Celiac's.  Gluten and flours are used in a lot of places you wouldn't expect.  It's used on frozen food to prevent binding and to absorb extra moisture.  Used in salt and spices for the same reason.  But yeah, if fresh corn in a husk is labeled as gluten free, that's dumb",
                            "score": 74,
                            "author": "Chemistryguy1990",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The problem is sometimes even if it's labeled as such, it will still contain it. Honey Nut Cheerios got in trouble awhile back for it.",
                                    "score": 10,
                                    "author": "DrainYourDamnPool"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As dumb as it sounds, the label is helpful. As someone with Celiac, I’m still sometimes surprised at how these companies sneak gluten into their food\n\nFor anyone looking to cook gluten free, look for a logo/seal that is is CERTIFIED Celiac safe gluten free. The FDA limit on gluten free is enough to trigger a reaction for some. Cross contamination can ruin a meal thought to be safe. For example, oats :( oats are not gluten, but there is so much contamination during processing",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“Organic” salt.",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Almost. The best is organic salt.",
                    "score": 4,
                    "author": "justadrtrdsrvvr",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Dammit Marie, they're minerals!",
                    "score": 5,
                    "author": "AFlyingMongolian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My THC distillate syringe has \"non-GMO\" on the side of the box. Isn't the whole thing is pretty much a genetically modified organism? From breeding the different strains and extracting everything.",
            "score": 1596,
            "author": "Acceptable-Term",
            "replies": [
                {
                    "level": 1,
                    "comment": "People don’t oppose to the idea of things being genetically modified. It’s why they are genetically modified. They genetically modify a crop so they can use pesticides freely without killing the crop. GMO foods aren’t bad the pesticides are bad. There was this study that showed measuring the toxicity levels of subjects consuming one vs the other. Agree or don’t agree I’m really not here to argue with people I say this because I don’t want anybody to think I’m triggered or anything because I really don’t care what people consume in their daily lives. It’s none of my business. I’m more so sharing the information for clarification purposes on where those people’s opposition comes from. I hope that makes sense cause most often we read written comments in the most obnoxious tone in our head thinking people are all worked up. Okay now I’m talking too much lol \n\nI’ll take my downvotes now.",
                    "score": 496,
                    "author": "WomanNotAGirl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 503,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 94,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pesticides are used on both GMO and non-GMO plants though, as well as both organic and non-organic. It's not like the farmers with organic, non-GMO crops never spray their fields.",
                                            "score": 7,
                                            "author": "joey_sandwich277"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Most people don't farm themselves though and don't have the space to do so either, so farmers have to exist to grow the world's crops. Asking a farmer to hand weed fields is gonna get you laughed at, and while there are ways to weed fields for short crops (electroshock), I do not know of any that would be useable on crops that grow to the same height or higher than weeds. As for pesticide use, again it comes down to being able to remove the pests from hundreds of acres. GMOs and pest/herbicides are currently the best option for sustainable food production.",
                                            "score": 11,
                                            "author": "RecombinantDAD",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Asking a farmer to hand weed fields is gonna get you laughed at, and while there are ways to weed fields for short crops (electroshock), I do not know of any that would be useable on crops that grow to the same height or higher than weeds.\n\nThere's a company in California, the Bezzerides Brothers, who developed a whole series of mechanical tillage tools for their customer tillage business.  Really neat tools, I've produced some crops in really clean fields using these techniques.  The trick is to get the weeds while they are still small and get the crop canopy up to hinder the second and third flushes of weeds.",
                                                    "score": 3,
                                                    "author": "ksiyoto",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh right, because we have a history of being so great with pesticide regulations and testing... If you honestly think there's never any negative effects from pesticides in our food then you're way too trusting. I say this as someone who doesn't bother with non GMO or organic or whatever.",
                                    "score": 77,
                                    "author": "newbeansacct",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But that’s hardly an argument against GMO crops specifically. More of a broad remark against farming practices and regulations in general.",
                                            "score": 202,
                                            "author": "TurkeyZom",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "GMO foods often use less pesticide than “non-GMO” and “organic” foods. AND they often use the exact same pesticides.",
                            "score": 185,
                            "author": "Retroviridae6",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Organic doesn’t really mean anything of value anymore. As soon as something becomes trendy and is able to be marketed and commoditized, it gets watered down and bastardized until the term loses all meaning. \n\nThe standards for items to be labeled “organic” are not what they once were. Not even close.",
                                    "score": 53,
                                    "author": "SixxDet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's my understanding that the standards defining the term organic have, in fact, gotten stricter and better defined over time rather than bastardized. Could you share examples of standards that have become more lax or bastardized?",
                                            "score": 69,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I really like the way you shared your understanding and then asked for examples. All too often we see people belligerently argue instead of genuinely trying to learn. Kudos, friend.",
                                                    "score": 20,
                                                    "author": "turkeyandtuna9",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thank you. I was listening to a video regarding [the nature of true love](https://youtu.be/bw-_iPIcGIU) and it said some things that really struck me. It stressed looking beneath the surface to try and understand, and be generous and patient. If you look at my comment history I've not been this way recently.\n\nI'm trying to do better.",
                                                            "score": 25,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hey, I can get that way myself sometimes. The point is you keep trying to do better and eventually you will. Also, patience and understanding is definitely not a linear path. Sometimes it's two steps forward, one step back. You're doing well today so that counts for something.",
                                                                    "score": 11,
                                                                    "author": "turkeyandtuna9"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 8,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;How the fuck is my organic dog shampoo any different than normal dog shampoo? Because the plants from which you extracted the chemicals from where grown without pesticides?\n\nIt's organic because certain compounds were not present in their cleaning, manufacture, growing, etc. Organic does not mean no pesticides are used, as there are many organic pesticides. There are also many organic compounds that are very dangerous and need equal, if not more, careful handling compared to their non-organic counterparts.\n\nIn my opinion, too many people don't learn what terms like natural or organic mean and just equate them with \"healthy\" and/or \"safe\" which is where the issues pop up.\n\nPure butane actually would be considered organic if I remember correctly.",
                                                            "score": 22,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;The standards for items to be labeled “organic” are not what they once were. Not even close.\n\nPlease give us a history of what it once meant and how it compares to what it does now. This should be interesting.",
                                            "score": 4,
                                            "author": "SpaceJackRabbit"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They actually use more pesticides on non GMO crops.",
                            "score": 35,
                            "author": "frodeem",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I am glad a few folks have commented on this comment.  No, GMOs are not developed so pesticides can be used freely.  In fact, many GM products are developed to require *fewer* pesticides.  For example, Bt corn includes a bacteria that acts as a natural insecticide.  Consequently, insecticide/ pesticide use is much lower with most GM crops compared with conventional crops.\n\nAs a general rule GM crops require fewer chemical inputs - insecticides, herbicides - compared to conventional crops.  Also, GM crops usually require less tilling and fewer fertilizers.  GM products are also commonly bred to be more resilient to shocks like floods or extreme heat.  And, on top of all that, their productivity is usually much higher than conventional crops.  No wonder [developing countries are leading the adoption of GM crops](https://allianceforscience.cornell.edu/blog/2018/06/developing-nations-lead-growth-gmo-crops/).",
                            "score": 17,
                            "author": "Exhausted_but_upbeat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I totally agree, but the GM corn doesn't contain the bacteria Bacillus thuringiensis, it just produces the same toxin that kills the insects that eat it.",
                                    "score": 7,
                                    "author": "Enigmatic_Starfish"
                                },
                                {
                                    "level": 3,
                                    "comment": "But you forgot about roundup resistance genes.",
                                    "score": 3,
                                    "author": "caresforhealth",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You are pretty close to what many think of GMO's, only Reddit seems to think they encompass all modified organisms from the beginning of when humans began modifications.\n\nIt is easy to see why so many oppose them now, it has been all over the news (US last year) where there were many lawsuits and they (Bayer) lost some really big ones, even lost on appeal. Bayer and Monsanto started this conversation, some think that they need to \"enlighten\" others when in fact they themselves are missing the point entirely.",
                            "score": 41,
                            "author": "askaboutmy____",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They aren't missing the point anymore than Phillip Morris was or Exxon were. \n\nThey know exactly how bad many of the products they sell and practices they keep are. They are just profit driven psychos like tobacco, oil and all the rest before them.",
                                    "score": 20,
                                    "author": "thefightingmongoose",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "GMO is a problem when the modification prevents the plant from dying in the presence of certain weed killers.   This allows the liberal use of glyphosate to increase yeild but the glyphosate may be getting into people via the gmo plant.   Lots if great gmo applications that are very safe and useful.  Weed killer resistance, not so much.",
                                    "score": 28,
                                    "author": "wschred",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; liberal use\n\nThe rate and timing is regulated. Less is used, that's the whole point, which is why would farmers use them.",
                                            "score": 24,
                                            "author": "seastar2019",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 25,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Except most dont yet. Let's not forget the long winding path of Monsanto and Bayer and their gmo seeds and the grip they hold on farmers who choose not to use them. There exist myriad articles written and documentaries produced that demonstrate the evils of genetically modified seed producing companies. I think many people understand GMO foods to be relatively safe to eat but dont want to buy because of the companies that create the seeds and products that MUST be used in conjunction with growing them. There are very good reasons small-scale farmers choose non-hybrid seeds least of all because they are not GMO, more practically to avoid being sued by a mega corporation for not abiding by their business plan. Glyphosate is required to keep weeds at bay and hurts bees.",
                                                    "score": 17,
                                                    "author": "bunnysnot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; There exist myriad articles written and documentaries produced that demonstrate the evils of genetically modified seed producing companies.\n\nPropaganda from the organic industry...\n\n&gt;and hurts bees.\n\nIt's an herbicide not an insecticide.",
                                                            "score": 19,
                                                            "author": "ILiterallyCannotRead",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It doesn’t kill bees outright, but does affect their ability to navigate and gets passed to their young which have reduced survival rates, etc. Find a research paper not funded by an ag giant.",
                                                                    "score": 14,
                                                                    "author": "maudyindependence",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Sure, if you *force feed it to them*. Go ahead and link those papers where they exposed bees to 10,000x the expected dose...\n\n[Using a modified spray tower to simulate field spray conditions, the researchers found that 26 pesticides, including many (but not all) neonicotinoids, organophosphates, and pyrethroids killed nearly all of the bees that came into contact with the test pesticide sprays. However, seven pesticides, including glyphosate and one neonicotinoid (acetamiprid), killed practically no bees in the tests.](https://entomologytoday.org/2015/10/13/glyphosate-acetamiprid-low-toxicity-honey-bees-2/)\n\n[We do know that habitat loss, disease, invasive species, climate, and many other factors have detrimental effects on not only bees, but most wild animals, whereas glyphosate is an important method in the toolkit to counteract many environmentally harmful effects of farming. As weed ecology professor Andrew Kniss writes, if farmers would be forced to forgo glyphosate, on top of consequences like increased soil erosion and fuel use, we could well see a return to less diverse rotations.](https://thoughtscapism.com/2018/06/11/no-glyphosate-is-not-a-threat-to-bees/)",
                                                                            "score": 17,
                                                                            "author": "ILiterallyCannotRead"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Genetic modification is not the same as selective breeding. With genetic modification, someone is choosing the exact gene they want to change and introducing it themselves. Selective breeding is breeding two organisms that already have a naturally-occurring version of a gene you want.",
                    "score": 37,
                    "author": "thc-3po",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Isn’t GE just a type of GMO, like selective breeding",
                            "score": 13,
                            "author": "P8Kcv6n",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In the food industry, GMO refers to genetic engineering because most domesticated crops have been selectively bred.",
                                    "score": 5,
                                    "author": "thc-3po",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is why regulating terms like GMO is important for consumers.",
                    "score": 3,
                    "author": "SiscoSquared"
                },
                {
                    "level": 1,
                    "comment": "&gt;\tMy THC distillate syringe\n\nHoldup.. \n\n\nYou out here injecting whole canabusinesses?",
                    "score": 3,
                    "author": "MrKerbinator23",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I see this shit slapped on all sorts of produce where there isn't even a GMO strain of the crop available",
            "score": 74,
            "author": "UnspeakablePudding",
            "replies": [
                {
                    "level": 1,
                    "comment": "There [are exactly ten types of GMO crops](https://time.com/3840073/gmo-food-charts/) grown in the US:\n\n* Corn\n* Soybean\n* Cotton\n* Potato\n* Alfalfa (hay)\n* Canola\n* Papaya\n* Squash\n* Apple\n* Sugarbeet\n\nIf it's not on this list, it should not even be eligible for a non-GMO label because it cannot be GMO in the United States. Non-GMO Project and others have absolutely monetized the fear of the word GMO and the misinformation around it.",
                    "score": 71,
                    "author": "persondude27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fun fact, Canola is indeed not the name of the seed/plant. It is Rapeseed. But rapeseed is much harder to market and so the breed used to make the oil was branded as canola, which stands for ‘Canada Oil Low Acid’",
                            "score": 20,
                            "author": "Dom_S54",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Whats wrong with Rapeseed?",
                                    "score": 7,
                                    "author": "chuk2015",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It has the word \"Rap\" in it, and many of its consumer base are old white people who still don't consider rap real music",
                                            "score": 21,
                                            "author": "Tybick",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"rap isn't music\" - my dad and also Ben Shapiro",
                                                    "score": 5,
                                                    "author": "markocheese"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It has the word \"ese\" in it, which could be considered as cultural appropriation of Hispanic culture.",
                                            "score": 8,
                                            "author": "PAP_TT_AY"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It has the word \"ape\" in it which makes people afraid it's an animal product.",
                                            "score": 10,
                                            "author": "markocheese"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "GMO potatoes are not commercially sold in the US anymore (I think they were produced to solve a plight, the plight was solved? I'm possibly incorrect its 6am) and the only GMO apple is the ~~cosmic crisp~~ Arctic apple, ~~which was approved in 2018 and finally gaining popularity this year because its delicious~~ which is difficult to find is stores still despite approval for sale. \n\nI'm a dietetics student and I'm pissed this isn't addressed im our food science class. GMO foods are addressed but GMO labeling/the extent of GMO foods is not. So stupid.",
                            "score": 5,
                            "author": "jemappellepatty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Things like 'cage-free,' 'free-range,' or 'pasture-raised,' are also thin, subjective, bureaucratic lines.",
            "score": 746,
            "author": "amolluvia",
            "replies": [
                {
                    "level": 1,
                    "comment": "IIRC the only term that holds weight is pasture raised. It might be free range, but I'm fairly certain it's pasture raised.\n\nAt least in thw context of eggs/chickens",
                    "score": 234,
                    "author": "Avanolaure",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I read that you should look for the \"Certified Humane\" label.\n\n&gt;For Certified Humane, it’s 108-square-feet per bird, which is the same standard adopted by Animal Welfare Approved. [Source](https://certifiedhumane.org/decoding-the-carton-how-to-buy-clean-humane-eggs/)",
                            "score": 170,
                            "author": "deadmeat08",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "108 sq ft per bird is more space than where many humans live lol",
                                    "score": 103,
                                    "author": "godofglizzys",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "...shit",
                                            "score": 21,
                                            "author": "Z085"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No kidding. The dorm i lived in my freshman year of college was only 100 sq ft.",
                                            "score": 16,
                                            "author": "TheDrunkSlut",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; The dorm i lived in my freshman year of college was only 100 sq ft.\n\n... and you lived your entire life in that dorm?  \nYou never left to go outside?",
                                                    "score": 11,
                                                    "author": "ALoneTennoOperative",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Those responses are absolutely bonkers. I guess it somewhat applies during COVID though for people who aren’t leaving their house. 🤔",
                                                            "score": 5,
                                                            "author": "Quintary"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; more space than where many humans live\n\nThose humans generally do not spend their entire life inside.",
                                            "score": 4,
                                            "author": "ALoneTennoOperative"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 22,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Various terms have different meanings and legal protections in different countries.",
                            "score": 24,
                            "author": "twowheeledfun"
                        },
                        {
                            "level": 2,
                            "comment": "Grass fed and grass finished. One is a few minutes a day, or a small part of its life, the other is the entire life.",
                            "score": 23,
                            "author": "Spore2012",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well which is which then?",
                                    "score": 11,
                                    "author": "Fridsade",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol right?",
                                            "score": 5,
                                            "author": "MyFeetLookLikeHands"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Wait, which one is which",
                                    "score": 3,
                                    "author": "SciGuy013",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've seen pasture-raised eggs advertise how many square feet there are per chicken. It really helps visualize the actual free space instead of getting a misleading impression like \"cage-free.\"",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pretty much everything you read on a meat label is exactly that.",
                    "score": 15,
                    "author": "AgentSkidMarks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The same is true for milk. A friend of mine's dairy farm is one of 6 that supplies to a bottling/distribution group for my major metro area. Every single one of the brands in local stores is the same milk. Some are advertised as non-gmo, no-hormone, free range happy cows, and etc., and that's the exact same as Roundy's plain old milk. It literally all comes from the same cows.\n\nGiven regulations on this stuff, though, if the cows get sick and have to be given antibiotics that means they're taken off the dairy line and simply await being picked up to be turned into dog food. The \"grass fed cows\" for milk &amp; beef, well guess what: corn is a type of grass.",
                            "score": 16,
                            "author": "_toodamnparanoid_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“Antibiotic free” just means the animal never got sick in its lifetime. The farmer will still administer the necessary drugs to preserve the animal’s life. Like any drug however, antibiotics have a withdraw period. After that, animal products are free of it. However, they can no longer be sold as “antibiotic free”. \n\nMy favorite with milk is “no rBST”. rBST is a hormone that is naturally produced in cattle. Farmers found that by injecting their cows with it, they could increase milk production. Enough people complained about rBST in their milk, citing questionable data, so the US government banned its use. rBST is still present in milk though, since it is still produced by the cattle themselves. \n\nThat can be said for any hormone. If you ever see a label that reads “hormone free”, it’s a crock of shit. Hormones will be present in any animal product you consume since hormones are naturally produced in every animal.",
                                    "score": 14,
                                    "author": "AgentSkidMarks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The dairies I know after the antibiotic period sell the heifer off for dog food. =/",
                                            "score": 7,
                                            "author": "_toodamnparanoid_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dairies will do that because dairy cow meat isn’t all that great and milk labels are a bit more strict. Beef cattle have a few more options.",
                                                    "score": 3,
                                                    "author": "AgentSkidMarks"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That dude who did \"supersize Me\" did a second movie about chicken. And all those bulshit terms",
                    "score": 18,
                    "author": "poomaster421-1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In general, I'd be cautious of trusting stuff that Morgan Spurlock produces. Despite being for an admirable cause, Supersize Me was full of methodology issues and the results have been widely criticized as being flawed and unreproducible.\n\n&gt; As Tom Naughton points out in his documentary, Fat Head, there's simply no way Spurlock could have been eating that much food if he was sticking to his own rules. A large Big Mac meal clocks in at \"just\" 1,450 calories, and it's by far one of the fattiest items on the menu. This means that even Supersizing lunch and dinner every day and adding dessert falls well short of the 5,000 calories a day Spurlock's nutritionist claims he was consuming. In an effort to find out just exactly what the hell, Naughton attempted to contact Spurlock to obtain his food log, but Spurlock (who makes a huge deal in his documentary about McDonald's never calling him back) never called him back.\n\n- https://www.consumerfreedom.com/2018/05/is-super-size-me-a-big-fat-lie/\n- https://www.cracked.com/article_20585_6-famous-documentaries-that-were-shockingly-full-crap.html\n- https://www.youtube.com/watch?v=Ccdfzq2M1Ec\n- https://rationalwiki.org/wiki/Super_Size_Me#Criticism",
                            "score": 25,
                            "author": "dontworryimnotacop",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah Doug benson basically debunked the whole thing already",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What was that called? I'm interested.",
                            "score": 6,
                            "author": "Drfoxi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Holy Chicken",
                                    "score": 11,
                                    "author": "logicbomb666",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Supersize Me 2: Holy Chicken.  \n\n\nI think it's free on YT, I watched it back in April when I bored.",
                                    "score": 7,
                                    "author": "SocialistSycopath"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"Cage free\" and \"free range\" doesn't mean much when the chickens are packed so tightly that they can't even move lol",
                    "score": 3,
                    "author": "claravoyance"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And \"Organic\" doesn't mean pesticide-free (In the U.S. anyway).",
            "score": 82,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 35,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think the misconception is that the lay person has associated organic with something \"natural\" or free from chemicals.",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even in the 70s, \"organic\" had the general connotation of being \"all-natural and healthier for you.\" In 4th grade science (76-77), our science book stated that when a substance is \"organic,\" it means that it contains carbon. When Mr. Wilson (our teacher) said that that means that water is not organic, many of my classmates and I were quite surprised (or \"shook,\" as the kids today say); we'd all been told many times by many adults that water is the healthiest thing to drink.\nNo carbon in water = not organic. That's stuck with me for over 40 years.  \n\n\"Organic\" at the grocery store isn't something I *completely* ignore, or view as a total marketing ploy; I do wash my produce thoroughly, regardless of its status.",
                                    "score": 3,
                                    "author": "FillMyBagWithUSGrant",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So how does one decide whether to spend an extra dollar or two on something being organic? Do you just have to look up the company and hope they have good morals &amp; go from there?",
                    "score": 8,
                    "author": "elonsrightnut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you want to spend extra money on something being organic? If so, go ahead. There’s no real health benefit to eating organically (https://www.health.harvard.edu/staying-healthy/should-you-go-organic), however organic produce may be of a higher quality flavour-wise (https://www.intechopen.com/books/organic-farming-and-food-production/the-quality-of-organically-produced-food)",
                            "score": 18,
                            "author": "Thomas_GN",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Isn't the whole anti-GMO movement not based on the fact that they are bad for you, but because the main companies behind them are notoriously shady and criminal?",
            "score": 360,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's also concern about how GMO crops affect the environment they are produced in. One example being an insect resistant GMO might have a negative impact on local environments either directly or indirectly through food chain disruption. They have been proven safe for human consumption but also need to be proven safe for the locations they are to be grown in.\n\nIt's a shame the public conversation about GMOs has completely stalled at human safety, because while those concerns are pretty much settled, the whole picture deserves attention.",
                    "score": 217,
                    "author": "simon_guy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://readersupportednews.org/news-section2/312-16/13328-monsanto-gm-corn-is-creating-super-worms\n\n&gt; the EPA is launching a review of one of Monsanto's corn strains engineered to produce the natural pesticide Bt. As the agency told Bloomberg, \"There is mounting evidence raising concerns that insect resistance is developing in parts of the corn belt,\" where Monsanto's corn dominates the fields. Root worms exposed to the corn's toxin seem to have become immune to it, breeding an unprecedented colony of superworms that are bound to spread throughout the entire Midwest.",
                            "score": 40,
                            "author": "Commando_Joe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And then Monsanto just happens to develop a new strain after two crop failures and a 85% takeover of the market.\n\nIn all seriousness, GMOs and the monocultures they tend to spawn are dangerously susceptible to systems collapse. Even worse than that, they're basically killing all biodiversity by simply out competing them. Just look at the diversity of corn in the US.",
                                    "score": 17,
                                    "author": "Spready_Unsettling",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not to mention they were subsidized and couldn't even survive as a business without government help, aka the taxpayers paying for both sides, for the subsidies and higher prices. Farmers can't save the seed for the next year. There's a lot of problems, including the fact the risk assessments are done by the companies that want to push the new crops... should be done by a third objective party. But what do you expect when an ex CEO of Monsanto is put in as head of the EPA. Never mind the fact that no long term studies have ever been done and that these posts are always posted by people in the bio engineering business... which this poster has admitted he is. The goal is to remove people's ability to even know whether they are eating GMOs are not, the argument being \"people are too stupid to know what's good for them\". Yeah, no, I don't care what they think about society, everyone has a right to make that decision for themselves, not the corporate and political overlords declaring what we should believe.",
                                            "score": 3,
                                            "author": "LonelyLongJump",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Farmers can't save the seed for the next year\n\nNot commonly done, especially for hybrids (see hybrid vigor)",
                                                    "score": 3,
                                                    "author": "seastar2019"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Many GMOs are designed specifically to be extra resistant to herbicides",
                            "score": 24,
                            "author": "Mr_Moogles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly. It's not so much that I don't want GMO food, it's that I don't want Roundup sprayed on my food.",
                                    "score": 31,
                                    "author": "stark_raving_naked",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If it’s not roundup, it’s going to be more of other less safe herbicides.",
                                            "score": 18,
                                            "author": "SciGuy013",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What would you prefer to be sprayed on your food?\n\nAlso it's not sprayed on your food. Its sprayed much earlier in the growing season. Much before the edible portion of the plant is developed.",
                                            "score": 9,
                                            "author": "TacoSeasun",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Super shady. Something like 4 companies control the market, forcing farmers to use their seeds. Farmers profit margins are getting smaller and smaller. [interesting read on the issue.](https://www.farmaid.org/issues/gmos/gmos-top-5-concerns-for-family-farmers/)",
                    "score": 69,
                    "author": "johnnycbr954",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Not necessarily. A lot of the anti-GMO stuff is centered on the belief that they are “unnatural” and only “natural” foods are ok. A lot is also based on not understanding the science and being scared of big words to some degree. There’s a lot of overlap in anti-vaxx and anti-GMO thinking",
                    "score": 30,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's a complicated topic. While GMOs aren't inherently bad (and none to my knowledge cause negative health effects) the environmental consequences and economic/societal consequences are hairy issues.\n\nLike if a company were to genetically engineer a new type of plant, not just by breeding, but with gene editing technology, should they be able to own the rights to that gene sequence? Do we really want to apply copyright law to genetics? \n\nIf a company has a plant that's resistant to insects, it may lead to insects that are resistant to whatever chemical the plant is producing as an insecticide. Then we either have to use more insecticide, or we have to genetically engineer even more resistant plants. And what happens to the farmers that can't afford the special insecticide-enhanced seeds? What if the seeds blow into nearby crops (as seeds do), do they belong to the owner of the crop or the owner of the seed?\n\nThe \"it's not natural so it's not healthy\" crowd has their head up their ass, sure. But GMOs don't represent a miracle science that has no disadvantages. We need to tread carefully as a society.",
                            "score": 13,
                            "author": "Teeshirtandshortsguy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Totally agree with you",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are also very few GMO crops in use and most of them are grains iirc. So many things with the \"non GMO\" label are on things that don't even have a GMO version that exists.",
            "score": 40,
            "author": "MathNerdGord",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s mostly corn, soybeans, cotton, and canola (almost 100% of each).",
                    "score": 9,
                    "author": "XenopusRex",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "There are 10 or so US approved GMO crops, most of which are animal feed or for ethanol. There are more world wide, I'm sure.",
                    "score": 4,
                    "author": "bythog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 131,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; GMO is the company\n\nWhich company? Multiple companies produce GE seed.",
                    "score": 63,
                    "author": "MGY401",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Monsanto specifically gets most the hate for their practices.",
                            "score": 72,
                            "author": "46_and_2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even Futurama did [it. ](https://morbotron.com/meme/S01E02/586428.jpg?b64lines=IEFkZHJlc3MgYWxsIGNvbXBsYWludHMKIHRvIHRoZSBNb25zYW50bwogQ29ycG9yYXRpb24u)",
                                    "score": 7,
                                    "author": "Impstrong"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "39% of Americans believe GMO’s are detrimental to health, while 20% believe they’re highly detrimental.\n\n\nhttps://www.pewresearch.org/science/2016/12/01/public-opinion-about-genetically-modified-foods-and-trust-in-scientists-connected-with-these-foods/",
                    "score": 3,
                    "author": "BumblingSnafu"
                },
                {
                    "level": 1,
                    "comment": "It's kind of both. The company stuff is legitimate, the health stuff is not.",
                    "score": 15,
                    "author": "dogeman87",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you see a pasta product that says 'non-GMO' that is purely a marketing ploy because there are no GMO varieties of wheat.",
            "score": 10,
            "author": "Clarksonforcaptain",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I purposefully seek out GMO’s tbh",
            "score": 99,
            "author": "Psycho-tamago",
            "replies": [
                {
                    "level": 1,
                    "comment": "So do I. Anything labelled \"no-GMO\" I avoid like the, well... plague. ^(\\[too soon?\\])",
                    "score": 58,
                    "author": "SeedlessGrapes42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not soon enough, my friend!",
                            "score": 9,
                            "author": "Slyrunner"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 12,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Besides, almost everything we eat is GMO. It means genetically modified. We've been doing that through selective breeding for thousands of yrs.",
            "score": 136,
            "author": "Jamie_XXX",
            "replies": [
                {
                    "level": 1,
                    "comment": "Selective breeding is different from what Monsanto is doing",
                    "score": 59,
                    "author": "aminalsarefriends",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just bc it's done on a microscopic level doesn't make it different. The exact process may be more intricate, but the end results are the same. Before DNA they cross pollinated crops to make them perform more to their liking.  It's also why saying something is non-gmo isn't regulated bc everything these days is or has been genetically modified. Otherwise we'd have only has a few types of apples for example until much more recently.",
                            "score": 78,
                            "author": "Jamie_XXX",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, the two results are exactly the same. One takes place in the environment and changes to the crop are introduced over several generations giving the ecosystem time to adapt to the changes, the other happens in a lab away from the ecosystem it will be grown in, and it is introduced with a drastically different impact on the local ecosystem giving it no time to adjust.",
                                    "score": 11,
                                    "author": "BigRedFirewall",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The ecosystem doesn't \"adapt\" to selectively bred crops. Both forms are too fast to allow for an adaptation or adjustment.",
                                            "score": 4,
                                            "author": "Xeno_Lithic"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;”Giving the ecosystem time to adapt”\n\nDo you really think farming works in cooperation with the ecosystem? Farming is like the nr 1 threat to native ecosystems.",
                                            "score": 8,
                                            "author": "Leprecon"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is the liberal equivalent of climate skepticism. People ignoring the actual science because of how they feel.",
                            "score": 30,
                            "author": "JordanLeDoux",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly. Science doesn't see political spectrum.\n\nWhile I would say that the left tends to trust science more, they still fall for simple logical fallacies like in this case, \"Appeal to Nature.\"\n\nI love the study that shows an inverse correlation with a distrust in GMOs and scientific illiteracy.",
                                    "score": 8,
                                    "author": "Smiley_Wiley",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep. Monsanto was a company with shitty practices and shitty people running it. So I assumed the science was shitty and sketchy too, especially with how similar science was manipulated by tobacco companies decades ago.\n\nBut then I was told, here on reddit actually, basically what I just wrote. Someone told me that I was doing with GMO what the right does with climate change.\n\nSo I went and actually looked at the science. I couldn't find a single reputable primary source that GMO's were dangerous. Not one. I found plenty of *secondary* sources, and blogs, and so on. But I could not find *one* actual scientist who actually studies it that had *any* level of concern.\n\nSo I changed my view, because I don't particularly like disagreeing with facts and reality.\n\nMy position before had been that I didn't want to ban GMOs, I just thought they should be labeled. But even that was *way* outside of what scientists think. Partly because there's no really good way to define GMO that wouldn't result in nearly ALL food getting labeled as GMO, and partly because it has been going on for a LOT longer than most people realize, and we would have seen any such effects already.",
                                            "score": 12,
                                            "author": "JordanLeDoux"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The weird thing about the anti GMO movement is that before we were able to do it in a lab, we'd basically blast different seeds with radiation to scramble DNA and create essentially random mutations in the plant.\n\nEveryone is up in arms about a scientifically precise method and had no concern for radiation blasted and mutated crops that have grown into what we eat today.\n\nMy issues are really with ethical practices of the companies that do it. \n\nGMO is great as a core concept though, and we have honeycrisp apples to thank for that I think.",
            "score": 51,
            "author": "Avanolaure",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honey crisp apples aren't GMO. Unless we're counting all breeding as GMO (which apparently has been considered GMO on reddit for some reason).\n\nArctic Apples are a GMO apple that lost its ability to oxidize and brown when slice though.",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 11,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "But we fear impacts on other plant species in nature.",
            "score": 53,
            "author": "Captain__Spiff",
            "replies": [
                {
                    "level": 1,
                    "comment": "Which could also happen with non-GE crops....",
                    "score": 16,
                    "author": "SeedlessGrapes42",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Precisely what I said in the second paragraph. This post is about human health. I alluded to environmental problems, I just didn't go into detail.",
                    "score": 27,
                    "author": "dogeman87",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wrote my thesis about what Greenpeace's GMO stance was and how ti stood up to scientific research and I arrived at your same idea. The GMO thing is problematic in many ways relating to monopolistic practices and other political and economical issues., but it has never been shown to be dangerous. But I understand how the general public is grossly misinformed because it's much easier to print \"Monsanto Bad\" than actually trying to educate people.",
                            "score": 20,
                            "author": "jmdemucha",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The monopolistic practices aren't a GMO problem, they're a capitalism problem.",
                                    "score": 18,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't know much about the subject, but I thought the whole GMO bad thing was because GMO crops causes less diversity; GMO crops spread pollen and cross-contaminate all nearby crops, and those crops get more and more genetically similar, which is bad because if a disease hits the crop and they're all genetically similar, the entire crop can be knocked out which could lead to a food shortage. Is that an accurate issue?",
                                    "score": 4,
                                    "author": "redditor-for-2-hours",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, there is some truth to that but like I said, there’s 20 layers more of nuance to it. For example, corn is wind pollinated. So there’s always going to be a mixing, some are against gmo corn because if it crosses with their regular strain the next generation might contain one of the special genes. That doesn’t necessarily mean it’s a bad thing but because of certain politics, if your regular corn has the gmo marker then it might be worth less in the market, even though corn is always mixing.",
                                            "score": 3,
                                            "author": "jmdemucha"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Having seen both bottled water and paper plates (!) labeled gluten free, I have quit believing much of anything on food labels other than the list of ingredients. Selective breeding, which modifies genetics, is as old as agriculture.",
            "score": 21,
            "author": "StrangeJournalist7",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was at a farmers market last year and saw somebody selling (and I swear these were real) gluten-free birthday cards.",
                    "score": 13,
                    "author": "SeedlessGrapes42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If a person is stupid enough to eat a paper plate, why not nibble on a birthday card?",
                            "score": 3,
                            "author": "StrangeJournalist7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I blame scratch and sniff stickers.",
                                    "score": 3,
                                    "author": "SamBoha_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 28,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "For me, the biggest issues are water use and transport distance. Engineering crops to grow in less suitable conditions (closer to the end user) and to reduce their need for irrigation will be immensely valuable as fuel and water become harder to obtain.",
                    "score": 14,
                    "author": "izlude7027",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is exactly right! The GMO crops that are being made to absorb their own nitrogen from the environment so that need for fertiliser is eradicated is also in this line of thinking. Makes producing crops cheaper, better for the environment, and will potentially produce higher yields. So many farming issues could be solved by GMs",
                            "score": 5,
                            "author": "BK-abcd"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 6,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I love you so much.",
            "score": 4,
            "author": "The_Autistic_Gorilla",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love you too, autistic gorilla.",
                    "score": 3,
                    "author": "dogeman87"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wouldn’t say non-GMO is a marketing ploy because a lot of the movement is for transparent labeling of food regardless of whether you believe gmos are harmless or not. If people want to avoid eating food with GMOs they should be able to (I say this as a person who agrees that GMOs are harmless).",
            "score": 3,
            "author": "devourtheunborn69",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why should I trust you? Can you provide a source in the form of a Facebook post?",
            "score": 4,
            "author": "Id_rather_be_lurking"
        },
        {
            "level": 0,
            "comment": "I agree with your 100% on the lack of people's knowledge. I studied bio for years and can't comprehend the amount of people who say everything \"not organic\" will give you cancer.",
            "score": 7,
            "author": "guinader"
        },
        {
            "level": 0,
            "comment": "If it's not corn, wheat, rice, soy, or canola, and the label says non-gmo, you're being jerked off..",
            "score": 3,
            "author": "justsomeyeti"
        },
        {
            "level": 0,
            "comment": "In australia they are trying to produce GMO cotton that is already coloured to reduce the environmental impacts of dyes. Black dye is especially harmful to the environment (can’t remember why but that’s what I read in this paper). They have gotten yellow and reds so far so hopefully one day we will see pretty fields of coloured cotton that does require any dye. And that’s my story that no one asked for.",
            "score": 3,
            "author": "sevenseas401",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Also if the modified organism is produced via CRISPR technology it technically doesn't need to be labeled as genetically modified as it is considered genetic engineering. Either way, GMOs are good for the world.",
            "score": 3,
            "author": "et133et",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I know nothing about any of this so seeing both sides of the debate in these comments is really interesting.",
            "score": 3,
            "author": "turkeyandtuna9",
            "replies": []
        },
        {
            "level": 0,
            "comment": "But then I’m curious as to why it’s GMO is apparently banned in Europe? I was looking up why the Impossible burger isn’t sold in Norway and from what I read it said that it isn’t sold in Europe because it contains GMO. So why is it banned in Europe?",
            "score": 3,
            "author": "doge_daelus",
            "replies": []
        },
        {
            "level": 0,
            "comment": "GMOs are honestly our best shot at adapting agriculture to \"post\"-climate change conditions. It infuriates me when I see people saying GMOs are a bad thing. It's like being an anti-vaxer",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I ate at a vegan restaurant in London in 2012 that had “organic water” on its menu.",
            "score": 3,
            "author": "tbods"
        },
        {
            "level": 0,
            "comment": "Your line about how all crops are \"GMO\" is basically an industry talking point and I'm tired of hearing it. While it is true that all crops have been selectively bred over decades to millennia, thus modifying their genes. It is only recently that we have had the ability to edit the genes in the organisms directly. This has been such an advancement, that there can no longer be an \"apples to apples\" comparison of the GMOS of today to those of the past, and to do so regarding safety based on the fact that both are \"GMO\", would also be ludicrous. \n\nWhile it is true that GMO technology can do pretty innocuous things like add a useful vitamin, increase yields, etc. GMOS of today also do things like carry insect gut-perforating endotoxins from bacteria. This would never happen with just selective breeding. The safety of Bt-corn is evaluated more like a drug trial or pesticide exposure study (because that's what it is, a natural pesticide that consumers would be exposed to in much larger amounts than typically otherwise)\n\nWhat's more, genes like these are so useful for the plant (absolute insect resistance to Lepidoptera), they tend to contaminate other non-GMO strains so they are essentially introduced permanently into the population of the crop unwittingly.\n\nBut again, that's just as safe as a selectively bred corn...right? Even though it hasn't been around as long as a human lifetime...right? \n\nThink about how many drugs, pesticides, etc. are determined to be 'safe' and then recalled. This kind of GMO warrants scrutiny and to say otherwise, I think is a mistake.\n\nTLDR;\nSome GMOs have a safety concerns akin to drugs and pesticides rather than food.  Scientists and informed consumers are actually concerned about THESE GMOS.",
            "score": 3,
            "author": "Sauce_salsa",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s more accurate to say GMOs have “no more established risk for humans” rather than “no risk.”\n\nJust like with cross pollination, there is always a chance that the new plant generation has a negative trait. This really helps bridge the gap between someone who is scared of GMOs. \n\nGMOs are not any more dangerous (to humans) but *anytime* the genome changes there is a chance for negative side effects. Even natural changes in the wild can make new dangerous stuff. GMOs aren’t much different besides being extremely deliberate and precise rather than random. \n\nTo be clear I agree with your sentiment.",
            "score": 3,
            "author": "rincon213"
        },
        {
            "level": 0,
            "comment": "You're stupid. \nGmos are modified to be resistant to roundup so your eating more roundup.",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\\&gt;GMOs have no established health risks in humans\n\nThat we know of. In 10-20 years, we will see that this is not true",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Correct. GMO is nearly all of the produce that we have been mass producing for over 100 years on the globe. \n\nIt’s the Monsanto RoundUp that is hurting people, not the food.",
            "score": 3,
            "author": "BelCantoTenor",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m more worried about what they modified the crop to do. Like, did you modify it to make it produce Vitamin D or something? Cool! Did you modify it to make pesticides or withstand huge amounts of pesticides? Less cool! I just wanna know what the modification does. But I’m not so worried about it that I don’t eat GMO food, it’d just be nice to know.",
            "score": 48,
            "author": "9pmlmn",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;  I just wanna know what the modification does. \n\nThere are relatively few transgenic crops that have been [approved for consumption.](https://en.wikipedia.org/wiki/List_of_genetically_modified_crops) The vast majority include genes taken from *Bacillus thuringiensis* that produce Cry (crystal) proteins that kill larvae. This organism, also known as Bt, is commonly sprayed on lettuce, and is an [\"organic\" pesticide.](http://www.bt.ucsd.edu/organic_farming.html) The Cry proteins don't last long in an acidic gut; the pH and proteases of the mammalian digestive system make short order of them. Because the pesticide is produced endogenously (inside the plant), non-target organisms are generally unaffected.\n\nFrom that Wikipedia page, most of the other transgenic crops that are approved for use have herbicide resistance (much of this is coincidental with the production of transgenic crops- link herbicide resistance to, say, Bt Cry proteins, and screening is so much easier, and now it can be put in the field and sprayed with glyphosate).\n\nOther'n that and a handful of crops with improved pathogen resistance (most notably, having saved the Hawaiian papaya crop), most improvements are pretty mundane.",
                    "score": 14,
                    "author": "Level9TraumaCenter",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt;I’m more worried about what they modified the crop to do. Like, did you modify it to make it produce Vitamin D or something? Cool! Did you modify it to make pesticides or withstand huge amounts of pesticides? Less cool!\n\nThe point of resistant crops is to use ***less*** toxic pesticides post-emergence, or to replace the need for pesticides (Bt crops). Plants already produce pesticides. Caffeine, nicotine, limonene, etc.\n\n&gt; I just wanna know what the modification does. But I’m not so worried about it that I don’t eat GMO food, it’d just be nice to know.\n\n[Go wild.](http://www.isaaa.org/gmapprovaldatabase/cropslist/default.asp)",
                    "score": 85,
                    "author": "SeedlessGrapes42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, I will check out that link!",
                            "score": 9,
                            "author": "9pmlmn",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "GMO crops actually use less pesticides. That's a very important part of it being a GMO. A non-GMO crop needs more pesticides because it can't naturally protect itself against diseases/pests.",
                    "score": 42,
                    "author": "frodeem",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "But if I dont eat organic non GMOs everything how am I supposed to feel superior?",
            "score": 22,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not only are not bad for you, in some cases, they can be quite helpful. I don’t remember the whole article but I remember the important parts. When I was in high school, our ag teacher showed us an article on GMO corn. A company was doing some modifying on corn but it wasn’t working. They were giving the corn to a farmer to feed his cattle so it wouldn’t go to waste. The farmer realized that when feeding the cattle with this corn, the cows didn’t have any diarrhea. Anyways, somehow, some people found out about this and had the idea to feed people in 3rd world countries with this corn. When they did, the people’s dysentery went away just as with the cows.",
            "score": 13,
            "author": "PBAlfro",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Everything we eat is genetically modified. \nWe wouldn't have yellow bananas, popcorn, apples, any of the farmers market veggies without genetically modifying them. Grapes without seeds? Genetic modification.",
            "score": 7,
            "author": "swapsrox",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Remember the 90's when GMO's were going to end world hunger and save humanity? Funny how they were just an excuse for monolithic food corporations  to pollute more, control more and treat us like lab nice.",
            "score": 5,
            "author": "captobliviated",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh wow, I really hope that the millions of peoples lives saved in India know about this\n\n\nhttps://www.bbc.com/news/world-asia-india-38156350",
                    "score": 3,
                    "author": "nowyouseemenowyoudo2",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "#THANK YOU, I’m sick of people thinking GMOs are fucking poison.\n\nGMOs can legitimately save lives, by genetically engineering pest-resistant crops and shit",
            "score": 23,
            "author": "Kush_goon_420",
            "replies": []
        },
        {
            "level": 0,
            "comment": "People love to hate what they dont know, most of the time they dont even bother to do the research",
            "score": 7,
            "author": "Isfoskas",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Our limited understanding of epigenetics alone is reason enough to be concerned.  Then there's the concern of ingesting the pesticides in the food.  Then there's the \"no established\" health risks.  When it comes to my food, I'm looking more for \"established safe\" over \"not known to be dangerous\".  The latter always has the possibility of a \"yet\".  \n\nThere's a multi-billion dollar industry making money on GMOs, know who paid for the research you read.  There isn't much money available for independent research.  Nor has there been enough time to really evaluate GMOs.  \n\nEat what you like, but respect my choice as well.  Its equally as valid",
            "score": 8,
            "author": "star_tyger",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s not a marketing ploy. It’s a protected term and *does* mean something. As to whether or not we should *care* about whether something contains GMOs or not is another story, but this is different than using a term like, say, “natural” which truly doesn’t mean anything and *is*  a marketing ploy",
            "score": 16,
            "author": "gianthooverpig",
            "replies": []
        },
        {
            "level": 0,
            "comment": "People think GMO is some artificial food essentially. I tried to write essays in high school that said that GMOs were harmful to humans but there just isn’t any evidence to support that argument. In fact, GMOs may be the only way to truly support the growing population of the Earth.\n\nTake corn for example. It isn’t a GMO in the sense that people think of it. But over thousands of years we genetically modified the plant [teosinte](https://teosinte.wisc.edu/questions.html) through plant breeding to turn into what is now modern day corn. It isn’t some awful thing that humans have created, but a tool that we can use to support the population more efficiently. \n\nThe whole non-GMO advertisement ploy is really a bunch of nonsense to sell more. Plus the lines are so blurred on what a GMO is that it doesn’t even make sense to use it anymore. And anything that claims to be “non-GMO” is likely not even true. I think we really need to get rid of the stigma around GMOs.",
            "score": 17,
            "author": "SammehPls",
            "replies": [
                {
                    "level": 1,
                    "comment": "Corn is very much GMO. Majority of corn in the United States is produces BT, a protein from a bacteria that kills certain insects, and/or Round-Up ready (or Glyphosate resistant).",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}