{
    "id": "j028wa",
    "score": 45516,
    "title": "YSK Yielding the right-of-way at a four-way stop isn't \"nice\"; you're disrupting the flow of traffic.",
    "author": "coloradoconvict",
    "date": 1601108133.0,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/j028wa",
    "media_urls": [],
    "other_urls": [],
    "postText": "Why YSK: Your intentions are probably kindly but the quickest, most efficient, and above all SAFEST way to process traffic through a multi-way stop sign is for people to take their right of way, in the order that they arrive at the stop. Waving people through to be friendly or because you aren't sure if it's your turn throws a giant wad of uncertainty into a rigidly mechanical and very safe system of prioritizing traffic. Pay attention and know whether it's your turn, and be friendly on social media or at the park.\n\nBonus tip: if you arrive simultaneously with someone who is crossing the intersection against your path, you can remember who has the right-of-way with this mnemonic: the person on the RIGHT has the right of way.",
    "comments": [
        {
            "level": 0,
            "comment": "Go......gooooo...g.... Would you go.....ok... Fine..... I'll go.... Why are you fucking going..... Fine.. I'll stop..... Oh for fucks sake... Don't wave me through.... FUCKING GO",
            "score": 3657,
            "author": "umm_mickey",
            "replies": [
                {
                    "level": 1,
                    "comment": "I felt this in my soul",
                    "score": 528,
                    "author": "abunchofschleem",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's because you were being polite. \\*tsk tsk tsk\\*",
                            "score": 95,
                            "author": "Gsusruls",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's why I'm super polite and dont even stop.",
                                    "score": 38,
                                    "author": "Graysect",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Your Kia Soul?",
                            "score": 39,
                            "author": "stooftheoof",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'll just wait, I'm never in a hurry, I got all day. You got there first but want to wave me through? Naw I'm fine, my favorite song is on.\n\nJust make eye contact and shake your head at their wave.\n\nThough, honestly,  it seems like most of the time it's because they just aren't paying attention and have no idea who got there first, which is also scary.",
                    "score": 159,
                    "author": "Pezmage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Just make eye contact and shake your head at their wave.\n\nThe problem with trying to communicate this way in cars is that they might not be able to see you as well as you think.  Because of glare on the windshield, darkness inside the vehicle, etc, anything less than a hand wave (which is more noticeable due to the movement) should not be assumed to have been understood.",
                            "score": 51,
                            "author": "000882622",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or people with tinted windows getting mad because you can’t see them waving you on. I’m sorry but you’re the one who paid for privacy windows, don’t be annoyed at me when you have to crack your window and stick your hand through...",
                                    "score": 38,
                                    "author": "FlailingConversation",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Then they get pissed when you don't take them up on their kindness. Stopping in a four Lane to let you out, with a line of cars behind them and cars zipping by in the other three lanes. \"Go motherfucker! You're not helping\"",
                    "score": 27,
                    "author": "Tilthead",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah hate those left hand turns where one person stops to let you through and you can see the cars still coming up in the next lane and they keep waving at you to go just so you could end up getting tboned if you actually took the opening.\n\nIt's like you dumb mother fucker how about using your mirrors for once and see how stupid your attempt at being nice is.  I just wave them forward while shaking my head and most get the hint.",
                            "score": 13,
                            "author": "garlicdeath",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I always point at the oncoming traffic when people do this.  Like, thanks, but you're waiving me into an accident dickhead.  Don't be nice, be predictable.",
                                    "score": 9,
                                    "author": "hugotheyugo",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Some asshat did exactly that in thick traffic and my husband traveling in the right lane (on motorcycle) was hit by a car that turned left. Flipped over the car and broke his leg, got surgery, but it’s still not the same 3+ years after. Wasn’t even at a crossroad, the idiot waved through the idiot that hit my husband into a goddamn laundromat parking lot! My husband couldn’t see him, nor could he have anticipated that anyone would be turning left there. Like, he’d normally slow down a bit approaching an intersection just in case, but in the middle of the block? Wtf.",
                                    "score": 5,
                                    "author": "newluna",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's almost always parking lot driveways that I see this happen/happens to me.  \n\nThat sucks about your husband.  That's one of the reasons I get annoyed by the comments that are like \"I'd just hit them since they're at fault anyway\" \"ooooh big payday\" etc.  \n\nSo many people don't get that you can still be dealing with some consequences of a car wreck that wasn't your fault for months, years or even for the rest of your life.  A stupid check from your insurance company isnt going to fix that.",
                                            "score": 4,
                                            "author": "garlicdeath",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "People seem to have this misconception that if you’re not at fault, you’re automatically going to be awarded a huge settlement and actually get it. In most cases nothing could be farther from the truth. The check my husband got from the dude’s insurance barely covered medical expenses, forget about time off work, etc. And that’s with a decent lawyer (who didn’t take that much, mind you). He could’ve started litigation, but really, how much can you get from someone who buys bare minimum coverage for their car? Meanwhile you still need to pay your lawyer through the whole uncertain process. Being awarded and collecting are very, very different things.\n\nEdit: Suing someone rich isn’t great either. A former neighbor was awarded a few hundred thousand (at least) in settlement after some rich asshole broke her back, but she hasn’t been able to collect for years now. Offender simply left the country to travel the world for a few years or some such. Nobody’s gonna hunt them down across the globe, and at some point those judgments expire.",
                                                    "score": 3,
                                                    "author": "newluna"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The worst thing is when a light is malfunctioning and blinking red or yellow. Where I am, a blinking yellow is \"slow down and use caution\" and blinking red is \"treat it like a four way stop\". Nobody seems to know this. It's pure chaos, especially when the intersection is for multiple lanes including turn lanes.\n\nEdit: As many have pointed out, a red blinking light means treat it as a stop sign. It is only a four way stop if all the lights in the intersection are blinking red.",
            "score": 2056,
            "author": "LaeliaCatt",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 393,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What's bad though is there is no way to tell at a red. Blinking light if the other way has a red or a yellow light",
                            "score": 127,
                            "author": "pizzafourlife",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've also seen where major roads will get the blinking yellow and the intersecting gets blinking red but the traffic never eases up, so red can never go safely.",
                                    "score": 3,
                                    "author": "anderhole"
                                },
                                {
                                    "level": 3,
                                    "comment": "This.  \\^\\^\\^  That's the problem with blinking red lights generally. A four way stop sign you can see from the other streets with the octagonal sign being a dead giveaway. Not so much with blinking yellow!",
                                    "score": 4,
                                    "author": "barrett-bonden"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You guys get blinking lights during power outages?! When the power is out where I am from, there is zero lights lol. Just a massive cluster fuck because no one follows the right of way",
                            "score": 58,
                            "author": "Tinkxxo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If the lights are completely out then it should be treated like a stop sign.\n\nBut so many people don't do that",
                                    "score": 56,
                                    "author": "jhooksandpucks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Almost got rear ended last month for stopping at an intersection where the lights were out. Dude whipped around me, flipped the bird while honking (knee steering?) and almost hit at two other cars who had stopped but we're crossing.\n\nHe sure showed me who the asshole was.",
                                            "score": 42,
                                            "author": "donnerpartytaconight",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Everyone likes to act like they're driving an ambulance or fire truck, as if 10 seconds is going to be the difference of life or death.\n\nGlad you didn't get rear ended!",
                                                    "score": 24,
                                                    "author": "jhooksandpucks"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Had this occurr yesterday. Lights out in all directions at two intersections on either side of interstate exit/entrance ramps. People just blew through the intersections in all directions. Chaos. WTF people.",
                                            "score": 10,
                                            "author": "zuprman"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; If the lights are completely out then it should be treated like a stop sign.\n\nSo, slow down to around 20, look both ways to see if you're going to hit anyone, and then slam the gas going through the intersection? /s",
                                            "score": 8,
                                            "author": "talkingtunataco501",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Million times this. Everyone will get home faster &amp; safer if we all follow the rules.",
                            "score": 32,
                            "author": "kuznetmatrican",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One problem with this is the people with the blinking red can't see that the other lanes have a blinking yellow. You have to wait and intuit it from traffic flow, which isn't all that reliable in some places. Seasoned drivers coming up to the blinking yellow may realize this and have to adjust if there are drivers at the red that could incorrectly enter the intersection ahead of them. Confusion ensues.\n\nAnd then some dimwit stops at the yellow to be polite and, yeah, chaos.",
                    "score": 217,
                    "author": "Somorled",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 35,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A lot of intersections around me go blinking red for the smaller road and yellow for the larger road between like 2am and 7 am.",
                                    "score": 68,
                                    "author": "nileo2005",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Around me the main road will have blinking yellow while the side roads that connect to it have blinking red. \n\nThis starts at night maybe around 10pm? It’s earlier than you’d expect.",
                                    "score": 12,
                                    "author": "Tohrchur",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ve heard that called an “uncontrolled intersection.” Nobody seems to know that rule. It’s usually treated as a the-busier-road-has-the-right-of-way-but-should-slow-down-a-bit-first intersection.",
                    "score": 18,
                    "author": "randallstevens65",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you have a flashing yellow, the perpendicular road should have a stop... not really much to do with right of way",
                            "score": 29,
                            "author": "OG_Felwinter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This is the correct answer.",
                                    "score": 3,
                                    "author": "wildcoasts"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How does everyone know which is the “busier” road? Flashing red, treat as a stop sign. Flashing yellow, proceed with caution. No lights or uncontrolled, treat as a four way stop.",
                            "score": 9,
                            "author": "mbgpa6"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Blinking red messes with a lot of people here but if for some reason the power goes out and the lights are off people assume the lights never existed and go full speed right through all of them even though it is supposed to be an all direction stop.",
                    "score": 9,
                    "author": "Veighnerg"
                },
                {
                    "level": 1,
                    "comment": "i've never seen blinking red, but blinking yellow means that you have to obey the traffic signs at that intersection",
                    "score": 32,
                    "author": "boborg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd add \"if present\". There are intersections with blinking yellows that don't have separate signage, and those are more/less common depending on where you live. They're there to say \"Keep on moving but be extra careful.\" And often \"...and by the way, this might turn red.\" You'll see the former at unusual junctions like 5-way intersections and the latter in front of fire stations.",
                            "score": 48,
                            "author": "dcgrey",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve never seen a blinking yellow turn red aside from left turn arrows. Does it happen to regular ones too? How do you know when it’s about to change? Will it turn solid yellow first?",
                                    "score": 7,
                                    "author": "OG_Felwinter",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah they normally go solid yellow first and then turn red. They're more common with intersections that are needed to stop traffic like for fire stations and I've seen crosswalks with lights too",
                                            "score": 18,
                                            "author": "H3rlittl3t0y",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In Germany every single Traffic light intersection has yield/stop signs that automatically dictate right of way if the lights fail",
                    "score": 5,
                    "author": "LimjukiI"
                },
                {
                    "level": 1,
                    "comment": "If the power is out to the light, and it displays nothing, that’s supposed to be an all way stop and people don’t seem to know that.",
                    "score": 4,
                    "author": "broff"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dont drive politely, drive predictably. Don't go out of your way to be polite in cases where its unpredictable.",
            "score": 979,
            "author": "FormerGoat1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a transplant to the South and so many people create incredibly dangerous situations DAILY by trying to be polite. No. Just fucking drive the way you're supposed to.",
                    "score": 192,
                    "author": "5pens",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I live in the south and go through a four-way stop daily. It's a nightmare of \"polite\" people waving each other through at random. Sometimes crossing the intersection feels about as safe as if you just closed your eyes and hit the gas.",
                            "score": 85,
                            "author": "notwatchingdrwho",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also from the south. This is why I slow down more than necessary when pulling up to four way stops so I visibly arrive last and the other cars will just *go*. The waving at each other drives me crazy. \n\nBonus dick points to people in the right lane stopping to let you out into traffic...except you want to pull into the left most lane and you can’t see around them now to know if both lanes are clear. Aaaaaaah",
                                    "score": 90,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"This is why I slow down more than necessary when pulling up to four way  stops so I visibly arrive last and the other cars will just *go*.\"\n\nAh, but see, down here in Wilmington, NC, you do this and the other person will just sit there and wait...and wait...annnd wait until you've pulled up and stopped. And THEN they'll go. It's infuriating.\n\nYOU DON'T HAVE TO WAIT FOR ME, JUST FUCKING GO AND GET OUT OF THE GOD DAMN WAY! GOOOOOOOOO!!!",
                                            "score": 44,
                                            "author": "phil_davis",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Same. Except they wait and wait and wait and still end up waving for me to go first 🤦🏻‍♂️",
                                                    "score": 12,
                                                    "author": "JimmyAxel",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; Bonus dick points to people in the right lane stopping to let you out into traffic...except you want to pull into the left most lane and you can’t see around them now to know if both lanes are clear.\n\nFWIW you shouldn't ever be turning right and going immediately into the leftmost lane. You're supposed to go out into the right lane and wait until it's clear to signal and get into the left lane. It sucks if you're immediately trying to make a left turn but it is what it is. Same as people turning at a stop light and shifting to the outside lane in the middle of the turn. It's extremely dangerous.",
                                            "score": 16,
                                            "author": "32BitWhore",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;I live in the south and go through a four-way stop daily. It's a nightmare of \"polite\" people waving each other through at random. Sometimes crossing the intersection feels about as safe as if you just closed your eyes and hit the gas.\n\nI've always heard that situation referred to as a Canadian standoff.",
                                    "score": 11,
                                    "author": "Bacon_Fiesta"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My father gave me the best driving advice in the world when I was 16: don't do anything unexpected. \n\nEveryone is safer when people do what they're expected to do.",
                    "score": 31,
                    "author": "Callinon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That and 'the graveyard is full of people that had the right of way'.",
                            "score": 11,
                            "author": "fistymcbuttpuncher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There was a PSA from like a million years ago that went something like: \n\nHe was right all right as he sped along, but he's just as dead as if he'd been wrong.",
                                    "score": 10,
                                    "author": "Callinon"
                                },
                                {
                                    "level": 3,
                                    "comment": "Here lies the body of Billy Mackay\n\nWho died while defending his right of way.\n\nHe was right, quite right as he drove along\n\nBut he's just as dead as if he'd been wrong.",
                                    "score": 3,
                                    "author": "Vlad_The_Inveigler"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "#THE RIGHT OF WAY IS NOT YOURS TO GIVE UP",
                    "score": 156,
                    "author": "thagthebarbarian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "#IT'S MY RIGHT, DAMN IT!",
                            "score": 18,
                            "author": "MightyCaseyStruckOut",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "although, if you're a pedestrian, your right of way will typically be ignored",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Which, oddly, still fits with 'is not yours to give up' lol\n\nThe big metal humans will give it up for you",
                                    "score": 9,
                                    "author": "Famous-Account",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "dammit I hate that you're right",
                                            "score": 5,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“Considerate drivers” stopping to let someone turn in 2+ lane are f***ing assholes. You’re spelling out an accident right here.",
                    "score": 15,
                    "author": "lolkeinthatsghey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not to mention it backs up traffic so it takes you even longer to make that turn safely.",
                            "score": 7,
                            "author": "enameless"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 106,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can leverage the rules when you know people are likely to either follow them anyway, or be selfish bastards. Creating a situation where there's only one possible outcome based on the laws and potential selfish nature of others.\n\nLike, if I'm approaching a 4-way stop and someone else is as well, I slow to stop much more slowly than I would have, so I'm still moving some by the time they stop, and then I stop after. That way they for sure reach it first without any confusion, so they can go before me when I would have otherwise stopped first or at the same time. It's a conscious ceding of right of way I would have had that's completely lawful and predictable.\n\nI used to get hung up on law and courtesy with driving, but it just made me angry and want to vigilante my way through. Now I focus on doing what I can to contribute to the most efficient and safest flow of traffic within the law.",
                    "score": 12,
                    "author": "radicalelation",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "And zippering out of order",
            "score": 318,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 167,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not zippering, but I was trying to merge into the left lane yesterday for a left exit, I had an opening before a line of three cars were going to overtake me. Obviously when I put my signal on the car about twenty feet behind starts speeding up because drivers are children who think you're trying to budge them in line. She proceeded to slowly overtake me, and as soon as she did she merged into my lane and slowed down. There were no card behind me in that lane. I was flabbergasted at the stupidity.",
                            "score": 52,
                            "author": "MedalofHodor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am amazed at how often I get cut off with zero cars behind me. Given I live in a town that has terrible infrastructure and most people end up waiting forever to turn, but seriously, just wait a second and then you don't have to floor it.",
                                    "score": 26,
                                    "author": "ladykiller1020"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Where I live zipper merging isn't a thing. It isn't taught at all. Lane closure a few clicks up? Well, everyone better get in the remaining lane asap because no one will want to let you in.",
                    "score": 105,
                    "author": "manyfingers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah same in Tennessee and Kentucky. We're not taught it in driver's ed and it's not on the tests. Unless they've changed in the last 10 years.",
                            "score": 19,
                            "author": "FaeryLynne",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I lived in Tennessee for a year, and I’m not entirely convinced that they have driver’s ed",
                                    "score": 33,
                                    "author": "dukec",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They think driver's ed is just some guy named Ed who drives a delivery truck",
                                            "score": 11,
                                            "author": "jhooksandpucks"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Kentucky still doesn’t have it as of late last year when I took my test",
                                    "score": 9,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I didn’t get it taught to me either. Michigan, where I'm from, is trying to catch up with this as we speak.",
                            "score": 23,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm in northern Indiana and where I'm from people call the merge lane the \"asshole\" lane and think it is fun to stop people from merging. They all like to line up before a light in the left lane. I've literally seen a line of 30-50 cars in the left lane with an almost completely empty merge lane because people don't want to be assholes. Infuriating, but I'm also not afraid to be the asshole so I actually make a lot of progress on my commute because these people are schmucks.",
                                    "score": 19,
                                    "author": "whoatemypie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I thought this odd phenomenon was unique to the PNW for a long time. Turns out there are morons everywhere 🤷🏼‍♂️",
                                            "score": 11,
                                            "author": "greybeard_arr"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same this is how it works in my state",
                            "score": 7,
                            "author": "zehydra"
                        },
                        {
                            "level": 2,
                            "comment": "It only happens naturally in my town at a few specific merge points during rush hour. Otherwise people have 0 idea how to do it.",
                            "score": 5,
                            "author": "ICKSharpshot68"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Me, on the freeway, almost daily:  'It's like a zipper, people!!!\"  But I'm convinced most people just didn't pay attention in driver's ed.....except for us fine citizens who are commenting, of course!",
                    "score": 8,
                    "author": "jo_Z13"
                },
                {
                    "level": 1,
                    "comment": "Lived in oklahoma for 3 years to go to college and saw this repeatedly. One lane closed on 35 and everyone gets over into the open lane miles BEFORE YOU EVEN SEE THE *FIRST* CONSTRUCTION SIGN, then when you try to pass all the cars to zipper properly, some (usually) old person in a car clearly built in the 60s will slip out of their lane in front of you to block you from passing by going the same speed as the other lane. It's absolutely infuriating. Oklahoma has some of the worst drivers education, imo. My mother learned how to drive in OK bc she was born and raised there and actively insists she is a \"safe driver\" bc she \"has never gotten a ticket in her whole life,\" but every time I'm in her Lexus that smells like her BO, I'm actively scared for mine and others safety on the road. She break checks, she intentionally cuts people of if she feels like they are going too fast, she refuses to drive at or above the speed limit (always tops of just below speed limit and will hit brakes to maintain speed instead of coasting to slow), uses a blinker but hits her breaks before even turning it on. Just to name a few. This is why we need reoccurring driver's ed across someone's entire lifetime, not just once when they were teenagers and say \"you can get from point A to point B? You're good for the rest of your life.\"\n\nEdit: typos",
                    "score": 4,
                    "author": "Natrian8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also never wave a pedestrian ahead at a crossing, you can create eye-contact and let them understand you see them so they make the decision to cross. But there might be other cars that doesn’t understand this and then the pedestrian thinks it’s all clear and doesn’t pay attention.",
            "score": 119,
            "author": "fireblade_",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s called the wave of death",
                    "score": 64,
                    "author": "Icykool77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow, had no idea about that. Just remembered my driving school teacher telling me about it and it made me conscious about how many people do it in the traffic everyday.",
                            "score": 16,
                            "author": "fireblade_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I walk as my main source of transportation, I usually turn around when someone tries to wave me through an intersection. I'm like \"no thank you, rather not get run over.\" I had a woman stop at a green light and then try to wave me through on a red light going my direction. I said \"umm I have a red light\".",
                    "score": 33,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do the same thing, I always feel like a jerk. Not as bad as when I'm on my bike and can't turn around so I just firmly shake my head. Sorry, but just fucking go.",
                            "score": 13,
                            "author": "staciarain"
                        },
                        {
                            "level": 2,
                            "comment": "Yep, that's my go-to. Someone who has right of way tries to let me go? Oh I'm sorry, I'm turned around, I can't see you. Oops, guess you just have to FUCKING GO.",
                            "score": 4,
                            "author": "ClassyEmu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And it’s fucking annoying when you’re not at a stop sign because bro you’re in a CAR you could have passed me before I even think about crossing but now instead we both gotta wait for you to slow down and stop just so you can try and be nice.",
                    "score": 19,
                    "author": "BadgerwithaPickaxe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I came here to say what you said! They think they’re doing you a favor, but when you think about it, if your car is in drive, the safest place for me in the street is behind you, not in front. I’m not anxious to just hand over trust to a stranger at the wheel of a death machine by jumping in front of it.",
                            "score": 11,
                            "author": "ringmaster"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There have been a few times where I'd stop at a three way intersection and the person WITHOUT a stop sign would wave me ahead.\n\nLike bitch, even with my dashcam I'd probably be the one at fault if you decided to ram into me while I did that.",
            "score": 54,
            "author": "StoneHolder28",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used to visit a friend and in his neighborhood, there was a particular intersection with a regular old two-way stop sign where people _on the main road_ would come to a stop to let you in. I don't mean aggressive politeness at a four way stop - I mean coming to a full stop in the middle of a road where you have no signage at all, and the only thing that's happening is that someone's waiting at a side street.  I've never seen people behave this way anywhere else.\n\nDrove me absolutely nuts because I could have gone sooner if they would just maintain speed and go on past me.  And yes, if I just stare in confusion wondering if their car's broken down or something, their \"generosity\" turns into furious rage in about two seconds.",
                    "score": 17,
                    "author": "ghjm",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It helps when everyone actually stops, too.",
            "score": 47,
            "author": "bigredkitten",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's the problem I see most often. How do you know who gets to the stop sign first, if no one else ever fully stops at one?",
                    "score": 15,
                    "author": "aj9811",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love it when you fully stop at a stop sign and people just keep rolling through, perhaps the \"STOP\" part is confusing?",
                            "score": 6,
                            "author": "WorthyTomato",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fair point but also, roundabouts.",
            "score": 698,
            "author": "Leep_Ananab",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where I live there are roundabouts. The most annoying thing is when people, who are IN the roundabout, stop to be courteous and let someone go. \n\nAbsolutely boneheaded cause it’s asking to get rear-ended.",
                    "score": 111,
                    "author": "nta1646",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This caused the only at-fault accident I’ve been involved in. Fuck people that yield while in a roundabout.",
                            "score": 18,
                            "author": "jasonmb17"
                        },
                        {
                            "level": 2,
                            "comment": "I’ve actually been on a roundabout where the person in the roundabout has the stop/yield sign.",
                            "score": 20,
                            "author": "kdevari",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And I get that, but the yield signs are all for the cars heading into the roundabout. They have them set up here for whoever is in the roundabout has the right of way.",
                                    "score": 14,
                                    "author": "nta1646",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah. That’s how roundabouts are supposed to work! But this one was the complete opposite and it was a total mindfuck.",
                                            "score": 11,
                                            "author": "kdevari"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So glad you said this. This was my first thought too. Roundabouts (or inexplicably... according to my google maps when I visit the us... \"turning circles\") are so much better than 4 way stops. \n\nBut then theres the magic roundabouts we have and double roundabouts that will just fuck you up if you dont know what you're doing. Though they are a marvel of traffic management.",
                    "score": 282,
                    "author": "vms-crot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From the northeast US... They are called (typically) either Rotary or Traffic Circle, depending on the size/speed. Smaller ones (like replacing a 4-way stop) are traffic circles, and larger ones at faster speeds are rotaries. Why, I don't know.\n\n\nPeople have called them other things, like roundabouts, but the signs around here only refer to them as that. \n\n\nI've never heard turning circles. Anyone from the US got different names?",
                            "score": 36,
                            "author": "Alfajiri_1776-1453",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I live in California; we call them roundabouts. Also, it's incredibly rare in my experience that I see a four-way, manual-stop intersection where people aren't crushing how efficiently they get through it. I think in my entire driving career, I think I've only seen like one or two people who inappropriately ceded the right of way... makes me think I happened to catch a novice driver who was intimidated by it.",
                                    "score": 10,
                                    "author": "Adabiviak",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "The US invented cars, we can call it what we want /s",
                                    "score": 7,
                                    "author": "MediocrePancakes",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\\&gt; turning circles\n\nI don't know where *you* live, but speaking as an American I can say that I, personally, have literally *never* heard anyone use that phrase.\n\nIt's either \"roundabout\" or \"*traffic* circle\".",
                            "score": 52,
                            "author": "RangerSix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As a New Englander, we also call them rotaries.",
                                    "score": 10,
                                    "author": "BostonDodgeGuy",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Its roundabout.  I only heard turning circle when my google maps was giving me directions when I was visiting PA. \n\nIt's roundabout for me. There's no other name where I'm from.",
                                    "score": 12,
                                    "author": "vms-crot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've gotten \"roundabout\" out of Google Maps, while Waze (and casual conversation with my neighbors) gets me \"traffic circle\".\n\nMaybe \"traffic circle\" is an MHV thing.",
                                            "score": 7,
                                            "author": "RangerSix",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Could be. I know it made me laugh when I heard it though. Hopefully they just end up calling them all roundabouts in the end.\n\nCould also be because my google maps is very English compared to the US one so might be a localisation thing.",
                                                    "score": 6,
                                                    "author": "vms-crot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Eh, as long as the term makes sense and isn't too ridiculously contrived, the name doesn't matter all that much to me.\n\n...that being said, *turning* circle seems rather contrived to me. Could be a localization issue, could be weird terminology derived from bureaucrats (\"it's a *circle*, and people *turn* on it, so let's call it a turning circle!\").",
                                                            "score": 4,
                                                            "author": "RangerSix",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don't know why it didn't use my native terminology. Every one here is \"at the roundabout turn...\" I think that's why it stuck out so badly. It just seemed, as you say, contrived.",
                                                                    "score": 3,
                                                                    "author": "vms-crot"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A few years i lived in a town where we has the “Magic Roundabout” looks like hell when you google it but it wasnt too bad (sometimes)!!!",
                            "score": 57,
                            "author": "DiamondFringe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The one in Swindon ? It looks mental but pretty simple to drive around as long as there is some common sense involved. I can't imagine what the congestion would be like if it were to have traffic lights at that junction instead.",
                                    "score": 31,
                                    "author": "intergalacticscooter",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Go Swindon",
                                            "score": 9,
                                            "author": "agitatedbeee"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; as long as there is some common sense involved\n\nah, that's the US out then",
                                            "score": 16,
                                            "author": "GroovingPict",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I've not driven there but we have a few doubles and they'll catch you out if you arent paying attention. Saw a video on the magic roundabout. It all makes sense if you just realise a roundabout is a one way road that has multiple give ways in order to join it. Then it's just like any other junction.",
                                    "score": 21,
                                    "author": "vms-crot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly!!! Laser focus on your lane ..... although one time i did witness a pensioner on his bike cycle through the middle of it. God i was envious!!!!",
                                            "score": 9,
                                            "author": "DiamondFringe"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Tom Scott has a video for that.\n\nhttps://youtu.be/D22BOOGbpFM",
                                    "score": 8,
                                    "author": "JimmyMinch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tom Scott has a video for every comment section - I am convinced of this fact.",
                                            "score": 5,
                                            "author": "EngineersAnon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"Relevant Tom Scott video\" is becoming the new \"relevant XKCD\"",
                                                    "score": 5,
                                                    "author": "Bandit_the_Kitty",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I get mad at people here in Pennsylvania for not knowing how to use the 2 one lane roundabouts in our area, but looking at a picture of the Magic Roundabout gives me anxiety.",
                                    "score": 4,
                                    "author": "High_Flyers17",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My friend was hit last weekend bc this lady thought that my friend who was in the roundabout was supposed to yield to her entering the roundabout.\nLike she started yelling at my friend telling her that there's a yield sign, my friend was like yeah it's for you",
                                            "score": 5,
                                            "author": "chazthespaz81",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The great thing about that is you can turn in circles until you figure out where you should be going",
                            "score": 10,
                            "author": "Northernlighter",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Unless you live in a mediumish sized American town where nobody knows how to use roundabouts.\n\n\nIt's extremely common for cars to yield at the entrance when they don't need to, and occasionally you get the dumbass who stops *in the middle of the roundabout* to wave someone through...",
                            "score": 16,
                            "author": "Certified_GSD",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "YES. I swear that's literally my biggest pet peeve about roundabouts. They're lovely inventions, but I've had people in the roundabout stop dead to try to let me in and I'm just screaming internally \"NO YOU GODDAMN IDIOT, YOU'RE FUCKING UP TRAFFIC.\" And then if someone behind me sees that, and I don't go, suddenly they honk at me because suuuuure *I'm* the asshole in this situation.",
                                    "score": 7,
                                    "author": "TheMidwestJess",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "At least they are in theory, but people can't drive through them properly to save their lives",
                            "score": 3,
                            "author": "Escenze",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I once had someone stop in the middle of a rotary (roundabout) to let me in\n\nI was angry for exactly the reason OP is.",
                    "score": 15,
                    "author": "tosety",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Roundabouts are great. Love me some roundabouts. Happy to replace most 4-ways with roundabouts.\n\nUntil that happy day, TAKE YOUR FUCKING RIGHT OF WAY.\n\nNot you personally. I am sure that you personally are a prince(ss) of a driver.",
                    "score": 22,
                    "author": "coloradoconvict",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "roundabouts are great, the problem is that most people are idiots and do not know how to use them",
                    "score": 23,
                    "author": "boborg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In UK there are lots of roundabouts and everyone knows how to use them. I know there aren't many in US. I think you need a \"critical roundabout mass\" where people know who to use them properly to reach the roundabout utopia.",
                            "score": 13,
                            "author": "rainbowWar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Might as well convert to metric while they're at it.",
                                    "score": 6,
                                    "author": "nicholt"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In the US, I wish folks yielded at roundabouts. Instead, drivers go gangbuster right into the roundabout with complete disregard for the traffic already traveling in the roundabout.",
                    "score": 7,
                    "author": "aspapu"
                },
                {
                    "level": 1,
                    "comment": "OMG, where I live whoever is already in the roundabouts has priority.. Except this one roundabout near where I went to college. It has a sign stating whoever is in the main avenue has priority. It's so darn confusing. We have no vision in the roundabout of who is coming and have to miraculously figure out when a car is near. It is terribly dangerous too.",
                    "score": 6,
                    "author": "watashinomori",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah that seems like whoever put it there did not give a damn. They can usually be very efficient at moving traffic.",
                            "score": 3,
                            "author": "Leep_Ananab",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was once yielding to a car driving through a roundabout, and the lady in the car literally stopped in the middle of the road and waved me on. some people...",
                    "score": 7,
                    "author": "porungas"
                },
                {
                    "level": 1,
                    "comment": "As a motorcyclist, roundabouts are always preferred because of the continues flow in traffic and I rarely need to put my foot down to stop. I also feel safer and less likely to be rear-ended. Stopping at a traffic light could make me wait 5-10min because the sensors don't always register motorbikes.",
                    "score": 5,
                    "author": "MiIIan"
                },
                {
                    "level": 1,
                    "comment": "There's a roundabout at the exit of my neighborhood. In the three years I have lived here, 7 people have nearly hit me going the wrong way because it's \"faster to exit\". They're always older. \n\nBoomers are so fucking dumb...",
                    "score": 5,
                    "author": "AndreTheShadow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A couple of years ago, the first 2 roundabouts in my town had just opened. I was walking my dogs close by. Saw a car slowly approach, lots of traffic bunched up behind it already. Traffic from other exits were already going around anti-clockwise (the correct way in the USA) and thus this white haired person had multiple examples of using the roundabout correctly. They stopped for a while (maybe 60s?) and then slowly turned sharp left to go the wrong way around then another sharp left to exit. So many people stopped and shouting at them, but they ignored them all and went their way.",
                            "score": 4,
                            "author": "vale_fallacia"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Roundabouts are fine, until the people in charge got the brilliant idea to add lights at roundabouts.",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lights on roundabouts help them deal with higher traffic levels, but in most cases they should be part time.",
                            "score": 5,
                            "author": "dpash"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The issue is that states have different laws. In some you’re supposed to yield on the round about",
                    "score": 4,
                    "author": "Strosity",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’ve had people stop IN a roundabout to let me in.  2 or 3 different occasions",
                    "score": 3,
                    "author": "issius",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "People where I live thinks they are stop signs... even more annoying than being polite at a stop sign.",
                    "score": 3,
                    "author": "Northernlighter",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree. People think they are performing a kind gesture by waving others through,  but all they are doing is creating ambiguity and confusion.  Let's just all go when it's our turn to go!",
            "score": 148,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same deal when someone slows to let a pedestrian cross at a light even when they have a green. Easily leads to hesitation/confusion and can be dangerous",
                    "score": 66,
                    "author": "ginzykinz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, the driver doesn't control every lane of traffic and has no right to instruct someone to cross against the light. So often drivers do this to me and get frustrated that I won't cross or drive in front of them, when in reality they are blocking my view of other traffic when they stop in this way. Just mind you business and I will go when I am ready!",
                            "score": 43,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This is literally what killed my sister. The driver in the second lane didn’t stop. I teach my children to NEVER let someone “wave” you in when it’s not your turn. It’s called the wave of death for a reason.",
                            "score": 37,
                            "author": "Sudo_Nymn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm sorry for your loss.",
                                    "score": 12,
                                    "author": "CupcakeGoat"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Came here to say this exact thing! I absolutely hate when someone defies traffic laws to let me cross as a pedestrian. I wasn’t prepared to cross, now I’m anxious because I don’t feel I safely checked all my avenues before crossing, but it’s also dangerous if I wave back for them to go and we get into a waving war while this person is stopped in the middle of a street at a green light! I will never understand this behavior!",
                            "score": 14,
                            "author": "sheenonthescene",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just don’t go, I will stay fixed where I am - it’s not for them to make the decision whether it’s safe for me. (In our area it’s bloody awful driving - people significantly speeding in residential areas - so I’m not going if I don’t think it’s safe to!\n\nThey’re in a car, I’m a squishy human walking along",
                                    "score": 12,
                                    "author": "timeinvariant",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "YES. Be predictable people.",
                    "score": 10,
                    "author": "3randy3lue"
                },
                {
                    "level": 1,
                    "comment": "The worst are those that are stopped in on coming traffic to allow those to take a left hand turn at a green yield after the light turns.  \n\nI don't know if they are trying to let me turn, or if they are just not paying attention to their light turning green.",
                    "score": 4,
                    "author": "spekt50"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ya know what else drives me crazy?  \n\nWhen I am a pedestrian and I stop and look both ways to see if the road is clear and people randomly stop their car in the middle of the road and wave for me to go in front of them.\n\nNah.  I’m not going to walk in front of a 2 ton vehicle operated by someone who, rather than follow the rules of the road, does totally unpredictable things.",
            "score": 41,
            "author": "Gravybone",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't get such thing at. all. Like, it'll take the driver like 2 seconds to pass by me.\n\nSo instead of me just waiting those extra seconds, he stops in the middle of a road, cars may pass by him that I can't see, it'll take a heavy vehicle a long time to start back up, and I now have make a decision to either have the driver be pissed I'm still waiting, or hurriedly go in front of him.",
                    "score": 16,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s another big part of it.  It absolutely takes longer for them to slow down enough to stop than it would have for them to just drive by.\n\nIt’s a real irrational pet peeve of mine.  I know that they’re trying to be nice so I shouldn’t be so angry, but it really drives me crazy.",
                            "score": 6,
                            "author": "Gravybone",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot of people when they arrive simultaneously don't know about the \"person to the right\" rule so it's kind of just seeing who gets bored first I guess. Doesn't tend to matter much at most 4 ways.",
            "score": 64,
            "author": "1Freezer1",
            "replies": [
                {
                    "level": 1,
                    "comment": "What happens when four cars from each direction arrive simultaneously at a four way stop?  Or two cars arrive at directly opposite directions simultaneously?  It gets more complicated than that rule.",
                    "score": 19,
                    "author": "NobodyImportant13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In such situations, the God of Traffic appears in the middle of the intersection and the first driver to get out and pray to His Asphaltiness gets to go first",
                            "score": 30,
                            "author": "Password_Is_hunter3",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "When directly opposite and simultaneous, there is only conflict if one person is turning left and the other isn't. In that case, the usual rules for left turning vehicles yielding apply.\n\nFour four way, the coolest car goes first. Actually there are no rules since it's rare, so you just have to figure it out. You can start to go slowly, but be prepared to yield if someone else also goes.",
                            "score": 7,
                            "author": "GetsGold"
                        },
                        {
                            "level": 2,
                            "comment": "if two or four cars meet at the same time right of way is determined by the the direction your turning, Its straight over right, right over left. This will sort out most situations. In reality someone just needs to just go and set an order",
                            "score": 10,
                            "author": "HellMuttz",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can slightly forgive them for not knowing, by comparison to the other crimes they could be committing. It isn't intuitively obvious, it's not signposted, and if you miss that day in driver's ed, or don't have driver's ed, you might not pick it up later. It's a relatively minor glitch, and that IS a scenario where \"oh, you go ahead\" isn't going to hurt anybody, as long as those are the only two idiots at the intersection.",
                    "score": 16,
                    "author": "coloradoconvict",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I'll be honest even I forget about it sometimes. I don't live in a massive city or anything so traffic flow on streets with 4 ways isn't much of an issue. I will say tho sometimes I'll see another car stop like noticeably way before me and then they still wait for me to go. People be crazy",
                            "score": 10,
                            "author": "1Freezer1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'll double down and wait lol",
                                    "score": 8,
                                    "author": "WhiteHairedWidow",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I don't forgive anyone for taking control of a killing machine without knowing all of the rules and regulations involved",
                            "score": 5,
                            "author": "Chamoore13"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I moved to a state where people will stop in the flow of traffic to let someone go.  Like if they are driving along a straightaway and see someone trying to turn into traffic, they will stop and let the person in.  The first time it happened I literally almost died.  \n\nThe other thing that happens is if they yield their right of way but the other driver doesn’t see them waving or yielding, they get so pissed!  It’s like, I’m sorry I thought I had 1.4 seconds to gather my thoughts sorry I didn’t see you disrupting the flow of traffic trying to be nice and then dr jekylling into an irate lunatic.",
            "score": 41,
            "author": "uniquefuckinusername",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, exactly this. This is how you can tell it's a dominance game rather than actual niceness.",
                    "score": 7,
                    "author": "ghjm"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you so much I HATE it when people do this",
            "score": 48,
            "author": "epickittylover"
        },
        {
            "level": 0,
            "comment": "This drives me crazy. I was an operations manager for FedEx for 11 years and now I live on Maui. Without thinking I practice rigid adherence to every traffic law and now I'm surrounded by people doing this all the time in the name of Aloha. I get it, you're a good, kind person who wants to pay it forward, but I see near misses all the time when someone gets waved right into a oncoming traffic. Don't come crying to me when you want to blame the person that waved you on for the accident. That shits 100% your fault",
            "score": 20,
            "author": "dk_jr",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The town next to mine seems to have a problem with its residents doing this. It’s absolutely infuriating. I’m at a point where I sit and ignore the wave. It’s amazing how long some folks will sit and continue to try and get you to go through first. I don’t understand.",
            "score": 11,
            "author": "PolkaDotMe",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do this too. If I've made eye contact, i just shake my head and keep waiting.",
                    "score": 7,
                    "author": "chicky-nugnug"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My goodness yes. I want a bumper sticker that says: “save a life: don’t be a nice driver, be a predictable driver”",
            "score": 9,
            "author": "Sudo_Nymn"
        },
        {
            "level": 0,
            "comment": "I live in the Seattle area, where the Four-way Blunderfuck is a local pastime: Four cars stopped at an intersection, each furiously waving each others across. Invariably, someone gets pissed enough to seize the moment and go, only to discover that someone else has the same idea. Now they're stopped in the middle of the intersection to avoid collision, still trying to motion the other across. But now the waving has evolved into pointing and shouting, with an obligatory F-bomb and pointing at one's head.\n\nThing is, people here aren't at all nice to begin with, so I don't know where this pretense of civility comes from.",
            "score": 10,
            "author": "Mr_Ghost_Goes_2_Town",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Right of way is not your right to give away.",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Try living in Canada where basically everyone is nice and it happens at almost every intersection.",
            "score": 6,
            "author": "charles879",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I almost got in an accident two days ago because some fucking numpty kept waving for me to go when it was their turn. It confused the hell out of this poor old guy on the opposite side as me and he started turning into my lane just after I started driving.\n\nDon’t drive politely. Drive correctly.",
            "score": 7,
            "author": "CrakAndJaxter"
        },
        {
            "level": 0,
            "comment": "Oh my God this is so frustrating. Just fucking go! Half the time if I come to a stop sign wanting to turn left at the same time as someone going straight, I won't turn on my blinker so that they'll take the right of way. Too many times they wave me to go. No, you go!",
            "score": 6,
            "author": "Wrights66",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Agreed. Also, I feel like a lot of drivers aren’t aware of the order of which cars should go at a multiple-way stop. I’ve had times where it would be my turn to go, given who stopped first, and the person that thought they had the right to go would honk at me or I would see them gesturing their arms in the air from my rear view mirror. Not a lot of competent drivers out there..",
            "score": 5,
            "author": "retrobubbz"
        },
        {
            "level": 0,
            "comment": "This is dumb and why people get into accidents. Right of way is a thing. I see way too many morons making lefts when they shouldn’t be.",
            "score": 4,
            "author": "Don_Cheech"
        },
        {
            "level": 0,
            "comment": "Also that thing when you’re patiently waiting for traffic to die down so you can walk across a 2-lane road where there is no crosswalk...and a driver stops to wave you across, but the other lane has traffic wizzing by. 😡",
            "score": 5,
            "author": "HereComesRex",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, fucking deadly. I wrote a YSK about it https://www.reddit.com/r/YouShouldKnow/comments/j0b8x4/ysk_stopping_in_the_middle_of_the_road_to_let_a/",
                    "score": 3,
                    "author": "opgary"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This kind of goes for any time you are \"nice\" on the road. Letting people cut in, letting people get out into traffic, letting people go at a light, etc., whenever you are stopped when you are supposed to go you are disrupting the traffic flow.",
            "score": 4,
            "author": "theknewnorml",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thank you! It always astounds me how many people try to wave you through. Like no, I'd rather obey the law. If there's an accident and you say you proceeded without the right of way because that guy told you to it's not going to look good on anyone",
            "score": 4,
            "author": "madems"
        },
        {
            "level": 0,
            "comment": "This includes emergency vehicles that do not have their lights or sirens on. I’m paramedic and this happens all the time. People try to give me right of way at the most bizarre times when not driving with my warning systems on. \n\nYou aren’t being nice, you’re just the confusing the fuck out of me while I’m trying to get a morning coffee.",
            "score": 4,
            "author": "phoenix25",
            "replies": []
        },
        {
            "level": 0,
            "comment": "For the love of god, don’t stop in a traffic circle to let people in",
            "score": 4,
            "author": "giraffe_engineer"
        },
        {
            "level": 0,
            "comment": "Or people that think they are being safe or helpful by stopping and waving me across when I'm walking. If you would just keep driving like you're supposed to it would be a lot faster for both of us. And then they try to say its safer when its not. Like I'd much rather be behind or to the side of your moving 2 ton death machine than in front of it even if it is stopped. Stopped is not off or in even in park.",
            "score": 4,
            "author": "lllll00s9dfdojkjjfjf",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This only works if everyone at the stop knows how right-of-way works.\n\nHere in South Florida stop signs and lines are apparently optional.",
            "score": 5,
            "author": "ADrenalineDiet"
        },
        {
            "level": 0,
            "comment": "YSK that four way stops are the most stupid way to control traffic.\n\nput in a roundabout you melons!",
            "score": 3,
            "author": "trollslapper"
        },
        {
            "level": 0,
            "comment": "God damn I feel like I’m the only person who understands this. The mother fucker stops FIRST, so I wait, and he looks at me like I’m stupid.",
            "score": 5,
            "author": "CountBarbatos"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don’t care. Where I live, people roll into the stop and then immediately speed up-even when they obviously don’t have the right of way. I’d rather let someone who is giving me signs that they’re going to break the law to get in front of me go before me instead of mad maxing it in a shopping center",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’ve lived in the US for nearly four years, the four way stop is a terrible system and you all need to learn to love roundabouts",
            "score": 4,
            "author": "Owz182",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The “RIGHT” rule fails when two cars arrive simultaneously on opposite sides of at least a two way stop or when four cars arrive simultaneously at a four way stop.",
            "score": 18,
            "author": "OneMeterWonder",
            "replies": [
                {
                    "level": 1,
                    "comment": "2-car case: If you're both going straight, there is no conflict; proceed cautiously simultaneously. If one of you is turning, and the other is not, and the turn crosses the line of traffic, the non-turner has right of way. (If the turn does not cross, again, cautiously proceed.) If both of you are turning left, you theoretically could both go but it's better to make eye contact and have one of you yield.\n\n4-car case: Einstein demonstrated conclusively that in a cosmos consisting of a space-time continuum, the concept of simultaneity is basically rubbish and no two events can occur at the same time. So certainly no FOUR events could EVER occur at the same time, even allowing for slop and approximation. Therefore, this case never occurs and I don't have to solve it.",
                    "score": 27,
                    "author": "coloradoconvict",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember asking my father about 4 cars arriving simultaneously when I was learning to drive, and he it's practically impossible but then you all have to just work it out.",
                            "score": 5,
                            "author": "Callinon",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had the same question but was able to find a [decent answer](https://911drivingschool.com/the-four-golden-rules-of-four-way-stops/)",
                    "score": 5,
                    "author": "b_mco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Really the one single rule that beats all of these is proper communication and an understanding of driving behavior. Tell other people as clearly as you can what you intend to do and make your actions as defensive as possible within the confines of the established rules.",
                            "score": 6,
                            "author": "OneMeterWonder"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Outnicing (v.)- when 2 dorks arrive at an intersection simultaneously and insist that the other go first, causing road rage in the drivers around them.\nUsage- \"STOP OUTNICING EACH OTHER AND GET THE HELL OUT OF THE WAY!\"",
            "score": 6,
            "author": "jsmith69nh",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have shouted \"Take your fucking right-of-way\" at more than one person.\n\nPer day.",
                    "score": 5,
                    "author": "coloradoconvict",
                    "replies": []
                }
            ]
        }
    ]
}