{
    "id": "13rtxcu",
    "score": 15,
    "title": "What do those who graduated with a degree in Crim, sociology and/or psychology doing now?",
    "author": "BlackRoses64",
    "date": 1685050069.0,
    "url": "https://www.reddit.com/r/CarletonU/comments/13rtxcu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just curious what Carleton alums (or even current grads) with their criminology, sociology and/or psychology degrees are doing now career wise?",
    "comments": [
        {
            "level": 0,
            "comment": "Did an HBASc in Crim and a BA in Psych (not from Carleton), then completed Carleton’s MPPA and got a research job. \n\n10/10, would recommend",
            "score": 11,
            "author": "Faveri",
            "replies": [
                {
                    "level": 1,
                    "comment": "What do you like most about your job?",
                    "score": 1,
                    "author": "AwkwardLadybug",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1. The freedom to read and write about what I find fascinating\n2. Guiding new people through the research process while watching them discover what they find fascinating.",
                            "score": 2,
                            "author": "Faveri"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My boyfriend got his psych degree last year and then went to Algonquin College for a graduate diploma in HR Management. He just started his first HR position last week. It is a 6 month contract and what I noticed is that, compared to my field, a lot more of the “entry level” positions in his field asked for 2+ years of experience.",
            "score": 9,
            "author": "Relentless_Scurvy"
        },
        {
            "level": 0,
            "comment": "Graduated with a BA in Psych a year ago. I’m currently getting my Master’s and working for the government, likely applying for PhD programs to start Fall 2024 or 2025.",
            "score": 7,
            "author": "casually_cabbage"
        },
        {
            "level": 0,
            "comment": "Did my BA (hons) and MA at Carleton. Currently on a work year and I’m a lab manager at Carleton and a researcher at CBSA in the government. I will be starting a PhD in clinical psychology in the fall outside Ontario with the intention of working primarily as a clinician and perhaps a bit of research or contract teaching on the side.",
            "score": 5,
            "author": "psychgirl59"
        },
        {
            "level": 0,
            "comment": "I graduated with a BAH in sociology with co-op last June and I am currently a policy analyst for the government.",
            "score": 3,
            "author": "MammothTumbleweed"
        },
        {
            "level": 0,
            "comment": "I think BA students shouldn't sell themselves short, working in the tech industry for 5+ yrs now has already taught me that most of the people I work with aren't even that smart.\n\nThe ones that actually move up in the company and advance are the ones that have more soft skills then hard skills and know how to play the game.\n\nI think a BA student from crim, sociology or Psychology will acquire much better soft skills then the other majors. If a BA grad has learned how to play the game, read people, know what they want and deliver exactly what someone wants I think they have a really good advantage here.",
            "score": 4,
            "author": "dariusCubed"
        },
        {
            "level": 0,
            "comment": "Got a BA in psych, now doing a PhD in neuro. Hope to pursue a career in research and development.",
            "score": 3,
            "author": "CatsWearPants"
        },
        {
            "level": 0,
            "comment": "Graduated with BA in Psych and was getting ready to prep for grad school but ended up taking a break and decided to work in the Cannabis industry",
            "score": 3,
            "author": "bunnyclub97"
        },
        {
            "level": 0,
            "comment": "Did my BA in Psych. I’m an education assistant.",
            "score": 3,
            "author": "StellaEtoile1"
        },
        {
            "level": 0,
            "comment": "4th year crim here and already got a job in law enforcement. It was through FSWEP where crim was listed as the “preferred” degree 😄",
            "score": 3,
            "author": "H410m45t3r"
        },
        {
            "level": 0,
            "comment": "Crim grad - doing my MHA currently and working in an administrative role at the hospital.",
            "score": 2,
            "author": "gcjager"
        },
        {
            "level": 0,
            "comment": "about to start a clinical psych program at uoft after graduating from psych at CU",
            "score": 2,
            "author": "msgurllllll"
        },
        {
            "level": 0,
            "comment": "Hi there! I graduated with my BA in crim at Carleton last year. I’m making $26 as a housing based case manager right now at a homeless shelter and I’m starting my master’s in September in crim again. My end goal is to become a tenured professor.",
            "score": 2,
            "author": "Cunanan13"
        },
        {
            "level": 0,
            "comment": "did my BA in crim, finished in Feb - working in a law firm in the accounting department",
            "score": 2,
            "author": "Upstairs-Fox917"
        },
        {
            "level": 0,
            "comment": "BA in Law &amp; Legal Studies. Just finished law school, studying for the bar.",
            "score": 1,
            "author": "brownemil",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey do you mind if I pm and ask you a coupon questions?",
                    "score": 1,
                    "author": "BlackRoses64",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure!",
                            "score": 1,
                            "author": "brownemil"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crim grad (2007). I worked for CSC for a few years, went back to school for a master’s, now I have my dream job in research.",
            "score": 1,
            "author": "dianacarmel"
        }
    ]
}