{
    "id": "13u4d5l",
    "score": 3,
    "title": "Engineering course selection questions",
    "author": "MatchConsistent",
    "date": 1685290761.0,
    "url": "https://www.reddit.com/r/CarletonU/comments/13u4d5l",
    "media_urls": [],
    "other_urls": [],
    "postText": "Are the courses for 1st-year aerospace eng short? like what's up with them only being 0.25 credits? Does that leave me time for the (I'm assuming standard length) mandatory electives? also, is this in anyways related to the early-late-full semester thing? I'm loaded with questions lol so thx in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "The 0.25 means it’s a half semester course (so a pair is equivalent to one full course, although you might have to do an exam for each 0.25 course). You’ll notice that you have 4 0.25 courses each semester, you’ll do 2 in the first half of the semester and then the other 2 in the second half. \n\nUsually the pairs complement each other, for example ECOR1041 and 1042 both deal with programming. \n\nWith that in mind, you’re likely looking at something equivalent to 5 courses per semester in first year which should leave time for the elective.",
            "score": 5,
            "author": "Losthero_12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Another thing... the [elective](https://carleton.ca/engineering-design/current-students/undergrad-academic-support/electives-for-beng-programs/) list is still for summer 2023 do you know when they are going to be updated? do they change much from year/semester to year/semester?",
                    "score": 1,
                    "author": "MatchConsistent",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure when it’ll be updated, likely before registration starts (end of June) though.\n\nThey don’t change much between terms; most of [these](https://carleton.ca/engineering-design/wp-content/uploads/FW_CSE_Aug9.pdf) courses should be eligible",
                            "score": 2,
                            "author": "Losthero_12"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yea so it being 0.25 credits is basically it being a quadmester. So you do everything in 2 months and have a final and mid term as well for some of the courses.",
            "score": 3,
            "author": "adamchazamYT"
        }
    ]
}