{
    "id": "j3ujb2",
    "score": 299,
    "title": "Can't wait to hear what they have to say",
    "author": "Tuddless",
    "date": 1601645605.0,
    "url": "https://www.reddit.com/r/CarletonU/comments/j3ujb2",
    "media_urls": [
        "https://i.redd.it/doh66dg6poq51.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Now increase the tuition so we can afford more spoons",
            "score": 69,
            "author": "Is_It_Me_or_Not",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or forks. The caf kept running out of them back when I was in res.",
                    "score": 13,
                    "author": "Sonoda_Kotori",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They’re now plastic LOL",
                            "score": 5,
                            "author": "trexjj2000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "either the k in karleton kwality is gone or they did it bcs of covid.",
                                    "score": 4,
                                    "author": "Sonoda_Kotori"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In Business - grades have been significantly higher since covid started. I think it's a mix of sympathy marking, open book tests/exams, and students cheating. I made my exams open book so that honest students aren't disadvantaged to students who want to cheat. The marks are obviously much higher. The problem is that we have marking guidelines and can't submit a class with all A's...",
            "score": 33,
            "author": "BulletproofCPA",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thiiiiiiis. Grading has been extremely compassionate, and a lot of courses are now assignment based with group work instead of closed book exams.",
                    "score": 19,
                    "author": "whiteduchess"
                },
                {
                    "level": 1,
                    "comment": "I never understood this, why is it bad to submit a class with all A's? Like what is the impact of this?",
                    "score": 8,
                    "author": "robby105",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 22,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Interesting, never fully understood that. Thank you for sharing!",
                                    "score": 8,
                                    "author": "robby105"
                                },
                                {
                                    "level": 3,
                                    "comment": "Just to mention it, things are different between the various faculties. I’m in the faculty of science, and there is no official target (or no one has ever told me about a target). But the marks could still be sent back by the dean if they’re too high or too low.",
                                    "score": 3,
                                    "author": "math_brandon"
                                },
                                {
                                    "level": 3,
                                    "comment": "I wonder if this attitude is a bit \"old school\"? Is the real goal of assessment to separate/rank the students? Maybe that's one reason, but there are others (e.g. see http://www.ascd.org/publications/books/100053/chapters/What-Are-Grades-For%C2%A2.aspx). In at least some other faculties there are no target distributions or averages. Grades might get sent back for review if there are, for example, an abnormally high failure rate.",
                                    "score": 7,
                                    "author": "hank3789"
                                },
                                {
                                    "level": 3,
                                    "comment": "Wait, so students can risk getting their grades pigeonholed out of an A+ because of.....politics?\n\nPardon my  *je ne sais quoi*, but that's \\*\\*\\*\\*ing bull\\*\\*\\*\\*. Not every sample of students, i.e., a class, is going to fall into a normal distribution. For goodness' sake, you're all supposed to be scholars. Trying to fudge your numbers so the data looks good is shameful and it hurts students. Scholarships are gained and lost on fractions of a percent. Shame on the deans for pressuring you like this and shame on any teacher for folding and submitting to it.\n\nToo many people get A's? Maybe it was a good batch of students! Imagine that! When it starts happening more frequently than should be expected tell the dean to make the course harder in the future. Don't screw the current students. What the hell.\n\n\"Excuse me, professor, why did I lose marks here?\"\n\n\"Because of grade quotas. Sorry, you can't have an A, but I have plenty of space for B's so I'll give you one of those instead.\"",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Having difficulty reading the red font",
            "score": 32,
            "author": "Raven0821",
            "replies": [
                {
                    "level": 1,
                    "comment": "First picture reads: “Did we fail at online learning?”\nSecond picture reads: “No, it’s the students they just couldn’t handle it.”\n\nHope that helps! 😊",
                    "score": 38,
                    "author": "tayleafs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Quick little tip.  White font with black outline is readable on every color background",
            "score": 11,
            "author": "Lychosand"
        },
        {
            "level": 0,
            "comment": "That’s why they’re allowing UNS, I guess",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait are they ? Do you have a source ?",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sure I read in a past e-mail but tbh I don’t remember exactly. I a grad student so I don’t pay a lot of attention to that. If I was an undergrad I’d be pushing CUSA to fight for SAT/UNS instead of using their time to produce merchandise",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "CUSA, CASG, and other student groups are currently trying to allow each student to pick one course to mark as SAT/UNS",
                                    "score": 2,
                                    "author": "incoexists"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It was part of the president’s address that was sent to every student.",
                            "score": 2,
                            "author": "whiteduchess",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are right. Just found it. And my apologies, it hasn’t been decided yet.\n\n“As one possible additional measure to support students through this difficult time, Senate is considering the implementation of compassionate grading practices, for example having “F” grades converted to “UNS,” meaning unsatisfactory, to mitigate the negative impact on grade point averages. A final decision will be made later in the fall.”",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}