{
    "id": "13y8x26",
    "score": 1,
    "title": "Guys, I have been hearing terms like experimental questions, fifth section. What are these? Will there be experimental questions in each module and do they appear at the very end? How they affect marking?",
    "author": "stardust_nur",
    "date": 1685701707.0,
    "url": "https://www.reddit.com/r/Sat/comments/13y8x26",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "In the digital test, there are two unscored questions in each module. You won't be able to distinguish them from the scored questions.",
            "score": 3,
            "author": "Guidancenyc",
            "replies": [
                {
                    "level": 1,
                    "comment": "So if you manage to get these 2 wrong, you would still get a full mark?",
                    "score": 1,
                    "author": "MohaJLifts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your performance on the unscored questions has no effect on your score, but since you can't tell which questions are unscored, you should treat every question as though it is scored.",
                            "score": 4,
                            "author": "Guidancenyc"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some paper based test takers may see a fifth section that contains experimental questions. Don't worry too much and treat it however you feel like at that point.",
            "score": 3,
            "author": "prsehgal"
        },
        {
            "level": 0,
            "comment": "Reminder: When asking for help with questions from tests or books, please include the source of the question in the post title. Examples of appropriate titles might include \"Help with writing question from April 2017 QAS\" or \"Help with question from Erica Meltzer's grammar book.\" **Posts that do not adhere to this rule are subject to removal.** For more information, please see rule #7 in the sidebar.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Sat) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "My suggestion is to just take the test, answer the questions, and don’t worry about.",
            "score": 1,
            "author": "RichInPitt"
        }
    ]
}