{
    "id": "13yevbl",
    "score": 9,
    "title": "My SAT score is actually pitiful. How much will it affect my chances + Apply test optional.",
    "author": "Illustrious-Band6900",
    "date": 1685717484.0,
    "url": "https://www.reddit.com/r/Sat/comments/13yevbl",
    "media_urls": [],
    "other_urls": [],
    "postText": "My SAT score is 940, my math section was crazy low around 300 something…. And I studied for MONTHS on the Khan Academy official practice and still failed it. I won’t take it again just to fail, it would be a waste of time for me. I didn’t even reach the thousands. This was a while ago but I still cannot believe how slow I am it’s so crazy. I have made the honor roll a few times and get good grades but damn. I’ve passed Algebra 1 and 2 with A’s and Geometry with a B. Even in elementary school I was below average or barely making it on standardized tests. Is there a reason behind this, maybe there is something wrong with me or if I’m just a little dumb lol? I can’t sit for that long and read/do all of that in the time limit. If anyone has had a similar experience plss offer wisdom, maybe there is something in my head preventing me from doing decently??? Pls don’t judge y’all are so smart for no reason haha",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "actually a lot of my classmates say that I seem like I have adhd (definitely not an actual diagnosis of course) and I talked to my counselor a bit before the test and she said there was nothing she could do because it was too late. i have also talked to my parents about it but unfortunately, they don’t believe in that kind of thing (they are immigrants and like mental health and stuff like that is bs) and I’m scared it will hinder my academic ability once I reach college",
                    "score": 2,
                    "author": "Illustrious-Band6900",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Once you’re in college and more independent I’d recommend seeing a psychiatrist and getting a diagnosis. I have adhd and getting proper accommodations has helped me so much with school",
                            "score": 1,
                            "author": "Camillee1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey if it makes you feel any better I got a 870 on my first try , I also have ADD and sometimes that gets in the way of focusing but try to see if there’s anything distracting you or making you lose focus. And also remember you can retake it as much as you want",
            "score": 2,
            "author": "Dapper-Ad8945"
        },
        {
            "level": 0,
            "comment": "I can tutor you in math, I really don’t believe that anyone is innately limited to excel at the math section—-it just takes long amounts of exposure and practice.",
            "score": 1,
            "author": "Asleep_Job3691",
            "replies": [
                {
                    "level": 1,
                    "comment": "nvm I just saw that u said u weren’t gonna take it again: still, there’s a reason the SAT quizzes on that mathematical knowledges: you need to have a strong foundation in algebra to handle college math. So, it may still be in ur benefit to truly learn the math concepts.",
                    "score": 1,
                    "author": "Asleep_Job3691"
                },
                {
                    "level": 1,
                    "comment": "tutor me lol(plz)",
                    "score": 1,
                    "author": "Impossible-Sun107"
                }
            ]
        }
    ]
}