{
    "id": "13yrjut",
    "score": 3,
    "title": "march 2022 writing question",
    "author": "Objective-Top-3444",
    "date": 1685744616.0,
    "url": "https://www.reddit.com/r/Sat/comments/13yrjut",
    "media_urls": [],
    "other_urls": [],
    "postText": "can someone explain why 39 is D?",
    "comments": [
        {
            "level": 0,
            "comment": "D seems to match the tone of the passage the best, usually for these questions the most formal one is right",
            "score": 4,
            "author": "GeographyGeek01"
        },
        {
            "level": 0,
            "comment": "yeah I remember missing this one too.\n\nI initially thought \"didn't look like\" and \"aesthetically\" were redundant and therefore incorrect but ig collegeboard doesn't see it that way\n\nThe issue is the passage was talking moreso about how the two ships don't fit together and not how different they look. Two ships can look very different and still be able to fit. Lets say for example we got two futuristic style boats who look to be made in the same era, but one is colored red and one is blue. There would be no issue putting both of them in star wars, even tho they look very different. Lets assume, again, that we have a ship with a futuristic look and a ship that's looks like it was made in the 1700s. Putting them in star wars would obviously make some people go \"wait wtf what is that ship doing in here.\" The issue isn't how different they look, but how one clearly is out of place when compared to another. \n\nNo shame in missing this, this was a tricky question tand I didn't understand this either until after grading the test lol",
            "score": 0,
            "author": "Actual-Librarian3315",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you!!",
                    "score": 1,
                    "author": "Objective-Top-3444"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reminder: When asking for help with questions from tests or books, please include the source of the question in the post title. Examples of appropriate titles might include \"Help with writing question from April 2017 QAS\" or \"Help with question from Erica Meltzer's grammar book.\" **Posts that do not adhere to this rule are subject to removal.** For more information, please see rule #7 in the sidebar.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Sat) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "contextually d is the answer. night and day are types of video aesthetics so that is the best choice tbh whoever makes these questions just write anything but don’t think too hard and break your brain, these questions usually are common sense/no brainer",
            "score": 1,
            "author": "Business-Upbeat"
        }
    ]
}