{
    "id": "13zaa55",
    "score": 5,
    "title": "As a May DSAT taker, this June 3rd DSAT's maths module was so much easier",
    "author": "CookieCrumblerGift",
    "date": 1685792574.0,
    "url": "https://www.reddit.com/r/Sat/comments/13zaa55",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone else feel the same? I had 12 minutes extra on mm2 compared to having 0 minutes and 2 unanswered last time. It was straight up so much easier in many ways. The Eng section this time was \\*slightly\\* harder/confusing though, IMO. I'm sure there's quite a bit of luck with getting time consuming questions/harder questions from the question bank, and I got lucky this time. Also, I'm 100% sure I got the harder math module, in case you're wondering. \n\nHoping I get my goal score this time...",
    "comments": [
        {
            "level": 0,
            "comment": "The second math section was way harder than the last for me, there are more than two levels of difficulty I think.",
            "score": 5,
            "author": "Potential-Limit-6442",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm curious, what were some of the hard questions you got? I definitely agree there are harder questions in the question bank and I got lucky especially compared to last time.",
                    "score": 1,
                    "author": "CookieCrumblerGift",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did you get the question about the cowpose species and them being locked in a place or not and the difference in hormone level\nWhat was the right answer?",
                            "score": 1,
                            "author": "Conscious-Addition-8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope, I didn't get those.",
                                    "score": 1,
                                    "author": "CookieCrumblerGift"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bruh same as me second module of math is may was NUTS. But this one i had time to check almost all the questions in the second module in math \nSame with english it was a little bit harder but there were like 6 texts repeated from the may test for me",
            "score": 2,
            "author": "Conscious-Addition-8"
        },
        {
            "level": 0,
            "comment": "What questions did u get in the second module",
            "score": 1,
            "author": "Zealousideal-Roof526",
            "replies": [
                {
                    "level": 1,
                    "comment": "the (r, 7r/4 + 3r/5) one, parallel line a b one with x &gt; v and some other abstract quadratic one. Those 3 were the hardest ones and I was only unsure with the parallel line one. The rest were easy and unmemorable. Just the normal tricky word equations and functions inside of functions or circles and points on circles.",
                    "score": 3,
                    "author": "CookieCrumblerGift",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We didn’t get the same",
                            "score": 2,
                            "author": "Zealousideal-Roof526",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah there are several hard modules. The question bank is pretty big.",
                                    "score": 1,
                                    "author": "CookieCrumblerGift"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same bruh i love you. \nWhat was the answer for the parrallel lines one \nI treated the other lines (d,e) as parrallel two and from that x=w bcs of alternate exterior",
                            "score": 2,
                            "author": "Conscious-Addition-8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "bruh me 2",
                                    "score": 1,
                                    "author": "nagn1042",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sadge that choice is wrong its x&gt;w 😭",
                                            "score": 2,
                                            "author": "Conscious-Addition-8"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Btw that r one was in the non adaptive practice test 1 i think",
                            "score": 1,
                            "author": "Conscious-Addition-8"
                        },
                        {
                            "level": 2,
                            "comment": "omg i got the same. everyone else saying that they had unit circle and fking difficult questions made me think that i messed up mod1",
                            "score": 1,
                            "author": "nagn1042",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "XD sameee",
                                    "score": 1,
                                    "author": "Conscious-Addition-8"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My math 2 was harder than I expected it to be, and the vocabulary part of english was just brutal.",
            "score": 1,
            "author": "BizoIsMe0708",
            "replies": [
                {
                    "level": 1,
                    "comment": "Vocab part was definitely brutal",
                    "score": 2,
                    "author": "CookieCrumblerGift"
                }
            ]
        }
    ]
}