{
    "id": "13zkwfd",
    "score": 4,
    "title": "Falsely accused !",
    "author": "Disastrous_Mouse1073",
    "date": 1685816303.0,
    "url": "https://www.reddit.com/r/Sat/comments/13zkwfd",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm falsely accused of cheating. I didn't do anything . I took international dsat from India on may 6th. It was my 2nd time. The first time I got a 1190. This time I prepped really well and gave my best . My scores were delayed. Now they are cancelled. What should I do now. Please I just feel like crying 😭😭😭😭😭. Reply asap guys.",
    "comments": [
        {
            "level": 0,
            "comment": "Sorry about this. Unfortunately you can't do much about it, so sign up for the August test.",
            "score": 2,
            "author": "prsehgal",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll do that but would writing the SAT on a scholarship affect my scores like my scores got cancelled this time. Would it be like that as I wrote under scholarship",
                    "score": 1,
                    "author": "Disastrous_Mouse1073",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The cancelled test won't show up on your record so you don't need to mention it anywhere.",
                            "score": 1,
                            "author": "prsehgal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What I would like to know is would giving the SAT under a waiver get me problems like this. I'm financially constrained so I request waivers. Should I register with waiver now or should I pay ?",
                                    "score": 1,
                                    "author": "Disastrous_Mouse1073",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It won't make a difference.",
                                            "score": 1,
                                            "author": "prsehgal",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks Sir. But this is so unfair. I don't even have financial sources to get a lawyer",
                                                    "score": 1,
                                                    "author": "Disastrous_Mouse1073",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Even if you did, a lawyer wouldn't have helped.",
                                                            "score": 1,
                                                            "author": "prsehgal",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yea I agree. It would be so hard balancing my IELTS prep sat and board examinations. I don't have any other go",
                                                                    "score": 1,
                                                                    "author": "Disastrous_Mouse1073"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "what happened",
            "score": 1,
            "author": "12345679onetwothree",
            "replies": [
                {
                    "level": 1,
                    "comment": "I gave the paper sat on Dec 3 2022 and got a 1190. Then I crammed harder and gave the may 6 digital sat. I received an email about reviewing my scores on the score releasing day. Now they say I cheated I know I might have jumped hundreds of points up. But just because of this they can't accuse me of cheating. I did around 7000 questions. Only I know the pain of prep I had gone through. They simply accused me of cheating. I have financial constraint of taking the SAT. I am taking the SAT using scholarship only .",
                    "score": 3,
                    "author": "Disastrous_Mouse1073"
                }
            ]
        }
    ]
}