{
    "id": "13zouhl",
    "score": 25,
    "title": "Too easy to cheat",
    "author": "nerfrosa",
    "date": 1685824852.0,
    "url": "https://www.reddit.com/r/Sat/comments/13zouhl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does it bother anyone else how easy it is to cheat on the paper SAT? It's a little ridiculous. In my room alone, the guy on my right was just flipping through sections willy-nilly, the girl to my left pulled out her calculator randomly for a no-calc question, and our proctor gave us 3 extra minutes on the writing because we started at 9:18 but she rounded it to 9:15 on the board. As much as I don't like the idea of the dsat, it cannot come soon enough.",
    "comments": [
        {
            "level": 0,
            "comment": "Why are you looking at other peoples papers 🤨🤨🤨🤨",
            "score": 53,
            "author": "Bitter-Tomorrow6502",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ong frfr",
                    "score": 10,
                    "author": "LongLong404"
                },
                {
                    "level": 1,
                    "comment": "do you not ever take a glance just to see where they are at? I'm not taking there answers or anything i just wanna see how far behind I am",
                    "score": 2,
                    "author": "nerfrosa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t dare look at the paper itself. I don’t care where they are either way, I’d rather pay attention to my own test.",
                            "score": 5,
                            "author": "Sir-Kerwin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "we are different in that way",
                                    "score": 2,
                                    "author": "nerfrosa"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh my gosh I thought I was the only one who did that lol. I've never done it on a standardized test, only normal school ones though, just to make sure I'm not falling behind. Definitely be careful since others can take it the wrong way if they catch you.",
                            "score": 2,
                            "author": "LeCollegeGal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For sure, I just glance to see if there is any graph or anything on their page to see if I've gotten there yet. But i wouldn't risk it if I had a super strict proctor",
                                    "score": 2,
                                    "author": "nerfrosa"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "pulling out a calculator on no calc is crazy",
            "score": 25,
            "author": "Illustrious-Plum-556"
        },
        {
            "level": 0,
            "comment": "Just depends on the proctor. Mine stood over eveyone the entire time",
            "score": 24,
            "author": "sabrinarose2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Focus on your tests and your score—it doesn’t matter what these cheaters are doing because…\n1) if they have to cheat on the sat i bet you they ain’t getting a good score (like who needs a calculator for the no calc)\n2) they probably aren’t really learning the concepts and will suffer later in college \n3) getting a good score probably won’t mean much to you if you cheat—Id rather work my ass off and finally, after failing a bunch, get a good score than cheat the first time. You’ll not only feel more proud and accomplished, but also it won’t weigh on ur conscious later in life",
                    "score": 10,
                    "author": "Asleep_Job3691",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why would cheating on a test weigh your conscious later in life even in the slightest",
                            "score": 13,
                            "author": "CharlieEditss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It would absolutely for me. I’d feel like my college acceptances depended on it",
                                    "score": 2,
                                    "author": "sabrinarose2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i mean with such a big test",
                                            "score": 0,
                                            "author": "Asleep_Job3691"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh wow, the testing centers I’ve been to are extremely extremely strict like all the proctors are walking around the entire damn time and there r people patrolling the hallways and bathrooms so people don’t talk",
            "score": 10,
            "author": "Legitimate-Mood1596"
        },
        {
            "level": 0,
            "comment": "Honestly, if it doesn’t affect you specifically why does it bother you so much? If others cheat that’s none of your business and if you wanted to as well i promise you those same people wouldn’t care either",
            "score": 6,
            "author": "Prestigious-Hour-215"
        },
        {
            "level": 0,
            "comment": "FR... My proctor and testing room was so chill. Also I had my calculator on my desk for the entirety of the test so If I wanted to, I could have used it.",
            "score": 2,
            "author": "Dry-shirley"
        },
        {
            "level": 0,
            "comment": "Where was ur trst center?? I need to take august sat there 😩🙏",
            "score": 2,
            "author": "Aggravating-Diver-60",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cheltenham HS outside of Philly. Def wouldn't recommend it tho, there was a line out the door and we didn't get started until almost to 9 💀",
                    "score": 1,
                    "author": "nerfrosa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea that won't be an issue we start near 9pm too :D",
                            "score": 1,
                            "author": "Aggravating-Diver-60"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No one cares 💀",
            "score": 2,
            "author": "NMJacob",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean I wouldn't care if I had a 1540 either...",
                    "score": 1,
                    "author": "nerfrosa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just because they cheat doesn't mean your scores are affected. For me taking the paper test, nobody could do anything cause the proctor zoomed around the aisles.",
                            "score": 1,
                            "author": "AlphaDurian"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It said that people were supposed to leave their phones at home/in the car and I did that. Literally no one else at my center did. And this guy literally was on his phone during break and the proctor didn’t care. He could easily be sending shit to other people or searching up answers.",
            "score": 1,
            "author": "Due-Necessary3238"
        },
        {
            "level": 0,
            "comment": "Our proctor set the timer for extra 10 minutes in the reading segment for no reason💀",
            "score": 1,
            "author": "DepressedSATeenager"
        }
    ]
}