{
    "id": "140i7vr",
    "score": 3,
    "title": "SAT Summer Guide",
    "author": "Final-Ad-2238",
    "date": 1685896199.0,
    "url": "https://www.reddit.com/r/Sat/comments/140i7vr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, I'm planning on taking the November SAT, 80+, and just started studying (this is my first time). I took a Khan Academy practice test and got 1310, but I think 6 months of intense studying will be able to work. So far my plan is to complete College Panda books, all of Khan Academy SAT practice tests, and all the SAT practice tests available by college board. Are there any other resources I should use? What benchmarks are useful to gauge where I'm at and what score I should expect? \n\n&amp;#x200B;\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "uworld 🙏🏾🙏🏾",
            "score": 1,
            "author": "0v3rtd",
            "replies": [
                {
                    "level": 1,
                    "comment": "costs money tho",
                    "score": 2,
                    "author": "Actual-Librarian3315",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it’s actually pretty cheap compared to some other practice materials. like a month subscription is basically equivalent to 3 practice books ($70)",
                            "score": 0,
                            "author": "0v3rtd"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought the khan academy practice tests were the exact same as the official college board ones\n\nyou can also use past released sats, they're also as good as the practice tests",
            "score": 1,
            "author": "Actual-Librarian3315"
        },
        {
            "level": 0,
            "comment": "yo my first practice was a 1310 aswell leggo\n\njust do khan tbh, any online courses are prolly a waste",
            "score": 1,
            "author": "PaleUnderstanding819"
        },
        {
            "level": 0,
            "comment": "I prefer kaplan and Erica to be honest.khan academy was a waste of time compared to the effort it takes and what it gives.",
            "score": 1,
            "author": "AcanthaceaeObvious28"
        }
    ]
}