{
    "id": "143xs08",
    "score": 3,
    "title": "Seeking Advice: Can Practicing with Old Paper-Based SAT Reading Materials Improve Digital SAT Performance? Struggling with the Reading Section.",
    "author": "Rory-Mercury001",
    "date": 1686194338.0,
    "url": "https://www.reddit.com/r/Sat/comments/143xs08",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am currently contemplating the extent to which practicing with the old paper-based SAT reading materials will be advantageous in the context of the digital SAT. Suppose  If I were to devote substantial effort to mastering all the paper-based reading exercises provided by Khan Academy and UWORLD, do you believe it would result in notable enhancements to my performance on the digital SAT? I am genuinely interested in hearing your insights. Additionally, I have been encountering difficulties in the reading section, which is why I have been considering this approach.",
    "comments": [
        {
            "level": 0,
            "comment": "If you have exhausted all the materials for DSAT, practicing with paper SAT materials is the way to go. The skills tested are the same and the additional practice would improve your scores. But if you have access to additional, good DSAT materials give preference to them.",
            "score": 3,
            "author": "soda9bottle"
        },
        {
            "level": 0,
            "comment": "Yeah, it could help you with improving your reading comprehension skills and reading speed.",
            "score": 3,
            "author": "AcanthaceaeObvious28"
        },
        {
            "level": 0,
            "comment": "Depends on your approach to the Reading. \n\nIf you plan on gaming the Reading and using a bunch of hokey gimmicks &amp; strategies (skimming the text, reading questions first, etc), then the paper tests are pretty much useless for the DSAT. \n\nHowever, if you approach the reading by actually comprehending the text, then the paper tests are fine to use - both the DSAT and paper are testing the same skills in that regard.",
            "score": 2,
            "author": "nightcrawler47",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the information. It seems that individuals who have performed well on paper-based assessments may find it easier to handle DSAT Reading and Writing questions. Considering this, I was optimistic about attempting those questions myself, especially since I have completed studying the DSAT material",
                    "score": 2,
                    "author": "Rory-Mercury001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd agree that the DSAT questions are a bit easier than the paper test; however, the margin for error seems to be smaller (higher penalty for wrong answers). That's the possible trade-off you may want to keep in mind!",
                            "score": 1,
                            "author": "nightcrawler47"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It will certainly help in learning the principles tested on the SAT, yes.  Doing it with questions structured as will be on the digital test would be ideal, but that material is a bit thin.",
            "score": 2,
            "author": "RichInPitt"
        }
    ]
}