{
    "id": "144a3ae",
    "score": 3,
    "title": "Good at math and writing, dogshit at reading, is this my limit?",
    "author": "AutoMonkey5",
    "date": 1686232829.0,
    "url": "https://www.reddit.com/r/Sat/comments/144a3ae",
    "media_urls": [],
    "other_urls": [],
    "postText": "Ok so I'm not a big brain that scores 800s on math n stuff like that. I'm tryna to get into a somewhat competitive college (25%-30%) and want to do aeronautical engineering so being good at math and science is more important than English. But I've been scoring consistently between the 680-720 range in math but it goes back and forth. To compare, I got a 640 on my first SAT exam, now for English I've BARELY improved, I got a 590 on my first chance and only moved up to a 600. I can only finish 4/5 passages before time is up and it's been like this for the entire time. I HAVE to get 1400 before my October exam if I wanna get accepted in my dream college. I've been taking tutoring classes that require me to do 1 math test per week and my English class is a bit different, I take the full test during the class instead and homework is just english practice stuff. My math tutor says 750 is my limit and I have to focus on English instead, is this true?",
    "comments": [
        {
            "level": 0,
            "comment": "You’re going to see a much bigger impact from working on the English than you would from the math at this point. How are you scoring on the grammar portion vs the reading? \n\nYou mention reading specifically, so I’m going to focus on that here. When you take a reading passage, what’s your current approach?\n\n-\tDo you read the passage first? Answer questions during your first read-through?\n-\tWhat are you focusing on or looking for in your read-through?\n-\tWhat are you using to decide on the answer you choose?\n-\tWhen a problem is difficult, what do you do? \n-\tAre all passages equally difficult, or are there 1–2 types that always trip you up?\n\nImproving the reading score is harder than just learning rules or formulas because this section is all about your **strategy.** It sounds like you might not be getting as much guidance in this section which would definitely contribute to the stagnant score.",
            "score": 1,
            "author": "NightPortal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi, these are all the skills ik so far\n\n- on paired evidence questions I look at evidence first then match it up with the statement \n- i try to get vocab /graph questions done first because I don’t need that much context \n-  on double passages I read the first passage, finish the questions corresponding with the 1st passage, then move on \n- I use process of elimination the most \n\nI think my worst aspect is timing, I can get all the questions done with enough time which explains why I spend so much time trying to perfect the first 3 passages and then doze off on the last 2 passages",
                    "score": 1,
                    "author": "AutoMonkey5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For timing, the best thing will be to work on changing your mindset to maximize the number of questions you answer. It seems weird at first, but you don’t need to get every question correct—you can (and should) guess on problems that aren’t worth your time. It’ll take some practice to figure out where that cutoff point is for you, but as a good starting point, guess and move on if you haven’t made progress in ~20 seconds. \n\nThen when you’re reviewing, focus on answering “How could I have answered this quickly?”\n\n-\tWhat keywords are in the question that help you see where it is in the passage?\n-\tDo you know where things are in the passage? How much are you searching for each answer?\n-\tAre you understanding the main idea of the passage, or do you need to adjust your strategies to improve that?",
                            "score": 1,
                            "author": "NightPortal"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you tried reading for 11 minutes per passage and answering all the questions in 2",
            "score": 1,
            "author": "Charge_0"
        }
    ]
}