{
    "id": "146eipn",
    "score": 27,
    "title": "How much can I improve by august",
    "author": "New_Seaworthiness324",
    "date": 1686439928.0,
    "url": "https://www.reddit.com/r/Sat/comments/146eipn",
    "media_urls": [],
    "other_urls": [],
    "postText": "For context I can never finish the english on time although I am exceptionally good at english because of concentration issues and suck at math it’s as simple as that. Any advice on how to improve on timing and math and yes I plan to use Khan academy. Any advice would be super appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "How are you so verbally gifted but mathematically crippled 💀",
            "score": 9,
            "author": "PhysicalGazelle2889",
            "replies": [
                {
                    "level": 1,
                    "comment": "IK WORST PART IS MY DAD IS A COLLEGE MATH PROFESSOR",
                    "score": 7,
                    "author": "New_Seaworthiness324",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You'd think mathematical talent is genetic..\n\nMy dad is pretty good at math and that rubbed off on me (800 first time SAT math).",
                            "score": 1,
                            "author": "PhysicalGazelle2889",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My parents are immigrants with a 4th language as english so honestly I have no clue where I get it from. My dad has 4 book shelves of math text books yet idek what calculus is",
                                    "score": 4,
                                    "author": "New_Seaworthiness324",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tbf I took calculus and idek what it is.",
                                            "score": 2,
                                            "author": "TheQuestioner234",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "so real of you honestly 😭",
                                                    "score": 1,
                                                    "author": "New_Seaworthiness324"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "UWorld for Math and Erika Meltzer for English. Grind UWorld math and 700+ is very possible same with English",
            "score": 9,
            "author": "Gullible-Half-5263"
        },
        {
            "level": 0,
            "comment": "you have a lot of room in math to improve, which is luckily the easiest to get a 700+ in within a month",
            "score": 13,
            "author": "Money-Syrup-6574"
        },
        {
            "level": 0,
            "comment": "Though most people recommend Khan Academy and seem to do well with it, I personally saw little improvement and spent too much time studying obscure level 4 topics while I was still shaky on simple math principles. With a score as low as 410, your priority should be starting from square one and relearning all of the basics, slowly working through each concept that will appear on the test. To me, Khan Academy seems more like a practicing resource not a learning one, and if you are scoring anything below a 650, then you probably just don't understand all of the content. Since you have a lot of content to cover, I HIGHLY recommend [1600.io](https://1600.io) volumes 1 and 2. They start out slow for each chapter and give detailed explanations, with WORDS! Because you have a naturally better reading score, I believe you will benefit from these explanations as I did. I never fully grasped the procedures I needed to perform in the math section until I understood WHAT I was doing and WHY I was doing it. (Resources such as Khan Academy also showed me sometimes worse ways of solving things, and because I was new to a lot of the math , I thought every problem had to be solved this exact same way.) And don't worry, the math is all actually very easily solvable. Once you have learned it all, you might even start to prefer it over the reading section",
            "score": 4,
            "author": "Maleficent-Falcon821",
            "replies": [
                {
                    "level": 1,
                    "comment": "wow this is actually so helpful because I’ve been using khan academy but it never really explained the concepts to me i appreciate this sm!!!",
                    "score": 1,
                    "author": "New_Seaworthiness324"
                }
            ]
        },
        {
            "level": 0,
            "comment": "tips for reading/writing?",
            "score": 3,
            "author": "chrisreddittt",
            "replies": [
                {
                    "level": 1,
                    "comment": "are you asking me for tips? i’m being genuine btw i’m not sure if your asking me for tips or mean something else i’m happy to give you tips if you are asking tho 😭",
                    "score": 2,
                    "author": "New_Seaworthiness324",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "no i am 😭 i’m trying to get a 600 on the reading/writing section as well. that’s actually such a great score!!",
                            "score": 2,
                            "author": "chrisreddittt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thank you!! For english it’s honestly always come naturally for me because I read since I was little so reading even now, I promise will help you so much in analyzing the little things. Also, annotating not big annotations, but let’s say you’re reading and you see the authors purpose just write on the side, the authors purpose in a couple words. Another thing is a lot of people think that reading the entire passage in the reading section will make you lose time but just practice being a fast reader because if you don’t read it and you skim through it, and you don’t understand the questions you realize you don’t understand it so you have to go back and read it and now you’re losing more time than you would have if you just read it the first time, so read it understand the purpose, the tone and that’ll get you far if they ask you to go back to a specific passage or sentence go back.  annotations also help with this because instead of going back to reading the passage, you can just read what you wrote on the side now of course you still want to pace yourself because that’s what I struggle with so honestly I would just do packets of stuff like EOC testing practice SATs for reading sections because you keep reading you start to see a pattern and what they mean by the purpose and you start to see the pattern in what they mean by the authors tone. Uworld practice questions can also help with the  because uworld is super difficult for no reason so if you can just get like a 75 on some you uworld quizzes you WILL improve. with WRITING I struggle with that one a little because I’m not great at the whole comma stuff, for when it comes to writing, I see just the questions that ask for like synonyms, and and how to connect sentences those are really easy if you just practice and I know I’m saying practice practice practice but that’s really all it is I’ve been practicing English since I was young and till this day I don’t have to study for English stuff because I know it by heart I’m just not fast you can always DM me so we can practice together. I don’t know if you’re good at math, but I can help you you could help me maybe 😉",
                                    "score": 10,
                                    "author": "New_Seaworthiness324",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "THANK YOU SO MUCH FOR ALL THESE TIPS I DEEPLY APPRECIATE YOU!!!",
                                            "score": 3,
                                            "author": "chrisreddittt"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take a practice test every day during the month of July and review what you got wrong. You can find over 50 practice tests online and I took almost all of them, going from a 1160 to a 1570 in around a month and a half. When school starts up again take a practice test every weekend and do practice questions in your free time during the week. You can totally increase your score by 450+ points as long as you grind, and I promise the satisfaction of getting that 1500+ will be like nothing you've ever felt before. I got between a 1580 and 1590 on every practice test I took after 33, so in reality I improved by 430 points. If I was able to do it, so are you. You got this!",
            "score": 3,
            "author": "Ratioskillissue"
        },
        {
            "level": 0,
            "comment": "Math 100% just use khan academy. Maybe math isn't your strength, but I'm sure if you nail the basics of algebra this summer, you'll see a lot of improvement.  Your english score is pretty good. Maybe work on grammar for now as that seems like it will be easier to practice. For reading, just read books for fun if you have free time, and while you take the SAT, pretend the passage is genuinely intriguing even if it's not. You can also try to annote/take notes if you have time, as that could improve focus.",
            "score": 6,
            "author": "YA_BOI_KAJAK",
            "replies": [
                {
                    "level": 1,
                    "comment": "i found with english my main issue is running out of time",
                    "score": 3,
                    "author": "New_Seaworthiness324",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "imo practice can be a huge factor in improving speed. timed sessions do the trick too. good luck!",
                            "score": 4,
                            "author": "coffee_tv_13"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "im the same as you 😭. let me know if you find any math tips",
            "score": 3,
            "author": "cherrybears01"
        },
        {
            "level": 0,
            "comment": "Use the practice tests available on college board. They have full tests with answer explanations. Time yourself. Also, look up strategies for what to do when you are out of time but still have questions 🤫",
            "score": 2,
            "author": "LaLaLenna"
        },
        {
            "level": 0,
            "comment": "In my opinion, math is the easiest to improve on while reading is the hardest. So I think you’ll be able to reach a 1400+ for sure 👍",
            "score": 2,
            "author": "daddy_eats_yu"
        },
        {
            "level": 0,
            "comment": "You could get a 1300 for sure if you practice 10-15hrs a week for the rest of the summer",
            "score": 2,
            "author": "Medium_Iron7454"
        },
        {
            "level": 0,
            "comment": "A lot, if you are dedicated. I recommend doing prep books and watching YouTube videos on topics you struggle with. In March I got a 1020, by May I was up to an 1120. Practice makes progress.",
            "score": 2,
            "author": "rednaxyy"
        },
        {
            "level": 0,
            "comment": "You have great room to improve in math and can surely have a huge score improvement with some practice and dedication:\n\nI'm a perfect SAT Math Scorer who is conducting a summer BootCamp (June and July)\n\nHere's the link if you are interested: https://schoolhouse.world/series/7007",
            "score": 2,
            "author": "PranzEproftrol"
        },
        {
            "level": 0,
            "comment": "You can definitely improve math is so much easier to improve by just doing things like khan academy and you can get a 600+",
            "score": 2,
            "author": "Start280Finish"
        },
        {
            "level": 0,
            "comment": "Hayden Rhodea 90 day SAT prep course YouTube🫡",
            "score": 5,
            "author": "ayang1003",
            "replies": [
                {
                    "level": 1,
                    "comment": "That guy’s annoying af tho",
                    "score": 9,
                    "author": "Shoddy-Advice-8420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s free content?? Lmao just cause he’s annoying in your opinion (which I honestly don’t agree with since he’s usually thorough with his work) doesn’t mean that it should be discredited as study material. I used his 14 day prep course and gained 120 points on the next SAT that I took",
                            "score": 0,
                            "author": "ayang1003"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "how well did you score on the SAT after you finished his 90 prep course on youtube? i’m gonna start it this week but i’m taking the SAT in august",
                    "score": 1,
                    "author": "Ordinary-Travel-9633",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I went from 1380 to 1500 after taking his 14 day prep course. But don’t be fooled into thinking that this is some miracle drug. On top of paying attention to the videos, you need to take time to do practice tests.",
                            "score": 2,
                            "author": "ayang1003"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And yes ik it’s very bad trust i’m embarrassed",
            "score": 3,
            "author": "New_Seaworthiness324",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mannn don't be embarrassed about an SAT score. A good score is nice to be proud of, but don't work yourself up too much. This sub only exists to help people who need help, so don't be ashamed to ask. Hopefully you find some people's tips useful and improve on your next test :D",
                    "score": 8,
                    "author": "YA_BOI_KAJAK",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thank you that means a lot &lt;3",
                            "score": 2,
                            "author": "New_Seaworthiness324"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "it's not bad!!! 50th percentile is perfectly average. you can definently improve a lot by august because math is much easier to improve on than english",
                    "score": 2,
                    "author": "Alexok1127",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i appreciate that. eng has always been my strong suit so i’m relying on that 😭",
                            "score": 2,
                            "author": "New_Seaworthiness324"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Use Khan Academy. You don't need anything else unless you want a 1500+.",
            "score": 2,
            "author": "Alexok1127"
        },
        {
            "level": 0,
            "comment": "Grind practice tests and khan academy math and you’re on track to a 1300 I think. Of course, you have to be consistent and start now. And when I say grind, I mean work but be looking for the mistakes that you make. Don’t just mindlessly run through the questions",
            "score": 2,
            "author": "Sir-Kerwin"
        },
        {
            "level": 0,
            "comment": "SAT blackbook helped me so much. You should definitely use it over the summer in combination with the officially publised SAT tests. Math seems intimidating but there are a lot of patterns in the questions- even the ones that are supposed to throw you off :)",
            "score": 1,
            "author": "Aware-Ice-5774",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!!!! I wasn’t sure what kind of prep book i should get",
                    "score": 1,
                    "author": "New_Seaworthiness324"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got a 1060 and got into a top 5 public University. Don’t worry.",
            "score": 1,
            "author": "Latter-Ad906"
        },
        {
            "level": 0,
            "comment": "You can improve a lot if you have a strategic and methodical study plan",
            "score": 1,
            "author": "Shoddy-Advice-8420",
            "replies": [
                {
                    "level": 1,
                    "comment": "you mean like planning the days i study or how I study?",
                    "score": 1,
                    "author": "New_Seaworthiness324",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Both",
                            "score": 1,
                            "author": "Shoddy-Advice-8420"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "All study guides will work and be helpful but the best use of your time is using a resource with the help of a personal tutor.",
            "score": 1,
            "author": "Familiar-Gain3882"
        }
    ]
}