{
    "id": "147gu3g",
    "score": 7,
    "title": "Digital prep (pls help!!)",
    "author": "itsclownery",
    "date": 1686551114.0,
    "url": "https://www.reddit.com/r/Sat/comments/147gu3g",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I’m going to be appearing for a retake this August after having given the non digital version of the SAT last year. I’ve taken a look at the main changes and the syllabus etc but I’m a bit confused regarding practice. As far as I know, for initial practice and understanding of concepts, we should be using the old SAT workbooks etc + khan academy, and the bluebook for digital practice tests.\n\nCould somebody please let me know if my understanding is correct or what I should be doing differently? Also, aren’t 4 full length official practice tests too little? As far as I know there are only 4 available for the new version. Kind of stressing, not sure how to study for this digital version. Would really appreciate some responses!",
    "comments": [
        {
            "level": 0,
            "comment": "I think you can use the old workbooks for Math from the calculator section but i dont suggest using the old english material. For the english material you can study from Khan Academy and Erica L Meltzer books.",
            "score": 1,
            "author": "IllustriousJunket323",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay thank you! Do you think I should also attempt the non calculator section from the old math workbooks but with a calc if needed so I have practice of all concepts",
                    "score": 1,
                    "author": "itsclownery",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes you can but the remember the numbers on the digital SAT will be bigger.",
                            "score": 2,
                            "author": "IllustriousJunket323",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay got it",
                                    "score": 1,
                                    "author": "itsclownery"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "4 practice is definitely enough. Remember to record your wrongs in a chart and analyze why you got them wrong and make sure you get it. Maybe do one practice on bluebook first to see where you are at, then watch the khan academy digital sat videos and do questions. Focus on your weakness. then do the rest and learn where you got wrong. For the math, a lot of the questions you don't need to calculate, just plug into the desmos graphing and you will have the answer. Make sure you are familiar with how to use desmos and how to graph to get answers.",
            "score": 1,
            "author": "Scary_Will_2170",
            "replies": [
                {
                    "level": 1,
                    "comment": "if you have learned the old sat before and are familiar with the concepts, I don't suggest looking at the old versions. However, if you are not familiar with the basics of the sat, you can use the old ones.",
                    "score": 1,
                    "author": "Scary_Will_2170"
                },
                {
                    "level": 1,
                    "comment": "Erica meltzer has a new digital sat book if you can afford it. But the old one works magic too",
                    "score": 1,
                    "author": "Scary_Will_2170"
                },
                {
                    "level": 1,
                    "comment": "Got it thank you so much for this response",
                    "score": 1,
                    "author": "itsclownery"
                }
            ]
        }
    ]
}