{
    "id": "148af74",
    "score": 25,
    "title": "do y'all think june 3 reading was hard or just me...",
    "author": "Firm-Chicken2497",
    "date": 1686645467.0,
    "url": "https://www.reddit.com/r/Sat/comments/148af74",
    "media_urls": [],
    "other_urls": [],
    "postText": "i need a good reading curve on this one bc i did not think it was easy at all... anyone else",
    "comments": [
        {
            "level": 0,
            "comment": "I was obliterated by no calc section but everything else went pretty well",
            "score": 23,
            "author": "United_Barracuda_247"
        },
        {
            "level": 0,
            "comment": "I also thought it was hard, especially the science passages. I understood the League of Nations passage perfectly but for some reason the questions were still hard for me. I think I got all the questions right on writing and math though.",
            "score": 13,
            "author": "Ambitious_Load5068"
        },
        {
            "level": 0,
            "comment": "I thought it was average level , But that No Calc Bru . Shit better be like the May Curve 😭",
            "score": 9,
            "author": "ultraboostforlife",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank god I wasn’t the only one who thought no calc section was hard. Im usually really good at math but there were a couple questions on that that were so weird and I didn’t have the time to actually figure them out 😅pls let there be a good curve",
                    "score": 4,
                    "author": "Atackat16",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "if you find sat math difficult don’t call yourself good at math",
                            "score": 0,
                            "author": "meloneberry",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If your username is meloneberry, please find something better to do with your time",
                                    "score": 3,
                                    "author": "YA_BOI_KAJAK"
                                },
                                {
                                    "level": 3,
                                    "comment": "I agree with this in general but everyone has different upbringing and different resources. However, I think that once you get to a certain level of math you realize that simply being ahead or knowing content isn’t enough to be “good at math”. The innate problem solving skills dictates skill in math. Even though I am taking Linear Algebra Junior year after taking AP calc BC sophomore year, I still believe that there are plenty of people who are on a technically lower level of math but are still better because of those problem solving skills. I think the best test of someone’s ability at math is to take content that everyone has learned already, and make it about the problem solving. This is essentially what Mathcounts, AMC, AIME, etc are. Mathcounts only requires middle school level math but I bet you that most high schoolers can’t get more than 80% of the questions right.",
                                    "score": 3,
                                    "author": "MeanEntertainment213"
                                },
                                {
                                    "level": 3,
                                    "comment": "bro I feel fairly confident on a 5 in ap calc but for some reason can’t break low to mid 700s on sat math ☠️",
                                    "score": 2,
                                    "author": "spirit_saga"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What was that like??",
                    "score": 1,
                    "author": "Designer-Entrance-47"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I guessed on the last 5 and out C for all of them because I was out of time",
            "score": 4,
            "author": "Mr-splatoon-2"
        },
        {
            "level": 0,
            "comment": "Not necessarily",
            "score": 3,
            "author": "Enkhmendd"
        },
        {
            "level": 0,
            "comment": "it was hard asf for me",
            "score": 3,
            "author": "0v3rtd"
        },
        {
            "level": 0,
            "comment": "I feel like it's average level",
            "score": 3,
            "author": "dwarf-marshmallow",
            "replies": [
                {
                    "level": 1,
                    "comment": "OH WAIT I'm talking abt digital😭not the paper test",
                    "score": 2,
                    "author": "dwarf-marshmallow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m very confident in like a 790 or 780 for math section. All of it was light",
            "score": 3,
            "author": "Mr-splatoon-2"
        },
        {
            "level": 0,
            "comment": "it wasn't extremely hard but it wasn't easy either",
            "score": 2,
            "author": "fangirl_483078"
        },
        {
            "level": 0,
            "comment": "Omg yes usually it’s a breeze for me but I thought to myself it was oddly hard",
            "score": 2,
            "author": "lamblvr"
        },
        {
            "level": 0,
            "comment": "For the June test, my ratings are (i've taken a real test 3 times times and 25+ practice):\n\nReading-5.5-6/10\n\nWriting-6.5-7/10\n\nMath Without Calculator-10/10\n\nMath With Calculator-3.5-4/10\n\n1 is really easy, 5 is average, 10 is really hard.",
            "score": 1,
            "author": "Beautiful-Cut-6976",
            "replies": [
                {
                    "level": 1,
                    "comment": "The writing part was much easier than the reading part for me",
                    "score": 1,
                    "author": "mrwangsensei"
                }
            ]
        }
    ]
}