{
    "id": "j094td",
    "score": 1780,
    "title": "This sub in one picture",
    "author": "whereisthebroccoli",
    "date": 1601137938.0,
    "url": "https://www.reddit.com/r/Sat/comments/j094td",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "You forgot the constant score flexing",
            "score": 240,
            "author": "PsychologicalTrash5",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 134,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I lose my patience when someone says that, one time I just replied “if you think that score is stupid, then you probably are”",
                            "score": 104,
                            "author": "PsychologicalTrash5"
                        },
                        {
                            "level": 2,
                            "comment": "Infuriating",
                            "score": 13,
                            "author": "Cass024"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What! Nah, 1550 and above is practically a 1600 and that’s from ivy leagues students",
                                    "score": 8,
                                    "author": "Sadunfunnyclown"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had rly bad anxiety at the beginning of the test and probably bombed the reading section bc of it, and I’m mad bc I could tell it was easy but I couldn’t do anything bc I was freaking out so much. It was actually so weird bc I couldn’t do anything to calm myself down.. the other sections were a breeze doe",
            "score": 70,
            "author": "queeniezx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too, I took the August 29 one and got immediate anxiety stomach pains the moment I started",
                    "score": 19,
                    "author": "usernametaken0602",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ughh 😖",
                            "score": 4,
                            "author": "queeniezx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I got a 1270, twas a bad time. (I took the Aug 29 one)",
                                    "score": 7,
                                    "author": "usernametaken0602",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m sorry😔That’s so annoying especially when it’s bc of anxiety and there’s literally not you can do about it.",
                                            "score": 5,
                                            "author": "queeniezx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah no amount of training can prepare you for anxiety, especially because I dont take anything for it. Its not like a 1270 is bad, but I definitely wanted better. Math seemed easy but I just shut down on it.",
                                                    "score": 3,
                                                    "author": "usernametaken0602",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah I completely agree",
                                                            "score": 1,
                                                            "author": "queeniezx",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm just glad its over",
                                                                    "score": 1,
                                                                    "author": "usernametaken0602"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The duality of man",
            "score": 126,
            "author": "averagewhiteduder420"
        },
        {
            "level": 0,
            "comment": "I took the test with exactly one other person. The supervisor was also incredibly nice. Most chill test I've ever done. Benefits from living in a small Balkan country, I guess.",
            "score": 28,
            "author": "vlatkosh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait you were only the two of you writing?",
                    "score": 4,
                    "author": "Pkay05",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep. I think there were 2 or 3 other people doing the TOEFL in another part of the school, but that's it.",
                            "score": 4,
                            "author": "vlatkosh"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Which country is that?",
                    "score": 3,
                    "author": "unoor7633",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "N. Macedonia",
                            "score": 5,
                            "author": "vlatkosh"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My PERIOD came on during the writing section AND I got cramps for the FIRST time ever T-T.",
            "score": 14,
            "author": "kennedyrll45",
            "replies": [
                {
                    "level": 1,
                    "comment": "I swear periods and period cramps ALWAYS come at the worst time. Why can’t they come on a normal day? Why does it always have to be the school swimming carnival day???",
                    "score": 7,
                    "author": "Melinow"
                },
                {
                    "level": 1,
                    "comment": "Omg during mine today I was freaking out bc I was scared mine would start. Thankfully mine started when I got home but I was still so anxious that I’d leak or something",
                    "score": 4,
                    "author": "4yeetusthefetus4"
                },
                {
                    "level": 1,
                    "comment": "LMAO i can relate lol in august i got it right as i was about to go to my testing center",
                    "score": 3,
                    "author": "snazzy-salamander"
                },
                {
                    "level": 1,
                    "comment": "i didn’t eat breakfast this morning and my stomach was grumbling THE ENTIRE TIME. so embarrassing omg",
                    "score": 4,
                    "author": "bbinxin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OMFFGG MINE TOO",
                            "score": 3,
                            "author": "Zeyn0202"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy shit lmao. I thought it was the easiest one I’ve done yet",
            "score": 30,
            "author": "reddit_is_a_mistake",
            "replies": [
                {
                    "level": 1,
                    "comment": "You haven't seen it's curve my friend! I am a survivor of that troubled time!",
                    "score": 25,
                    "author": "_Athz_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ah true. hopefully the curve isn’t brutal",
                            "score": 13,
                            "author": "reddit_is_a_mistake",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hope the curve lets u get 50 questions wrong on reading and still get 800🤪",
                                    "score": 40,
                                    "author": "squidmonkeyxoxo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "you haven't seen its curve too my friend!",
                            "score": 2,
                            "author": "JANTYYYY"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The proctor messed up the clock so I had to guess on the final last half of the passage",
            "score": 34,
            "author": "moritzwest",
            "replies": [
                {
                    "level": 1,
                    "comment": "what",
                    "score": 5,
                    "author": "kan_ny"
                },
                {
                    "level": 1,
                    "comment": "My proctors on Wendesday were a couple of clowns. Had no clue what they were doing and it was really annoying",
                    "score": 3,
                    "author": "JacobD6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Really?  Why Wednesday",
                            "score": 1,
                            "author": "moritzwest",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was the school day SAT (9/23) so my proctors were a couple of teachers who had been \"trained\" and given the script.",
                                    "score": 3,
                                    "author": "JacobD6",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh wow ..",
                                            "score": 1,
                                            "author": "moritzwest"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol I was kidding!! What was hard on the test today",
            "score": 61,
            "author": "Big_Communication_46",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea sure u were",
                    "score": 6,
                    "author": "dilashma"
                },
                {
                    "level": 1,
                    "comment": "I still need to work on science reading and exponents",
                    "score": 6,
                    "author": "Im_Rambooo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember last year after the May international scores were released some people were planning suicide",
            "score": 28,
            "author": "Pkay05"
        },
        {
            "level": 0,
            "comment": "bruh always pray it’s hard so the curve is more generous💀💀",
            "score": 12,
            "author": "sophomore-cox"
        },
        {
            "level": 0,
            "comment": "The irony",
            "score": 18,
            "author": "YellowSwan718"
        },
        {
            "level": 0,
            "comment": "i hope i did ok regardless oof today was not a good day",
            "score": 7,
            "author": "k1tty_"
        },
        {
            "level": 0,
            "comment": "It was my first and only chance to take the exam, too. Unfortunately, I was late because I was coming from another city and we couldn't arrive in time. Even though I was able to get in the last second, I was completely messed up without sleep and dining. Also, I needed to run for a while to get into the test center in that last second. I wear glasses and they were foggy all the time because of the high level of breathing. Imagine you have one single chance and everything happens in a kind of way. Especially, Reading part has always been the part which is hard for me. I always used to miss the perfect 1600 because of reading mistakes on official practice tests. I don't know if I will be able to get a good score out of this, literally, messed up test day but I hope so.",
            "score": 6,
            "author": "vaultboyfurkan"
        },
        {
            "level": 0,
            "comment": "I took it today, and honestly, I feel like I did HORRIBLE. The reading/language sections were not bad at all, so those were fine. My only worries are my math and essay. I panicked and was not accustomed to the type of essay they wanted me to write, and I forgot so much math. Even though I’m in a Pre-Cal college course rn, it’s way too easy. All of it is basically review and we never do any assignments in class. It’s all just watch the teacher do an “example problem” and then, you ‘learned’ the skill. We have only done ONE test, and now, we are about to do a midterm? like this upcoming week. My highschool math was so much more challenging, and the teachers were so much more engaging and interactive. I miss them greatly.",
            "score": 6,
            "author": "710K"
        },
        {
            "level": 0,
            "comment": "LMAOO HONESTLY",
            "score": 5,
            "author": "j3nnyb3nny"
        },
        {
            "level": 0,
            "comment": "Took the test today can confirm",
            "score": 4,
            "author": "barryb33b3ns0n"
        },
        {
            "level": 0,
            "comment": "I took it and I’m dyslexic and so reading is hard for me. I had a lot of math word problems and it was all a lot for my head. Honestly I’ve always had trouble testing and I’m shooting low lmao.",
            "score": 5,
            "author": "StruggleBus2002"
        },
        {
            "level": 0,
            "comment": "^damnfifthsectiondjdmapcsoxjsxissnsnxbjxksskxk",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My test centre had a blackout twice. Once during the Reading and again during the Essay. My guess is that the classroom’s lights use motion detectors...which is hella dumb. I wonder what action goes on there on a normal school day else I’d imagine there would be a blackout real frequently.",
            "score": 3,
            "author": "dadeeba",
            "replies": [
                {
                    "level": 1,
                    "comment": "You should complain to college board about a test day disruption. You can probably qualify for a make up or retake day if you want it.",
                    "score": 1,
                    "author": "whereisthebroccoli"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I honestly prefer saying it was easy rather rhan ppl getting a 1560 or smth and saying oh god I'm so dumb blah blah blah like pls no it's an accomplishment many don't reach brag all you want",
            "score": 2,
            "author": "alexafaro"
        },
        {
            "level": 0,
            "comment": "Hope the curve gonna be easy",
            "score": 1,
            "author": "realrachel77"
        },
        {
            "level": 0,
            "comment": "Can we pin this post to the top of this subreddit?",
            "score": 1,
            "author": "SadWolverine24"
        },
        {
            "level": 0,
            "comment": "If it’s that easy, will October 3’s test be easy ???? I’m scared that my first SAT ever",
            "score": 1,
            "author": "RaspberryKookie"
        },
        {
            "level": 0,
            "comment": "What did y’all get for finding h in terms of the surface area, length, and width",
            "score": 1,
            "author": "kennedyrll45"
        },
        {
            "level": 0,
            "comment": "The one that says it is easy does bad, and the one that struggles does amazing💀",
            "score": 1,
            "author": "joegav1"
        },
        {
            "level": 0,
            "comment": "I never want to go through what that person went through.",
            "score": 1,
            "author": "MitchTvd"
        }
    ]
}