{
    "id": "13q7xs5",
    "score": 1,
    "title": "Tiny bug on pillow",
    "author": "jpill123",
    "date": 1684893785.0,
    "url": "https://www.reddit.com/r/biology/comments/13q7xs5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I found this tiny bug on my kids pillow. I picked it up, took this picture and threw it outside. Doesnt look like bed bug. Can someone help me identify what this is? Only found one so far.",
    "comments": [
        {
            "level": 0,
            "comment": "Actually, I’m fairly certain that is a carpet beetle larvae. Looks fuzzy and doesn’t have the characteristic antennae of an isopod. Pretty common to find inside and there are many species. They tend to feed on stray crumbs and whatnot where I live. Nothing to really be worried about, the beetles are tiny. But it might be a good idea to clean any food waste out of the kid’s room and try to make sure he doesn’t leave scraps of food around. \n\nThat said, Carpet beetles tend to show up in small numbers anyway. Hard to eradicate their food sources entirely because they’ll munch on everything from other dead beetles to trace amounts of dead skin.",
            "score": 6,
            "author": "MisterViperfish",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm pretty sure you're correct! I had one in my earbuds once, I thought I had bugs in my ears, which was sort of true.",
                    "score": 2,
                    "author": "Plastic_Ad7436"
                },
                {
                    "level": 1,
                    "comment": "I'm pretty sure some of these guys did in some of my yarn stash.  From what I remember they got the name carpet beetle from the fact that they ate wool carpets.\n\nThe little \"hairs\" that come off after this stage can be an irritant to lungs, skin, but if it's just one and your kids aren't having issues you should be good.",
                    "score": 1,
                    "author": "PrettyLittleLost"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s the larvae of a carpet beetle, *Anthrenus verbasci*.\n\nIt won’t harm you, but if you have a high enough density of them in the home, they can damage some of your belongings.",
            "score": 4,
            "author": "DrPlantDaddy"
        },
        {
            "level": 0,
            "comment": "Its a carpet beetle larva.",
            "score": 2,
            "author": "TheSmell0fRain"
        },
        {
            "level": 0,
            "comment": "**Bot message:** Help us make this a better community by clicking the \"report\" link on any pics or vids that break [the sub's rules.](https://old.reddit.com/r/biology/about/rules/) Thanks!\n\n**Disclaimer:** The information provided in the comments section does not, and is not intended to, constitute professional or medical advice; instead, all information, content, and materials available in the comments section are for general informational purposes only.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/biology) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I'm no Entomologist, but I am a Biologist that has done museum specimen maintenance. This is a carpet beetle larva. If you are a bone collector, taxidermy enthusiast, have books, fabric, or crafting supplies, I would start looking over your collections to check for damage.",
            "score": 1,
            "author": "BhalliTempest"
        },
        {
            "level": 0,
            "comment": "Looks like a wood louse",
            "score": -2,
            "author": "openly_gray",
            "replies": [
                {
                    "level": 1,
                    "comment": "Too small",
                    "score": 1,
                    "author": "mmmhotcoffee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s an isopod. A pill bug :)",
            "score": -2,
            "author": "Cookgypsy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks. Before I start googling… should I be worried?",
                    "score": 1,
                    "author": "jpill123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not really.  It’s not bed bug. So you are good.",
                            "score": 1,
                            "author": "parabuthas"
                        },
                        {
                            "level": 2,
                            "comment": "Not at all. It’s harmless",
                            "score": 1,
                            "author": "Cookgypsy"
                        }
                    ]
                }
            ]
        }
    ]
}