{
    "id": "13se6yh",
    "score": 0,
    "title": "4 to 16 Day Cycles",
    "author": "patbrown42184",
    "date": 1685109962.0,
    "url": "https://www.reddit.com/r/biology/comments/13se6yh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Ok this is a weird one.  If it's too out of character I won't be offended by being pruned\n\nWhat processes in human or general biology (or other general natural if you're feeling frisky but this isn't r/AllTheThings so maybe PM anything OT.  Or not; I'm not sure what the culture here is) are between about 4 and 16 days?\n\nI'm playing with a little amateur philosophy of time and questioning the correctness of a seven day week.  Is seven actually more correct than 6 or 8?  Is there a reasonable case for a eleven days, maybe with a two day work weekend and one day weekmiddle?  And cetera \n\nBio isn't the only consideration, and probably not the primary consideration, but I don't have the background to see biological processes that might be important if they exist\n\nThanks in advance",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;I'm playing with a little amateur philosophy of time and questioning the correctness of a seven day week. Is seven actually more correct than 6 or 8?\n\nThis sounds very much like a question for philosophers and the type of thing that the hard sciences are unable to answer and/or uninterested.\n\nWhat do you mean by correctness? And thinking like a scientist - how would you define, measure, and test it?",
            "score": 1,
            "author": "Affectionate-Bee3913",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well the day for example is easy.  Sunrise and sunset in the earth, but also circadian patterns exist in humans relating to wake/sleep. Likely others but I'm not a biologist\n\nLikewise months.  Certain cycles occur monthly in humans as well\n\nAs to specifically correctness, yes, that's a philosophical or axiological question, but that doesn't make facts irrelevant.  If there are biological cycles that occur every 5-6 days for example, that's some evidence for a shorter week.  Something every nine days would be evidence for longer\n\nI didn't come here for philosophy, though I'll take it if you'd like.  I came for the science.  Are you aware of any objective patterns in human or general biology that have a period of 4ish to 16ish days?",
                    "score": 1,
                    "author": "patbrown42184",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There are lots of biological timers (e.g. menstrual cycle) but no, to my knowledge there's no evidence of any biological reason for a 7-day week. I'm certain there are biological cycles that operate on 7 day cycles just like there are biological clocks that operate on 4-week cycles give or take a week or two. But that doesn't mean anything, just that evolution landed on a timer for that process that was good enough.",
                            "score": 1,
                            "author": "Affectionate-Bee3913",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks.  \n\nI'm not looking for biological evidence for a seven day week exactly, just cycles in that very rough timeframe that could in theory be attractors.  I would be surprised enough to find it in fact I'd have a good hard look at the research methodologies \n\nI'd argue \"doesn't mean anything\" as an input to philosophy or human psychology is too strongly put, but definitely a very small effect even if found \n\nBut regardless, asked and answered, thanks.  I don't know any either and I'm certainly not throwing any stones 😁",
                                    "score": 1,
                                    "author": "patbrown42184"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}