{
    "id": "13tfsc0",
    "score": 2,
    "title": "The first cell..",
    "author": "FatherOfNyx",
    "date": 1685215223.0,
    "url": "https://www.reddit.com/r/biology/comments/13tfsc0",
    "media_urls": [],
    "other_urls": [],
    "postText": "When people refer to the first cell that all life came from, are they referring to a species evolving or literally one cell that all life came from?\n\nI always assumed it meant a species rather than an individual, but it seems a lot of people assume it as an individual cell.\n\nKind of like how there isn't a single individual in our evolutionary line you can point to and say \"this was the first human\".. I always thought the first cell meant the first species of cells to evolve.",
    "comments": [
        {
            "level": 0,
            "comment": "Given how single cell organisms replicate (via binary fusion, splitting one cell into two) then theoretically there would be a single cell all life could be traced back to. However that would not be the only cell around at the time, the lines of decent from the other cells just all died out. LUCA (Last Universal Common Ancestor) is more a theoretical concept then something we can definitively point to. And regardless of if you want to interpret it as a specific individual cell or a species, that wouldn't mean there weren't other cells or species around at the time, just that they left not currently living dependent.\n\nIn this regard its similar to the concept of Mirochondiral Eve, a woman from whom all living humans are decended (or at least can trace their mitochondrial lineage back to). She was not the only woman living at the time, but in the time until now all the female lineages of the other women died (at some point they either didn't have children or had only sons). The male version of this is Y-Chromsome Adam and the two didn't live at even close to the same time.\n\nNow it is possibly you are thinking more along the lines of abiogensis, the formation process that lead to the development of the first proto-cell, something we can be even less certain about than LUCA. Life could have started and failed several times, multiple proto-cells could have arisen at the same time (maybe that is where viruses come from, a different arising of life), or it could have been a single proto-cell, with a membrane and (probably) RNA as its inheritance material. We just don't know and short of a time machine, we may never know.\n\nBasically due to now Archaea and Bacteria reproduce (and we think LUCA was most likely an Archaea), there probably was a specific single-celled organism from which all life is decended, but for the sake of our sanity most people tend to think of a species instead. And the same goes for the formation of the very first proto-cell",
            "score": 4,
            "author": "Cultural-Opposite937"
        },
        {
            "level": 0,
            "comment": "We call the first cell LUCA, Last Universal Common Ancestor.\n\nYou can interpret ancestor however you want imo, but for me species makes more sense because you can't possibly pinpoint the moment where organic matter became the first living cell. It was a gradient and if even if we knew what the process looked like we'd argue over semantics of where exactly this point is. Which is nonsense imo, because the point of a living being was probably overstepped and backtracked multiple times until the gradient shifted more into one direction. The entire discussion would be pointless, so I think species makes much more sense.",
            "score": 2,
            "author": "Not_Leopard_Seal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, that's what I was thinking. Question just came up because this was a random topic with coworkers and pretty much all of them were referring to it as an individual cell rather than a species of cell.. and I was the oddball with saying it was most likely a species than individual.",
                    "score": 1,
                    "author": "FatherOfNyx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly it doesn't matter much. I think it would be more scientific to refer to LUCA as a species, but again, that's semantics and I don't think this discussion is worth to have",
                            "score": 1,
                            "author": "Not_Leopard_Seal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's fine.\n\nI'll skip replying to your other one to me, since it wouldn't really lead to anything. Fun, but not productive.",
                                    "score": 1,
                                    "author": "chem44"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Your general approach seems good.\n\nBut how does that lead you to suggest first species is better than first cell here?\n\nWe know what cells are. Species remains a useful idea, but without any clear specific meaning.",
                    "score": 1,
                    "author": "chem44",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We know what cells are, but we don't know what the first cells were. How much of the first cell was organic matter, and how much of it was part of the white smoker it first evolved in. The current hypothesis is that the white smokers pores had the function of a semipermeable membrane in the first cells.\n\nBut that already differs significantly from what we know about cells today, as the semipermeable membrane that we know is a fat layer.\n\nAnd that's what I mean with discussion over semantics.",
                            "score": 1,
                            "author": "Not_Leopard_Seal"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You need a brick to create a wall.",
            "score": 1,
            "author": "Entropy_dealer"
        },
        {
            "level": 0,
            "comment": "The first cell preceded the first species. \n\nThey seem like different points.",
            "score": 1,
            "author": "chem44",
            "replies": [
                {
                    "level": 1,
                    "comment": "What if I changed it from species to group? Was the first cell literally one cell that all life on Earth came from? Or was it a group that were going through the same processes of abiogenesis?",
                    "score": 1,
                    "author": "FatherOfNyx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I suppose the  best answer is that we don't know.\n\nWe make models of what likely happened, but know pretty much nothing about details.\n\nIt is also easy to get bogged down in words, going well beyond any meaningful info.",
                            "score": 1,
                            "author": "chem44"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If my biology doesn’t fail me, it was the protocell? \n\nAnd for humans, it was the eukaryote. \nMight be super wrong though haha, it’s been 20 years.",
            "score": 1,
            "author": "BourbonGod"
        }
    ]
}