{
    "id": "13ui32p",
    "score": 184,
    "title": "Is this a spider egg sac or a caterpillar cocoon?",
    "author": "countcoleman",
    "date": 1685326477.0,
    "url": "https://www.reddit.com/r/biology/comments/13ui32p",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m not sure what it is but it’s sitting above my door frame",
    "comments": [
        {
            "level": 0,
            "comment": "It's a butterfly chrysalis.  That's the exoskeleton of the animal, secured by a bit of silk to the screen.  Some species of moth spin extra silk into a cocoon (basically a silk sleeping bag) around their body before they shed their last  caterpillar exoskeleton into the chrysalis exoskeleton.  You can see the caterpillar exoskeleton to the left of the silk attachment.  The next time either kind of animal sheds the exoskeleton, it will have wings and be able to mate.",
            "score": 51,
            "author": "OphidianEtMalus"
        },
        {
            "level": 0,
            "comment": "That's a mourning cloak butterfly chrysalis. I see them occasionally in my part of the world.",
            "score": 12,
            "author": "PaulieC11",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, Mourning Cloak. Too spiky to be a swallow tail.",
                    "score": 7,
                    "author": "keinaso"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks like a Swallowtail butterfly chrysalis.",
            "score": 42,
            "author": "KuraiTsuki"
        },
        {
            "level": 0,
            "comment": "See those “spikes” lined up in vertical pairs? Those were the caterpillar’s legs. It’s a cocoon",
            "score": 56,
            "author": "EldridEinherjar",
            "replies": [
                {
                    "level": 1,
                    "comment": "First of all, those spikes are not legs. Although caterpillars can have up to five pairs of prolegs, which are the soft fleshy appendages that are located toward the posterior end of the larva, like all other insects (which belong to the **Hexa**pod subphylum of arthropods) they only have three pairs of spiky true legs. I'm counting four prominent pairs of spikes in this picture, though I think there may be as many as eight or nine in total, so definitely not caterpillar legs.\n\nSecond, I believe this to be a chrysalis and not a cocoon. While crysalides are the pupal forms of butterflies (which is to say that they're the animals, themselves), cocoons are external structures made of silk and debris that are spun by moth caterpillars (along with other types of insects, such as wasps), within which they pupate. Contrary to popular belief, butterfly caterpillars do **not** spin cocoons, though other animals (like leeches) do, albeit for different reasons (i.e. to protect their eggs, in the case of leeches).",
                    "score": 30,
                    "author": "EmergencyExit2068",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So many children's books lied to me!",
                            "score": 8,
                            "author": "petit_cochon"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -28,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I actually found them very informative. What's wrong with being pedantic on a very specific subreddit anyway? That's how we learn.",
                                    "score": 24,
                                    "author": "petit_cochon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There’s such things as “social norms”.  Sure he isn’t wrong, but he really didn’t need to nitpick or get up on a soapbox over petty details when the nature of op’s answer was simple and didn’t require it.",
                                            "score": -26,
                                            "author": "EldridEinherjar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's the Biology sub",
                                                    "score": 21,
                                                    "author": "EarthExile"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It’s a biology sub. If you are going to speak and explains something then you should be correct and have a reliable source (either through research or your credentials) to back you up.",
                                                    "score": 3,
                                                    "author": "Nebulae360",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It wasn’t being incorrect that I was annoyed by. It was the paragraph I was sent explaining the petty differences between a cocoon and a Chrysalis when it had nothing to do with OP’s question.   \nThe number of sycophants jumping on me for it just poured gasoline on the fire.",
                                                            "score": -2,
                                                            "author": "EldridEinherjar",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Well the difference between a cocoon and a chrysalis can be very important when the initial post is trying to identify said potential cocoon or chrysalis or egg sac. I understand why it’s upsetting though.",
                                                                    "score": 2,
                                                                    "author": "Nebulae360"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Your nonsense about \"caterpillar legs\" had nothing to do with OP's question either.",
                                                                    "score": 1,
                                                                    "author": "Sekwa"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": -10,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Lol you’re making statements you have apparently no clue about and you say this? At least be grateful, this person just learned your ass.",
                                    "score": 7,
                                    "author": "Mycophyliac"
                                },
                                {
                                    "level": 3,
                                    "comment": "You read that as 'pedantic', I read that as 'not misinforming people'.",
                                    "score": 11,
                                    "author": "hfsh"
                                },
                                {
                                    "level": 3,
                                    "comment": "This is a biology sub and I was simply trying to ensure that visitors to it who may not know about this particular biological topic are not misinformed.",
                                    "score": 14,
                                    "author": "EmergencyExit2068",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -17,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "wow, good luck with content creation with this attitude towards comments",
                                                    "score": 4,
                                                    "author": "conzstevo"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'm sorry that you're apparently a lot more concerned about being \"right\"/popular than you are about actually learning something.",
                                                    "score": 14,
                                                    "author": "EmergencyExit2068",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "https://mahadeviyakka.wordpress.com/2020/03/20/pelt-the-pedant/",
                                                            "score": 0,
                                                            "author": "EldridEinherjar"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": -5,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I appreciated their explanation.",
                                                                    "score": 7,
                                                                    "author": "1heart1totaleclipse"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Pelt the jackass. He is educating not being a pedant.",
                                                                    "score": 6,
                                                                    "author": "EthelredHardrede"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Bro you really can’t handle being wrong….like, this is childlike levels of denial",
                                                                    "score": 5,
                                                                    "author": "Ohiolongboard",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "fr this might be one of the goofiest threads I've ever read. It's giving lack of critical thinking",
                                                                            "score": 4,
                                                                            "author": "rosetheweeb"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's a biology subreddit.",
                                    "score": 3,
                                    "author": "HadMatter217"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Bot message:** Help us make this a better community by clicking the \"report\" link on any pics or vids that break [the sub's rules.](https://old.reddit.com/r/biology/about/rules/) Thanks!\n\n**Disclaimer:** The information provided in the comments section does not, and is not intended to, constitute professional or medical advice; instead, all information, content, and materials available in the comments section are for general informational purposes only.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/biology) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "TIL that's how you put up those door nets",
            "score": 1,
            "author": "Forsaken-Average-662"
        },
        {
            "level": 0,
            "comment": "Poke it",
            "score": -10,
            "author": "ConstantProgress83"
        },
        {
            "level": 0,
            "comment": "Caterpillar cocoon.",
            "score": -1,
            "author": "TriceratopsHorridus"
        }
    ]
}