{
    "id": "13xefv0",
    "score": 10,
    "title": "Why do moths drown themselves?",
    "author": "deviantmoth",
    "date": 1685616957.0,
    "url": "https://www.reddit.com/r/biology/comments/13xefv0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have a habit of leaving a cup of coffee on the windowsill and completely forgetting its there. But since I don't mind cold coffee, when I go back to drink it, there's a 5% chance it has a dead moth or gnat floating on the surface. Moths don't have mouths. What'a going on?",
    "comments": [
        {
            "level": 0,
            "comment": "Because it's at the end of its life cycle",
            "score": 6,
            "author": "HaileyParrote",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean, what's attracting it to my coffee?",
                    "score": 5,
                    "author": "deviantmoth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had one in my hard cider the other night. It was swimming along like it didn’t just ruin it",
                            "score": 4,
                            "author": "Death_Watcher_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. They get thirsty and have adapted to expect a certain level of surface tension to keep themselves from drowning while drinking from natural water sources - a lot of drinks have different surface tensions and thus will trap the moth and drown it when it lands.\n\n2. They mistake the reflections on the surface of the drink in low light conditions for an actual light source and end up in the drink and drown.",
            "score": 6,
            "author": "Paracelsus19"
        },
        {
            "level": 0,
            "comment": "They are concerned about your protein intake",
            "score": 4,
            "author": "HouseSparrow873"
        },
        {
            "level": 0,
            "comment": "my guess is theyre attracted to a lamp nearby, then when the light goes out they start moving around looking for another light, and being clumsy flyers end up in the drink",
            "score": 2,
            "author": "Small_Kaiju"
        },
        {
            "level": 0,
            "comment": "Some moths do have mouths and may drown. They may also land not realizing it is a liquid and get stuck.",
            "score": 1,
            "author": "Arthkor_Ntela"
        },
        {
            "level": 0,
            "comment": "Because moths are agents of evil and Satan. They deserve to be destroyed on sight",
            "score": -10,
            "author": "RepresentativeAd3433",
            "replies": [
                {
                    "level": 1,
                    "comment": "Virgin moth hater:\n\nCasual moth enjoyer:",
                    "score": 8,
                    "author": "deviantmoth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "😂 I’ve had a phobia of moths since I was like 5 years old.",
                            "score": -2,
                            "author": "RepresentativeAd3433",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So this is like you're worst fear?\n\nhttps://ifunny.co/picture/dad-can-there-s-a-moth-outside-of-the-bathroom-dDekRJ9N8?s=cl",
                                    "score": 3,
                                    "author": "Colorado_Girrl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not even gonna click that",
                                            "score": 2,
                                            "author": "RepresentativeAd3433",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's that text conversation where someone is texting their dad a moth is outside the bathroom door. Dad doesn't get it right away and when he does he responds as the moth saying “Dad is dead. You're next. Love Moth.” no moth is pictured. I'm not that evil to people I don't know IRL.",
                                                    "score": 2,
                                                    "author": "Colorado_Girrl",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is Reddit. One learns to protect oneself",
                                                            "score": 2,
                                                            "author": "RepresentativeAd3433",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It is Reddit so I approve! I very rarely click links when I suspect I won't like what's on the other side.",
                                                                    "score": 2,
                                                                    "author": "Colorado_Girrl"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m irrationally afraid of moths(not butterflies idk why tho) but I’ll only kill it if it’s in my room outside he’s chilling",
                                    "score": 2,
                                    "author": "i_enjoy_music_n_stuf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t even kill them. I just completely fuck off. If there is a moth I am gone",
                                            "score": 1,
                                            "author": "RepresentativeAd3433"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Once when I was little I made myself a bowl of mushroom soup. I was so excited to eat it until I saw a gnat nosedive directly into it like his life depended on it. His exoskeleton instantly disintegrated or something. The guy opened up like a blooming flower.",
            "score": 0,
            "author": "JustAMessInADress",
            "replies": [
                {
                    "level": 1,
                    "comment": "Similar thing happened to me a few days ago. I made coffee, literally only a minute later there's a gnat in it.",
                    "score": 2,
                    "author": "deviantmoth"
                }
            ]
        }
    ]
}