{
    "id": "148425x",
    "score": 1,
    "title": "What (widespread) species have the most well understood geographic range (i.e. known to a very fine scale)?",
    "author": "Extension-Skill652",
    "date": 1686622790.0,
    "url": "https://www.reddit.com/r/biology/comments/148425x",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Homo sapiens ??",
            "score": 5,
            "author": "chem44",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's honestly the correct answer but I'm trying to think of an animal species (excluding humans) to use for a research project",
                    "score": 2,
                    "author": "Extension-Skill652",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Any regulated species — likely endangered and/or of national significance. Pandas. Bald eagles. White rhino.",
                            "score": 2,
                            "author": "BolivianDancer"
                        },
                        {
                            "level": 2,
                            "comment": "It's an interesting question.\n\nWhen you say well understood, did you actually mean well-described? That is, do you want where or why? Either is fine, but they are different, so be clear.\n\nThere may be some good data for farm animals, but that is not 'natural'.\n\nThere is interest in ranges changing with climate change, eg, some things moving north. That might lead to some ideas.",
                            "score": 1,
                            "author": "chem44"
                        },
                        {
                            "level": 2,
                            "comment": "Mice or rats?",
                            "score": 1,
                            "author": "Grief-Heart"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Try https://www.inaturalist.org/ I doubt there is a specific identifiable species that fits your question - but rather there are quite a few that might fit your needs.  INaturalist can give you a good starting place to explore a variety of species and their geographic ranges.",
            "score": 3,
            "author": "Cookgypsy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was actually hoping to use iNaturalist with some data manipulation and compare that to an already created map of a species so while it is a good place for this the way I want to use it is like the one caveat because I can't really compare it against itself",
                    "score": 2,
                    "author": "Extension-Skill652",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You might consider looking into the Natural Heritage Network, a set of partners in each of the 50 US states, most Canadian provinces, and many Latin American countries that collectively house a network program dedicated to gathering and developing biological information on species of conservation concern and natural vegetation communities. They might be able to help you with a comparative dataset, but be prepared to be very specific about your needs.",
                            "score": 2,
                            "author": "Cookgypsy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Marine phytoplankton have a pretty decently defined geographic range since they can be observed with satellites as long as there isn’t major cloud cover. Down to the species can be trickier though- E. Huxleyi probably has the best chance. \nI’ll bet some species of trees and grass are also pretty well defined.",
            "score": 2,
            "author": "userwholikesthings"
        },
        {
            "level": 0,
            "comment": "Terns or other birds that get ringed.",
            "score": 2,
            "author": "Brrrtje"
        },
        {
            "level": 0,
            "comment": "Im a plant guy and for plants I'd say invaders. Needed for control and anticipatory energies. Maybe wild boar? I know we are quite concerned about their spread in Canada",
            "score": 1,
            "author": "Gravytrain467"
        },
        {
            "level": 0,
            "comment": "Maybe an invasive species - e.g. an agricultural, forestry or fisheries pest? Their spread is usually tracked closely.",
            "score": 1,
            "author": "Kanye_Wesht"
        }
    ]
}