{
    "id": "1485uw3",
    "score": 1,
    "title": "Is it true that Biology majors are lowly paid?",
    "author": "Brilliant_Writer_136",
    "date": 1686628701.0,
    "url": "https://www.reddit.com/r/biology/comments/1485uw3",
    "media_urls": [],
    "other_urls": [],
    "postText": "As a kid, I wanted to be a scientist because I had seen a movie where a doctor creates a robot that has feelings and he becomes famous due to his creation. I wanted to do something similar with Plants. I wanted to study biology in University and take science stream in 11th and 12th.\n\n\n\nMy father, who was a typical business man said that science majors are the worst STEM degrees because learning the periodic table, learning about gravity, relativity and learning the respiration process and knowing that the mitochondria is the powerhouse of the cell doesn't provide any market value. He would take me to his friends' house who were a couple that both studied botanical sciences and we're working as researchers. I don't mean to be rude, but there lifestyle was just so different from ours's. My Dad studied accounting and finance and opened his own buffet business and my brother joined him.\n\n\n\nI was also forced to study the same subjects and honestly, I'm doing amazing. Not only is my pay very satisfactory, especially for a single man with no dependants, but I'm also running a small online accounting examination guidance and Financial consultancy service. I was very mad at my father for forcing me to study numbers and computer systems and economy (Also made me do an MIS degree and made me minor in economy) instead of plants and organisms. But, I'm pretty greatful for my education. My friend, who studied exactly what I wanted to study, Botany and Microbiology, is not doing well financially. He used to be a researcher but switched to academia and isn't doing well. He says his reality is quiet different from his past expectations. He says its embarrassing for him to work in the same school he studied in and getting paid less by the school than he had to pay the school as a student.\n\n\n\n\nI read his books and realized that his subject so much harder than mine. Even tho I had a great interest in eventually becoming a botanist and making a living, talking plant (Stupid 14 YO me), the BSc Biology would have been the end of me. And for what, financially struggling like my friend who Hates his life?\n\n\n\nI can't believe that I'm making such an incredible living having studied numbers (Forcefully by Father) than my friend is making having studied exactly what I wanted to study. His grades are also incredible and I've always been an average student.\n\n\nIt's so unfair.\n\n\n\nPlease explain to me if it's true that Biology as a subject is low paying or not. And please explain why. P",
    "comments": [
        {
            "level": 0,
            "comment": "Business majors are smarter than stem majors because they decide how much we all get paid.",
            "score": 5,
            "author": "Sert5HT",
            "replies": [
                {
                    "level": 1,
                    "comment": "True.\n\n\n\nBut why are business majors easier to complete than STEM majors?\n\n\n\nLike, I know all the accounting rules, Financial laws, information systems and economic principles. But I could never memorize the Kreb's cycle. I could never memorize the difficult definitions you guys had to memorize. Yet, I get paid better.\n\n\nWhy?",
                    "score": 1,
                    "author": "Brilliant_Writer_136",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because businesses make money, science doesn't. Making money is not that hard; pay less than what you earn for others labor, be it physical or mental, and sell for more than cost of operations. Or be a tech startup like Uber and loose 9 billion dollars a quarter with literally no path to profitability.\n\nPaying yourself more for doing less is working smarter not harder, hence why business people are the smartest of us all. Morally admired? Perhaps loathed, but we don't pay people for trying we pay them for the money they can make us. \n\nBut seriously... A good CEO is better than a good scientist; no one breakthrough is a single person, but a single person can drive a company into the ground, and vice versa.",
                            "score": 2,
                            "author": "Sert5HT"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tbh I think some STEM degrees like bio are more of a toss up than business degrees. With business degrees, especially something like accounting, it’s pretty clear cut what kind of job you’re looking for, and there’s never really a question of what job is waiting for you. In terms of job security and overall success, business is a solid choice. Granted I know YMMV on any degree, so grain of salt and let’s assume a student that can at least hold a 3.0 average gpa. \n\nBiology, specifically, has a lot of variation in pay/job duties. With just a bachelor degree, you can end up limited to a lot of underpaying/overworked lab tech-style roles and competing for the few higher pay/growth opportunities that are available with just a bachelors. You also have to play smart in college, can’t risk slacking grades if you want internships, research opportunities, and trying to get into a masters or phd program if that’s your route. There’s also a gazillion different things you can do with a biology graduate program: med, environmental, bioinformatics, etc. All of these will end up with different pay scales and different amounts of debt:income. Also keep in mind that academia specifically versus private industry are completely different ballparks in pay scales. It’s well know that almost any academic role will underpay versus a private industry job. \n\nI lucked into a government role after a year of constant job hunting that only required a BS in bio, and managed to beat out the 150 other applicants. Less pay than if I went private industry, but still making above average for single income in my area, with steady annual increases not linked to performance. I find my job an important part of fulfillment in my life, and coming from a family full of accountants I think biology did what a business degree would not have done for me. If living a certain lifestyle is important to you, then a very reliable degree was definitely the right choice. You can make bank with biology, but often you’re dedicating your life to it and don’t always get the best work/life balance.",
            "score": 3,
            "author": "ditzydoodle"
        },
        {
            "level": 0,
            "comment": "It depends a lot *what* you do in biology. If you go into genetics, biochemistry, pharmacology and a few subdisciplines like that and you do really well at a good university, there's a decent chance you might land an industry position (either production or research) which is competitively paid and which has promotion chances. If your subject ends up being botany... you might land in the crop protection industry or something similar in the agricultural sector, which is not too bad, but chances aren't great. If you study\n\nAnd if you end up in academia, yeah, good luck. You're financially hosed for the rest of your life, there's almost no chance of ever getting a promotion, you will work horrible hours and it's not unlikely you'll spend most of your life jumping from one temporary position to the next, with one or two year contracts and the rest of your time spent looking for the next job.\n\nIf you're lucky, your work *will* be fascinating, though. And for some of us, that passion makes up for the rest of it.\n\nI've tried the industry gig. I was bored out of my mind and it wasn't even the worst job I could have gotten. But after a while, I just couldn't do it anymore, get up in the morning, go to some lab or office, and do the same thing over and over. Just couldn't do it. It got to the point where it was either drown myself or go back into academia, and I did the second. I'm in my mid thirties and I need roommates to afford a flat, but I'd say I'm still happier. \n\nThing is, most biological research will never produce anything that anyone wants to pay for. That's about it. At best, my work is going to make the list of species that have died out recently a few fractions of a percent longer.",
            "score": 1,
            "author": "Eldan985",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;go back into academia\n\nWhat exactly do you do? \n\n\n\n&gt;most biological research will never produce anything that anyone wants to pay for\n\n\nThen why study Biology? \n\n\n&gt;I'm in my mid thirties and I need roommates to afford a flat\n\nIs the pay really that bad?\n\nWould you mine sharing the number?\n\n\n\nWhat degrees do you have?\n\n\n\nWere you aware of the low pay before you entered Biology?\n\n\nWhat were your expectations?",
                    "score": 1,
                    "author": "Brilliant_Writer_136",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Degrees, job: PhD, currently on a Post Doc research position.\n\nMoney: Partially, the pay is that bad, partially, my university is in a really expensive city.\n\nWas I aware: yes. Everyone throughout my studies was very up front about it. I'm still one of the lucky ones, I managed to get a PhD position and then a job after it.\n\nWhy do I do it: everything else is boring. I just couldn't. \n\nAnd honestly, I'm not unhappy with my living standard. I can do what i want to do at work, I can come and go wherever I want without anyone telling me what hours to work, if I want, I can just stay in my office or lab space or greenhouse for several days in a row without talking to anyone. My flat is small, but we have a garden and a balcony, and I have my own room and I don't really need any more than that. The money isn't great, but it's enough for that, and I knew what I'd get going in.",
                            "score": 1,
                            "author": "Eldan985",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;PhD\n\nBruh. A Doctorate degree but can't pay rent?\n\n\nPlease tell me, exactly what kind of a pay is given to someone in a research position that they can't afford a basic necessity like a private place to live?\n\n\nWhy is biology so bad?\n\n\nIt's so hard to study even the Undergraduate degree, why can't the pay more?\n\n\nWhat was your PhD in?\n\n\n&gt;yes. Everyone throughout my studies was very up front about it.\n\nWhat did they say?\n\n\n\nWhy did you not choose some other subject?\n\n\n\nLiterally, a bachelor's in something as easy as accounting, a bachelor's can pay more than a PhD in Biology.\n\n\n\nI hate this world. And I love my father for slapping me when I tried to say that I'm gonna go against the grain and study biology and be a plant scientist. I'm so glad I got yelled at for saying that business degrees are for people with no life and no interest. I'm so glad I was threatened to be thrown out when I told my father I'm switching to Biology from BBA Finance &amp; Accounting.\n\n\n\nDid anyone try to pursuade you away from Biology?",
                                    "score": 1,
                                    "author": "Brilliant_Writer_136",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's not specifically biology. It's academia. We have standard federal work contracts and pay rates for all university positions.\n\n\\&gt;Please tell me, exactly what kind of a pay is given to someone in a research position that they can't afford a basic necessity like a private place to live?\n\nI don't like giving data that specific online. But I'm also in one of the most expensive cities in the world, that has a lot to do with cost of living.\n\n&amp;#x200B;\n\n&gt;What did they say?\n\nHalf of us in the Master's course wouldn't be working in what we're studying, or anything related to it, there's not enough jobs. Those that did would mostly be in badly paid temporary positions, doing a few internships, then try for a PhD, then do a few temporary post docs, then eventually drop out of academia, because there wouldn't be anywhere to go from that.\n\n&gt;Why did you not choose some other subject?\n\nMost academic positions pay like that. Standardized work contracts, at least across the sciences. And this was the most interesting one of them. It's what I wanted to do.\n\n&gt;Did anyone try to pursuade you away from Biology?\n\nNot my family or anyone like that. Study advisors, degree supervisors, tutors and research group leaders, yeah, kind of. They were all biologists and had all gone down that path and they all told us what the life was going to be like and that we should be very sure we wanted to do it. They all loved their jobs, though.\n\nAnd honestly, I don't *want* an easy degree. More salary would be nice, but even ten times the salary I have now wouldn't be worth it to do accounting instead of what I'm doing. I want to my research and write papers and go to conferences and talk to other people who do what they love. I don't see what I could get with money that would make up for that.",
                                            "score": 1,
                                            "author": "Eldan985",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;I don't see what I could get with money that would make up for that.\n\nPeace of mind. No regrets. A private place to live. Ability to raise a family on a single income. \n\n\n&gt;even ten times the salary I have now wouldn't be worth it to do accounting instead of what I'm doing.\n\nI make 217K just from my job. What times is that from the current job? (Just curious if you don't mind. I'll be deleting this post later. It's a very depressing thread)\n\n\n\nWhat exactly do you conduct research in?.\n\nWhat was your PhD in?",
                                                    "score": 1,
                                                    "author": "Brilliant_Writer_136",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't have a family. Or regrets. I'm really quite happy where I am.\n\nSalarywise... if you really have to know, about five times? A bit more? Before taxes, insurances, etc., that is.\n\nMy field's chemical ecology. Signal molecules between plants and insects, chemical defences and supression of those defences. Lots of fancy lab work on machines that cost literally millions. That's where the money goes, not into our salaries.",
                                                            "score": 1,
                                                            "author": "Eldan985",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;I don't have a family. Or regrets. I'm really quite happy where I am.\n\n\nMe too. I never wanted a family and don't have any dependants. Feels good to be free. \n\n&gt;Before taxes\n\nBelieve it or not, accounting teaches some useful tactics that can help you reduce taxes.",
                                                                    "score": 1,
                                                                    "author": "Brilliant_Writer_136",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I don't really have a problem with paying my taxes. I don't think it's worth my time to pay a bit less.",
                                                                            "score": 1,
                                                                            "author": "Eldan985"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I went into veterinary medicine, so that I could apply my love of science in a way that would guarantee employment.",
            "score": 1,
            "author": "ValeriusAntias",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please tell me the pay is good.\n\n\nI've yet to encounter a biology major who makes even close to 6 figures. I always wanted to be a plant scientist. But my father Forced me to be a business guy (which was the better route). But my friend told me how bad the pay is despite having studied Microbiology. He even has a masters but works in a school lab.\n\n\nHe is going for a PhD but someone told me that even a PhD in Biology doesn't pay well.",
                    "score": 1,
                    "author": "Brilliant_Writer_136",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, the pay can be very good (depends a lot on your kind of practice or where you are employed - e.g. welfare vets earn relatively little to say the vet for a feedlot company). \n\nI don’t live in the US, but recent graduates here earn more than recent accounting/ finance / law graduates / computer science graduates. Academia and private industry pay rather well and if you are strategic about your own practice you should have a decent income. \n\nYou probably won’t make nearly as much as a doctor treating human patients, but certainly enough to have a good quality of life.\n\nedit: wrt to your friend: they’ll need to leverage their expertise into a marketable commodity. Veterinary services are very marketable, I’m not so sure about your friend’s qualifications.",
                            "score": 1,
                            "author": "ValeriusAntias",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So, a PhD in microbiology won't get him a good pay?",
                                    "score": 1,
                                    "author": "Brilliant_Writer_136",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A PhD in microbiology can get you a high paying industry position, if you're lucky. Or it can get you a 50% teaching/50% research position at a university which pays enough to survive. Depends on which university you graduated from, how good your grades were, what exactly your thesis was, if you have industry connection, and if you know how to sell yourself to industry recruiters and if you can stand work culture outside a university.",
                                            "score": 1,
                                            "author": "Eldan985",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Can he make it to 80K?\n\n\n\nOnly makes $55,772 a year.",
                                                    "score": 1,
                                                    "author": "Brilliant_Writer_136",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Industry positions, I think, are pretty open ended in how much they can pay. If you run a department for an international chemical giant, you can probably make a lot more than that. \n\nIf you work at a university as a Post-Doc, 80k would be pretty much the upper limit. ETH Zurich pays that much, but that's in Switzerland *and* in one of the most expensive cities in the world. Everywhere else in the world is going to be much lower. Like, in Germany, where the salaries aren't *that* bad, a PostDoc makes 3000-4000 a month, before tax and insurance.",
                                                            "score": 1,
                                                            "author": "Eldan985"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So, a PhD in microbiology won't get him a good pay?",
                                    "score": 1,
                                    "author": "Brilliant_Writer_136",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It depends on where he finds work. It depends on what you define as “good pay”.",
                                            "score": 1,
                                            "author": "ValeriusAntias",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;good pay\n\nWell, I'm currently trying to get to 400K like my company's Chief Financial Officer. Am currently the Financial Controller.\n\n\n\nSo, my standards wouldn't be appropriate in Biology. I'd say he would be happy with 80K. Is that possible?",
                                                    "score": 1,
                                                    "author": "Brilliant_Writer_136"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;good pay\n\nWell, I'm currently trying to get to 400K like my company's Chief Financial Officer. Am currently the Financial Controller. 400K would be an 84% increase. \n\n\n\nSo, my standards wouldn't be appropriate in Biology. I'd say he would be happy with 80K. Is that possible?",
                                                    "score": 1,
                                                    "author": "Brilliant_Writer_136"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Biology BSc holders have a notoriously difficult time finding their first job, and they are unlikely to hit 6 figure salaries if working in research (in North America). PhD holders have an even harder time finding their first job from what I've seen unless they are well connected. As an end career thing BSc holders might hit 80k eventually? Unless they switch to management or some science-adjacent role. Very likely they won't make it to a leadership role where they call the shots for a science project. That's more the realm of PhD holders. If you are a PhD holder you *could* start at 80k-120k (in NA), but competition is stiff and many people end up leaving the \"scientist\" role after their PhD whether they are burnt out from their grad school or from being forced out because they weren't competitive enough (actually I think at this point it's more about luck and being well connected than honest-to-God merit, but that's just IMO). In academia postdoc salaries can vary, but Canada has a minimum of around 36kCAD I think (but often people are offered something more like 50kCAD), in the US the NIH minimum is approximately 56kUSD and some places offer about 65kUSD, many places in europe are something like 30kEUR iirc, and ETH Zurich currently offers 90kCHF (swiss francs, nearly 100kUSD) as a guideline, but it is not a minimum (also keep in mind that Zurich is an absurdly expensive place to live and you almost certainly will not be setting roots down there).\n\nThe sciences pay little at least in part because 1) it's a \"passion career\" and the fact that you like what you do used against you to pay you less, 2) it's a high-risk high-reward venture, so in order to get a reasonable return on investment a high volume-low cost approach is taken, 3) non-salary costs are significant (paying for lab space, reagents, and specialized equipment isn't cheap) and to balance this salaries tend to be lower for everyday workers, and 4) the general public tends to not be interested in the process of science, which combined with the high-risk high-reward nature of it means it has low commercialization potential on average.\n\nIt is unfair, but if you really care you can write your political leaders and advocate for higher investment in publicly-funded basic scientific research. A large portion of scientists view scientific knowledge (at least in principle) as a public good that is funded by your tax dollars. Universities tend to exploit the naive optimism and idealism of young people interested in science. I think that more students are wising up to the realities of the scientific career these days though and if they pursue a graduate degree are very post-grad job-focused... or financially supported by parents/a spouse. \n\nSorry I tried to keep this short but the post is actually very long.",
            "score": 1,
            "author": "throwawayAsMyResume",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Sorry I tried to keep this short but the post is actually very long.\n\nI like it big.\n\n\n\n\nI can finally see why my father beat the shit outta me when I was fixated on studying Biology and becoming a botanist.\n\n\n\nHe Forced me to be a numbers cruncher and I'm very grateful.\n\n\n\n\nCan you please tell me how I could have gotten into botany starting from a Biology Bachelor's and what my pay would be?",
                    "score": 1,
                    "author": "Brilliant_Writer_136"
                }
            ]
        }
    ]
}