{
    "id": "148nroc",
    "score": 331,
    "title": "Horse flies \"bite\" through clothes and this is how:",
    "author": "Psychological-Try800",
    "date": 1686685316.0,
    "url": "https://www.reddit.com/r/biology/comments/148nroc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Got a horse fly from a friend today. These things are metal AF! Did a light preparation before pinning to unveil the MASSIVE needle they use to get to your sweet, sweet red juices. Enjoy the nightmares 😉",
    "comments": [
        {
            "level": 0,
            "comment": "The method is that they slice the skin like a razor and lick it as it drips out.  So when they miss and go for a second hit, it hurts extra.",
            "score": 40,
            "author": "SlimeySnakesLtd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah, the classic \"scrape, and then lick!\" Guess the Vampires learned that one from horse flies, then?",
                    "score": 3,
                    "author": "Amicus-Regis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Underrated comment holy fuck.",
                            "score": 5,
                            "author": "AstrosFan4"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Horsefly bites are PAINFUL. I grew up an outdoorsy kid but in a place that didn’t normally have them, so when I was 10 miles back on a hike as an adult and one started following me I initially laughed it off— to the annoyance of my friends who had lived their while lives in “horsefly country”. I even declined repellant spray \n\nThen it bit me, and kept coming back for more even after applying spray. Maybe it was just me but the bites hurt for hours afterward and I couldn’t help but try to avoid every giant flying thing I saw after that. I HATE wasps but I’d have preferred one to the bitey bastard that was following me on that hiking trip\n\nEdit: I saw someone else mention that they hunt you and I will echo that it absolutely felt like she was hunting me for another five or so miles of that hike",
            "score": 79,
            "author": "aryukittenme",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a memory as a child and being hunted by a horsefly in our pool. It bit me and hurt like hell, and I ran around the yard and pool to try to escape  it. That fucker was following me.",
                    "score": 37,
                    "author": "AbbreviationsGlad833",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude. I’m 25 years old and am still terrified of these things due to a similar situation lmao. I was swimming in a lake when I was little, I was far out and one started biting me on the top of the head. I kept swimming underwater but no matter where I popped up, it would bite me on the head again. They’re doing it for sport I’m sure of it",
                            "score": 22,
                            "author": "Nedschneebly2"
                        },
                        {
                            "level": 2,
                            "comment": "Got to use your pool noodles dude. My brothers &amp; I hunted them as children, and when they attacked, we would hit the deck(water).",
                            "score": 3,
                            "author": "GeneralTrasch"
                        },
                        {
                            "level": 2,
                            "comment": "It was intending to eat all of you.",
                            "score": 3,
                            "author": "canuck_11"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Went for a run in the woods a couple years ago up in CT at my Uncles house. I was wasnt running too fast or consistently on the way there, but I got ab 6 miles out before this one fucking horsefly wouldnt leave me alone, so I turned around and booked it through a less open side trail designed for bikes. For 3.5 miles that fucker chased me. Id stop to catch my breath and hear bzzzzzzzzzzzz and have to go again cuz they fucking hurt. \n\nFunny thing is, I never got bit by the horsefly but I found a tick on my dick the next day",
                    "score": 12,
                    "author": "society_man",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "An exhibitionist in nature, I presume?",
                            "score": 4,
                            "author": "TrippyReality",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "💀💀💀 nosir idek how tf it got there but the idea of me running butt booty naked in the woods w my dick doin the thug shaker is absolutely hilarious",
                                    "score": 4,
                                    "author": "society_man"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "These and deer flies can fuck right off.  They’re aggressive and relentless.  At least mosquitoes and ticks have the courtesy to make it painless.",
                    "score": 9,
                    "author": "zsloth79",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Deer flies are annoying but at least they won’t bite right away you can usually just swipe at them",
                            "score": 1,
                            "author": "MegaFatcat100"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah they make a super deep and distinctive humming sound, like you can hear them following you even if you can't see them.\n\nI did a 5 day beach hike once and they would congregate at our camp in the morning but would leave after we lit a fire, they hated the smoke.",
                    "score": 9,
                    "author": "SappyCedar"
                },
                {
                    "level": 1,
                    "comment": "I'd kind of forgotten about these assholes until I was spending time at Lake Superior the last couple summers. \n\nI noticed from another beach they MOSTLY left me alone when I went in the water... but here I was knee deep in the water and these jerks were literally flying laps around me like sharks. I had a relatively efficient method of whipping them with my shirt, but I spent as much time fighting as I did picking rocks. \n\nI warned the couple getting ready to head down when I was on my way out that they NEEDED bug spray. Those things are simply ferocious. I guess after chomping on deer and other thick skinned critters humans are like a dessert buffet.",
                    "score": 1,
                    "author": "HelmSpicy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I once had to endure multiple horsefly bites for a few minutes straight, while I sat perfectly still.  \n\nI was sitting in a shallow pond and tiny little fish were swarming around me. I wanted to observe them. But every time I got bit by a horsefly I would twitch or move, and the fish would be scared away.  \n\nSo I sat perfectly still ensuring the pain. But it was worth it because those fish were awesome, (and the horseflies eventually give up). The little fish started nibbling me all over my body. It felt like I was being tickled and massaged at the same time.  \n\nI even caught a couple of the horseflies and threw them into the school the fish. They rip them apart and ate them.",
            "score": 20,
            "author": "Ban-Hammer-Ben"
        },
        {
            "level": 0,
            "comment": "Funnily enough, I’m working aquatics staff at my scout summer camp right now. Horseflies are constantly all over us at the pool. The trick is to let it land, don’t move no matter what, even if it bites you, and then smack the shit out of it and stomp on it. My kill count since last Sunday is probably close to 100. The small ones won’t be able to draw blood, but the big ones are terrifying and must be killed before they bite you.",
            "score": 15,
            "author": "TyGuy_275"
        },
        {
            "level": 0,
            "comment": "Bought one of those electric flyswatters, wade out into pond waist deep. Play tennis with horse flies out of revenge and hate.",
            "score": 12,
            "author": "Appropriate-Stop-353",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ahhh that satisfying crack when you make contact",
                    "score": 1,
                    "author": "wyze-litten"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate horseflies with all my heart and soul.",
            "score": 10,
            "author": "MoonPool06"
        },
        {
            "level": 0,
            "comment": "Horseflies were a myth to me until one fateful backcountry camping trip, where we had to hike in dense bush. Those m-f’ers hurt like a biatch. If I could’ve punched one in the throat, I would’ve.",
            "score": 10,
            "author": "FullOfHotAire"
        },
        {
            "level": 0,
            "comment": "Wait,there are flies that feed on blood?",
            "score": 24,
            "author": "0percentstraight",
            "replies": [
                {
                    "level": 1,
                    "comment": "Horse flies do. They usually feed on nectar but the females will feed on blood for protein to lay her eggs. They hurt like hell too. Cattle and horses can’t effectively brush them away so they’ve never had a selective pressure to develop a less painful bite like mosquitoes have.",
                    "score": 47,
                    "author": "wollawolla"
                },
                {
                    "level": 1,
                    "comment": "Among others, there are\n- mosquitoes\n- horse flies\n- black flies\n- stable flies\n- sand flies\nand that's just a couple of them. There's also the true bugs (kissing bugs and bed bugs), fleas, and some crazy vampire moths (yes that's blood sucking butterflies!!!) as well as lice.\n\nMore of them on earth than we'd like to know about 🤣",
                    "score": 35,
                    "author": "Psychological-Try800",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Botflies are nightmare fuel.  When they bite, they inject hundreds of their microscopic eggs under the skin where the larvae/maggots grow after time  and squirm around, and there is no medical treatment but to wait it out until they crawl out of your skin. Leaving many tiny bloody holes and then an antibiotic cream can be applied to all the holes to prevent infection.  Isn't that nice?",
                            "score": 13,
                            "author": "AbbreviationsGlad833",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cover with duct tape and suffocate? Probably wouldn’t work if they can survive under the skin anyway but why not find out",
                                    "score": 5,
                                    "author": "solitudechirs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Maybe, but then they would rot and you’d get an infection",
                                            "score": 2,
                                            "author": "mickeymouse6900"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nah, you can pull them out, \n\nBut the idea of feeling them moving around inside you.. JFC No!",
                                    "score": 1,
                                    "author": "dan_dares"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Found out about black flies (buffalo gnats, right?) during a family trip to the Smokey mountains. Took the family to the mountain stream for a dip and quickly had to run back to the car lol. Idk how the other people were tolerating those things and they were out in force.",
                            "score": 9,
                            "author": "Zalens5151",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, them's nasty. We had to evacuate to the cars in Sam Houston Forest before, horse flies will hunt you 😱",
                                    "score": 9,
                                    "author": "Psychological-Try800"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Are deer flies on your list by another name? We have those around here. Mini horse flies but their bites hurt just the same. They love swarming around heads.",
                            "score": 8,
                            "author": "BJacks135"
                        },
                        {
                            "level": 2,
                            "comment": "Don’t forget about deer flies. They have chased me while I was on an atv. Even if you go really fast, when you slow down, they’ll catch up to you. They will follow for miles",
                            "score": 9,
                            "author": "CaptObviousHere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Was on my small aluminum boat with a 9.9 hp on it. Engine wide open and a deer fly circling my head , they're fast",
                                    "score": 6,
                                    "author": "Blank_bill"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And all of which that are listed are vectors for zoonotic/parasitic diseases",
                            "score": 6,
                            "author": "TikkiTakiTomtom"
                        },
                        {
                            "level": 2,
                            "comment": "don't forget about deer flies! We get a ton of those in Ohio, they don't hurt as bad as a horsefly but they are relentless and there are so many more of them!",
                            "score": 1,
                            "author": "gridpoet"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The horrid little bastards n itchy as fuck after",
                    "score": 6,
                    "author": "vicioustowel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn hard to kill, too.\n\nSwat it with your hand against your horse's back, you can see it fall to the ground - but it will be back in the air soon enough.\n\nSwat it against your horse's back, and roll your hand to break up its wings... well, it may never fly again - but it will still be alive.  You've got to be sure to crush it completely.\n\nYeah, I'll circle back to make sure they're dead.  I hate them with a passion.",
            "score": 21,
            "author": "Journeyman-Joe",
            "replies": [
                {
                    "level": 1,
                    "comment": "The only thing worse than being bitten by a horse fly is being on (or near) a horse that has just been bitten by a horse fly.",
                    "score": 16,
                    "author": "Casharoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even a horse that's trying to get away from one...",
                            "score": 3,
                            "author": "Journeyman-Joe"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You're a nice person for giving them the mercy of a quick death.",
                    "score": 6,
                    "author": "snailpubes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well... I suppose that I can take credit for trying to be humane.  But mostly I want to make sure that they are **dead, dead, dead**! Never to bite a horse again.\n\nAnd once, to get a specimen to photograph for scale, like the OP's picture.  People don't believe how big they are.",
                            "score": 7,
                            "author": "Journeyman-Joe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For anyone reading this and wondering, they're only just barely smaller than you average bumblebee... but 20x faster.",
                                    "score": 4,
                                    "author": "snailpubes"
                                },
                                {
                                    "level": 3,
                                    "comment": "Do electric tennis racquets work on them? Cuz I've smacked the shit out of some cluster flies (the slow fat fucks that buzz around food) and they will take a lickin and keep on kickin",
                                    "score": 1,
                                    "author": "wyze-litten",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "some of them are better than others. plus fresh batteries. \n\nI found one that could even kill big roaches, now THAT had some kick to it.",
                                            "score": 1,
                                            "author": "dan_dares"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I swat them\nOff my horses, then carry them\nOver to hand feed them to my turkeys.   Let those damn flies feel\nWhat it’s like\nTo get bit.",
                    "score": 1,
                    "author": "farmerJayinOH"
                },
                {
                    "level": 1,
                    "comment": "So they’re like a tick.. won’t die 😩😑",
                    "score": 1,
                    "author": "EnthusiasmPossible02"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had one bite me through a shirt and t-shirt when i was a kid. Extremely painful.",
            "score": 6,
            "author": "dumparoni"
        },
        {
            "level": 0,
            "comment": "**Bot message:** Help us make this a better community by clicking the \"report\" link on any pics or vids that break [the sub's rules.](https://old.reddit.com/r/biology/about/rules/) Thanks!\n\n**Disclaimer:** The information provided in the comments section does not, and is not intended to, constitute professional or medical advice; instead, all information, content, and materials available in the comments section are for general informational purposes only.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/biology) if you have any questions or concerns.*",
            "score": 5,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "We should start a breeding program to favor small proboscis until they are too small to get us.",
            "score": 4,
            "author": "denisebuttrey"
        },
        {
            "level": 0,
            "comment": "Ahhh Needles my old friend.",
            "score": 2,
            "author": "_rutanimal"
        },
        {
            "level": 0,
            "comment": "I go fishing and from April to about mid June in the middle of the sea we get freaking horse flys attacking us. I always bring long cloths packed just incase and a bug spray. \n\nF*** horse flies",
            "score": 2,
            "author": "bk27465"
        },
        {
            "level": 0,
            "comment": "Don’t be shy everyone- invest in an electric fly swatter and hunt these fuckers back.\n\n\nI would also like to add the note that insect populations are on the decline and insects are essential to us and our ecosystems and to please think twice about killing a bug in your house or outside. But also fuck these guys specifically- electrify them.",
            "score": 2,
            "author": "Basiccc_cloud",
            "replies": [
                {
                    "level": 1,
                    "comment": "Man, I don't even care if it causes a complete ecosystem collapse and results in the end of life on earth, horseflies still need to die.",
                    "score": 3,
                    "author": "Person012345"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think I've ever actually gotten a horse fly bite.  But I have had them stalk me while swimming dozens of time",
            "score": 1,
            "author": "canadas",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you aren't sure then you probably haven't.",
                    "score": 1,
                    "author": "Person012345"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t wear black and you better fight back",
            "score": 1,
            "author": "Pallerie"
        },
        {
            "level": 0,
            "comment": "Hate those little bastards",
            "score": 1,
            "author": "watthewmaldo"
        },
        {
            "level": 0,
            "comment": "This is one solution that I fully intend on trying: https://youtu.be/ushspW_Fhz0",
            "score": 1,
            "author": "fuckpudding"
        },
        {
            "level": 0,
            "comment": "What area are they found in?",
            "score": 1,
            "author": "EnthusiasmPossible02"
        },
        {
            "level": 0,
            "comment": "What convenient timing, they're out in FULL force where I live right now. I hate them more than any other insect.\n\nThey're not metal, they suck!!!",
            "score": 1,
            "author": "NPC_Jay"
        },
        {
            "level": 0,
            "comment": "Hey fuck off you skin raping vampire bug!  Jesus Christ on a cracker, they can even bite through clothes!?! wtf are we supposed to do?!?",
            "score": 1,
            "author": "heavy-metal-goth-gal"
        },
        {
            "level": 0,
            "comment": "I fucking hate horseflies. There are bugs I might otherwise dislike (such as wasps and hornets) that I have an alliance with because they gank horseflies.",
            "score": 1,
            "author": "Person012345"
        },
        {
            "level": 0,
            "comment": "My nine month old got bit by a horse fly this past weekend when we were out for a hike. Let me tell you I was so mad at that thing. Fuck horse flies man.",
            "score": 1,
            "author": "Juella_de_chill"
        }
    ]
}