{
    "id": "da5ihn",
    "score": 3907,
    "title": "This note on our university's confocal",
    "author": "SamMee514",
    "date": 1569613642.0,
    "url": "https://www.reddit.com/r/biology/comments/da5ihn",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I can't believe the manufacturer didn't build a cooling cycle into the device for that kind of money. It should be automatic.",
            "score": 407,
            "author": "LAMATL",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah!  hard to believe. They build cool down cycles into classroom projectors to protect lamps worth a few hundred at most, why not in a device with a $12k tube?",
                    "score": 185,
                    "author": "zapfastnet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Allow a problem to occur and sell the only fix at an extreme markup",
                            "score": 164,
                            "author": "tha-biology-king",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sounds like apple",
                                    "score": 69,
                                    "author": "adv3rsace",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They were the pioneers of it",
                                            "score": 30,
                                            "author": "tha-biology-king",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Now where can I get a stand for this monitor...",
                                                    "score": 17,
                                                    "author": "-bryden-",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Still cheaper than a stack of textbooks.",
                                                            "score": 11,
                                                            "author": "ThePoorlyEducated"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Or Micro$oft, take your pick.",
                                            "score": 0,
                                            "author": "rpgnymhush"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "r/assholedesign",
                    "score": 17,
                    "author": "MonkeyJesusFresco"
                },
                {
                    "level": 1,
                    "comment": "Bio-Rad made a qPCR mashine with all the optics built in a flipping lid. It's forbidden to open and close this lid with your hand when you put your PCR plate inside, or else you would damage the instrument (there is a button to open the lid, another button to close it). Still, closing the lid manually is a natural thing and Bio-Rad representatives told us that this is the most frequent reason of breakage for this model. We had to write the warning about it in HUGE letters on the lid itself because this PCR mashine is used all the time by all the people in the lab, and we can't afford to repair it.",
                    "score": 18,
                    "author": "smeghead1988"
                },
                {
                    "level": 1,
                    "comment": "Depends how old the piece of equipment is.  As hinted at by the price of the laser these as not cheap and you will keep using one until it permanently breaks down, even if you get a second one through a new grant unless you don't have space for it but even then most labs / institutes / departments will find a way to keep it and house it elsewhere.",
                    "score": 1,
                    "author": "GMoI"
                }
            ]
        },
        {
            "level": 0,
            "comment": "PSA: gas ion light sources need to warm up and cool down 4-30 min. Fluorescent mercury lamps are most hazardous if they explode, but all gas tube systems can be toxic and are expensive to clean/replace. Diode lasers are solid state electronics, therefore they safer and faster, but you cannot tune their output as easily. Sassy note aside, its for your safety and their wallet",
            "score": 79,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; iode lasers are solid state electronics, therefore they safer and faster, but you cannot tune their output as easily.\n\nSomething, something, doped fiber MOPA",
                    "score": 1,
                    "author": "datenwolf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I worked as a maintenance tech for my university's molecular bio department, and occasionally the neuroscience department.\n\nYou'd be amazed at just how bad totally smart people regularly fuck up equipment that costs more than they will make in a year.\n\nEdit: my favorite ticket request was \"sonicator doesn't sonicate\"",
            "score": 46,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What was the worst incident?",
                    "score": 9,
                    "author": "lowlife_lurker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some kid in my lab blew out the compressor on our autoclave. $28,000 later and a week of melting media in a water bath, he breaks the gasket on the door and puts it out of service again. Granted this isn't a university but expensive none the less.",
                            "score": 29,
                            "author": "CrabyDicks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How did he break the autoclave? Did he intentionally turn up the heat?",
                                    "score": 3,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Please tell me he lost his job after that.",
                                    "score": 0,
                                    "author": "oberon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nah, we try not to fire interns, especially when we're short staffed as it is. However he is no longer allowed to use the autoclave haha",
                                            "score": 9,
                                            "author": "CrabyDicks",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ahh I missed that he was an intern. That's forgivable, those little tykes are clueless.",
                                                    "score": 9,
                                                    "author": "oberon"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Because he was the last to use it before it malfunction?\n\nYou know equipment can be stressed overtime and fail on the person not responsible.",
                                            "score": 4,
                                            "author": "Quantum-Ape",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We don't know the details so we have to go on what the guy said, and he said that the intern broke the machine. I'm not inclined to second guess him.",
                                                    "score": 1,
                                                    "author": "oberon"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Someone using a reeeeally old centrifuge basket that fragmented and shot through the equipment like a bouncing betty.",
                            "score": 9,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s because it’s not their own money and they are out in a few years. I’ve seen people be absolutely careless with million dollar equipment.",
                    "score": 5,
                    "author": "bilyl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Somebody from physics needs to swallow their pride and walk over to the engineering department and ask for help. They've got the parts just laying around in electronics lab rooms to add a temperature or timer control to this.\n\nI'm pretty sure there's a single component \"timer latch\" that could be spliced into the fan control lead to keep it on for a set additional time.",
            "score": 8,
            "author": "kylev"
        },
        {
            "level": 0,
            "comment": "Am I dumb or do the instructions not make sense? If the key is at zero then how do you switch to zero?",
            "score": 10,
            "author": "TamagotchiGraveyard",
            "replies": [
                {
                    "level": 1,
                    "comment": "They key should be turned to 0 and the power switch to the left of they key should be turned off (0) thereafter.",
                    "score": 7,
                    "author": "Beezus_Q",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah ok that makes sense, I thought the switch was more of a O than a 0 but I see now it does say 0 beside the switch",
                            "score": 2,
                            "author": "TamagotchiGraveyard"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is anyone else appalled that the instructions are in two sentences rather than one separated by a comma?",
            "score": 25,
            "author": "Frogmarsh",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not even two sentences. It's a sentence fragment followed by a sentence. It causes me physical discomfort.",
                    "score": 18,
                    "author": "oberon"
                },
                {
                    "level": 1,
                    "comment": "Just give the money, Lebowski!",
                    "score": 1,
                    "author": "Shevvv"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We live in an age where: I don't know what that thing is, I roughly understand what's written on it, and I now know how to properly turn it off if the chance ever arises for me to do so... What a time to be alive!",
            "score": 22,
            "author": "MonkeyJesusFresco"
        },
        {
            "level": 0,
            "comment": "This is the sort of thing that should be automated. You know that the guy who invented the combustion engine, he didn't want to have to press a button to make a spark. He made the spark automatic. Otherwise, we would be out there on our new Toyoma Takongoras with a twitchy finger to keep the engine on all the time.",
            "score": 4,
            "author": "imgprojts"
        },
        {
            "level": 0,
            "comment": "I've been to Melles Griot before. Very intriguing company, nice to see one of their products in the wild.",
            "score": 3,
            "author": "LavishManatee",
            "replies": [
                {
                    "level": 1,
                    "comment": "They used to have a location near me. I got to tour it when I was in the Boy Scouts. Obviously I didn't fully appreciate what was happening at the time but I remember bits and pieces. Mainly one guy who had his entire file cabinet covered with The Far Side cartoons.",
                    "score": 2,
                    "author": "Adamk0310"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Used to have a very similar setup at work. Can not believe the number of times people didn’t pay attention to the startup and shutdown instructions! After the 2nd laser replacement users were severely restricted.",
            "score": 3,
            "author": "tinydanger1"
        },
        {
            "level": 0,
            "comment": "I am so happy our department was able to splurge and upgrade to a brand new Leica confocal. Startup and shutdown is literally now 1 button and we control the lasers from Las-X. The number of people who didn't understand and follow the shutdown instructions previously and put it out of service was crazy.",
            "score": 1,
            "author": "Lepidopteria",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a pretty old Olympus model that I use for quick snaps or test zstacks. Our newer Zeiss is definitely a lot better but it has started to show its age as well. I've heard the department is looking for a new one but these things are so goddamn expensive it's probably going to be another year or so.",
                    "score": 2,
                    "author": "SamMee514"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well...  In establishment that prides itself on it’s understanding of such technical things, I think a better control system is necessary to demonstrate prowess.  However, there ARE times when you _might_ need to turn things off faster so don’t forget the big red mushroom button.\n\nPsychology plays a big part in UI design.",
            "score": 1,
            "author": "DigitalDunc"
        },
        {
            "level": 0,
            "comment": "Not sure how this connected with biology but ok\n\n&amp;#x200B;\n\nEdit: oh right confocal microscopy...",
            "score": 1,
            "author": "yenreditboi"
        },
        {
            "level": 0,
            "comment": "Why is this on r/biology",
            "score": -16,
            "author": "ryanfrogz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lot of biologists use microscopes",
                    "score": 19,
                    "author": "FlyingApple31"
                },
                {
                    "level": 1,
                    "comment": "https://en.m.wikipedia.org/wiki/Confocal_microscopy\n\n5 second google search says they’re used in life science and material science",
                    "score": 9,
                    "author": "TamagotchiGraveyard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it is people like you that give Reddit a bad name",
                            "score": -35,
                            "author": "ryanfrogz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn, fuck u/TamagotchiGraveyard for giving concise and accurate descriptions amiright?",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}