{
    "id": "mzvwt9",
    "score": 72539,
    "title": "Why Is Hell So Hot?",
    "author": "System32Comics",
    "date": 1619550209.0,
    "url": "https://www.reddit.com/r/pcmasterrace/comments/mzvwt9",
    "media_urls": [
        "https://i.redd.it/qevzu63okrv61.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome everyone from r/all! Please remember:\r\n\r\n1 - You too can be part of the PCMR! You don't necessarily need a PC. You just have to love PCs. It's not about the hardware in your rig, but the software in your heart! Your age, nationality, race, gender, sexuality, religion (or lack of), political affiliation, economic status and PC specs are irrelevant. If you love PCs or want to talk about PCs, you can be a part of the community! Everyone is welcome!\r\n\r\n2 - In case you are not a PC gamer because you think doing so is very expensive, please know that it is very possible to build a competent gaming PC for 500 dollars or less. Please check out http://www.pcmasterrace.org for our builds!\r\n\r\n3 - Please consider joining our efforts to get as many PCs worldwide help the folding@home effort, in fighting against Cancer, Alzheimer's, Huntington's, and Parkinson's. Recently, we've been actively focusing on fighting against Coronavirus as well. Please check this to learn more: https://pcmasterrace.org/folding\r\n\r\n-----------\r\n\r\nFeel free to use this community to post about any kind of doubt you might have about becoming a PC gamer or anything you'd like to know about PCs. That kind of content is not only allowed but welcome here!",
            "score": 1,
            "author": "PCMRBot"
        },
        {
            "level": 0,
            "comment": "So that's why I can't get a 3070... they all went to hell",
            "score": 1006,
            "author": "bioelement",
            "replies": [
                {
                    "level": 1,
                    "comment": "Want to buy one? Just sell your soul for it.",
                    "score": 364,
                    "author": "Dark_Reaper115",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, damn. I sold my soul for a cigarette when I was 12.\n\nIf I ask for it back, it'll be like that scene from that Ralph Machio movie, crossroads.\n\nWell, gotta speak to the devil to *mabe* get a *shot* at the *chance* to *buy* a rtx 3070.",
                            "score": 107,
                            "author": "Sorrowablaze3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Should have sold it to Millhouse.",
                                    "score": 37,
                                    "author": "Dark_Reaper115",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is that the blue haired fella from the simpsons tv show?",
                                            "score": 4,
                                            "author": "OMEGAxWOLF"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nobody ever said you had to sell *your* soul. Seriously, some people highly undervalue them. Get some dumb atheist to sell you theirs for $1, then turn around and sell it to the devil for the best gaming card on the market or whatever your heart desires. A soul isn't worth extremely warping reality for someone for, but for almost any modest asking price, the dark forces will oblige. There's just one caveat that you have to believe in them, or else they won't/can't(?) do anything for you.",
                                    "score": 7,
                                    "author": "LukariBRo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How do you know youre actually buying their soul? Is there a contract you fill out? What if they already sold their soul to someone else?",
                                            "score": 5,
                                            "author": "pnwbmw",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I haven't worked out the specifics since it's hard to know which dark whispers to trust. But from the most scientific standpoint, I just bought a bunch of souls off people. Sure, some percentage of them were bogus deals where they were pretending to sell something they'd already sold, but out of my large batches, there's a very high chance that I was the first buyer and thus the legal owner as far as trading goes. Plus whenever I would perform such dark arts that require such a large payment of an entire soul, I worked conditional statements into the contacts like \"if I have an available soul which I have the rights to trade available that is not my own, then so I offer this for &lt;insert desire&gt;. I only did it 3 times in my life since I worry about the ramifications of the souls I've traded for frivolous things like winning raffles and ways to aquire money, but the things that I asked for came to be in ways that would have required astronomical luck otherwise. I figure a soul isn't worth all that much, like it's not going to give you superpowers, but ask for small things that the small chaotic forces in the universe could easily line up over time and you may have a deal.",
                                                    "score": 3,
                                                    "author": "LukariBRo"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So this is who owns Newegg...",
            "score": 994,
            "author": "Army165",
            "replies": [
                {
                    "level": 1,
                    "comment": "Newegg is actually the owner. Hell came in a forced bundle.",
                    "score": 428,
                    "author": "jaykresge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 102,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Fuck those bundles, man. Just let me buy a card",
                            "score": 13,
                            "author": "shitfuck69420",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seriously every fucking product in the shuffle lately has been a bundle.",
                                    "score": 3,
                                    "author": "Dankbot-420"
                                },
                                {
                                    "level": 3,
                                    "comment": "I won the bundle for the monitor. Not sure what the hell I'm supposed to do with the 3060 that they bundled with it.",
                                    "score": 5,
                                    "author": "jaykresge",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sell that thang. How much you want for it?!",
                                            "score": 8,
                                            "author": "shitfuck69420",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "*(it was a joke)*",
                                                    "score": 5,
                                                    "author": "jaykresge",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I thought you were being serious lol. People like monitors!",
                                                            "score": 5,
                                                            "author": "shitfuck69420",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The monitors weren't worth the inflated bundle price, and could be purchased stand-alone.\n\nI guess I could have said that I won the explodey Gigabyte PSU, but that would have been TOO obvious :)",
                                                                    "score": 2,
                                                                    "author": "jaykresge"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How do you get your parts next to your name like that? I would like mine listed next to my name too",
                            "score": 33,
                            "author": "MadaRook",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "User flair. And how to change it depends on if you're on desktop (old vs. new reddit) or mobile (mobile web vs. app).\n\nWhat are you using?",
                                    "score": 25,
                                    "author": "jaykresge",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "On pc I use old.reddit and on mobile (android/samsung galaxy s8+) I use reddit is fun\n\nI appreciate the response",
                                            "score": 6,
                                            "author": "MadaRook",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Using Old Reddit - [Here ya go](https://imgur.com/a/ncoAgpu)",
                                                    "score": 4,
                                                    "author": "jaykresge",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "thank you :)\n\nI have a question, it seems I can only add \"Desktop\" as my flair, how do I add specific parts flairs?",
                                                            "score": 3,
                                                            "author": "MadaRook",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "After clicking a flair to use, a text box opens above the \"save\" button. Whatever is typed into that text box is what shows when hovering over the flair.",
                                                                    "score": 7,
                                                                    "author": "Denivire",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "awesome, ty! :D",
                                                                            "score": 5,
                                                                            "author": "MadaRook"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "oof",
                            "score": 12,
                            "author": "gramathy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "7",
                    "score": 15,
                    "author": "Christofer_Brito"
                },
                {
                    "level": 1,
                    "comment": "Deviled Egg",
                    "score": 13,
                    "author": "CursedPlane",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Newegg was bought by a Chinese investment firm who immediately tried to turn it into wish, so seems right.",
                    "score": 33,
                    "author": "minizanz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah really? And I've been shopping on Newegg to try to avoid Amazon",
                            "score": 9,
                            "author": "FifenC0ugar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They are still about the only choice other than best buy. You do t have to worry as much about getting weird open box stuff or scammed like with Amazon. You do have to make sure you order from newegg and not one of their marketplace stores. \n\n\nIt is just sad that they are no longer the company that would stand up to patent trolls or make things right without getting your credit card company involved when something goes wrong.",
                                    "score": 21,
                                    "author": "minizanz"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I  feel like this whole mining thing is like the gold rush of the 49s. Yeah some people made out like bandits, but it was the people selling the supplies to the ones mining.",
            "score": 663,
            "author": "Dantheman616",
            "replies": [
                {
                    "level": 1,
                    "comment": "Miners are consistently making a profit. They can sell their mining profits for dollars instantly if they want, the crypto world is extremely liquid.",
                    "score": 135,
                    "author": "augustofretes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Many miners are making a profit ... right now. Buying into the market is questionable, as it is not clear how long it will remain profitable compared to your payback period.",
                            "score": 59,
                            "author": "Akamesama",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pretty much all cards pay themselves in less than 6 months (even at their insanely inflated prices). It's not clear how profitable it will be (for GPU miners) after Ethereum switches to Proof of Stake later this year, but by then I guarantee you pretty much everyone who's mining will have more than covered the cost of their hardware (which they can resell anyway, unlike ASIC miners).\n\nSimply put, mining is very profitable and has been very profitable for essentially a decade now, and despite how liquid the crypto market is, people who *didn't* instantly sell their assets made on average way more than the people who did.\n\nMiners are not stupid, the economic incentives are just very strong.",
                                    "score": 76,
                                    "author": "augustofretes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ethereum switching to proof-of-stake is the financial equivalent of nuclear fusion. It’s going to happen any day now, honest!",
                                            "score": 38,
                                            "author": "WrestlingCheese",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hahaha. Well, the Beacon Chain, unlike in years past, already exists, and has been running since December, and apparently developers are aiming for October to merge them. Will see if it actually happens.",
                                                    "score": 15,
                                                    "author": "augustofretes"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Nothing's stopping people from moving on to another profitable coin. It'll be like nothing ever happened and they are still making money.",
                                                    "score": 12,
                                                    "author": "HelamanWarrior",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There are so many GPUs mining Ethereum, a rounding error of GPUs switching from a major pool to the next profitable coin would skyrocket that coin's difficulty and crush its profitability.\n\nEthereum switching to PoS means a whole lot of GPU compute supply being released into the market. For other coins to retain profitability, their prices and transaction volume would need to rise accordingly. It's unlikely any coin will fill the void Ethereum leaves in the PoW market so soon.",
                                                            "score": 5,
                                                            "author": "Vushivushi",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "People don’t realise how big of a GPU flood it’s going to cause on Ebay and other sites like these.  \n  \nBut.. as one comment pointed out..  \n  \n“Any day now!”",
                                                                    "score": 10,
                                                                    "author": "xAlcaranx"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Been saying that for years now. I will believe it when I see it.",
                                                    "score": 2,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "His point still stands. Past performance does not equal future profits.\n\nMining is and has been lucrative, but it could easily go South.\n\nBoth of you are right.",
                                            "score": 9,
                                            "author": "butter14",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's basically what I'm doing.\nI'm not mining for myself. Other people are paying me for my mining power to mine for them. If I find something they get it. But if I don't find something I still get paid.",
                    "score": 163,
                    "author": "MrDude_1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 138,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For someone like me, with a gaming pc and an extra RX580, it's not an issue. If you actually want to seriously mine, of course.",
                                    "score": 59,
                                    "author": "seandoc13",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same way I felt about it.  Running at a medium power load when not in use I'm netting around $100 USD per month on average.  It ain't the greatest option for all out mining but a nice chunk of change on the side with a lower risk to your GPU then straight up farming with it at max load 24/7/365.  Some other comments dive into the details a bit more but that's my 2 cents.",
                                            "score": 35,
                                            "author": "Catumi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Shit, net 100 for doing nothing? Sign me up.",
                                                    "score": 32,
                                                    "author": "MailMeCannabisSeeds",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, nicehash is the largest 3rd party mining software, and I believe HiveOS is basically the standard. He does have a 2070Super, and that's assuming you run it 24/7\n\nu/catumi are you undervolting? Should be\nAlso noticed your flair says GTX 2070 btw",
                                                            "score": 10,
                                                            "author": "seandoc13"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "yeah but what that kWh cost?",
                                                            "score": 5,
                                                            "author": "reyean"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "More like 100 for running your PC nonstop at your own cost of electricity bill and wear on your hardware \n\nYou’re like an Uber driver.  “Oh you just get paid cash for driving around”, yea except you bought the car, pay for the gas, and have to repair the wear and tear...",
                                                            "score": 23,
                                                            "author": "CommentsOnOccasion",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Anything above a 1660 and under a 3090 will pay for itself in under a year. Electricity is factored into the profit display. It's nowhere near Uber driving, it's far better in nearly every way.",
                                                                    "score": 25,
                                                                    "author": "xyifer12",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah Uber is super exploitative price wise, this is definitely better and more passive",
                                                                            "score": 6,
                                                                            "author": "CommentsOnOccasion"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lol wat",
                                                                    "score": 8,
                                                                    "author": "waxyslave"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 35,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It seems like it’s reasonable to bring up those points while also saying “the benefits outweigh the costs.” \n\nAsking in good faith because I honestly know literally only what everyone has commented, Can you tell me why the things they brought up are invalid?",
                                                                            "score": 28,
                                                                            "author": "MailMeCannabisSeeds",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[deleted]",
                                                                                    "score": 37,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Do you mean $100 after electricity costs and hardware usage / lifetime are factored in?",
                                                    "score": 5,
                                                    "author": "Panda_hat",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "At least for me, my house is fully solar powered so electricity is not an issue. I have already made more than what I bought my gpu for so it’s pure profit at this point.",
                                                            "score": 16,
                                                            "author": "iamevilest943",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's awesome! How did implementing solar power go?",
                                                                    "score": 4,
                                                                    "author": "Foolish_Hepino",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I live in Napa, CA so the sun in strong usually so the solar panels generate more than enough for the house. I needed an alternate source of electricity since the power of goes down when it’s windy. Tesla came and did the installation of the solar panels and also installed 4 Tesla Power Walls as backup for when the power is down.",
                                                                            "score": 2,
                                                                            "author": "iamevilest943"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Electricity is pretty low cost compared to the return. My 3070 will run about $12.50 a month for electricity compared to about $180 in income.\n\nAs far as hardware lifetime is concerned - really only the fans will be taxed and they are easy to replace. Fans have lifetimes of about 70,000 hours on average, so most of the time even those will last until obsolescence. Electronic components can last WAY longer. When you look up failure rates from there you are given them as a FIT rate (Failures in Time). FIT rates are number of failures per BILLION hours, and it's not uncommon to see FIT rates that are less than 1 (less then 1 failure per billion hours).",
                                                            "score": 4,
                                                            "author": "vahntitrio"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Depending on the time of day.\nYou have to average it all together of course but on high profitability days I make much more than you would directly mining. And on low profitability days I make between 8 to 10% less.\n\nOn the average day I make 3 to 4% less which works out to be $1.50 to 2 bucks less. I'm willing to lose that for the convenience of not having to convert my ethereum to Bitcoin because I'm long term on Bitcoin and not on ethereum.\n\nMy favorite part there are times like this where it's volatile and as the price of Bitcoin plummets I get paid more Bitcoin... Partially because of the cash conversion and how people tend to look at it, a mental thing... And partially because the interest in nice hash skyrockets when people see the price fall.\n\nIf the price stabilizes and becomes boring, so people are not all excited about the crypto and everything else then I have to switch over because the difference between nice hash and directly mining will be larger and more consistent.\n\nRight now I'm kind of skipping across the peaks and ending up a little bit ahead of directly mining.",
                                    "score": 23,
                                    "author": "MrDude_1"
                                },
                                {
                                    "level": 3,
                                    "comment": "Calling it a scam is a bit dishonest. Nicehash is a business that is providing the software, the exchange and offloading a lot of the time and knowledge for running mining rig to them. Mining for crypto yourself in an optimal manner will net you higher gains than selling your hash power to others though Nicehash's market.\n\nNicehash is a business, just like any other, They are going to get a cut of the profit for the services they provide. Just because the overhead for those services are not worth the cost to you don't mean it is a scam.",
                                    "score": 24,
                                    "author": "frostgecko",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can I use this as a copy pasta when people are whining in r/NiceHash? It’s crazy they refuse to accept this and say NiceHash is “skimming their profits” every few days.",
                                            "score": 7,
                                            "author": "Extension_Theory_179",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Go for it. \n\nThough you might want to edit any grammatical errors if you are going to copy paste. I already see that I managed to put \"don't mean it is a scam\" instead of \"doesn't mean it is a scam\"",
                                                    "score": 7,
                                                    "author": "frostgecko"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Eh\n\nNicehash feels easier because I can withdraw to coinbase for free with minimum 0.0005btc\n\nPool mining and gas fees seem like way too much effort unless you actually have a full on mining rig",
                                    "score": 4,
                                    "author": "braapstututu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Every pool I’ve ever used covered gas fees for payouts. I’m only mining with one rtx2060 in my regular consumer pc and the difference between NiceHash and pool mining is actually about $0.50 (~$3 vs $3.50) a day. This adds up to quite a lot over a month.",
                                            "score": 3,
                                            "author": "PM_ME_TOMATOES_pls",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If you have less than 500MH/s in hash power going to a larger pool isn’t worth it, unless you’re fine getting paid every 7-10 days. I, on the other hand, don’t mind to sacrifice 5-10% of potential earnings for the ease of use, app to monitor rigs, and frequency of payouts.\n\nI wouldn’t call that *”getting scammed”*.",
                                    "score": 17,
                                    "author": "rharrow",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I make $30+ a day from a pool and from Nice hash. The difference is negligible.",
                                    "score": 4,
                                    "author": "Gringochuck",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "nicehash?",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're settling yourself short with nicehash.",
                                    "score": 8,
                                    "author": "pau1phi11ips",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Whats better then",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just know that you will not be able to get paid as frequently with larger pools if you have a small rig.",
                                                    "score": 3,
                                                    "author": "rharrow"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I hope it comes to an end sooner, imagine the amount of underpriced gpus on ebay, yeah they might have been mined with but a gpu is a gpu",
                    "score": 15,
                    "author": "DanInYourVan67",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plus it's a waste of electricity and materials.",
                            "score": 13,
                            "author": "Scorpionfigbter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah we are literally burning through our limited fuel and materials on this planet doing useless processes to *mine* currency.",
                                    "score": 17,
                                    "author": "zieleix",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The children will judge us harshly.",
                                            "score": 8,
                                            "author": "jonhuang",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "See you in hot :)",
            "score": 941,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see what you did there",
                    "score": 206,
                    "author": "MrDuckyyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it because how much mining bitcoin heats up the planet",
                            "score": 54,
                            "author": "KraakenTowers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Let's move the mining rigs to Mars, I heard there's cold",
                                    "score": 40,
                                    "author": "Iuse_arch_btw",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The Martian Bitcoin Mines is where I want the dystopian regime to send me someday.",
                                            "score": 38,
                                            "author": "KraakenTowers",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That can be arranged",
                                                    "score": 15,
                                                    "author": "Iuse_arch_btw",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hail the Omnissiah. You shall make for a nice battery, u/KraakenTowers.",
                                                            "score": 5,
                                                            "author": "TatsumoriYuno"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I did what you see there",
                            "score": 8,
                            "author": "James_Cartwright_7"
                        },
                        {
                            "level": 2,
                            "comment": "I’m just gonna pretend like I did to go along with it",
                            "score": 3,
                            "author": "ninodaboss"
                        },
                        {
                            "level": 2,
                            "comment": "But not icy what you did there",
                            "score": 2,
                            "author": "hatchetthehacker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hello prophet, I found this in hot",
                    "score": 15,
                    "author": "Kron00s",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for reading my comics everybody. If you want to see more, you can visit my social media: [https://linktr.ee/System32Comics](https://linktr.ee/System32Comics)\n\nThank you everybody!",
            "score": 341,
            "author": "System32Comics",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love how u wholesomely thank everyone while theres a full on religion war going on aroun you in the comments. I respect that",
                    "score": 72,
                    "author": "SopranoSoulja"
                },
                {
                    "level": 1,
                    "comment": "Not gonna lie goat satan is kinda cute",
                    "score": 2,
                    "author": "RuneLFox"
                },
                {
                    "level": 1,
                    "comment": "Great job, I love the comic.  \n\nI have a special hatred for crypto mining.  They're taking real resources (electricity, and whatever you burn to make it) and turning it into something that only has value if people believe it has value.  You can't live in a house built of crypto or eat crypto for nourishment.\n\nOn top of that, a lot of the world's electricity comes from burning coal, especially in places like China.  If climate change becomes a death spiral and society breaks down, cryptocurrencies will be worth nothing to the survivors.",
                    "score": 23,
                    "author": "Atmaweapon74",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I understand your sentiment, but your point was lost. Almost all currency only has value because people believe it does. The only time this is not the case is for limited resources such as diamond and gold, the latter of which is no longer used as currency and only as a premium metal in jewelry.\n\nEdit: I must have said something in a way that sounds like I'm trying to defend crypto, I guess? I don't know. Sorry, everyone. I'm only trying to make the point to the parent comment here that the value conception also applies to paper currency not just bitcoin. Again, apologies.\n\nEdit 2: Completely forgot to mention which u/Farranor reminded me, is that gold is ALSO heavily used in the electronics industry.",
                            "score": 29,
                            "author": "rxbin2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; diamond and gold, the latter of which is no longer used as currency and only as a premium metal in jewelry\n\nGold is extremely malleable, ductile, and electrically conductive, and it doesn't corrode or tarnish. That's valuable for more than just jewelry.",
                                    "score": 8,
                                    "author": "Farranor"
                                },
                                {
                                    "level": 3,
                                    "comment": "We can make all of the diamonds we want.  No shortage of carbon.\n\nAnd gold *is* one of the most common and popular commodities.  There's a substantial amount serving no purpose other than sitting around and appreciating in value.",
                                    "score": 3,
                                    "author": "mr_ji",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This is true, but at least printing paper money has a low, static cost.",
                                    "score": 2,
                                    "author": "Atmaweapon74"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "On the other hand most modern physical currencies are backed up by... you guessed it, people believing that it has value.",
                            "score": 13,
                            "author": "VagabondRommel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is true, but you don’t have to burn more and more coal as you print more paper money.  The cost of printing paper money is cheap and static.",
                                    "score": 3,
                                    "author": "Atmaweapon74"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Mine runs exclusively on the solar I have installed on my roof.\nSo I'm not actually doing any of that shit to the environment. I'm using cards I've purchased second hand that would have otherwise gone into a landfill...\n\nAnd your Fiat currency is only worth anything because people believe it's worth something. There's no gold backing it. There's no anything backing it. There are no promises.\nNot to mention that everything costs twice as much as it did in 1999...\n\nSo I'm literally making value out of sunlight... Using recycled electronics... And it's paying for my house.",
                            "score": 35,
                            "author": "MrDude_1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\\&gt; I'm using cards I've purchased second hand that would have otherwise gone into a landfill...\n\nWhat cards? I doubt they'd end up in a landfill if you're using anything past ... say, GTX 7XX.",
                                    "score": 11,
                                    "author": "Funny-Jihad",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They were salvaged from being thrown out... But they're msi mech oc 5700xt cards that were overheating due to the factory not putting thermal pads in the correct places, or undersizing the thermal pads.\n\nI took them all apart and put new full size pads on them.\nThey were all returned for locking up from the memory overheating.\n\nI sure as hell couldn't afford them otherwise. Lol",
                                            "score": 16,
                                            "author": "MrDude_1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sounds like you're doing it right. But you're probably in a minority?\n\nThen again, GPUs used for \"valuable\" things is probably a minority as well.",
                                                    "score": 10,
                                                    "author": "worldsayshi",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No. By volume of people the majority of crypto miners are gamers who are just running their one or possibly two cards in their game machines whenever they're not using it for something else.\n\nBy actual wastage of electricity, cards and usage are just a handful of people doing this on a massive scale. And I mean an insanely massive scale. You'll have one site pulling megawatts of power. And that person probably owns more than one site and they're just power limited.\nAlmost exclusively these extremely large sites exist in China.\n\nA lot of other large sites exist in third world countries and second world countries where making the amount of US dollars we kind of shrug at is making their equivalent of millions of dollars.\n\nThe US and Europe, which makes it most of Reddit, is not using an insane amount of power for cryptocurrency. But there are a ton of people who just quietly run stuff in the background but they don't want to talk about it because all of their other gamer friends hate crypto miners or whatever... It's definitely a hate band wagon right now.",
                                                            "score": 12,
                                                            "author": "MrDude_1",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;handful of people doing this on a massive scale. And I mean an insanely massive scale\n\nI've wondered this: isn't your decision power in the ledger proportional to your processing power and doesn't that mean that if a handful of actors own most of the power the risk of 51% attack should be quite likely?",
                                                                    "score": 3,
                                                                    "author": "worldsayshi",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The use of those resources are themselves conferring a baseline of inherent value. It's called proof of work and, and it's pretty foundational to crypto.\n\nFiat literally only has value because a government issues it and hopefully is stable enough to maintain that value.\n\nAs a believer in cryptocurrency, I do worry about the environmental impact, though.",
                            "score": 6,
                            "author": "jvalordv",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That last part isn’t something that crypto in its current form can solve. You can’t believe in crypto and a stable climate can coexist - we need to put the breaks on all forms of energy use (a tall ask) but especially wanton use of energy for purely funny money’s sake. \n\nSometimes the things we want and the realities of them clash, and this is a very big one today.",
                                    "score": 4,
                                    "author": "dj_sliceosome",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why is satan being impersonated by baphomet?",
            "score": 191,
            "author": "OokamiKurogane",
            "replies": [
                {
                    "level": 1,
                    "comment": "Doesn't anyone do their research when making goofy cartoons?",
                    "score": 77,
                    "author": "_AlreadyTaken_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's like when everyone was pissing on Gary Larson because he had a Far Side comic of a Polar Bear and some Penguins.",
                            "score": 17,
                            "author": "guyhabit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Didn't he do that on purpose to troll everyone?",
                                    "score": 7,
                                    "author": "mr_ji",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "looool i almost responded to you seriously bc this comment is so far down from the parent.",
                            "score": 6,
                            "author": "pcrnt8",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Blame The Major Arcana.",
                    "score": 4,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "because nobody can keep the confusing bullshit narrative of Christian mythology straight--least of all the Christians.",
                    "score": 106,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Baphomet isn't part of Christian mythology](https://en.wikipedia.org/wiki/Baphomet) though.",
                            "score": 21,
                            "author": "Yeazelicious",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, your link goes on rather extensively about how it is part of Christian history.",
                                    "score": 73,
                                    "author": "TheNoxx",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't know how to explain to readers that this claim isn't true without just asking them to read the 'History' section of the linked article. He technically appears as a syononym for Satan in fantasy writer in James Blish's 1970 novel *The Day After Judgment*, but that doesn't somehow make it part of Christian mythology.\n\nThe strongest links between the two are: 1) that Baphomet iconography is used in the The Satanic Temple, but they're a nontheistic activist group and don't have any real relationship to Christianity, and 2) the [Taxil hoax.](https://en.wikipedia.org/wiki/Taxil_hoax)",
                                            "score": 18,
                                            "author": "Yeazelicious",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well anything \"pagan\" was satan so thats why we get Mephisto and Baal as Satan too.",
                                                    "score": 20,
                                                    "author": "Kaplaw",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Throw in Diablo and baby, you got yourself an ARPG.",
                                                            "score": 13,
                                                            "author": "raven12456"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Because \"satan\" isn't a pronoun in Hebrew.  The translation is \"opposer.\"",
                                                            "score": 6,
                                                            "author": "Send_Me_Broods"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "And how much mythology or even just popular imagery was lifted from Paradise Lost or The Divine Comedy? Everyone is cool with the term Bealzebub despite it just being a god from a different pantheon.\n\nHi to the transphobes downvoting my comment history, you’re pathetic!",
                                                    "score": 6,
                                                    "author": "Borthwick",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I mean, I'm just reading from the Wiki article you linked, but he appears as a synonym for Satan in the 1800's:\n\n&gt;Below this figure we read a frank and simple inscription—THE DEVIL. Yes, we confront here that phantom of all terrors, the dragon of all theogenies, the Ahriman of the Persians, the Typhon of the Egyptians, the Python of the Greeks, the old serpent of the Hebrews, the fantastic monster, the nightmare, the Croquemitaine, the gargoyle, the great beast of the Middle Ages, and—worse than all these—the **Baphomet of the Templars**, the bearded idol of the alchemist, the obscene deity of Mendes, the goat of the Sabbath.     \n\n\nhttps://en.wikipedia.org/wiki/Baphomet#Witches'_Sabbath",
                                                    "score": 7,
                                                    "author": "TheNoxx",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, but the fact that you feel the need to point that just shows their point in real time lol.",
                                    "score": 5,
                                    "author": "Rocky87109"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's all Ed Crowley's fault",
                    "score": 2,
                    "author": "realSatanAMA"
                },
                {
                    "level": 1,
                    "comment": "I saw that too! And the stars are pointed upwards, which isn’t satanic, it’s pagan",
                    "score": 2,
                    "author": "SleepyBitchDdisease"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why are the pentagrams upside down?",
            "score": 87,
            "author": "KillerDolphin72_2",
            "replies": [
                {
                    "level": 1,
                    "comment": "you know how some people wear those upside down crucifixes thinking they're cool?",
                    "score": 68,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "isnt the upside down cross st peters cross? so its still a christian symbol",
                            "score": 36,
                            "author": "AngryKV2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep!\n\nThe Pope had one on this stone throne.\n\nYes, the guy running Christianity is more metal than you.",
                                    "score": 37,
                                    "author": "elsydeon666",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would were the cross upside down as a peter cross just to be counter to the already counter people",
                                            "score": 3,
                                            "author": "Tommy-Nook"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "well it's a coincidence that he's australian",
                    "score": 18,
                    "author": "manhat_"
                },
                {
                    "level": 1,
                    "comment": "Only a miner would know this.",
                    "score": 3,
                    "author": "XADEBRAVO"
                },
                {
                    "level": 1,
                    "comment": "They're not lol  \n\n\nThe pentagram is traditionally depicted as it's shown in the comic.",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pentagrams are used for multiple things, when used in a satanic meaning, the point of the star is facing downwards",
                            "score": 9,
                            "author": "KillerDolphin72_2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They're not Satanic though.\n\nYou don't understand the symbol you're talking about.  \n\n\nThe \"sigil of Baphomet\" as it's called in Satanic circles wasn't even a thing until 1968.  \n\n\nThe pentagram is an ancient symbol that's existed for literally thousands of years.",
                                    "score": 29,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If they have GPUs in hell, I‘m down for it",
            "score": 35,
            "author": "_F0X__",
            "replies": [
                {
                    "level": 1,
                    "comment": "They have plenty of GPUs and high speed monitors,  but not a single display port cable. Only VGA.",
                    "score": 47,
                    "author": "__SpeedRacer__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And CRT monitors that need degaussing, but can’t be.",
                            "score": 13,
                            "author": "sciencetaco",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "CLUNK _woogity ^woogity ^^woogity_",
                                    "score": 3,
                                    "author": "Farranor"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ikr, if GPUs go to hell, I don't wanna go to heaven.",
                    "score": 4,
                    "author": "Krissam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In heaven, you’re limited to cloud gaming",
                            "score": 5,
                            "author": "urru4"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You can only use them for mining, you can never play games with them",
                    "score": 9,
                    "author": "RelentlessDrag",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Only mining GPUs without a display out",
                    "score": 2,
                    "author": "R3lay0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Or one 9 year old MacBook Air rendering HD video on final cut",
            "score": 6,
            "author": "NowFreeToMaim",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or a 9 year old MacBook Air doing anything really",
                    "score": 3,
                    "author": "shamair28"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dante Alighieri described the bottom layer of hell as a frozen wasteland with satan in the lowest, coldest spot. He describes it as being the furthest point away from Gods light and thus cold and dark. It is reserved for souls who committed treachery against their fellow man.\n\nIt'd be the perfect spot to overclock a mining rig. The most dastardly deed imaginable.",
            "score": 5,
            "author": "thebawsofyou",
            "replies": []
        },
        {
            "level": 0,
            "comment": "the true reason why hell is hot, all the mining rigs catching fire from all the wish PCI-E cables",
            "score": 33,
            "author": "Zeraora807",
            "replies": [
                {
                    "level": 1,
                    "comment": "That or SATA cables with a 54W limit\n\nSATA = Smoke Alarm Testing Apparatus",
                    "score": 14,
                    "author": "musecorn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why does Satan gotta be so heckkin cute tho? 👀",
            "score": 3,
            "author": "CastinEndac"
        },
        {
            "level": 0,
            "comment": "satan be lookin kinda cute ngl",
            "score": 9,
            "author": "Vectrex452",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What about scalpers?",
            "score": 13,
            "author": "Tim72861",
            "replies": [
                {
                    "level": 1,
                    "comment": "Whose blood do you think is cooling the rig?",
                    "score": 35,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "we as a species kind of need a more eco friendly bitcoin alternative. \n\nthat shit is really energy demanding.",
            "score": 53,
            "author": "HereIsACasualAsker",
            "replies": [
                {
                    "level": 1,
                    "comment": "We have one, it's called Nano",
                    "score": 4,
                    "author": "XxLokixX"
                },
                {
                    "level": 1,
                    "comment": "r/Stellar, r/cardano and soon r/ethereum (whenever ethereum 2.0 comes out)",
                    "score": 17,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ETH 2.0 has been \"just around the corner\" for so long it's a meme",
                            "score": 10,
                            "author": "nddragoon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ethereum has only existed since 2015. The silver and gold standards existed for five centuries before fiat currency replaced them.",
                                    "score": 8,
                                    "author": "neznein9",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"honey you said you were almost ready two hours ago\"\n\n\"The silver and gold standards existed for five centuries before fiat currency replaced them!\"\n\n\"then do i have time to--\"\n\n\"NO I'M ALMOST READY\"",
                                            "score": 9,
                                            "author": "Farranor"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 21,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Let's go back to Tulip bulbs and beanie babies",
                    "score": 6,
                    "author": "damnitHank"
                },
                {
                    "level": 1,
                    "comment": "Even if we address that (which will never fully happen cause bitcoin, the most popular crypto, is actively resistant to any kind of change), all Proof algorithms share one thing in common: they all only make the rich richer. The people really profiting from crypto are those with giant GPU farms, racks upon racks of hard drives, or a shit ton of coins already",
                    "score": 3,
                    "author": "nddragoon",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everyone hates miners until they get a 3080 or a 3090 and realize they can make their money back in a few weeks or months.",
            "score": 59,
            "author": "iShoot556",
            "replies": [
                {
                    "level": 1,
                    "comment": "To state the obvious, that really depends on how much they bought it for. 3080 at current scalping prices would be more like 8 months whereas 3090 at current prices would likely take well over a year. That's assuming mining stays as profitable as it is right now. \n\n&amp;#x200B;\n\nAt MSRP tho, they'd be making out like kings no doubt.",
                    "score": 32,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And it doesn't because difficulty goes up by 20% each month, so unless eth price does the same it becomes less profitable",
                            "score": 10,
                            "author": "nelusbelus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ETH is up 50% this month and 110% over the past 3 months.",
                                    "score": 3,
                                    "author": "kool_moe_b",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can confirm. Started mining with my 3080 and the $10/day is nice to see.",
                    "score": 6,
                    "author": "PaleGutCK",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah with one gpu not 8 scalped and hooked up sitting about",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I hate this shortage, but can you blame them? It's practically free money.",
                    "score": 14,
                    "author": "wyattlikesturtles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can, but I guess morality doesn't matter when the planet is involved for everyone else.",
                            "score": 10,
                            "author": "BrightBlackOrbitz",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love it",
            "score": 3,
            "author": "shingfunger"
        },
        {
            "level": 0,
            "comment": "Lovely stuff",
            "score": 3,
            "author": "laghjdhxjdj"
        },
        {
            "level": 0,
            "comment": "By the law of thermodynamics heat is rising up,so that means deepest pits of hell are populated with cryptocurrency miners with their mining stations that produce heat.",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Laughs in ps5.",
            "score": 6,
            "author": "OddlySpecificOtter",
            "replies": [
                {
                    "level": 1,
                    "comment": "*Cries in ps4*",
                    "score": 4,
                    "author": "AmazingBoringSheep",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its ok, try Costco. You have to be a member but they have drops all the time and since its limited to members ( you actually have to log in) not many scalpers, not *as* many.",
                            "score": 4,
                            "author": "OddlySpecificOtter"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's the asic and large companies miners that are destroying what it should be :(",
            "score": 7,
            "author": "RichardDickJr"
        },
        {
            "level": 0,
            "comment": "Gamers good miners bad",
            "score": 8,
            "author": "pyroman1324"
        },
        {
            "level": 0,
            "comment": "Hell is hot because it’s the worst thing humans could think of when they wrote the Bible.\n\n“Hey guys, what’s the worst thing in the world right now?”\n\n“Uhh, burning by fire?”",
            "score": 8,
            "author": "Burrito_Loyalist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably now, Hell is basically normal Earth, but with 32 kbps Wi-Fi everywhere",
                    "score": 9,
                    "author": "XauMankib",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I like how paradise is a land of milk and honey.  Not hookers and blow, just milk and honey.",
                    "score": 2,
                    "author": "mr_ji"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now you can debate whether or not a space heater is equivalent, or actually inferior to, a quiet mining rig.",
            "score": 5,
            "author": "walloon5"
        },
        {
            "level": 0,
            "comment": "Pretty sure Newegg hired Pornstars to act as \"Floor Lan Girl Hosts\" for their second LanFest, yes I was there. I don't remember too many faces but this one aggressive blonde stood out... she was kinda mean. Cool tournament",
            "score": 2,
            "author": "errorseven"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That’s not even Satan, that’s Baphomet lmao",
            "score": 2,
            "author": "Front_Action8931"
        },
        {
            "level": 0,
            "comment": "Why is there a chip shortage? All I hear is that there is a chip shortage and that's why prices are higher but why is it there in the first place? Has a organisation like the OPEC been formed to regulate chip production or something?",
            "score": 2,
            "author": "skullshatter0123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Semiconductor shortages due to covid shut downs in the countries that mine, process, and manufacture the materials involved. There is also shipping delays due to covid. Higher demand for pc parts because of the stay at home surge in purchasing over the last year. This is affecting more than just computer parts. The car industr and electronics manufacturing are another two areas suffering. Treated timber is also hard to come by at the moment so the construction industry is suffering. The electrical trade is finding it hard to get parts made in the UK or India. I work in this area and it is almost impossible to get certain size circuit breakers at the moment.",
                    "score": 5,
                    "author": "Darth_SW",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for explaining",
                            "score": 2,
                            "author": "skullshatter0123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finishing the founding blocks of a decentralized bank is hellish, almost as bad as free health care.\n\n&amp;#x200B;\n\n/s",
            "score": 2,
            "author": "Flybaby2601"
        },
        {
            "level": 0,
            "comment": "Just a heads up u/System32Comics, you're depicting Baphomet and he's a copyrighted symbol by the Satanic church. And they have sued in the past.",
            "score": 2,
            "author": "pumpkin_seed_oil"
        },
        {
            "level": 0,
            "comment": "I am a miner. I mine on my 1080 and RX-580, game on my 960 (priorities, lol).\nIf you tell me, that I can make money with a GPU that would otherwise sit and do nothing when not gaming, I'll do it.\n\nAnd my opinion is, that we (small miners like me) are not the ones buying all the GPUs. It's the giant mining farms that buy the GPUs directly from the board partners before it even gets to a store.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’ll never understand how a gpu mining rig works",
            "score": 5,
            "author": "TroubledDoggo",
            "replies": [
                {
                    "level": 1,
                    "comment": "People broadcast transactions they want to make to miners, who then pool them together into a \"block\" which is really just a set. The miner then hashes that block until it gets a result starting with a specific number of 0s. Once they've found a working hash, they propagate that block to other miners who can verify it. From that point forward the transactions are permanent, since the hash of that block will be included in the next block, creating a \"chain\" where undoing a transaction would require redoing the work for the entire chain after it.\n\nIt just so happens that for some chains like Ethereum, a GPU is the best thing for hashing. On chains like Monero it's a CPU, and for Bitcoin there are special machines called ASIC miners that are built just to be efficient at BTC's hashing algorithm.",
                    "score": 10,
                    "author": "MajorasButtplug",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is there not something that would be more efficient than a GPU that could be designed specifically for mining?  Not that it would help with the shortage, but at least people could have more realistic expectations when it comes to GPU availability and price.",
                            "score": 2,
                            "author": "mr_ji",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Running powerful computers at max load running completely pointless calculations is valuable somehow",
                    "score": 13,
                    "author": "goggles447",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "And material supplies are low for *everything*.  I was just reading about how there are probably going to be gas shortages over the summer because so many truckers had to find other work and don't want to come back.",
                    "score": 5,
                    "author": "mr_ji"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wish people got this angry over our overfished oceans, but people want to pretend they have righteous intent when they are just salty miners buy up large supplies of GPUs, which I can't say bothers me my 1070 still does the job and the \"Energy\" usage of miners is nowhere near as crazy as people make it out to be lol last I read it was somewhere in the ballpark of Sweden's energy consumption. \"equal to 0.21% of the world's supply.\"\n\nMaybe get mad at real global issues instead of pretending you care when it's all just salt about a GPU lol.",
            "score": 8,
            "author": "SkitZa",
            "replies": []
        }
    ]
}