{
    "id": "tqz2dh",
    "score": 129375,
    "title": "How far it's fallen. Bring back my dog.",
    "author": "SuppleFoxFluff",
    "date": 1648558330.0,
    "url": "https://www.reddit.com/r/pcmasterrace/comments/tqz2dh",
    "media_urls": [
        "https://i.redd.it/t2jnjbjskbq81.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome everyone from r/all! Please remember:\n\n1 - You too can be part of the PCMR! You don't necessarily need a PC. You just have to love PCs! It's not about the hardware in your rig, but the software in your heart! Your age, nationality, race, gender, sexuality, religion (or lack of), political affiliation, economic status and PC specs are irrelevant. If you love PCs or want to learn about them, you can be part of our community! Everyone is welcome!\n\n2 - If you're not a PC gamer because you think doing so is expensive, know that it is possible to build a competent gaming PC for a lower price than you think. GPU prices are sky high right now for a few reasons, but it's still possible to join the PCMR. Check http://www.pcmasterrace.org for our builds and don't be afraid to create new posts here asking for tips and help!\n\n3 - Consider joining our efforts to get as many PCs worldwide help the folding@home effort, in fighting against Cancer, Covid, Alzheimer's, Parkinson's and more. Learn more here: https://pcmasterrace.org/folding\n\n4 - Need some sweet PC hardware? Join the worldwide PCMR x ASUS ROG giveaway and enter to win Mobo+CPU combos, ASUS AIOs and more awesome stuff! https://www.reddit.com/r/pcmasterrace/comments/thd712/asus_rog_x_pcmr_worldwide_giveaway_win_the_ryujin/\n\n-----------\n\nFeel free to use this community to post about any kind of doubt you might have about becoming a PC gamer or anything you'd like to know about PCs. That kind of content is not only allowed but welcome here! We also have a [Daily Simple Questions Megathread](https://www.reddit.com/r/pcmasterrace/search?q=Simple+Questions+Thread+subreddit%3Apcmasterrace+author%3AAutoModerator&amp;restrict_sr=on&amp;sort=new&amp;t=all) for your simplest questions. No question is too dumb!\n\n\nWelcome to the PCMR.",
            "score": 1,
            "author": "PCMRBot"
        },
        {
            "level": 0,
            "comment": "An SSD you say? Let me still take 5 minutes thinking about what you're looking for..",
            "score": 5181,
            "author": "qster123",
            "replies": [
                {
                    "level": 1,
                    "comment": "I swear that windows has a lot of instances of [Schlemiel the Painter's Algorithm](https://en.wikichip.org/wiki/schlemiel_the_painter%27s_algorithm) all through its code. Even windows XP search was quite slow by comparison to other OS searching features.",
                    "score": 1469,
                    "author": "Anticept",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought the reason why a computer science degree was supposed to be \"necessary\" for a programming job was to prevent shit like this.",
                            "score": 218,
                            "author": "AshTheGoblin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You get the degree so you know how to properly express how slow and inefficient your algorithms are",
                                    "score": 261,
                                    "author": "djheat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "n^n^n^n^n",
                                            "score": 92,
                                            "author": "snorch",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It is. Unfortunately, proper algorithm design takes time, and when the execs want to ship *now* you don't always get the time to go back and fix it properly.",
                                    "score": 103,
                                    "author": "nictheman123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or they could just not try to reinvent the wheel every 5 years and keep the things that every1 think works great",
                                            "score": 63,
                                            "author": "IRLhardstuck",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But then they don't get to market that they have an improved feature and get people to pay more money",
                                                    "score": 25,
                                                    "author": "Darth_Thor",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I never got this. Cant they just apply a fresh UI over old stuff and be done with it? Why actually CHANGE the search function for example. They could say they made an improved one when in reality, they fucking didnt. Who is gonna know?",
                                                            "score": 13,
                                                            "author": "alexnedea",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Auditors. Auditors and nerds. \n\nBecause some nerd will get pissed off when the algorithm is being slow, and then they'll start running comparisons. They'll do tests. And they'll figure out that no, it's not actually any faster, there's no improvement in any way. And then our angry nerd files a complaint for false advertising, and in come the auditors, and they're gonna look at your source code. And when the source code of the algorithm is the exact same, you are fucked.",
                                                                    "score": 13,
                                                                    "author": "nictheman123",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If I took all the time I needed to build efficient programs, I'd be fired for not making deadlines.",
                                    "score": 45,
                                    "author": "KastorNevierre",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;\tSchlemiel the Painter's Algorithm (also spelled Shlemiel) is a term referring to a class of routines that may seem to perform well under small workloads but prove to be highly inefficient as they scale due to needlessly redundant operations that are performed at a lower level.",
                            "score": 921,
                            "author": "mimocha",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This fucking algorithm describes my company's code goddamn",
                                    "score": 424,
                                    "author": "Raestloz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Boss makes a dollar; I make a dime.\n\nThat's why my code runs in exponential time.",
                                            "score": 312,
                                            "author": "clearlybraindead",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Isn't this a software engineer Union chant?",
                                                    "score": 62,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I wouldn't be surprised. It seems like the kind of joke someone in the 80s would have made and I don't remember where I first heard it.",
                                                            "score": 24,
                                                            "author": "clearlybraindead"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I love you for this.",
                                                    "score": 7,
                                                    "author": "Nice_Guy_AMA"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 21,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Thats fascinating, time to explain to my rubber duck about Schlemiel and his adventures",
                            "score": 55,
                            "author": "Spy141414"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love when the dog starts and continues to sniff when hitting refresh.",
            "score": 1340,
            "author": "Redditor_RBN",
            "replies": [
                {
                    "level": 1,
                    "comment": "I miss this feature",
                    "score": 239,
                    "author": "Saleh_Alghanami",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I miss that future",
                            "score": 74,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "📎💬",
                                    "score": 61,
                                    "author": "__O_o_______"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "B - Bluetooth and other devices\n\nBl - Bluetooth and other devices\n\nBlu - Bluetooth and other devices\n\nBlue - Bluetooth and other devices\n\nBluet -  - Bluetooth and other devices\n\nBlueto - Bluetooth and other devices\n\nBluetoo - Bluetooth and other devices\n\nBluetoot - Bluetooth and other devices\n\nBluetooth - Search \"Bluetooth\" with Bing\n\n**BRUH**\n\n\\----\n\nThank you all for blowing this comment up into the stratosphere!",
            "score": 12552,
            "author": "CleverNameTheSecond",
            "replies": [
                {
                    "level": 1,
                    "comment": "Way to often have I had to hit backspace because I saw the search result I was looking for disappear.",
                    "score": 4759,
                    "author": "Vondi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This one happens to me all the time and the more accurate you get the worse it gets. Ca finds calculator but calc doesn’t. Crap like that. It’s really weird.",
                            "score": 2615,
                            "author": "Jhuderis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Especially infuriating because calc.exe is the process name for calculator.",
                                    "score": 1468,
                                    "author": "Neontc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The search box used to essentially be a run box. Was bliss.",
                                            "score": 691,
                                            "author": "frosty95",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "win+r gets pressed a lot on my keyboard",
                                                    "score": 287,
                                                    "author": "-arsenile-",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yep, WIN+R -\\&gt; \"calc\" -\\&gt; ENTER has been my defacto way of opening calculator for a decade now.\n\nNeed task manager, but hate the delay of having to navigate the windows lock screen? CTRL+SHIFT+ESC\n\nHave too many windows open and you need to see the desktop? WIN+D\n\nNeed a quick screenshot? WIN+SHIFT+S\n\nHotkeys make the world go round!",
                                                            "score": 311,
                                                            "author": "rsjc852",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I use all of these! Only pitfall about ctrl+shift+esc is that it doesn't send an actual hardware interrupt like ctrl+alt+del does which you might need if your system is very stuck.",
                                                                    "score": 110,
                                                                    "author": "BruhMomentConfirmed",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's the natural way of escalation for me anyway.\n\n* Press ctrl+shift+esc\n* wait 1 sec \n* press again \n* wait one sec \n* ctrl+alt+delete\n* ctrl+alt+delete\n* ctrl+alt+delete\n* ctrl+alt+delete\n* ctrl+alt+delete",
                                                                            "score": 113,
                                                                            "author": "Allyoucan3at",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "* Hold the power button, feeling like you're suffocating you computer to death with a pillow",
                                                                                    "score": 156,
                                                                                    "author": "B0Boman",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm not sure even ctrl+alt+del does that anymore. I think I remember getting hard lockups a few times and even that not helping.",
                                                                            "score": 18,
                                                                            "author": "coolguy8445",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It can't send a true interrupt over USB, because USB is a master/slave setup where the computer checks the USB line at a given polling rate and whatever is stored on the line has to wait until the computer gets around to checking it. On true PS/2 ports (not PS/2 over USB) the PS/2 sends an interrupt with every single keystroke.",
                                                                                    "score": 28,
                                                                                    "author": "No_Pension_5065",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Another one i like (not a keyboard shortcut but a shortcut nonetheless) if you ever need to do something in CMD or Powershell, you can open File Explorer and type either of those in the file path bar, and the program will open with the current file path set as the directory.",
                                                                    "score": 26,
                                                                    "author": "Reaperzeus",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That's a neat one to know!\n\nThe way I usually do that is shift+right click in the blank area of Explorer, then select \"open in Command Prompt\" (or something to the effect) from the context menu",
                                                                            "score": 11,
                                                                            "author": "rsjc852",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Win + E is one of my favorites. Opens the file manager. Now change the folder setting in file manager to open file explorer to This PC, and you will have the file manager the way it's supposed to be ;)",
                                                                    "score": 8,
                                                                    "author": "wotererio",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Want me to search the internet for calcium?",
                                            "score": 38,
                                            "author": "Yawzheek"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 194,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Where is it?",
                                            "score": 61,
                                            "author": "A-Delonix-Regia",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 147,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Fiddle with it and you tell us",
                                                            "score": 29,
                                                            "author": "DizzySignificance491",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 34,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "We need answers so we Can fix them",
                                                    "score": 28,
                                                    "author": "Androkless",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Windows + R, type “calc,” press enter. \n\nWorks for other things like “mspaint,” too. More reliable than shitty search bars.",
                                    "score": 94,
                                    "author": "LittleBitGhengisKhan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The only thing is you have to know the exact terms to use.",
                                            "score": 119,
                                            "author": "Dodototo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My nitpick exactly. This doesn’t make an intuitive OS “intuitive” at all.",
                                                    "score": 70,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Some process name that come up often:\n\n* \"calc\" calculator\n* \"cmd\" command prompt\n* \"dxdiag\" directX diagnostics\n* \"excel\" MS Excel\n* \"mspaint\" paint\n* \"winword\" MS word\n* \"snippingtool\" snipping tool\n\nWhile on the topic of useful hotkeys:\n\n* win+d hide/shows all windows/shows desktop\n* win+g game bar (built-in screenrecording with audio capture, may not work on enterprise installations)\n* win+prtscr saves a screenshot to pictures\\screenshots folder\n* win+shift+s screencap a region of the screen to clipboard\n* win+. opens a window that has a lot of emojis and unicode cartoons ☜(ﾟヮﾟ☜)\n* alt+prtsc screenshot the current active window\n* alt+f4 on desktop opens the shutdown/restart dialog",
                                            "score": 31,
                                            "author": "Mackerel_Mike",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "YES.\nJesus Fuck.\nI really thought I was the only poor bastard dealing with this.\n\nIf I put in the full term, my search results disappear, and are replaced with irrelevant nonsense.",
                            "score": 186,
                            "author": "hippymule",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[Those guys who worked on the Cuil search engine had to find work somewhere.](http://cuiltheory.wikidot.com/what-is-cuil-theory)",
                                    "score": 13,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This makes me rage",
                            "score": 23,
                            "author": "AshTheGoblin",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It’s intentional because it assumes that if you didn’t click the result, it’s not the one you are looking for, so it makes it disappear and gets something else. In theory it’s a great implementation, but in practice it’s annoying because you write the whole word before you want to click on any of the results.",
                            "score": 32,
                            "author": "shy_monkee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wish someone would come up with the theory that no one ever wants Microsoft to search the web for them",
                                    "score": 54,
                                    "author": "pistoncivic",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Note - top result: Notes app    \nNotes - top result: Notepad",
                    "score": 830,
                    "author": "ChimneyImps",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "N - Notepad  \nNo - Notepad  \nNot - Notepad++  \nNote - Notepad  \nNotep - Notepad   \n\nWhy is it like this?!?",
                            "score": 518,
                            "author": "Do-it-for-you",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is mine right now:\n\nN - Notepad++  \nNo - Notepad++  \nNot - Notepad++  \nNote - Notepad  \nNotep - Notepad   \nNotepa - Notepad   \nNotepad - Notepad   \nNotepad+ - Notepad   \nNotepad++ - Notepad   \n\nBUT... for notep-notepad the results change. I've typed it in multiple times and what's written is the initial result. Now, anything after notep is a gamble lol",
                                    "score": 302,
                                    "author": "bad-r0bot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I got notepad all the way until \"notepad++\"",
                                            "score": 41,
                                            "author": "cough_e",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's so frustrating. Lately I've had it suggest me the uninstaller for the app I'm searching for, instead of the app. \n\nIf I type in \"cura\" the actual cura app isn't in the results, only the uninstaller. I have to navigate the start menu like a barbarian to launch it",
                                    "score": 183,
                                    "author": "malfist",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No steam results, even when the icon is on the desktop.",
                                            "score": 43,
                                            "author": "AquaeyesTardis",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "User: N\n\nWindows: Telemetry tells me that 91% of users who type N want the notepad. Here it is.\n\nUser: No\n\nWindows: I know. You want the notepad. Here it is.\n\nUser: Not\n\nWindows: I showed it to you twice and you didn't click it. Are you trying to find something else? Notepad++? Is this it?\n\nUser: Note\n\nWindows: What do you want? There's nothing else that starts with note. Are you looking at the keyboard while you're typing? I'll just show you notepad until you decide to look up because I'm 91% sure that's what you want. Maybe Microsoft will give me eye tracking capabilities in a future update so I can give more accurate results next time.",
                                    "score": 122,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's a terrible algorithm if so, and a waste of time (sorry whoever coded it if true lol), someone should've noticed it in UX testing.\n\nThat said there definitely is a terrible algorithm at play, whatever it is, the words above are still true. They've overcomplicated the wheel and now it's a clunky square.",
                                            "score": 66,
                                            "author": "HyperGamers",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Its annoying because you just know it's someone's job to come up with solutions to problems literally no one is having. But obviously he can't just be like \"we don't need to add anything this is perfect\" because that's just admitting g that his job is unnecessary. Is there a term for this?",
                                                    "score": 13,
                                                    "author": "MajesticAsFook",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "notepa - Uninstall notepad",
                                    "score": 38,
                                    "author": "BirdsGetTheGirls",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is it possible windows search is just a misunderstood aspiring comedian",
                                            "score": 34,
                                            "author": "KennyFulgencio",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Bing search for dxdiag\n\nVery cool windows. Thanks.",
                    "score": 141,
                    "author": "ZoomBoingDing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "CMD - Bing search command prompt",
                            "score": 44,
                            "author": "derrida_n_shit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "~~SHHHHHhhhhhutup! Stop giving them new, terrible ideas. They already have way more than enough of those on their own.~~\n\nEdit: I realized a second later what you actually meant which is already the awful reality, and not the way worse thing I was thinking. Nevermind.",
                                    "score": 12,
                                    "author": "Lysdexics_Untie"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I typed in \"word\" because I was feeling to lazy to open the start menu.  You'd think it would open the program but no...  It searched for the definition of word on bing.",
                    "score": 96,
                    "author": "Badgers_or_Bust",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or opens wordpad instead of word",
                            "score": 19,
                            "author": "microwavedcheezus",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "sometimes it does this at the last second while im typing fast and when i hit enter without thinking microsoft fucking edge practically bursts out my monitor and smacks me in the goddamn face",
                    "score": 600,
                    "author": "Masonixx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's basically a vampire that tricks you into inviting it into your home",
                            "score": 149,
                            "author": "TheRealSpidey",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 22,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "d - Download Settings\n\ndo - Download Settings\n\ndow - Download Settings\n\ndown - Download Settings\n\ndownl - Download Settings\n\ndownlo - Download Settings\n\ndownloa - Download Settings\n\ndownload - Download Settings\n\ndownloads - Download Settings\n\nHOLY FUCK WHY CAN'T IT FIND THE MOST IMPORTANT FOLDER IN 2022\n\n(╯°□°）╯︵ ┻━┻",
                    "score": 274,
                    "author": "treestick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why are you downloading stuff, it should all be in the cloud! /s",
                            "score": 92,
                            "author": "decoyq",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Yes, we've had One Drive, but what about Second Drive?\"",
                                    "score": 47,
                                    "author": "Whiskinz",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This hits close to home",
                    "score": 24,
                    "author": "LukeTheGeek",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Used classic shell for years and always thought: It can't be that bad right? Well I got a new pc now (with Windows 10 still) and holy shit it really is that bad!",
                    "score": 18,
                    "author": "The_Blue_DmR",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude windows 10 is so much better than windows 11. I can still use the search bar to find apps in windows 10. I can't usually find text files, but at least executables. Windows 11 can't even find executables.",
                            "score": 12,
                            "author": "majic911",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just went to my computer right now to search for an image file, and search in windows tried to use Edge and immediately failed because I was offline.\n\nWTF is this?",
                    "score": 18,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "The most infuriating thing. Is it so hard to show two options at least? The menu you are looking for and the option to search?",
                    "score": 33,
                    "author": "9966",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Holy shit, the accuracy of this comment tilted me off the face of the planet. But I also feel vindicated.",
                    "score": 24,
                    "author": "Ol_Big_MC",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I don’t agree with it, but this is actually a feature, especially for NLP-based algos.\n\nSince the algo already suggested you that option and you continue to type, it assumes that you actually want a different thing and shows you something else.\n\nIt’s poorly implemented, though. It should be able to understand when you want to search online and also learn your habits. If you never use the bing search feature, it should suggest it less. However, that doesn’t benefit MSFT.",
                    "score": 57,
                    "author": "lanabi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With the massive bug that it presumes the user is continuously paying attention to the results as they get presented, pausing to peruse at each keystroke.",
                            "score": 68,
                            "author": "jj4211",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even if you're staring right at it you usually type faster than it can refresh or you can really read and comprehend what it's showing.  And I'm barely above hunt n' peck level typist.",
                                    "score": 29,
                                    "author": "My_Work_Accoount",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That sounds great for people who reevaluate their life every time they press a single key on their keyboard.",
                            "score": 9,
                            "author": "Slime0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "may I recommend to you PowerToys which has, among other useful features, PowerToys Run, which is what the Start search should be?",
                    "score": 6,
                    "author": "longoon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Download Everything and never look back.\n\nhttps://www.voidtools.com/",
            "score": 5107,
            "author": "AnAncientMonk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can only vouch for this. Literally searches *everything* almost instantly",
                    "score": 1563,
                    "author": "Kumakobi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't understand the quality divide between the two.\n\nIt's literally mind boggling how large it is.",
                            "score": 955,
                            "author": "MilkoPupper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Everything is designed around what the user wants.\n\nWindows Search is designed around what Microsoft wants.",
                                    "score": 1761,
                                    "author": "amorpheus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Windows is designed around what Microsoft needs",
                                            "score": 447,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "# Money",
                                                    "score": 302,
                                                    "author": "Iuse_arch_btw",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They better watch out because Linux is coming for them\n\nEdit: like a slow, aching turtle 🐢",
                                                            "score": 178,
                                                            "author": "ring2ding",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It's the year of Linux on the desktop!\n\n\\- Beards since 1998",
                                                                    "score": 149,
                                                                    "author": "JerryWShields",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 33,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I'd say steamdeck is a decent start.",
                                                                                    "score": 18,
                                                                                    "author": "Prestigious-Move6996",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "A person that uses Bing?",
                                                    "score": 57,
                                                    "author": "Scarbane",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They will literally give you money to use Bing through Microsoft rewards. It comes off as desperate",
                                                            "score": 91,
                                                            "author": "EvanMBurgess",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It's all about getting your data. \n\nIf they pay you a penny for a search, they're selling it for 5",
                                                                    "score": 43,
                                                                    "author": "Crazy_Is_More_Fun",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 24,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "As much as big companies shy away from porn in public views. I highly suspect that the data gets crunched just the same as any other. Fed into the every growing maw of AIs and Algorithms to guess what you're thinking and what you will want next",
                                                                                    "score": 22,
                                                                                    "author": "Crazy_Is_More_Fun",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I saw it on this Microsoft Reward programme (sent an email) that you get 5 points with every Bing search or something like that. What the points are for, I got no clue. They're trying.",
                                                            "score": 21,
                                                            "author": "rtz13th",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You can redeem the points for £5 vouchers if you get enough. It's how I got the Apex Legends battle pass for free.",
                                                                    "score": 25,
                                                                    "author": "VeryMoistWalrus",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's gotten so bad since windows 8. More and more cloud integration, random updates, random 100% disk usage, hidden processes, I have no god damn clue what windows is doing half the time.",
                                                    "score": 29,
                                                    "author": "DrScience-PhD",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Microsoft is getting really fucking bad with forcing people to create Microsoft accounts just to use Windows. \n\nI haven't even thought about using Windows 11 yet and I am a tech enthusiast.   \n\nAlso, apparently my gaming rig that outperforms 99% of the computers in the world does not meet the requirements of Windows 11.",
                                                            "score": 28,
                                                            "author": "mangobattlefruit",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Protip, don't connect it to a network during the initial setup. It gives up asking for an account and phoning home when it can't.\n\nEDIT: This is for 10, no idea on 11, fuck that noise.",
                                                                    "score": 18,
                                                                    "author": "BURNER12345678998764",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I so badly wish my games all worked on linux I'd move so quickly I hate windows so much. All the bloat, onedrive I know I can deactivate or delete some shit but some shit also comea back with updates. Half the tike i try to edit certain files I can't cause fucking onedrive is trying to sync or is running into error, I don't need my documents backed up 90% of the time it's a game pdf/readme idgaf.\n\nI've disabled it before cause it's useless on top of the fact my internet is dogshit so all those interneted connected bullshit gives me errors most of the time that seemingly no one fuckin gets. Steam takes me several attempts to \"go online\" or to \"retry\", discord once it disconnects I have to either turn a VPN on or flush my dns via cmd and thrn launch it in admin mode.",
                                                                    "score": 8,
                                                                    "author": "Ezreol",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "that random 100% disk  + my laptop being a super low end laptop (as it is really old) just kills me. It became so bad over time that I couldn't even run a simple search on it.. Finally moved to linux (pop os) and man the speed I am getting is just unparalleled. The ram usage dropped by about 65%. Windows is just becoming heavier and heavier with every update If you have a low end pc and are not that much into gaming(cuz games on linux suck XD), deff recomend linux",
                                                            "score": 11,
                                                            "author": "dfnoid27",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Honestly. I would probably use a lot more Microsoft services if they didn’t force me to use Bing for everything.",
                                            "score": 10,
                                            "author": "DirectFrontier",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If you are comfortably logging into reddit and writing a comment, you are effectively in the elite tier of computer users. Remember, whole companies exist and turn a profit on cold calling people claiming to be from microsoft and scamming them out of money. The changes to the default ui are based on extensive user surveys and testing. I would bet money that the opinion of the ui designers towards users like you and I would be along the lines of \"fuck it, they can figure out how to install someone's github project if they really care enough\".  \nI am also frustrated by modern user interfaces, but have to remind myself that they aren't designed for users who can actually use their computers.",
                                    "score": 63,
                                    "author": "apaniyam",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; they aren't designed for users who can actually use their computers\n\nThis explains a lot.",
                                            "score": 40,
                                            "author": "123_alex"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Look mum, I've made it, I'm an elite tier computer user.",
                                            "score": 23,
                                            "author": "Kuentai",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "also I found this toolbar you can install: [https://github.com/stnkl/EverythingToolbar](https://github.com/stnkl/EverythingToolbar)\n\nactually goated. Everything literally saved me a ton, when a program perma deleted all my desktop files for some reason, to locate those files at %Recycle.Bin folder and recover them.",
                    "score": 381,
                    "author": "fuckrobert",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "2002: *\"Whatever you fucking do, don't install any toolbars onto your computer, they're all cancer\"*\n\n2022: *\"Download this toolbar onto your computer, it'll cure its cancer\"*",
                            "score": 425,
                            "author": "McFlyParadox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Aaaaand I'm old. Fuck.",
                                    "score": 67,
                                    "author": "Sarctoth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "2006 kids drive themselves to work",
                                            "score": 15,
                                            "author": "The_Level_15"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Well, an open source project on github where you can literally review the code it would be running is slightly different than a flashing ad banner telling you it can install more ram.",
                                    "score": 138,
                                    "author": "i_sigh_less",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also a piece of software that you go out of your way to search, download and use is different than a piece of software that preys on you clicking Next without paying attention while installing some unrelated things.",
                                            "score": 62,
                                            "author": "ncann123",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hey, in my younger years I voluntarily installed and used Google Toolbar, and I liked it! I of course had the StumbleUpon toolbar too (man, I had totally forgotten that even existed...)",
                                                    "score": 28,
                                                    "author": "clb92",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "yesss someone else remembers StumbleUpon!!!\n\ni still have it installed on my college laptop thats somewhere in the closet.",
                                                            "score": 13,
                                                            "author": "Shishkebarbarian"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is the one, everything is great but I hate having a seperate window for it. Thank you for this!",
                            "score": 34,
                            "author": "Tron_Kitten"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\nWithout Eartrumpet, Everything, TreeSize, Various Hardware Monitoring Tools, 7Zip, Ad Blockers, Handbrake, Cookie Banner remover and a ton of other widgets and tools I wouldn’t even know how to use a PC and browser",
                    "score": 282,
                    "author": "Lutrek11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I still use this ancient thing called [Foldersize](http://foldersize.sourceforge.net/) does all i want it to do. I can easily find / sort for the biggest files on various drives.\n\nIs TreeSize smilar? Is it a standalone app that i have to run or does it offer a sweet \"next to the explorer\" type deal like foldersize?",
                            "score": 75,
                            "author": "AnAncientMonk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, it’s a separate GUI which shows you visually where and in which folders your used up disk space lies. It’s neat tool, although I would recommend WinDirStat since it is open source.",
                                    "score": 64,
                                    "author": "RocketMoped",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "WizTree does the same thing as WinDirStat except much, much faster",
                                            "score": 70,
                                            "author": "Spwntrooper",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Recently switched too. The speed difference is substantial but they work very similarly",
                                                    "score": 15,
                                                    "author": "walkingman24"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "https://www.diskanalyzer.com/wiztree-vs-windirstat\n\nDang, wish WinDirStat would figure out what they're doing and copy it, since it's open source.",
                                                    "score": 15,
                                                    "author": "nishinoran",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don't forget Ditto clipboard manager, I'm shocked that people don't talk about that more. Being able to quickly access things you recently copied is amazing \n\nShareX is also mandatory for me, i use it so much",
                            "score": 30,
                            "author": "YobaiYamete",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Have you tried using Win+V to paste? The first time it will ask you to enable clipboard history. After that Win+V will let you view everything you've copied to clipboard recently. I'm not sure how far back it remembers, I currently have stuff going back to yesterday morning when I last logged into Windows, but clearly at least 24 hours.",
                                    "score": 28,
                                    "author": "KingZarkon",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Why hasn't ninite added these?",
                                    "score": 7,
                                    "author": "saadakhtar"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "spacesniffer is an invaluable tool for me",
                            "score": 11,
                            "author": "oskarkeo",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can this show me folders by size?  Tryin' to get some drivespace back, but Windows hates showing folder sizes...",
                    "score": 33,
                    "author": "DJ_Zephyr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Try WinDirStat. Shows folders by size graphically. So you can be like: “what’s that enormous dat file buried in that folder?!?”",
                            "score": 51,
                            "author": "jonfitt",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I have used Spacesniffer with unmitigated success",
                            "score": 12,
                            "author": "Fun3mployed",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Motherfucker, that just found a file I've been looking for for DAYS, on the first attempt. Thank you.",
                    "score": 25,
                    "author": "zvika"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's a GPO to disable the Bing search in the bar. It's unbelievable how much more useful the search bar is with Bing disabled.",
            "score": 1115,
            "author": "ABotelho23",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can also disable it straight through the registry. Its pretty easy.",
                    "score": 362,
                    "author": "mrjackspade",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Should be easier though... Or just the default.",
                            "score": 325,
                            "author": "lahire149",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Funnily enough, it was.\n\nIt was removed at some point, but disabling web search used to just be a right click option on the menu. It was incredibly fucking easy, and it was one of the first things I disabled on 10.\n\nAt some point they either changed or removed the option. \n\nThere is still this\n\nhttps://www.tenforums.com/attachments/tutorials/298071d1600443184-enable-disable-show-cloud-content-search-results-windows-10-a-cloud_content_search.png?s=a40204469c7b01b50f22d2ae5f86256c\n\nWhich looks like it does the same thing, but I cant confirm since I have everything registry disabled.",
                                    "score": 194,
                                    "author": "mrjackspade",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nope; turned off, it still \"searches the web\".",
                                            "score": 56,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Have you tried rebooting?\n\nJust for the fuck of it.\n\nI can't imagine you'd have to with a setting like this, but I did have to reboot for the registry change to take effect.\n\nI have three Windows 10 machines and non of them are searching the web right now, and I'm too scared to fuck around with it out of worry I'll never be able to disable it again.",
                                                    "score": 17,
                                                    "author": "mrjackspade",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It was off when I pulled it up, but still \"searched the web\"; I completely shut down (not just 'hibernate' or  'sleep') every day. I had to go into the Registry and kill it there - and the \"kill location\" changes depending on your W10 build.",
                                                            "score": 9,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 97,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 38,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah is there a guide or tool to easily return Windows to a more usable and less irritating state??",
                                    "score": 16,
                                    "author": "__O_o_______",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Windows Decrapifier \nhttps://www.makeuseof.com/windows-10-decrapifier-debloater/",
                                            "score": 45,
                                            "author": "1studlyman"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is huge news, literally just learned how to create a group policy for work, now I can put it to use for myself let's go (:",
                    "score": 18,
                    "author": "Dogeishuman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "By default, Windows only indexes your home folder. This is an absolutely fucking stupid default that ignores the fact that nobody uses their storage this way on a Windows machine. \n\nTo fix it, Start - type \"indexing\" - Indexing Options - click Modify - add all the places you want Windows to index. \n\nIt's still not the best, and it still clutters up with Bing shit, but it will improve the functionality.",
            "score": 413,
            "author": "shggybyp",
            "replies": [
                {
                    "level": 1,
                    "comment": "To fix it just install Everything which uses the NTFS file table so it instantly has your entire computer instantly searchable. If you create a new file, it’s in the index because the file table itself is what everything uses.",
                    "score": 140,
                    "author": "anethma",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I read that as\n\n&gt;which uses the NFTs\n\nand nearly imploded",
                            "score": 109,
                            "author": "Jaakarikyk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's really fast. But costs $40,000",
                                    "score": 51,
                                    "author": "saadakhtar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ahem. It's actually a certificate showing you that you own the fast search program at a specific link (hosted on somebody's random server which may or may not always exist, of course).\n\nSure, other people own randomized versions of the same program with slight tweaks, and anyone can *use* your version of the program by just going to that link, but you have the pride of knowing you own it for $40k.",
                                            "score": 16,
                                            "author": "JTtornado"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gonna be honest... the way I handle this now is just by keeping track of my shit myself. Folders for journal, work, finances, etc. Shit goes where it belongs cus I put it there. If I haven't touched it yet it's in Downloads.",
            "score": 501,
            "author": "bxsephjo",
            "replies": [
                {
                    "level": 1,
                    "comment": "or documents  \n\n\ndownloads and documents the universal trash folder, well mostly downloads for me now because i don't want random files on onedrive",
                    "score": 103,
                    "author": "zzcool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I de-linked onedrive and documents.",
                            "score": 21,
                            "author": "bilgediver",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same, I have separate trash-documents and synced-documents. A lot of games create random files in Documents hogging up the space. :/",
                                    "score": 15,
                                    "author": "Koder1337"
                                },
                                {
                                    "level": 3,
                                    "comment": "Lol y'all actually have Microsoft accounts tied to your login?  Because if you don't onedrive is always off.",
                                    "score": 16,
                                    "author": "HighOwl2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't mind having onedrive, it's just that I ran into issues with having documents taking control away if it was linked to onedrive, so I de-linked it.",
                                            "score": 10,
                                            "author": "bilgediver",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thats how it should be. 8ve helped too many people remotely who just had icons everywhere. I saw a desktop so full that icons started stacking on each other in the top left corner. Like man, if only there was some sort of container you could organize these files into....",
                    "score": 8,
                    "author": "creegro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "About sums it up too.",
            "score": 315,
            "author": "Eagle2502",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep! If I wanted to search the internet for a file name, I’d search it in the browser.",
                    "score": 259,
                    "author": "Nytr013",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But then bing would be used less",
                            "score": 116,
                            "author": "MrStoneV",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Here, let me change that default for you while you sleep\"",
                                    "score": 91,
                                    "author": "asianabsinthe",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You kidding me? On XP it built the filetable from scratch every time you entered a new query.\n\nJust use the search field in the explorer window, instead of the Cortana one.",
            "score": 227,
            "author": "FNLN_taken",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah. I was looking for some sanity here. WinXP search was absolute garbage. Just because Win10 search is broken in a different way, doesn't mean we can pretend that search in Windows has ever been a particularly good feature. Back when everyone was on HDDs the search indexer would sometimes grind the entire computer to a halt randomly as well.",
                    "score": 76,
                    "author": "vemundveien",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I am convinced that everybody upvoting the original post did not actually use the Windows XP search feature. It was terrible.",
                    "score": 88,
                    "author": "j_cruise",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It really was, I came here just to find the comment chain calling it out. I loved Windows XP, but the search was somehow even more garbage than the barely functional search we have now.",
                            "score": 24,
                            "author": "Yemm",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeah. The results were mixed at best (though often better than Cortana), and it was super slow.  One of the few major issues XP had, imo.",
                            "score": 8,
                            "author": "SalsaSavant",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have no idea what people are on about. It’s so much better than it used to be. People don’t remember that search was basically useless on PC for a very long time.",
                    "score": 7,
                    "author": "fungi_at_parties",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck windows search, and welcome Everything forever.",
            "score": 13,
            "author": "KingofGnG"
        },
        {
            "level": 0,
            "comment": "That's some hella rose tinted glasses y'all are wearing. The Windows XP search was ass.",
            "score": 318,
            "author": "mt_xing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was thinking the exact same thing. Also this is comparing two different tools, XP never had a combined search which is what the newer versions of Windows have. The newer versions still retain the search from within file explorer.\n\nThe combined search is still ass as well, but apples to oranges and all that...",
                    "score": 53,
                    "author": "KesselRunIn14",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol Windows XP search legitimately never got it right it would fail to find so many files.",
                            "score": 10,
                            "author": "mura_vr"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It was effectively useless.",
                    "score": 13,
                    "author": "Mrhiddenlotus",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It was absolute rubbish. I never used it because it sucked HARD.  \n\nI don’t think op ever used xp.",
                    "score": 35,
                    "author": "LorenzoCol",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And File Explorer's search bar does this just fine anyway. It's two clicks away.",
                    "score": 61,
                    "author": "def_of-insanity",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I only use it for programs, it’s pretty good at that",
            "score": 142,
            "author": "Bigbuster153",
            "replies": [
                {
                    "level": 1,
                    "comment": "For me Powertoys Run is better, opens with a shortcut, can do math, open apps, search the web and all that, and doesn't block the entire screen like the win 11 search panel",
                    "score": 52,
                    "author": "gamesrebel123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; For me Powertoys Run is better, opens with a shortcut, can do math, open apps, search the web and all that, and doesn't block the entire screen like the win 11 search panel\n\nI tried Powertoys but settled on Euli, give it a try...it's amazing and can use everything as a plugin. \n\nhttps://ueli.app/",
                            "score": 13,
                            "author": "Andrew_hl2",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't forget all the random ass quick launch folder suggestions. Oh wow, look at that, the folder with all the contents of my old laptop....great.",
            "score": 60,
            "author": "BeardedManatee",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Bring back Bonzai Buddy",
            "score": 10,
            "author": "DrunkWeebMarine",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How about the search function in the File Explorer? To be fair I only use that one and never the start.",
            "score": 10,
            "author": "why_no_salt",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Computer\\\\HKEY\\_CURRENT\\_USER\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\Explorer  \nDword DisableSearchBoxSuggestions=1",
            "score": 50,
            "author": "christurnbull",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also\n\nHKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Search\n\nCreate a DWORD 32 named BingSearchEnabled. Set to 0.\n\nThe fact that you have to fiddle around in regedit is still infuriating.",
                    "score": 24,
                    "author": "OrangeInnards",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any linux file manager:\nHeres what u want, do u want to search for files with that word on the content too",
            "score": 48,
            "author": "Dany_B_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Does anyone know why it's like this? Like was it a design choice of some kind or are computer hard drives just way bigger and harder to search now",
            "score": 63,
            "author": "Grouchy-Offer-7712",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's several factors, but the biggest is what the meme points out with the old search only searching your files, and the new one also including internet searches, apps, etc. They wanted it to be your go to search engine, but as far as I know almost no one uses it that way. \n\nWhat you pointed out is also a small factor too. There are not only significantly more files, but its much more commom to have multiple drives too. Theoretically, it shouldn't make a difference because of indexing, but Microsoft's indexing isn't very efficient.",
                    "score": 59,
                    "author": "no1-important-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Old people use it that way. I've hidden it so they would stop saying \"they've been hacked\" because they ended up somewhere strange in bing.",
                            "score": 26,
                            "author": "asianabsinthe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That blows my mind. I can't even get the older employees at my work to use it to search for installed programs. If it's not on their desktop, it's not on the computer apparently.",
                                    "score": 27,
                                    "author": "no1-important-",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*out of sight out of mind*\n\n*can't see shit with 10 billion desktop icons*\n\n\"How the fuck do you find anything?\"",
                                            "score": 10,
                                            "author": "asianabsinthe"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve never understood how I can type in the name of an application on my computer letter for letter and windows goes\n\n“cAnT fInD iT”",
            "score": 36,
            "author": "Treigns4",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Pretty sure theres an option to make windows search go beyond your user folder.\n\nBy default it only searches the desktop, documents, music, video and maybe a couple more folders.\n\nAlternatively, you can just create a desktop folder and throw in shortcuts to everything important you have.",
            "score": 5,
            "author": "michelas2"
        },
        {
            "level": 0,
            "comment": "I have used Everything ( https://www.voidtools.com/downloads/) for like 10 years for this reason haha. Check it out",
            "score": 7,
            "author": "ovard",
            "replies": []
        }
    ]
}