{
    "id": "1073qc8",
    "score": 3,
    "title": "Is it weird I shake every time I feel a strong emotion ?",
    "author": "pussyslayer2point0",
    "date": 1673236035.0,
    "url": "https://www.reddit.com/r/emotions/comments/1073qc8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I repress my emotions a lot and I’m in therapy to deal with that. But is it weird that since I don’t allow myself to express the feelings through tears and things like that, I shake ??\nPositive feelings, excitement, hope, stress and anxiety, fear obviously but also anger and sadness (which also makes me nauseous?) \nIs it normal ? Should I try to stop and how can I if I should",
    "comments": [
        {
            "level": 0,
            "comment": "Ya know this happens to me too. I havent told anyone but my wife and only because she saw it happen. I thought i was just being weird but reading this im curious what causes it then. I have PTSD from a career i had in Law Enforcement and i used to get flashbacks and right before it happened i would get overwhelmed with a plethora of emotions and start shaking or my entire body would tense so hard it hurt. If you find answers give an update plesse.",
            "score": 2,
            "author": "Classic_Yogurt_3769",
            "replies": [
                {
                    "level": 1,
                    "comment": "ooh I see \nI’ll share the answer if found :)\nGlad I’m not alone (also same only my partner knows)",
                    "score": 1,
                    "author": "pussyslayer2point0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey there. Thanks for reaching out. Involuntary shaking can be indicative of some serious concerns like epilepsy, Parkinson’s, etc. but in the context of repressed emotions it has a ‘normal’ place as the body is trying to discharge the emotional charges it harbors. Similar to when an animal is threatened in the wild, when it eventually reaches a safe place, it will shake as an involuntary response to what it just encountered. This discharges the excess energy and helps the central nervous system to reset. With guidance from your therapist and other medical professionals you may want to share this to rule out any more serious possibilities. This isn’t medical advice of course so it’s anecdotal but hope it gives you some direction to pursue for peace of mind.",
            "score": 2,
            "author": "FitRefrigerator7256",
            "replies": [
                {
                    "level": 1,
                    "comment": "In terms of what to do about it, work with your therapist to find healthy ways to PHYSICALLY discharge emotions so the repressed stuff has a physical outlet. Otherwise, that energy building up in your system can really disrupt the other healthy bodily functions.  If there’s so much stored in your system you also have to be careful about not discharging all at once as that can be quite intense. Looking for support from experienced somatic experiencing practitioner may be a nice supplement to guide this type of process.",
                    "score": 2,
                    "author": "FitRefrigerator7256",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are so helpful, I can’t thank you enough \nthe example about the animal makes so much sense because most of the times I shake with a lot of intensity, I’m feeling very safe \nThank you",
                            "score": 1,
                            "author": "pussyslayer2point0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Great. You’re welcome. If it helps you can also try actively talking to yourself in these situations. To assure yourself it’s ok. The “voo” breath might also be helpful if you wanna look that one up. It’ll help to calm you but realize just calming and not releasing is still repressing.",
                                    "score": 2,
                                    "author": "FitRefrigerator7256",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i'll look that up, thank you",
                                            "score": 2,
                                            "author": "pussyslayer2point0"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}