{
    "id": "11d2ohg",
    "score": 3,
    "title": "Are my emotions valid?",
    "author": "technomaster_45",
    "date": 1677472178.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "Your feeling are of course valid! \nCompletely inappropriate questions from your “teacher”.\nThis is exactly the kind of behaviour and way of thinking that is rampant in religious groups. It’s disgusting. \n\nThere’s is absolutely NO rush to be in a relationship. Trust me, there are SO many people who never have a relationship until they’re in their 20s. If you haven’t found someone who you click with yet, then that’s absolutely fine! Please don’t let anyone make you feel weird about that. They’re the ones who should feel weird about pressuring a god damn 18 yo into getting into a relationship. It’s disgraceful. \n\n\nYou. Do. You. \n\nI understand no wanting to tell your mother you don’t want to go to church, but you’re technically an adult now. She can’t force you. She’ll get over it. \nPersonally, I would get out of those circles asap. \nOrganised religion is poison. Especially in the US. It’s terrifying to the rest of the (western) world how extreme it is. \nI believe in some higher power, but I don’t need religion to tell me how to be a good person or how to live my life. You don’t either. \n\nSorry for the slight rant. But when I hear these kinds of stories red flags just start jumping up in my brain.\n\nI hope you find your solution to your situation 🙏\n\nTL;DR Your feeling are absolutely valid. It’s creepy and weird to be talked to like that by a teacher. \nTell your mother that’s you’re an adult and you don’t want to go anymore.",
            "score": 1,
            "author": "irishboy491",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the insight",
                    "score": 2,
                    "author": "technomaster_45"
                }
            ]
        }
    ]
}