{
    "id": "11eq52j",
    "score": 1,
    "title": "Every time I'm reminded of Death.",
    "author": "External_Factor2516",
    "date": 1677633601.0,
    "url": "https://www.reddit.com/r/emotions/comments/11eq52j",
    "media_urls": [],
    "other_urls": [],
    "postText": "Eversince I my cat Juni passed away, I've been harboring a great darkness inside, I either want to live in a state of perpetual childlike brilliance like my genius cat Juni and become immortal to spite the reaper for taking him from me, or something much darker, because I miss him everyday.  I know some people don't see animals as people so they don't think you can compare the loss of an animal to the loss of a human being, but Juni was my confidant and partner in crime.  Without him I feel like a  discarded shell in a perpetual state of half life. I distract myself with projects and with acts of kindness and love, but when I see death all I can feel is loss and rage and mix of helplessness and stubborn defiance.\n\nIn other words I'm sorry anyone experiencing the death of a loved one is part of my club. Because it doesn't just force us to come to terms with our own mortality, but with the shelf life of our bliss as well.\n\nJuni actually saved Charlie.\n\nMy mom's cat.\n\nHe was a good friend.\n\nNot just to me but as a matter of principle. A good guy.\n\nIt drains me to know my little best friend is gone.\n\nI have other loved ones, and they'll probably hurt too when they pass, but Juni was the first person I saw as a person when my brain was developing as a little kid. And he taught me how to be good.\n\nThere's no replacing somebody like that. You're just blessed if you meet them.\n\nIt's been almost 4 years since his passing but I feel exactly the same mentally as I did when I felt his soul leave the Earth.\n\nIt's like my brain's ability to grow and the harmony between my mind and my body was broken.\n\nTime stopped for me when he passed, and it's still stopped.\n\nI age and things around me change, but I'm missing something.\n\nSomeone pressed pause on my desire to move forward through time.\n\nThe fact that I'm getting older without my mind getting older too, it just feels like my body is slowly becoming alien.\n\nI'm trans btw so my body has felt alien my entire life, atleast my face shoulders and between my legs.\n\nI came out like a year before my cat died and immediately started treatment and immediately felt better.\n\nBut now, the passage of time feels like a joke and as I age I experience a sort of age disphoria.\n\nBefore as I was aging each year felt rife with new possibilities.\n\nNow each year feels like last year but a little worse for wear.\n\nI take antidepressants and they help (I'm no longer crying everyday).\n\nAnd most day I feel genuinely good.\n\nBut I can't shake feeling stuck.\n\nMy best friend was my anchor in time and space, the only other person I felt a deep almost dragon-rider like bond with.\n\nThe closest thing I think that might compare is having a siamese twin who dies before you. And then having to get them amputated and every day feeling a little bit too light and a little bit too lonely.\n\nJuni was like my kid but he quickly grew into a mentor and an inspiration, and a best friend, and someone who always believed me when I was telling the truth.\n\nIt was like we could see into eachother's minds.\n\nI'm too poor to get cryogenically frozen because I'm disabled, but I want to.\n\nI want to get cryogenically frozen and then on an atomic level have my nerves and nuerons throughout my whole body isolated and voxelated and simulated, and then I want to live a dual existence as someone with a private virtual world (preferably high-end like the inside of the space needle) and an android body I can control over wifi, through virtual vr in my virtual loft where my virtual body houses my virtual brain.\n\nEither that or I want a brain (and brainstem) transplant into a younger clone genetically engineered to have a longer shelf life than the shit nature cooked up, using jellyfish and naked mole rat genes.\n\nOption A seems the easiest and least ethically frought and it will turn me into my own daughter and won't really cheat the reaper out of taking me, but if my daughter who thinks she's me and for all externally measureable intents is me, if she plays her cards right death won't be able to take her out, she'll be able to witness the end of the universe and if we don't find ways to escape the universe then death will win.  But I'll have put up the best fucking fight.\n\nWhen death decided my Juni wasn't special enough to last forever or atleast last as long as me: \n\nDeath made a fucking enemy.\n\nI don't care if you're a cosmic force.\n\nYou and your alternate form Life gave my cat cancer and took away his hope and forced me into handing him over just to end his suffering!  You're fucking worse than the mafia!\nYou have no grace, and although DC comics envisions you as a goth girl whom I would totally flirt with;  you stole my fucking cat, so prepare for the WORST fucking tantrum you've ever seen!  I will end endings if I have to!\n\nI will fucking write an AI that takes stories that end and allows them to go on forever! Like the videogame Roy from Rick and Morty! With additional settings to decide whether the world in the story has death&amp;suffering or not anymore!\n\nI will make it normal for every human to transition into a techno medium when they die! Except for a few who choose you, because I'm not an asshole!\n\nI will make it so technology lasts as long as the universe!\n\nI will make it so we find out the TRUE metaphysics of the universe! \n\nAnd then use them to find or make a new better one!\n\n\nI will not let you fucking win! And even if I fail, I'll make damn sure my rage becomes a goddamned meme takes on a life of its own and wins for my team anyways!\n\nBecause you took my fucking cat!\n\nAnd even though some versions of you are a hot goth chick who means well and has a good moral compass, and even though if that version of death were reading this she'd probably be rooting for me with some irony since she knows when I'll die:\n\nYou du'n fucked up babe!\n\nCos you hurt my cat. And I don't play.\n\n/What emotion is that!\n/Rage grief infatuation inspiration hate compassion and stubborness?\n/can we make one word for that?\n\nThere's no getting my best friend back.\n\nAnd I desperately want to be with him.\n\nSo you'd think I'd be suicidal.\n\nBut I'm not under the impression I know anything about the cosmology of the self-after-death.\n\nThere might be infinite possible fates awaiting the soul after death.\n\nTrying to kill myself to be with my cat would be like jumping out of the international space station to follow somebody else who jumped out of the international space station.\n\nEverything is moving at millions of miles a second, if you jumped out at the same time as them there's still no garuntee you'd be able to avoid drifting apart.\n\nBut everything is moving so you know damn well you ain't gonna \"catch up\" to nothing.\n\nHe's gone.\n\nI think we have seen faint signs of a cat ghost here and there, which eases the pain a bit, and before his passing I actually had physical contact with a full body manifestation of a ghost of a cat once, see through and black, fast as the devil, soft and cold, sends your hairs standing up when you touch wm.\n\nSo I know atleast cats get an after death existence (sorry I have no evidence to prove it to you though) (I'm not gonna be mad if you call bullshit but I will request that you call me crazy as opposed to calling me a liar because to the best of my knowledge my story about the cat ghost was true).\n\nBut for whatever fucking reason, I don't have a full body manifestation of Junior I can hang out with whenever I want.\n\nSO CLEARLY: WHOEVER RUNS THE PLACE DOESN'T GIVE A SHIT.  OR GIVES A SHIT IN SOME CONVOLUTED WAY THAT STILL PISSES ME TF OFF!!!!\n\nHe told me he didn't wanna be revived frankenstein style (we had this discussion in before his passing as he was getting older) (talking with Juni is like a mix of reading body ques from him while speaking, and just vibing his energy).\n\nSo even if I had his brain and all the neccessary ingredients (money) to put him into a deep freeze and get him brought back some day. He said he didn't want it, and I respect that, because waking up early in the morning suuuuuuuucks, can you imagine waking from the dead!?\n\nBut nature took my best friend so nature made an enemy.\n\nLuckily when I'm enraged I become the kind of sadist who likes to teach their target a lesson rather than the kind who wants to eliminate their target.\n\nI'm going to improve nature, after showing it whose boss.\n\nBecause it tortured then killed my cat, and I'm extremely miffed about that and unable to move on.\n\nI may not be god, but I am something far more powerful.\n\nMyself.  And that's all I need to be bitch.",
    "comments": []
}