{
    "id": "12143mx",
    "score": 1,
    "title": "Meditation drains me.",
    "author": "xc_LOLAZO_xc",
    "date": 1679703225.0,
    "url": "https://www.reddit.com/r/emotions/comments/12143mx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I focus on the breath and i let thoughts exist. But anger and desesperation for the session to be over just builts up. I focus on the breath, but the feeling just keep increasing until it reach a point where it hurts and iy never stops, never dissipates, i could be there for hours and the thing never goes away. Then i finish the session and feel drained and super tired. I understand that i have to let that anger exist, not act on it and focus on the breath, i get it. But that anger and desesperation drains my energy, no matter if i act on it or not, it still sucks energy and leaves me destroyed after a session, worse than before. And it just painful. \n\nIts allways like this for every session\n\nAlso with some thoughts and feelings, i manage to make them dissipate in the meditation by concentrating on the breath and observing them instead of giving them power. But then when i finish the meditation, they just come back. \n\nI feel meditation is doing nothing, i end up the same or worse than before. The feelings, thoughts and ways of being just come back. \n\nI want to do meditation so i can study more and not be lazy. Im in engeneering school. \n\nMy lazyness and unwillingness to study effcienly still exists after meditation.",
    "comments": [
        {
            "level": 0,
            "comment": "Be careful of using your breathing as a way to avoid your emotions. When you breathe with a focus on the exhale it is to help your body relax and release tension by engaging your parasympathetic nervous system. This allows you to begin to process your emotions by disengaging the tension in your body from the emotions. As the tension releases, your body can begin to integrate those emotions into your experience and natural understanding of your life/current state. If you are trying to escape your anger by focusing on your breathing, you could exacerbate your anger because of the effects of the existing bodily tension on your breathing. Consider focusing on your anger by recognizing how it manifests physically in your body. Is it a tension in your shoulders or neck? Perhaps something to do with your jaw or fists clenching? Maybe it’s a tension or a pain in your chest or somewhere else? Explore where it exists in your body. Then allow your attention to go back and forth between what you identify in your physical experience and how it changes (sometimes very slightly) as you breathe with an emphasis on the exhale. You may feel the tension/pain rise with your breathing in and decrease with your breathing out. You may also find that it gets larger overall but still fluctuates. You may also find that it shifts between different areas in your body. The goal here is just to explore and keep it in your awareness as much as you can and continue noting how it changes with your breath and how different tensions may arise and disappear.\n\nAt least that’s my experience. I will often get to a point where the feeling is unbearable and then I give up trying to make it go away and am just like fine, if I’m gonna feel this way then I’m gonna do it 100%. After this I just allow my awareness to wander between the tensions and pains and note any small changes in them as I breathe and/or adjust. Then the small changes eventually lead to bigger ones; the processing kind of happens on its own.",
            "score": 1,
            "author": "Yaliboyy"
        }
    ]
}