{
    "id": "1339epn",
    "score": 2,
    "title": "Glock to my head.",
    "author": "xc_LOLAZO_xc",
    "date": 1682809439.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "I hope you comment on this, if only to show that you're still here.",
            "score": 3,
            "replies": [
                {
                    "level": 1,
                    "comment": "Not dead. \n\nI cant. I fear hell.",
                    "score": 2,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Glad you’re not dead!",
                            "score": 2
                        },
                        {
                            "level": 2,
                            "comment": "Glad you're still here",
                            "score": 2
                        },
                        {
                            "level": 2,
                            "comment": "Glad you're still here",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! \n\nI studied Civil Engineering too. Much respect. How far along are you, first year? It can be so tough but hey, I actually dropped out and everything turned out to be ok. \n\nI know you feel like you don’t have any options but trust me, they’re there beyond all this pressure. It’s just hard to see it when there’s this much pressure on you. \n\nWhat are you doing now?",
            "score": 2,
            "replies": [
                {
                    "level": 1,
                    "comment": "I have harmed myself more. \n\n\nI had a takr home exam. All i needed to do was work on it on time. On the weekend. I did not. I wasted my time masturbating and watching videos. \n\nIm going to chop my dick. Getting ready to do it.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "How did you cope with leaving civil engeneering?",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "It was rough, a lot of judgement from myself and from my parents but I told them directly I couldn’t do it. They didn’t understand but after I took time off and got my emotional wellness together they started believing in me again. I only went back to school after I was right in the mind and had energy for it. Which was the right move. I did fine after I went back and my life got much better. I guess lesson #1 which is hard sometimes.. but ya gotta put your wellness as top prio. Things straighten out after that.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Leaving civil engeneering would be like killimg myself without dying. \n\nThis is what i want to do. But my brain did not want to. I had all the reasons to study but i did not. I dont know why, my mind just wont work.\n\nFucking hate this.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea. I get it!  How are your grades overall?",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not good. \n\nIm very very fucked.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This could have been avoided.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea. Same for me. I basically wasted two years but I made them up later. In the long-run it wasn’t so bad but it felt like the end of ‘my’ world while it was happening. Like I said, good things came out of it but I had to put my mental health first and get out of all the pressure. Then I could focus and take small steps into what was right for me.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}