{
    "id": "13qarju",
    "score": 2,
    "title": "Post Habitual Burnout &amp; Grip (Dealing with Communication &amp; what I want)",
    "author": "Dani_California247",
    "date": 1684901884.0,
    "url": "https://www.reddit.com/r/emotions/comments/13qarju",
    "media_urls": [],
    "other_urls": [],
    "postText": "I don’t know why but for whatever reason sometimes when I am confronted by what I want in life (especially having to do with relationships and girls) I seem to freeze up. I keep overthinking my interactions with girls mainly that I am attracted to and I am sick of myself doing that. I sabotage almost every single opportunity trying to hold onto what little ones I have. It’s absolutely ridiculous. I have zoomed in on what I am grateful for for too long that now it’s like I take for granted what I want to go after and incorporate what I want in my life. It’s really annoying. How do I shut down the judgement and over analysis of the opportunities where I really want to branch out and talk to someone but I don’t just because I am afraid? \n\nTLDR: How do I approach more girls after dealing with deep depression, habitual burnout, telling myself that it’s not worth it, being in denial and being so afraid of something going wrong?",
    "comments": [
        {
            "level": 0,
            "comment": "First start loving yourself and understanding what you really need from a partner and and most importantly what needs you should fulfill yourself to be an attactive partner to someone else (and feel loved by yourself).\n\nYou are always resposible for all your own emotions and feeling and taking the right action to make you feel okay.\n\nI think the book Crucial Conversations is a good read for you to understand more about your needs and how to communicate them with the people you have a relationship with (anybody from your family, boss, teacher, friends to your partner).\n\nKnowing yourself is the key to choose the right person to spend your life with.",
            "score": 1,
            "author": "Breros"
        }
    ]
}