{
    "id": "k90kcu",
    "score": 1,
    "title": "Bye.",
    "author": "Afraid_Spring643",
    "date": 1607415858.0,
    "url": "https://www.reddit.com/r/emotions/comments/k90kcu",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have realized something. My only current filler and validation is through academic work. I have always handled my emotions alone. I’m always alone. And it hurts. A lot. I’m sad and don’t know what to do, yes I have a plan for my career and I’m successful but my mental health (as much as I know i hate that term) is horrible. I don’t hate myself. In fact I love everything about me. But being lonely has made my life a living hell. I have no friends and just like I said a whole ass year ago my family will continue to ignore me. I can never open up because No one will listen. I feel so hopeless because it’s not me. It’s how everyone else treats me. I cannot go on like this anymore. I just can’t. My mind feels so clouded. I just need someone. Someone who would give me real appreciation I don’t even know who I am anymore because it’s been so suppressed. I treat everyone the way I want to be treated and I get kicked to the ground. I’m so tired.  \n\nI just want it to be over. I feel like the only person in the world going through this.",
    "comments": [
        {
            "level": 0,
            "comment": "The amount of times I have tried to communicate how i feel is overlooked. What have I done to deserve this.",
            "score": 1,
            "author": "Afraid_Spring643"
        },
        {
            "level": 0,
            "comment": "This will probably get ignored too. I don’t care. I’m leaving.",
            "score": 1,
            "author": "Afraid_Spring643"
        },
        {
            "level": 0,
            "comment": "Have you looked for a counsellor? If you’re at an academic institution they should be available there. You might think “but a counsellor or therapist isn’t like a real friend, they’re only listening to me because that’s their job” but they are drawn to that job because they care about people and want to listen and understand. \nIt’s strange that you have no friends, if you treat everyone like you want to be treated, unless you’re isolating yourself because you don’t believe anyone really wants to be your friend? Typically, someone who is kind and a good listener draws people to them. \nYou may love everything about you but you don’t really love your own company. I’ve never met you but there may be something about your need to be heard that comes across too strong? A counsellor/therapist could see through that and really help you express yourself, listening without prejudice.",
            "score": 1,
            "author": "carlbernsen"
        },
        {
            "level": 0,
            "comment": "Hey, I know what you've going through, I've also been very lonely and ignored. I went to a therapist, and it really helped me. You do need someone to listen, we are here for you. But a therapist can truly help you with your emotions, and their job is to listen. Just don't end it please, you're worth is. You deserve to be here. With correct treatment everything will be okay, I promise. It May take some time, but bad times can't last forever\nTry to find medical help, and perhaps talk to people online? There are various sites, I'm sure other people Will listen too",
            "score": 1,
            "author": "Shirruri"
        },
        {
            "level": 0,
            "comment": "Agreed with the posts above! Therapy was the best decision I ever made. It won’t fix everything but is a great place to start. Btw totally understand the feeling that work is your only gratification - I’m feeling something similar during isolation (due to covid) and it feels like it’s become my identity at times. I wish you the best of luck - you matter and  you deserve to be happy!",
            "score": 1,
            "author": "osm_____"
        },
        {
            "level": 0,
            "comment": "I'm so sorry to hear you've been feeling this way. it sounds like you have a lot of negative pent up emotions inside of you. Also, loneliness affects our well-being quite a lot so it's understandable that you feel very negative when you're lonely. I'm sure everyone feels lonely at some point in their lives and especially now more with the  pandemic. One of my thoughts is that you could try loving yourself unconditionally so that even if no one appreciates or cares for you, it's ok because YOU care and appreciate you. Sometimes I also feel very lonely / alone when people are not talking to me and recently I've come to an epiphany that as long as I love myself and feel comfortable with myself and can entertain myself I am enough. In those times I try to do something I enjoy like reading and assure myself that I can live alone and be happy haha. Also, I'm not sure what you mean by 'kicked to the ground' by other people but maybe try avoiding people who make you feel like that. \n\nAnother suggestion I have is maybe try journaling your thoughts. Journaling has a lot of proven benefits and I think it allows us to process and release our negative thoughts and emotions. I created a therapeutic journal based on positive psychology research that I'm hoping will help people. You can try the free gratitude journal to boost your happiness and optimism. You can find it at [https://emotewell.com/](https://emotewell.com/). You can use the gratitude journal for free or if you want to get the paid version you can use the code TRYFREE for a month off. Please feel free to let me know how it goes and wishing you all the best!",
            "score": 1,
            "author": "allaboutemotions"
        },
        {
            "level": 0,
            "comment": "I can relate.  Can you please tell me you’ll be ok?  Do you happen to have brain fog?  I do as well.",
            "score": 1,
            "author": "Right_Draw_8678"
        }
    ]
}