{
    "id": "kfetix",
    "score": 3,
    "title": "My anger issues are ruining my enjoyment for life. How can I handle this better?",
    "author": "gh67j",
    "date": 1608268475.0,
    "url": "https://www.reddit.com/r/emotions/comments/kfetix",
    "media_urls": [],
    "other_urls": [],
    "postText": "Today I came to the discouraging realization that I get angry A LOT easier than I’d like to admit. I never noticed how bad it really was, and wouldn’t really consider myself to have a short fuse. But now it’s starting to hurt my relationships with people, especially my boyfriend. This is not a good look on me and I really want to be mellow, and feel peace, not just fly off the handle. I believe this anger to be the root to a majority of emotions I experience. Not sure if anger is THE root, or an extending limb from a deeper issue. But one of my theories is, I has a little something to do with the way I was raised. My dad, and ALL my siblings also have a really short temper and are more apt to explode on a regular basis. Looking back I remember resenting my parents each time I was disciplined. So we’re talking my whole life I was raised in that environment. I want to break this lifelong pattern of hurt, anger, and frustration over the petty things I don’t need to react to. Any advice?",
    "comments": [
        {
            "level": 0,
            "comment": "Cognitive Behavioral Therapy (CBT). Highly recommend you find a therapist but you can just buy a workbook like [this one](https://www.newharbinger.com/overcoming-situational-and-general-anger-client-manual), which will lead you through exercises to retrain your brain. It really works for anger issues, which are totally treatable. Good luck!",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "gh67j"
                }
            ]
        }
    ]
}