{
    "id": "q8lqc3",
    "score": 2,
    "title": "Hey all just something that has been on my mind, is it bad that I don’t feel comfortable with being sentimental like when someone I know is going through a bad time and they confide to me about it I feel uncomfortable and I don’t know how to respond I do not want to feel this way",
    "author": "TheKingOfAusHimself",
    "date": 1634294302.0,
    "url": "https://www.reddit.com/r/emotions/comments/q8lqc3",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "You can learn to enjoy others pain, and still be a very good listener and friend. You aren't supposed to feel what the person feels when they're opening their heart. It's really well explained in a workshop about how to communicate with others. Search for Marshall Rosenberg San Francisco workshop on YT(it's quite humorous!). It can really help, and has really helped me. Wish you all the best.",
            "score": 2,
            "author": "Hoermemand",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ha! Maybe ‘enjoy others’ pain’ gives the impression of sadism, but I agree Marshall Rosenberg’s ‘Non violent communication’ method is really useful.",
                    "score": 1,
                    "author": "carlbernsen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is what we're taught to connect it to through jackal language. Sadism has nothing to do with it.\nIt's another way of actually being there for another person. \nAs an example: Instead of just agreeing with the sad person, and trying to make them feel better, you can be there listening to their pain, and stop trying to fix the pain - only themselves can fix their problems, and they'll just need a rock to lean against. Hope you understand what I am saying, otherwise you should definitely watch that video - he really describes it well. Hope you are doing well.",
                            "score": 1,
                            "author": "Hoermemand",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Watched the videos, read the books, done the course. It’s a very useful resource.",
                                    "score": 2,
                                    "author": "carlbernsen"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}