{
    "id": "qve8e8",
    "score": 2,
    "title": "I'm Lost.",
    "author": "Accurate-Ad1155",
    "date": 1637086669.0,
    "url": "https://www.reddit.com/r/emotions/comments/qve8e8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Lately I've felt so alone, so hopeless. Everything stresses me out. I finally thought I beat the dark thoughts and got out of the dark but I guess not. Long story short my boyfriend saved me. He really did but things are starting to comeback again and I don't know what to do. I constantly over think and feel depressed, he even admitted it's affecting him too now and Im scared I'll lose him. I lost friends, I can't socialise anymore I lost my whole self. He said that I need to find friends because it puts too much pressure on him to be the only one I turn to. I get him it is tiring so now I dont know how to act or what to do with my self beacuse he's the only thing holding me together and I dont want to lose him.",
    "comments": [
        {
            "level": 0,
            "comment": "Ok, breathe. Anxiety and stress is a physical sensation. Dark thoughts have no power over you without the feelings they trigger. Thoughts are not feelings.   \nApologies if you already know this:  \nIn your abdomen, in the ‘pit of your stomach’ is your Solar Plexus. It’s a primitive brain. Tendrils of nerve fibres come out of it and connect to specific smooth muscles around your stomach, intestines and other organs. When some of these places are ‘tickled’ by the Solar Plexus you feel happy excitement, when others very close by are squeezed you feel anxiety, dread. It’s all physical tension in those muscles. Good/bad.  \nThe reason it happens like that is because feelings make us do things, not thoughts. Everything we do, every choice we make is because of how we feel about it.   \nThe solar plexus sits like a security guard in a locked room, looking at a tv screen. It gets its information from the head brain and presses buttons based on what it’s told. But it can’t tell the difference between what’s happening right now and what’s a memory or imagination being played on the screen. And the feelings it creates send a signal back to the head brain saying “This is bad, do something!” And our imagination and thoughts go round and round trying to put images to the threat and find a way out. And the thoughts send a threat signal back to the solar plexus and so on etc in a feedback loop of anxiety. \nBut in a way that doesn’t matter. We don’t have to stop the thoughts. What we need to do is soothe and calm the smooth muscles that are being tensed and triggered in the abdomen. If they relax the anxious feelings stop. And without the physical feelings the thoughts lose their power and become irrelevant. Feelings are everything.  \nYou can do this yourself, or your boyfriend can help. Slow, circular clockwise massage of the abdomen, below the rib cage, around the navel and down to the pelvis. Breathe deeply, focus on relaxing the very place you feel the sensation of anxiety. If you want a pro to do it for you, look for an osteopath trained in the Barral technique of visceral stimulation (abdominal massage). It’s a Chinese method that a French osteopath promoted for physical health and stress relief and a lot of osteopathic training includes it. It’s quick, you don’t have to undress and it can leave you feeling blissed out, like you’re ‘floating on air’ once the emotional stress is soothed away.  \nAlso, make sure you’re drinking at least 2 litres of water every day and taking extra B5 B9 and B12 vitamins, and a Calcium with Magnesium supplement. Dehydration and lack of these is common and causes anxiety and stress. \n\nhttps://www.google.co.uk/amp/s/amp.theguardian.com/lifeandstyle/2008/jul/05/healthandwellbeing.massage11\n\nhttps://www.scientificamerican.com/article/gut-second-brain/",
            "score": 1,
            "author": "carlbernsen"
        }
    ]
}