{
    "id": "tojggi",
    "score": 2,
    "title": "Should you be sad if a person you've never met dies",
    "author": "Creeperman2306",
    "date": 1648280138.0,
    "url": "https://www.reddit.com/r/emotions/comments/tojggi",
    "media_urls": [],
    "other_urls": [],
    "postText": "A good example would be that Travis Scott concert. should I be sad that all those people died?",
    "comments": [
        {
            "level": 0,
            "comment": "Definitely.  It's objectively sad.",
            "score": 1,
            "author": "pyro1279",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah ok.",
                    "score": 1,
                    "author": "Creeperman2306"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't really feel much emotions the closest thing I've come to that made me sad was my dog almost died.",
                    "score": 1,
                    "author": "Creeperman2306",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think no? I hate hugs i despise sleeping i feel as its a wast of time, and i have no clue how to answer the hunger stuff.",
                                    "score": 1,
                                    "author": "Creeperman2306",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"You can stand there and just be you.. if you're totally fit, feel loved and fulfillment, don't change a thing.\" ah no i love my shitty life at the moment id say i feel pretty fulfilled. \"When you learn to accept hugs you will feel loved.\" so your saying if i get a hug rn ill just know what love is? dont think so.",
                                                    "score": 1,
                                                    "author": "Creeperman2306"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "but uhh eveything you said about my body i dont do at all lol i know its bad but oh well. i haven't had water in mounts (i just dont like it) i dont eat healthy and i stay awake untill i pass out. if im hungry ill most lickly eat junk like a hot dog or some crap",
                                                    "score": 1,
                                                    "author": "Creeperman2306"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh just figured id let you know i have high functioning autism or aspergers they changed the name of it. so I'm basically trying to figure out whats the normal emotion for stuff like this. Its like curiosity the only emotions i have experience are anger, on rare occasion sadness  sometimes happiness but i has to be like extreme happiness. not much empathy basically. tbh i don't even know if i love my mother i defiantly don't hate her or anything  but we get into alot of arguments so i dont even know what i feel for most people.",
                    "score": 1,
                    "author": "Creeperman2306"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We can have empathy for all life. Reflection on the sorrows of death, even for someone we don't know, can activate emotion. We can also be happy for the successes of someone we don't know.",
            "score": 1,
            "author": "FLS-TROYM",
            "replies": [
                {
                    "level": 1,
                    "comment": "uhhh i have no clue what this says.",
                    "score": 2,
                    "author": "Creeperman2306"
                }
            ]
        }
    ]
}