{
    "id": "u3hy7x",
    "score": 4,
    "title": "Can't stop being angry",
    "author": "Original_Paper_9237",
    "date": 1649944090.0,
    "url": "https://www.reddit.com/r/emotions/comments/u3hy7x",
    "media_urls": [],
    "other_urls": [],
    "postText": "A little bit of context: \nI found out a few months ago that one of my good friends had begun dating my ex-girlfriend behind my back. It had gone on for a few weeks and they had put themselves in situations where both of them would be around me. I was pretty upset when I found out.\n\nWe had a pretty serious relationship. I thought we were going to get married and so did she. \n\nHer and I still live together, so I decided not to look for a relationship out of respect for her. Clearly she did not feel the same way.\n\nPoint is: I get so mad when I think about everything that's happened, I literally don't know what to do. I've never been an angry person before, and I've never had my trust violated like this. Does anyone have advice on how to manage anger?",
    "comments": [
        {
            "level": 0,
            "comment": "Oof - that's rough. Common courtesy dictates if you're living with an ex, yall stay unattached until one or both of yall move out...\n\nTherapy could help? Making time for yourself and giving yourself a safe place to vent and work thru the feels\n\nAlso - that dude is not your \"good friend\" if he started hooking up with your ex that you still live with - dating the ex is alreadh very uncool, but the timing is inconsiderate AF - plus putting you in the situation to see them together?\n\nThat guy is not a good homie.",
            "score": 1,
            "author": "ManicPixieDreamSloot",
            "replies": [
                {
                    "level": 1,
                    "comment": "I started counseling a few weeks back, but it's through my college and I only get so many visits. I'm gonna start looking for other resources soon.\n\nAnd yeah, I realize now he's a piece of shit lol. He was mostly a party friend, but he was there for some of our breakup and I had started to consider him a pal. The problem I have now is I want to beat the shit out of him. It's a really strange feeling for me. I'm a pretty chill guy, I've never felt so angry at someone before.\n\nThank you for replying, I've kind of felt crazy a few months - I said the same thing about common courtesy to her and she responded with \"I wasn't going to put my life on hold for you.\" I guess you never really know someone. 🤷‍♂️",
                    "score": 1,
                    "author": "Original_Paper_9237",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ugh - that's so gross (her response).\n\nGood for you for starting counseling - keep it up.\n\n#Talk Therapy Pro Tips:\n\nA lot of people who have tried talk therapy will eventually stop going because \"it isnt helping\", which is usually followed by \"all i did was vent\"\n\nHere's why they weren't happy with their experience : all they did was vent lol\n\nWhen most people vent, they express all the stuff that other people are doing that's bugging them - which can feel good, but is not the most constructive use of having a trained mental health professional listening to your troubles. They cant do anything about the other persons problematical behaviors anymore than you can, ya know? \n\nFocus on you.  Your feels. Your thought patterns. Your triggers. Your destructive behaviors or your volatile emotional responses or your anxieties or your past (trauma trauma trauma - we all got it.)\n\nTry to figure out what patterns exist throughout your life in your relationships (take it back to mom &amp; dad; yes, it is their fault. No, it isnt fair. Yes, now you have to find coping skills to manage the ways they fucked you up lol im not saying that's relevant to you now... But it's what we all end up realizing in therapy eventually lol) \n\nIdentify what isnt working about the way you go about relationship and productivity - then the therapist's job is to help you identify how you keep getting in your own way and what kinda of choices you're vulnerable to and how to build up defenses and safeguards against those so you can live your best life. \n\nYes - your ex is inconsiderate AF and that buddy totally betrayed you and did so very disrespectfully. It's done - cant do shit about that. \n\nYou seem to already have a good sense for what you should be trying to figure out: \"why i am i suddenly so uncharacteristically angry/ragey?\" \n\nMy guess is you have been triggered somehow - *Big Feelings usually mean Trauma.*\n\nSo now you gotta think about unpleasant shit - times you've been betrayed by people you thought you could trust/were on your team. \n\nTimes that you havent felt secure at home would also be worth considering - did you walk on eggshells as a kid when you were home? Are yoi doing that now, living with your ex? Or maybe avoidance or even petty shit? \n\nWhat does this scenario remind you of, emotionally? \n\nThe feelings in your body that turn to anger - how old is the version of you that felt those the first time? \n\nWe usually get angry to protect our Inner Child (it sounds corny AF, but i wouldnt lie to you - the Inner Child shit is on point. All of oyr character defects essentially come from when we were tiny humans who weren't getting our needs met - usually emotional or social - the behaviors and emotional defenses we developed to protect ourselves as kids are the ones we use as adults - but they arent the **best** and are almost never healthy. Usually theyre toxic for relationships. Anyway - are you feeling vulnerability and is the anger coming from a place of \"maybe i can scare the pain away with big feels\"? \n\nI had a therapies say there were basically 5 core emotions \n\n#Joy, shame, fear, sadness, anger\n\nAlways try to boil your feels down to the simplistic terms / largest common denominator - makes it so much easier to identify / discuss / communicate them... \n\nHe also said *Anger doesnt even really count because it is almost always a mask for shame and/or fear.* (which i have found ti be true)\n\nSo. Trust being broken, feelings of being disrespected, possibly a little icky feels/shame/humiliation that they would be together, publically, with you present? PLUS - she still lives with you! Super disrespectful\n\nProbably dont feel comfortable at home / avoid being home\n\nAlso the betrayal of any promises /plans / desires yall once discussed and shared\n\nAny of this striking a cord?\n\nSorry if i went to specific or am totally on the wrong track - trying to be helpful!",
                            "score": 2,
                            "author": "ManicPixieDreamSloot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're spot on, actually. It's crazy how accurate everything you said is, about how I feel.\n\nI'm taking notes now - I wanna talk about this at my next session. You said a lot of stuff that I've been thinking but not sure how to bring up.\n\nI'm planning on getting a therapist that can see me more often, so that should help. Right now it's every two to three weeks.\n\nI really appreciate that you took the time to respond. I had a breakdown the other day and I wasn't sure where to turn to, reddit was kind of a hail mary. Thank you, really. I can't express that enough.",
                                    "score": 2,
                                    "author": "Original_Paper_9237",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yo - that's whats up!\n\nI love when that happens\n\nGlad i could help you put words to your feels - sometimes we just dont have the vocabulary for our emotions, and other times we kinda feel like we're speaking the language like a tourist, not a villager - if that makes sense?\n\nIt gets easier\n\nThe more therapy you do will make you more physically comfortable expressing the feels (practice makes perfect) -but honestly just reading about your specific types of baggage (trauma, trust in intimate relationships, etc) from a variety of sources (professionals, opinion pieces, Instagram hashtags have proven to be surprisingly insightful lol)\n\nYou'll get there\n\nAnd once you can identify everything and give all the demons names - it gets easier to deal with them. You know what and why they are, you know that you've got agency now that you didnt have previously, and the feelings can be managed/dealt with\n\nOvertime the demons become more manageable...but they'll pop uo every now and again, but you'll know what to do! Because thhheerrraappyyy lol\n\nFeel free to hmu if you need to chat  or need help finding mental health resources / navigating health insurance - i been at this a minute and i know some stuff lol\n\nSo glad i could help!! Yay!!",
                                            "score": 1,
                                            "author": "ManicPixieDreamSloot"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even though she is now your ex, this appears to be an act of disloyalty. Anger may be an appropriate emotion. I would distance yourself from your girlfriend and good friend, creating space to heal. Managing an emotion while still in the fire is a difficult task.",
            "score": 1,
            "author": "FLS-TROYM"
        }
    ]
}