{
    "id": "utwp8t",
    "score": 2,
    "title": "Someone explain pls",
    "author": "Old-Flatworm-8532",
    "date": 1653054973.0,
    "url": "https://www.reddit.com/r/emotions/comments/utwp8t",
    "media_urls": [],
    "other_urls": [],
    "postText": "This is my first reddit post and I was hoping some people would be able to give me an answer for what I’m feeling and what causes it. It’s not constantly but it’s happened enough and wedged itself into my life so quickly it’s an issue, I get so jealous? Annoyed? Sad? Over the smallest things like just early my boyfriend wasn’t paying attention to me because he was playing games, it was fine at first because he got a new desk and he wanted to use it. Then his brother (they’re twins) said in a groupchat that he was waiting on getting a monitor and that kinda made my heart drop a little and get a little heavy, it was worse when my boyfriend said he was also waiting for a monitor. My heart dropped so low and got so heavy, I wanted to cry and I don’t know why, I didn’t feel like he’d just play games and ignore me the entire time. I just felt frustrated but I didn’t want to talk to him about it because it was so petty like I wanted to cry because he mentioned buying a monitor. It’s not the first time this has happened over small things, I don’t talk to him about it because they’re so small and shouldn’t be an actual issue but they affect me so much. I think it’s my jealousy issues kicking it but I’m not 100% sure. If anyone knows what causes this or what it’s called or how to stop it that wouldn’t be greatly appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "Jealousy is based in anger and our desire to posses things. \n\nThis personality test will reveal your anger, sadness and anxiety traits - under the neuroticism:\n\n[https://www.personal.psu.edu/faculty/j/5/j5j/IPIP/ipipneo300.htm](https://www.personal.psu.edu/faculty/j/5/j5j/IPIP/ipipneo300.htm)\n\nShare the results in the DM and we can discuss if you like",
            "score": 1,
            "author": "ThePopulousMishmash"
        }
    ]
}