{
    "id": "x8hywd",
    "score": 1,
    "title": "Emotional intelligence issues or How fake a smile",
    "author": "Low-Welcome-4026",
    "date": 1662588239.0,
    "url": "https://www.reddit.com/r/emotions/comments/x8hywd",
    "media_urls": [],
    "other_urls": [],
    "postText": " \n\nHello.\n\nI am here because I couldn't find any reasonable explanation for my issue. I haven't felt any kind of emotion except for being angry when someone does their best to piss me off but it happens like 1-2 times a year. Also, I can feel hurt if someone says something to my face. It happens more frequently, unfortunately. The last time I felt happy was when my mother married again last year. This year I've only felt something that reminds me of the feeling of happiness 2 times, and one of them was when I communicated with my online friend. It lasted only for 3 to 5 seconds and I returned to my regular self. It feels like I started lacking emotional intelligence. When I see someone cry, I can barely feel empathy, but I understand that it would be strange if I stood right in front of them and did nothing, so I will always comfort that person because I understand how you should react at such moments. I think my heart now is made of stone. I mean, I never stopped communicating with people, I've spent a lot of time with my family on vacation. But while they felt their heart flutter at the sight of mountains and beautiful landscapes, I just had to pretend that I'm happy as well and put a smile on my face for the picture. Whenever someone sees babies, they are like \"Oh my god, he's so cute\" and in my case, it doesn't even bother me. I just see them as people.\n\nI had a thought that maybe covid had an impact on my brain neurons in that way as well because it's been 1.5 years since I got back my sense of smell and couldn't smell things normally (almost everything smells rotten or just bad; parosmia). Although I'm not a scientist, I assume there's probably some kind of connection between those neurons responsible for certain senses. Whenever someone hugs me, I can barely feel anything. It only helps if someone hurt me and I am crying. But I want to get back to my normal self, but I can't do anything about it.\n\nCan someone, who's had some kind of experience with such people or themselves tell me what it could be? I would be very grateful for your help.",
    "comments": [
        {
            "level": 0,
            "comment": "Could be a few things I’m aware of.. did you feel much more connected to your emotions before Covid or have you always felt removed from them?",
            "score": 1,
            "author": "FitRefrigerator7256",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I could feel emotions like any other person and after a while, since recovery, I just suddenly realized that I don't feel anything anymore. I also thought about work and my imposter syndrome, but something has really changed as if you toggle the light off",
                    "score": 1,
                    "author": "Low-Welcome-4026",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did you experience anything traumatic besides Covid like the death of a loved one, break up, loss of a pet, loss of a job or home, bodily injury, etc.? Prolonged states of highly elevated stress?",
                            "score": 1,
                            "author": "FitRefrigerator7256",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I was worried when my grandma was close to death, but it wasn't that traumatizing, because 1) I know that it's life and we have to accept it, and 2) she recovered soon. But maybe the reason is that I got a job at 17 and worked, suffering from imposter syndrome due to lacking self-confidence end experience in this area. Also, I had to make myself believe that I'm enjoying my job.",
                                    "score": 1,
                                    "author": "Low-Welcome-4026",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yea, sometimes stress and anxiety can really take a toll on your body. Have you spoken with your fam or a doctor about it? Prob a good idea, earlier the better ya know? How long have you been working at this job?",
                                            "score": 1,
                                            "author": "FitRefrigerator7256",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I've been working for a year. But I'd say due to lack of experience compared to others I've been really stressed. I'm the youngest in the company.",
                                                    "score": 1,
                                                    "author": "Low-Welcome-4026",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Again, not an expert but trauma-informed therapy can help break through some of the layers of ‘what’s stuck’ .. you might determine after several sessions if you’re making process or not. Perhaps also check with doc first if your hormonal levels are ok to see if there’s a chemical balance / priority first.",
                                                            "score": 1,
                                                            "author": "FitRefrigerator7256"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}