{
    "id": "yc26ys",
    "score": 1,
    "title": "I feel...",
    "author": "se_0",
    "date": 1666586264.0,
    "url": "https://www.reddit.com/r/emotions/comments/yc26ys",
    "media_urls": [],
    "other_urls": [],
    "postText": "I feel fucked, I feel violated, I feel as if I have truly given all I can and I have recieved absolutely nothing. Most of the people who I thought as of friends abandoned me in my time of need. My OCD really stalled any and all future plans I had for myself and well life is just hard. Anyhow..not complaining. I'll get over this (eventually) but I just wanted to share how I feel. I will keep on grinding through this mess we call life. It's healthy for me to share my emotions. I used to be so repressed and now i'm not. That's a step forward",
    "comments": [
        {
            "level": 0,
            "comment": "Thanks for sharing this. There’s a lot of courage here and whether or not you can see it all, there is a ton of progress. Nice work. I’m sorry you experienced this. And when it gets too much, remember there is qualified support for these hard times esp when it seems our struggles may be beyond our friend/family ability to handle. Doesn’t mean they don’t love us, just means we have to take responsibility to find the support our system needs. Sounds like you’re a good friend to others so you can decide what boundary feels fair and safe for you there. Feel welcomed to keep us updated and thanks so much for sharing your voice here.",
            "score": 2,
            "author": "FitRefrigerator7256",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for taking the time to read. Maybe there is some progress, not expressing my emotions really exacerbated my problems. I always had the stupid idea that being a man=hiding emotions. I have slowly moved away from that idea and I feel so much better now. One can't simply go through life hiding who you are and you are right, it is our responsibility to find support. Thanks for the openness",
                    "score": 1,
                    "author": "se_0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You have no idea. You’ve conquered so much already. Thank you for bringing this to the channel and for others to acknowledge and learn from your experience. 🙌 There are so many still stuck that can read but can’t yet comment. That can wonder but not put themselves in a position to act. Nothing wrong with this stage, just acknowledging you for making the progress you earned.",
                            "score": 2,
                            "author": "FitRefrigerator7256"
                        }
                    ]
                }
            ]
        }
    ]
}