{
    "id": "yszwhn",
    "score": 4,
    "title": "Am I too in touch with my emotions?",
    "author": "Potential_Speaker_53",
    "date": 1668238642.0,
    "url": "https://www.reddit.com/r/emotions/comments/yszwhn",
    "media_urls": [],
    "other_urls": [],
    "postText": "Like I feel like all I do is sit with my emotions and try to find the deeper meaning to what they are. But it's almost as if the well has run dry and I'm overly indulgant. Is this because I'm really not in touch with my emotions? I am a man btw. Do I need to lay off sitting with my emotions all the time?",
    "comments": [
        {
            "level": 0,
            "comment": "Well your emotions are physical feelings triggered by the stimulation of nerve endings in the smooth muscle fibres around specific internal organs.  \nThe mid point of the liver is a key place for the feelings of pleasant excitement and also anxiety and dread, for example.  \n\nFeelings will come and go as the solar plexus and enteric nervous system signal react to both outside stimuli and memories being replayed by the head brain. Continual inwards looking focus can make those temporary feelings seem more important than they are.\n\nPersistent negative feelings/emotions suggest an unresolved past issue or an ongoing harmful situation. These would be the matters to examine, not so much the feelings themselves.   \nIn the case of past experience which continue to provoke negative feelings it may well be unhelpful to continually revisit them, as it will strengthen and ‘practise’ those feelings.   \nFocusing instead on positive experiences and memories and using abdominal massage such as the Barral Technique may be a more effective approach.",
            "score": 1,
            "author": "carlbernsen"
        },
        {
            "level": 0,
            "comment": "You do know your emotions come from your thoughts? (Expectations, values, beliefs, etc).\n\nAnd your feelings/emotions of needs come from you body (need for food, sleep, etc) and soul (need for love, fulfilment, etc).\n\nWhat gives negative feelings:\n\n- Doubt\n- Worries\n- Being too hasteful or too lazy\n- Being judgemental\n- Clining to people, things, substances, rules, beliefs, etc.\n\nWhen you let go of the origins of the negative feelings you'll have emotion peace.\n\nEmotions and feelings are universal to mammals, so you as a man should feel them as any other mammel. You are figuring out how they work and that's great!! Most people don't and are controlled by their emotions. They fon't understand why they make certain choices in life.\n\nMaybe you like the watch something like this:\n- [How to master and control your emotions](https://www.youtube.com/watch?v=hYZmK46--Mc)",
            "score": 1,
            "author": "Breros"
        }
    ]
}