{
    "id": "yvmzvq",
    "score": 3,
    "title": "Tried to apologize",
    "author": "PrettyGirlChaz431",
    "date": 1668487169.0,
    "url": "https://www.reddit.com/r/emotions/comments/yvmzvq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I don't wanna get too much into the background of this but basically if you apologized to someone and they haven't said anything to you, do you just keep it moving and let them speak when they're ready? This other person might expect you to kiss their ass but that's a no",
    "comments": [
        {
            "level": 0,
            "comment": "I would let them speak when they're ready. Depending on what you said/did, they might not feel like accepting the apology, which is valid. I don't know the context of your situation but I have definitely been the type of person not to accept apologies before if the person hurt me really bad. It's not that I want them to kiss my ass or anything. I just don't feel like associating with that person anymore. For example, I've helped a few friends a couple of times and they acted extremely ungrateful and said rude things and then tried to backtrack and apologize. I didn't accept their apology because it honestly just felt like a slap to the face.",
            "score": 2,
            "author": "Slow-Unit-8372",
            "replies": [
                {
                    "level": 1,
                    "comment": "I get that. This was something with my half sister but basically I'm the youngest and people have always felt like I need to reach out first etc that's why I said the kiss ass part but she might come around and if not than oh well I tried",
                    "score": 1,
                    "author": "PrettyGirlChaz431",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At the end of the day, that's all you can do",
                            "score": 3,
                            "author": "Slow-Unit-8372",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True",
                                    "score": 1,
                                    "author": "PrettyGirlChaz431"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am in this sort of situation currently. I apologised but my friend still keeps his distance which hurts me because we used to be so close. I acknowledged my fault and sincerely apologised for what happened but months later and he still hasnt come ard even tho he was telling our group of friends how much he misses me, I really miss him too. But that's just abt it. If the person still can't face you after reflecting and apologising, that's on them and let them heal at their own pace. Pushing/forcing reconciliation with them will only hurt your relnship even further. It's not \"ass-kissing\" it's just respect of how they're feeling and also self-respect on your part. You did your part so let them heal on their own.",
            "score": 1,
            "author": "enginite",
            "replies": [
                {
                    "level": 1,
                    "comment": "I said ass kissing cuz sometimes people think I need to make things right or whatever since I'm younger. I know I've done my part and I'm not forcing anything. I been apologized and they haven't said anything so it is what it is, if they say anything at some point that's cool but if not oh well",
                    "score": 2,
                    "author": "PrettyGirlChaz431"
                }
            ]
        }
    ]
}