{
    "id": "zy4iv7",
    "score": 1,
    "title": "Cry even though logically, i find no reason to be sad",
    "author": "ehhCYS",
    "date": 1672317800.0,
    "url": "https://www.reddit.com/r/emotions/comments/zy4iv7",
    "media_urls": [],
    "other_urls": [],
    "postText": "So theres this thing ive been thinking about recently. Basically, when i think about stuff like past family issue i find no actual reason to be sad, but sometimes i feel the urge welling inside me to cry even though I look inside myself and find that im not all that sad about it. And when i cry, i think about whether i really am sad, and sometimes its no, and sometimes it's yes, even though i find no reason to, even amidst the tears. E.g. my parents got divorced when i was young, and i think about their arguments leading up to the divorce and i don't feel sad at all.\nBut sometimes when i think about it, it does. This usually happens when i'm already sad about something else. Its not something that immediately gets me crying when i do cry, but if i quieten my mind and hone in on the feeling it seems to drive me to tears. I don't think i have any repressed emotions surrounding this. Ive openly talked about how i generally dont feel sad about it and am not affected by it without problems. I also feel like when it happens that if im able to distract myself by thinking about something it just goes away like nothing.\n\nAll of this has me thinking it's just sort of strange. Ive also speculated about whether a part of my mind just wants to throw me into self-pity and be sad just for the sake of it. Overall just seems kind of spontaneous.\n\nHowever when something like getting scolded happens i feel as if i immediately tear up and am unable to control it. I think inside my head as my eyes get teary and even if i find their criticism to be justified i find myself fighting to hold it back all the same. I find that this usually happens for authority figures and less so people of the same standing as me.\nWhen i get time to be alone after the scolding i am still aware of how i dont have a reason to be sad, but that doesnt calm me down enough, especially when my eyes are reminding me that i'm crying and so is my diaphragm spasming. Im thinking that this is likely because its coupled with a shame of some sort surrounding crying, but i dont find that alone to be a reason why the tears continue. I also figure it could be some sort of a trauma response to my parents getting unreasonably angry over stuff when i was younger.\n\nI am aware that tears can have many emotions as their source, like fear, anger, or just stress in general. However despite this I'm still unsure about which ones if these i feel, if any at all.\nOverall im confused, and also need help stopping this because it causes me inconvenience sometimes. Teachers have thought i have issues at home or something when things have mostly calmed down.",
    "comments": []
}