{
    "id": "146yszv",
    "score": 2,
    "title": "I feel like I’m not good at anything",
    "author": "Crafter-lee",
    "date": 1686502242.0,
    "url": "https://www.reddit.com/r/teenagers/comments/146yszv",
    "media_urls": [],
    "other_urls": [],
    "postText": "I usually feel that sometimes, for example:\n\n1: Drawing: I draw pretty well, but compared to other people I draw pretty basic characters\n\n2: Music: I don’t know a lot of making music, I would want to try to make lofi but seems hard since I’m not into making music\n\n3: YouTube: I make videos, but only got 182 subs (+ got banned from r/YouTube for posting content that “is not” related)\n\n4: Other more reasons\n\nIs it normal for a teen to feel this way as a teen?",
    "comments": [
        {
            "level": 0,
            "comment": "This thread has been flaired as [Serious]. Please be aware that this marks it as a place for serious discussion only and that any unserious content in this thread will result in a removal, counting towards your [ban tiers](https://www.reddit.com/r/teenagers/wiki/rules#wiki_ban_tiers). If your comment does not contribute to the discussion in a serious manner it will be removed. Please report any comments that do not respect this rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/teenagers) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "you just need to find something you enjoy, without feeling the need to be good at it. for me it's painting",
            "score": 1,
            "author": "sillybitch333",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really like those 3 things",
                    "score": 1,
                    "author": "Crafter-lee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "then try not to stress about being good! if you love them youll learn more slowly and improvement without even trying",
                            "score": 1,
                            "author": "sillybitch333"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "there's  so many niches you can become good at; it is usually said that it takes about 5 years or 10'000 hours\n\nin other words, learn moar, git gud",
            "score": 1,
            "author": "moronic_autist"
        },
        {
            "level": 0,
            "comment": "It definitely normal! It sounds like you have loads of talents and you just need to practise them",
            "score": 1,
            "author": "Seafaring_Slug"
        },
        {
            "level": 0,
            "comment": "honestly depends on what you mean, hobby wise ur pretty set. also for making music, i made my first beat in FL studio in like 4 days (even tho it was ass) and production is super fun so i suggest u try it out, garageband is a more beginner friendly app but it’s ios exclusive",
            "score": 1,
            "author": "Mysterycracker12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fl studio is paid (sadly) can you make Lofi with it?",
                    "score": 1,
                    "author": "Crafter-lee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I may or may not have downloaded FL studio through certain unpaid means but, yeah u can make any kind of music with it, most top producers use it. Also u don’t need a midi keyboard to use it which is great",
                            "score": 1,
                            "author": "Mysterycracker12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow! But usually Lofi needs piano or smthing, I don’t usually go with the basics",
                                    "score": 1,
                                    "author": "Crafter-lee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "u can either compose note by note with your mouse or play the piano roll on your pc keyboard",
                                            "score": 1,
                                            "author": "Mysterycracker12"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Other comments are summing it up but dont aspire your self worth to objective things like these, it can never properly capture your acomplisment with something. Also, I'll sub to ur yt :)",
            "score": 1,
            "author": "Raichupog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thx!! It’s crafter Lee!",
                    "score": 1,
                    "author": "Crafter-lee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "U can learn to cook vegetarian or take a fasion workshop. Meditate, Calculate, learn to knit a tank top.\n\nYoga, hula, clogging, jogging, walking on a tightrope. Take a correspondence course or learn to make ur own soap.\n\nJumping on a pogo stick, standin' in a wheat feild. Goin on a snipe hunt, gotta keep yo eyes peeled. Take a little time to really decorate ur door and change ur hair to black then mabye dye it brown or orange.\n\nUNDERWATER TAXIDERMY, SHOPPING FOR A SUITCASE. PEELING A TANGERINE WHILE PLACIN SECOND IN A SACK-RACE\n\n**LION TAMIN', ONLINE GAMIN', TRYNA WIN A PRIZE FIGHT. GOIN ON A TALK SHOW DRESSIN AS A WATERSPRITE**\n\n##YEAHHHHHH\n\nIn all seriousness, you are most definitely good at something, you just haven't found it yet:)",
            "score": 1,
            "author": "Masterdizzio"
        },
        {
            "level": 0,
            "comment": "Sounds like a skill issue to me",
            "score": 1,
            "author": "Crimsonsssss"
        }
    ]
}