{
    "id": "146ze1m",
    "score": 0,
    "title": "I wanna say sorry",
    "author": "SCP-3812",
    "date": 1686503626.0,
    "url": "https://www.reddit.com/r/teenagers/comments/146ze1m",
    "media_urls": [],
    "other_urls": [],
    "postText": "Sorry for meeting you. Sorry for talking to you. Sorry for having fun with you. Sorry for getting to know you. Sorry for thinking at first you liked me. Sorry for (badly) flirting with you. Sorry for thinking I had a chance. Sorry for teasing you. Sorry for being so happy for the past few months. Sorry for trying to get rid of my feelings... All in all, I just wanted to say sorry for feeling this way about you...",
    "comments": [
        {
            "level": 0,
            "comment": "This thread has been flaired as [Serious]. Please be aware that this marks it as a place for serious discussion only and that any unserious content in this thread will result in a removal, counting towards your [ban tiers](https://www.reddit.com/r/teenagers/wiki/rules#wiki_ban_tiers). If your comment does not contribute to the discussion in a serious manner it will be removed. Please report any comments that do not respect this rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/teenagers) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "it's ok dude, I get it. your gonna be alright and your gonna make it through this! I salute your bravery to post this online and I'm happy I saw this to try and give u some support.",
            "score": 2,
            "author": "MrMcstinkerton125"
        },
        {
            "level": 0,
            "comment": "K",
            "score": 1,
            "author": "fetoextracurricular"
        },
        {
            "level": 0,
            "comment": "I understand how you feel but you still have a long way to go. You are just 13. I promise you'll find way better!",
            "score": 1,
            "author": "abyss_dreams"
        },
        {
            "level": 0,
            "comment": "apology accepted",
            "score": 0,
            "author": "ReaperSwordsYt"
        }
    ]
}