{
    "id": "14741qm",
    "score": 1,
    "title": "My relationship of 2 years is coming to an end... How can I cope with the loss better",
    "author": "jyri_ratas_official",
    "date": 1686514495.0,
    "url": "https://www.reddit.com/r/teenagers/comments/14741qm",
    "media_urls": [],
    "other_urls": [],
    "postText": "For the last few weeks my gf has been more silent than usual, and some days ago she asked if she could take a break from the relationship bc she wanted to think about the future. I thought about it a bit and allowed her to take the break after doubting about that for some time. \n\nDuring the break I started thinking that maybe our relationship wasn't working out well and I started thinking maybe it's best for us both if we do break up, I'll be in the military for the next 11 months anyway starting next months, god knows what could happen in that time.\n\nAbout half a hour ago the break ended and I called her. Asked her what did she gather from that break, she said that she might want to break up. I told her that I've come to pretty much the same conclusion. \n\nAfter hanging up the call it slowly started to hit me, I have been with her for 2 years, I know it will hurt, after my last breakup I didn't know how to cope, I doubt I know right now. I don't even know if I'm going to get any sleep today. So if you have any advice, please throw it my way, much appreciated...",
    "comments": [
        {
            "level": 0,
            "comment": "This thread has been flaired as [Serious]. Please be aware that this marks it as a place for serious discussion only and that any unserious content in this thread will result in a removal, counting towards your [ban tiers](https://www.reddit.com/r/teenagers/wiki/rules#wiki_ban_tiers). If your comment does not contribute to the discussion in a serious manner it will be removed. Please report any comments that do not respect this rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/teenagers) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "it's in the past and nothing can change that. what you did, you did for the better of both of you. put that all behind and focus on the future because life is short and it's not worth spending a chunk of it miserable over a relationship that hasn't worked out",
            "score": 2,
            "author": "blubtwoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for a new angle to look at things from, I'll try to do my best to think that way, could help me a lot.",
                    "score": 1,
                    "author": "jyri_ratas_official"
                }
            ]
        }
    ]
}