{
    "id": "148yg9f",
    "score": 85,
    "title": "Well, it's pointless to protest for just two days lmao",
    "author": "LilBilly1",
    "date": 1686717091.0,
    "url": "https://www.reddit.com/r/teenagers/comments/148yg9f",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "It's like charlie said. This was basically pulling a hunger strike until you get hungry. You already told them a end date",
            "score": 44,
            "author": "Crack-Hamster",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I'm glad some really big subs are still at it tho, and not that I don't like this sub, but what's the point in going dark if you're just coming back",
                    "score": 9,
                    "author": "LilBilly1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's what I was thinking, that's like the hanging of a man being protested for like 7 minutes and then everyone just goes home and let's it happen",
            "score": 16,
            "author": "ThriftyShark530"
        },
        {
            "level": 0,
            "comment": "EXACTLYY LIKE WTF WERE THEY EXPECTING TO HAPPEN💀",
            "score": 10,
            "author": "PlaybolCarti69"
        },
        {
            "level": 0,
            "comment": "Atleast reddit crashed once during the protest",
            "score": 12,
            "author": "Destiny_Ocean",
            "replies": [
                {
                    "level": 1,
                    "comment": "reddit crashes like every other day, i think that was coincidental 💀",
                    "score": 15,
                    "author": "PlaybolCarti69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol 💀",
                            "score": 4,
                            "author": "Destiny_Ocean"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "it literally is, for 2 days reddit ain t giving shit",
            "score": 5,
            "author": "SomeoneNamedPluto"
        },
        {
            "level": 0,
            "comment": "should have been a whole year honestly",
            "score": 4,
            "author": "blisseddream-"
        },
        {
            "level": 0,
            "comment": "Didn't Reddit say that they didn't care?",
            "score": 2,
            "author": "Ironbanner987615",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, because 2 days is quite literally nothing to them lmao",
                    "score": 3,
                    "author": "LilBilly1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "China disagrees, China thinks 1 day protest is too much.",
            "score": 2,
            "author": "A_Facist_Dictator",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, unfortunately (I can't believe I just typed this) this isn't China, because spez doesn't give two shits",
                    "score": 3,
                    "author": "LilBilly1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bing chong long wong, no more bing chilling for you, capitalist scum.",
                            "score": 4,
                            "author": "A_Facist_Dictator",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I laughed at this more than I probably should’ve…",
                                    "score": 3,
                                    "author": "JayTheWolf26",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "we're on the same boat probably",
                                            "score": 1,
                                            "author": "DGX_Eclispe"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "u/spez is a greedy twat and doesn't give a shit about what we want, if it involves him making major profits he doesn't care about the people using his app, he's gonna do whatever gets him all that profit",
            "score": 2,
            "author": "TheLocalDegenerate"
        },
        {
            "level": 0,
            "comment": "Kinda pointless to protest anyway (from my knowledge, please don't hate me). \n\nReddit is a multi billion dollar company, and there are tens of thousands of subreddits. Even thought a lot of the popular ones are quiet and or gone completely, many of the smaller subs are still active. \n\nI'm kinda uneducated on the subject, so lmk if I missed something big",
            "score": 1,
            "author": "M08GD"
        },
        {
            "level": 0,
            "comment": "These protests are kind of pointless either way, the majority of the user base and subreddits did not protest at all or will come back at some point. There's no way it would hurt Reddit as a company.",
            "score": 1,
            "author": "No_Celebration_7864"
        }
    ]
}