{
    "id": "14909qx",
    "score": 2,
    "title": "Tips to get a girlfriend",
    "author": "WorkableZulu166",
    "date": 1686723451.0,
    "url": "https://www.reddit.com/r/teenagers/comments/14909qx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just turned 14 and I feel lonely.",
    "comments": [
        {
            "level": 0,
            "comment": "You git gud",
            "score": 1,
            "author": "Regular-Attempt486"
        },
        {
            "level": 0,
            "comment": "You’re 14 bro you have plenty of time dw",
            "score": 1,
            "author": "Environmental_Nose_7"
        },
        {
            "level": 0,
            "comment": "Kidnapping 🥸",
            "score": 1,
            "author": "24tmarshall"
        },
        {
            "level": 0,
            "comment": "Idk talk to girls",
            "score": 1,
            "author": "Da-canari-gonnaend"
        },
        {
            "level": 0,
            "comment": "sorry you have to find out like this, girls aren't real.",
            "score": 1,
            "author": "i-like-circles"
        },
        {
            "level": 0,
            "comment": "It's easy just be cool.",
            "score": 1,
            "author": "the_wiggler_123"
        },
        {
            "level": 0,
            "comment": "Pretend your ash Williams it will work",
            "score": 1,
            "author": "shanewaIsh"
        },
        {
            "level": 0,
            "comment": "No cos I'm 15 and don't have a gf and have never dated any1 so just buy a car and dedicate your life to that",
            "score": 1,
            "author": "LanciaFlavia",
            "replies": [
                {
                    "level": 1,
                    "comment": "What about a street bike? \n\n\n\n\n\n\n\nAlso known as a motorcycle",
                    "score": 2,
                    "author": "WorkableZulu166",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ig, but girls sometimes think they are too masculine and a sign of being toxic",
                            "score": 1,
                            "author": "LanciaFlavia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just remembered that I'm 14.",
                                    "score": 3,
                                    "author": "WorkableZulu166"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just live ur life bro. I’m 17 and I’ve never dated and I’m perfectly fine (im gonna end it all)",
            "score": 1,
            "author": "hoodironywalk"
        },
        {
            "level": 0,
            "comment": "just catch the bag and move to a third world asian country and offer american citizenship if they become your wife. Love is overrated, get yourself a love slave",
            "score": 1,
            "author": "st3pn_"
        },
        {
            "level": 0,
            "comment": "Think of who you think is currently the hottest women on the planet. Now imagine her being your girlfriend. Imagine walking with her, hugging her, holding her, being with her in public.\n\nDo you feel unworthy or a little weird in this position? If so, determine what you need to work on.\n\nMaybe you’re not as fit as her or as fit as someone you imagine she’d be into. Maybe you’re just not confident enough. Maybe you feel weird, have glasses, and look nerdy. Maybe you feel her fashion is wonderful and yours just feels odd in her presence. Maybe your hygiene doesn’t live up to her goddess status. \n\nWhatever it is, this is likely the reality. You need to improve yourself. That might mean getting going to Jim. Might mean getting a job so you feel you can provide for her. It might mean changing your fashion to something you like. It might mean swapping glasses for contacts and maybe finding a pair of shades. Maybe you need to find a fragrance that makes you feel confident. Maybe grooming, whatever.\n\nIf you don’t feel anything is off, then just start talking to girls. Be playful when talking to people. \n\nBut a word of caution: don’t change yourself for others. If you feel you are fundamentally changing yourself solely to please others (girls) then you’re not doing it right. You should want the changes before you do them. There is no one size fits all formula. There are many different girls and they all like many different types of guys. Be you. If you’re a scrawny math nerd like me then maybe you want to become shredded and get rid of the glasses but still maintain my deep passion for math.\n\nAlso, disclaimer: I’ve never had a girlfriend. I’ve had girls crush on me, one asked to be my gf but I’ve never had a girlfriend.",
            "score": 1,
            "author": "Neither-Evidence-765"
        },
        {
            "level": 0,
            "comment": "1. Introduce yourself \n2. Tell them “If you don’t go out with me I’m taking my own life”",
            "score": 1,
            "author": "Syr0maniac"
        }
    ]
}