{
    "id": "elqvhw",
    "score": 82278,
    "title": "On christmas dinner",
    "author": "Cyher38",
    "date": 1578478305.0,
    "url": "https://www.reddit.com/r/teenagers/comments/elqvhw",
    "media_urls": [
        "https://i.redd.it/7aztazgw4j941.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "then 2 seconds later: WhY dOnT yOu EvEr TaLk To uS?!1?!1?",
            "score": 2680,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I tried telling my dad that I had begun independently learning Java and he went on a 15 minute rant about how I should stop and come do some other programming language. Same thing happened when I learned HTML\n\nI tried telling him I was interested in electrical engineering and he just shut down those dreams too. \n\nI got certified for Network Pro and it’s one of my biggest accomplishments, and yet he basically tells me it isn’t worth anything, when it’s basically on level with the CompTia N+. \n\n\nThen he asks me why I’m so negative all the time and don’t want to “spend time with the family”.\n\nEdit 1: Rip my inbox. \n\nSome more info: Networking makes more money than electrical engineering, and is less dangerous. Hence why I want to do it as a job. I would still like to learn some electrical even as a hobby however.",
                    "score": 1384,
                    "author": "VekGraylax",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like he's jealous tbh. Why do anything other than encourage you?",
                            "score": 541,
                            "author": "asgoodanameasany",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I dunno about this person's dad but some parents will downplay your achievements and criticizes everything you do because they believe that pointing out flaws is more useful than congratulating you.",
                                    "score": 356,
                                    "author": "SondeySondey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "^^ THIS",
                                            "score": 143,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They could at least acknowledge the good deeds and add criticism, it’d prevent the child from becoming potentially depressed, a workaholic or desperate for validation (which could make them susceptible to manipulative people) with a very high likelihood of other things I can’t think of atm. I’ve seen this happen so much and then the parents end up with a depressed and isolated kid on their hands then wonder where they went wrong.",
                                                    "score": 64,
                                                    "author": "TheBlyatMun",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hi, I believe somebody was talking about me and my parents?\n\nI get constructive criticism but all I ever hear is just plain old hostile criticism with no appreciation for what I do",
                                                            "score": 11,
                                                            "author": "zergilaus333"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Damn that must suck. This makes me realize how lucky I am to have a dad who encourages me with programming.",
                            "score": 123,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same my dad told me he would get me free shit if I learned lol",
                                    "score": 62,
                                    "author": "Undead_Cracker6",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now that's a good dad.\n\nNot saying that one who can't do such is bad, but damn that's a hell of an encouragement.",
                                            "score": 35,
                                            "author": "ThePizzaMuncher"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Same",
                                    "score": 9,
                                    "author": "nonono64qwertyu"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Follow up on that electrical engineering career, they make pretty good money depending on what you get. Also, Whats wrong with engineering?? Thats like the only field hiring anymore, smh",
                            "score": 41,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m going into networking but I always thought electrical was interesting.",
                                    "score": 19,
                                    "author": "VekGraylax",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Doesn't hurt to do a little bit of that on the side.  It may help you in your main career at some point.",
                                            "score": 17,
                                            "author": "Gestrid",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wanted to do it as a hobby kinda.",
                                                    "score": 9,
                                                    "author": "VekGraylax",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I will say not to let your family know about it too much.  Otherwise, you'll probably get a ton of \"Hey, can you fix this?  How about this?  And this?\"",
                                                            "score": 12,
                                                            "author": "Gestrid",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yep. I know. \n\nMy dads been working in IT for over 15 years+ but still I would prefer if he didn’t know lol",
                                                                    "score": 4,
                                                                    "author": "VekGraylax"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Damn I wish I wasn't as lazy as I am and could start learning Java by myself. Rn I take classes in school to learn it.",
                            "score": 16,
                            "author": "Juusto3_3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m motivated by wanting to make a unique and awesome mod for Mc. You can do it brother",
                                    "score": 16,
                                    "author": "VekGraylax",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Making a mod for MC seems like a fun idea tbh.  You have any plans on what kind of mod you're making?",
                                            "score": 15,
                                            "author": "Juusto3_3",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 11,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "To be fair, Java is horrible \nThis brought to you by c(++)/python elitism.",
                            "score": 25,
                            "author": "pipnina",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Imagine dissing Java and praising python in the same sentence.",
                                    "score": 13,
                                    "author": "phonethrowaway55",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Omfg why the fuck",
                    "score": 9,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I try to ask more questions so people don’t ask me questions",
            "score": 362,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "that plan can backfire really easily",
                    "score": 168,
                    "author": "BogdanNeo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That plan work perfectly for me.I would say or ask something a bit political and the rest of the table would dive too deep into the conversation to say anything about me",
                            "score": 96,
                            "author": "Outofgoodusername",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "whenever i try this project ask \"and how about you?\" or something along those lines, but i appreciate the fact that they're trying to hold a conversation with me",
                                    "score": 39,
                                    "author": "BogdanNeo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah but you have to even remotely enjoy small talk in order to do that :/",
                    "score": 22,
                    "author": "Kirra_Tarren"
                },
                {
                    "level": 1,
                    "comment": "Well I don't even get questions from others :))",
                    "score": 7,
                    "author": "TheDom1nt1s"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When i show them my favourite song they be like \"can you please stop the song\" really broke my heart a little",
            "score": 876,
            "author": "Hariz406",
            "replies": [
                {
                    "level": 1,
                    "comment": "Literally just happened 5 minutes ago lmao",
                    "score": 290,
                    "author": "tripodmak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel bad for you buddy",
                            "score": 124,
                            "author": "Hariz406"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 70,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This happen whenever I play music for anyone and now I just tell people that I don’t listen to music.\n\n¯\\\\\\_(ツ)\\_/¯",
                    "score": 141,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What do you listen to friend?",
                            "score": 59,
                            "author": "melandor0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Recently I’ve discovered this electronic genre, don’t know what it’s called, that literally everyone I know hates.  \nIt’s very chill, background music that is kind of inspirational, artists like Home, Hotel Pools, De Lorra and some small time guy from reddit who made a single, his name was The Present Sound. \n\nAll really awesome stuff that my hard rock family despises. I’m always looking for more of it!",
                                    "score": 75,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As somebody who's into rock, pls put a link in, id like to develop my own opinion",
                                            "score": 29,
                                            "author": "Jamaicancarrot",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[Spotify: Home - Odyssey ](https://open.spotify.com/album/2Nz9gdj35Unk1AbfL8Igmx?si=WgYASwUlTPKIbhIjLgwGvA)",
                                                    "score": 27,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I like this. Thanks for the recommendation! I've been looking for more music to read/write to. (:",
                                                            "score": 17,
                                                            "author": "CloverLynn",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don't really know the artists but chill background music sound like lo-fi (hip-hop)?",
                                            "score": 13,
                                            "author": "Masthorbaiter",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lo-Fi is definitely the correct direction (and fantastic study music), but leans a little too close to hip-hop. \n\nThese artists are a bit faster, more spacey or digital sounding.",
                                                    "score": 10,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "HOME is the only one of these I listen to but synthwave may be the genre you're talking about.",
                                            "score": 13,
                                            "author": "ahalpin02",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Bro same, I listen to music all the time but whenever someone asks, even close friends or siblings, I just say I don’t like listening to music.",
                            "score": 21,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just out of curiosity, do you get really anxious and sweaty on the rare occasion you do share music or is that just me?",
                                    "score": 17,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I sure do. It's like sharing something deeply personal.",
                                            "score": 8,
                                            "author": "Halfswift",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeh- now I just don’t talk about music at all unless it plays a part in a story/explanation (ex. “I didn’t hear [insert noise] because I was listening to music) or if they specifically ask about what kind. I don’t tell names of songs anymore tho",
                            "score": 9,
                            "author": "The-Ewwnicorn"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We have a Google home so my father literally stops mine and puts on his own ;-;",
                    "score": 16,
                    "author": "noahvz123"
                },
                {
                    "level": 1,
                    "comment": "Yeah my family always wants to see what music I listen to but I never show them because they wouldn’t want to listen to it and they’d probably make fun of me so no Thanks",
                    "score": 13,
                    "author": "TheCVR123YT"
                },
                {
                    "level": 1,
                    "comment": "this",
                    "score": 37,
                    "author": "eikussiistah"
                },
                {
                    "level": 1,
                    "comment": "Relateable",
                    "score": 7,
                    "author": "Bradette3210"
                },
                {
                    "level": 1,
                    "comment": "What song? I want to listen to it",
                    "score": 6,
                    "author": "g00ber88",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "My mom listened to my whole SoundCloud EDM playlist, I'm Lucky",
                    "score": 5,
                    "author": "FgameCorpYT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\\*and friends. Especially with music, it's a little heartbreaking when you show your friends your favorite song and then they say this.",
            "score": 120,
            "author": "terriblekoala9",
            "replies": [
                {
                    "level": 1,
                    "comment": "As far as I can tell my friends think I don't actually like very many things because I refuse to tell anyone about anything I do actually like.",
                    "score": 49,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can relate",
                            "score": 15,
                            "author": "Malleable_Egg"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My friend always says that Surreal memes are cringe, but he is a good guy anyways.",
                    "score": 4,
                    "author": "FgameCorpYT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me;*cleans dishes*\nParents; Wow look who finally decided to help\nAs if that’s going to make me want to do maths dishes more often",
            "score": 567,
            "author": "EnderTrev",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn that must suck, having negative consequences for not doing it and having passive-aggresive (so still negative) comments for doing it.",
                    "score": 231,
                    "author": "Freeaboo_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Followed by \"you never do ANYTHING around the house\"\n\nSource: my mom.",
                            "score": 122,
                            "author": "Alentrish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My mom said that to me this morning and I listed all the things I did around the house while she was asleep and her response was “You’re being disrespectful I’m not taking u to the gym today”",
                                    "score": 13,
                                    "author": "EnderTrev",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Same and I do way more than my younger brother who just stays in his room",
                                    "score": 21,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wait you don’t get those?",
                            "score": 22,
                            "author": "Undead_Cracker6",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nah I lucked out in terms of parents. They don't understand everything (which is sometimes frustrating), but they try most of the time. They're thoughtful people.",
                                    "score": 13,
                                    "author": "Freeaboo_",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I get the same types of remarks every time I try to help around the house too 🙄\nEvery time I respond : \"Well next time I'll let you do it, and won't be here when you'll ask me to\"",
                    "score": 14,
                    "author": "_miyabi_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alternatively, my family when I tell them my music preference",
            "score": 243,
            "author": "DschinghisPotgieter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup\n\nMe: *mentions that I like Infected Mushroom to my dad 1 time*\n\nMy dad: *proceeds to spend 20 minutes relentlessly going into detail about how I'll grow tired of psychedelic trance once the novelty of all these new sounds wears off, which is the only reason trance was ever popular in the 90s and now no one cares about it anymore*",
                    "score": 19,
                    "author": "Liznaed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hate people who say you can only enjoy electronic music if you use drugs. Like SHUT UP.",
                            "score": 12,
                            "author": "FgameCorpYT",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cries in Death Metal",
                    "score": 72,
                    "author": "Sir_Tatagreiss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*cries in YUH*",
                            "score": 38,
                            "author": "ChaChaChamberlain",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It goes it goes it goes",
                                    "score": 26,
                                    "author": "The_Diz_Man",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "GUILLOTINE",
                                            "score": 24,
                                            "author": "ChaChaChamberlain",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "*cries in sabaton*",
                    "score": 50,
                    "author": "VietInTheTrees",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*cries in Dschinghis Khan*",
                            "score": 29,
                            "author": "DschinghisPotgieter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Moskau, Moskau",
                                    "score": 7,
                                    "author": "SecularAvocado",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Snake Jazz",
                    "score": 9,
                    "author": "lesqie"
                },
                {
                    "level": 1,
                    "comment": "*cries in pc music*",
                    "score": 3,
                    "author": "RoboticChicken",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 704,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Were you standing there, were you full of fear?",
                    "score": 171,
                    "author": "jati1115",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With bodies at your feet?",
                            "score": 101,
                            "author": "VietInTheTrees",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Over there in the other trench, did bullets wear your name?",
                                    "score": 51,
                                    "author": "Duder963",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did you lead ahead, as the captain said, and show them no remorse?",
                                            "score": 33,
                                            "author": "AWildYeeHaw",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Do you understand what you've become?",
                                                    "score": 25,
                                                    "author": "chilichickify",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Did you do your duty and pay the price?",
                                                            "score": 19,
                                                            "author": "coconaut147",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Did you do the worthy sacrifice?",
                                                                    "score": 16,
                                                                    "author": "Lixxa",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Is this a great war?",
                                                                            "score": 9,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m also a Sabaton fan! Got into the band a couple years ago, also my 1 metal band that I like. My family fortunately doesn’t really care, aside from the usual “your music sucks”\n\nMy parents though, find it too violent along with bad.\n\nOof",
                    "score": 61,
                    "author": "VietInTheTrees",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My younger brother likes Sabaton, we often listen to it together with parents in the car",
                            "score": 18,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "As a Metallica fan my dad also really likes Metallica he’s the one that got me into it!",
                            "score": 10,
                            "author": "ProJasonHammett"
                        },
                        {
                            "level": 2,
                            "comment": "My family actually likes my music.",
                            "score": 8,
                            "author": "JustSimon3001",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's just wrong",
                    "score": 103,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Was listening to Ghost in the trenches when i read your comment",
                    "score": 15,
                    "author": "peter_2202",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Listening to Uprising :)",
                            "score": 9,
                            "author": "VietInTheTrees",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Listening to Ruina Imperii",
                                    "score": 10,
                                    "author": "Queben1"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Listening to Cannibal Corpse while reading this",
                            "score": 10,
                            "author": "Sir_Tatagreiss"
                        },
                        {
                            "level": 2,
                            "comment": "Listening to ritual while reading this",
                            "score": 7,
                            "author": "mistermelvinheimer"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "sabaton is s great band and your mum has nothing to worry and quite frankly its kind if silly that she thinks that way about it.",
                    "score": 8,
                    "author": "squidward_boi"
                },
                {
                    "level": 1,
                    "comment": "&gt;I love my parents and they’ve barely done anything wrong from a parenting POV but this has pissed me off so much I don’t even talk about music anymore with them\n\nThat's exactly how I feel, my parents have always done their best to give me and my sister the best opportunities in life and I love them and I'm very grateful for them\n\nBut bloody hell I cant wait to move out like srsly they drive me crazy sometimes",
                    "score": 25,
                    "author": "definetly_not_alt"
                },
                {
                    "level": 1,
                    "comment": "Well they kinda did go wrong in parenting not accepting the music you like, look i get that super christian families dont want their kids listening to cannibal corpse, but c’mon its just music.",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I tried to talk about some computer games at the Christmas dinner table and my family didn't even care.",
            "score": 1261,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "*At least* they didn't care. My mom would go on a rant about video games that I've heard at least 500 times.",
                    "score": 674,
                    "author": "wokethonking",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tell me about it",
                            "score": 175,
                            "author": "Jelle10Messi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 206,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not that bad",
                                            "score": 94,
                                            "author": "Jelle10Messi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "She plays on a Commodore 64....",
                                                    "score": 68,
                                                    "author": "TheRollingTide",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's awesome actually",
                                                            "score": 47,
                                                            "author": "Gexku",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I suppose retro is in right now.",
                                                                    "score": 33,
                                                                    "author": "TheRollingTide",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Retro is always in. The only thing that changes is what people consider as such.",
                                                                            "score": 25,
                                                                            "author": "EuphoricPenguin22"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Is your mom Henry Cavell",
                                            "score": 11,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Mine would've been actually interested. She plays vr games with me. It's a lit time. I feel bad for y'all..",
                            "score": 22,
                            "author": "AquaticDeer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Be grateful. My parents actively ridiculed my interests (art/poetry) growing up and did everything to demotivate me.",
                                    "score": 13,
                                    "author": "THE_ALUMINUM_PINKY",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Some would argue that that kind of a parent is better than OPs",
                            "score": 24,
                            "author": "iXorpe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's a difference between trying to discourage video games and shooting down your kid's interests.",
                                    "score": 12,
                                    "author": "Gestrid"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "have you considered the possibilities that your parents probably forgot about you?? very possible with that type of mentality lmao",
                    "score": 237,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Personally I have considered it and accepted it probably happened somewhere around the age of 3",
                            "score": 30,
                            "author": "ForCompletion"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": " same thing with my family except I like to just browse the internet learning about history and stuff and my future and they think im a lonely sack of poo, and kinda make fun of me.",
                    "score": 21,
                    "author": "jake_jakejake"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is legit my parents. If I try to talk about anything related to electronics (games, music) they are like “YoU aRe So AdDiCteD”. Like if I’m talking about something I’m passionate about you can at least not be rude out of courtesy.",
            "score": 118,
            "author": "AGR27",
            "replies": [
                {
                    "level": 1,
                    "comment": "just call them addicted when they talk about their passions",
                    "score": 50,
                    "author": "orifan1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tried that. Dont reccomend it....",
                            "score": 29,
                            "author": "Stormchaserelite13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "_you are so addicted_\n\n*goes back smoking because of addiction*",
                                    "score": 22,
                                    "author": "themadman502"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "OMFG YES  \nTHEY TREAT PASSION AS ADDICTION IF THEY DONT LIKE IT",
                    "score": 5,
                    "author": "KingOverHeaven"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lmao, yall share what u into?",
            "score": 301,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oof yeah sometimes\n\nSome things I keep for myself though",
                    "score": 81,
                    "author": "VietInTheTrees"
                },
                {
                    "level": 1,
                    "comment": "you mean you don't tell your family you like bdsm porn?",
                    "score": 75,
                    "author": "TheSecretShade"
                },
                {
                    "level": 1,
                    "comment": "Nope. Never wish to.",
                    "score": 31,
                    "author": "__DontKnowDontCare__"
                },
                {
                    "level": 1,
                    "comment": "No, never.",
                    "score": 9,
                    "author": "Mollof2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me: *talks about anything made after 1885*\n\nFamily:what is this alien technobabble ???",
            "score": 81,
            "author": "flamethekid"
        },
        {
            "level": 0,
            "comment": "mOm HaVe YoU hEaRd AbOuT tHiS nEw AnIme",
            "score": 139,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Noooooo. That’s signing a death warrant",
                    "score": 100,
                    "author": "Dave30954"
                },
                {
                    "level": 1,
                    "comment": "I actually got my mom watching some anime with me and she liked it",
                    "score": 54,
                    "author": "Illeolusion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You, sir/madam, just surpassed mortality.",
                            "score": 79,
                            "author": "Kataoaka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I too watch anime with my mum. When attack on titan came weekly we, watched it together in the living room.",
                                    "score": 29,
                                    "author": "wholesomeandfluffy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My mom freaked out when I played Tf2 because it was 'too brutal' \n\nI did not even think about telling her about AoT",
                                            "score": 35,
                                            "author": "Alphalark",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My mom completed RDR2",
                                                    "score": 13,
                                                    "author": "FgameCorpYT",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I like your mom\n\nwait no, that sounds wrong",
                                                            "score": 22,
                                                            "author": "Alphalark",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh no.",
                                                                    "score": 9,
                                                                    "author": "FgameCorpYT",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oh yes",
                                                                            "score": 7,
                                                                            "author": "marksman678"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "honestly it amazes me how parents usually aren't that accepting of their childs interests, i can understand them not being interested in it but the least they can do is have some respect for it.\nunless it's being a furry or some weird shit.",
                                    "score": 15,
                                    "author": "Illeolusion",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tbh most furry isn’t the stereotypical one, 90% just like animal and role play but the other 9.9% makes erotica and 0.1% wants to rape dogs\n\nAnd the 10% is the face of the community",
                                            "score": 19,
                                            "author": "Coalmunist",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same, my mom watched a bit of Naruto and Bleach back in the day.\nWe watched some Ghibli movies. She watched the Fullmetal Alchemist and Death Note Netflix by herself.",
                            "score": 9,
                            "author": "Ransine",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "H-how?!  I showed my parents Into the Spider-verse (which I loved enough to *purchase the combo pack for*), and neither of them had any real interest in it, even when *that* scene (What's Up Danger?) came on!  (I know it's not anime, but I *know* they wouldn't like that.)",
                            "score": 6,
                            "author": "Gestrid"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "After watching just 3 animes I was dubbed \"animu boi\" by my little brother.",
            "score": 80,
            "author": "Kdogred",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao that’s actually funny though",
                    "score": 48,
                    "author": "MitchGro_1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good little brother",
                            "score": 20,
                            "author": "Do_doop"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On your birthday too",
            "score": 74,
            "author": "DramaticRice",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"What do you want for your birthday??\"\n\"You want/like *that*????*\n\nWhy'd you ask if you're gonna react like that?!",
                    "score": 59,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 30,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah same, especially as a car guy",
                    "score": 9,
                    "author": "gassstationhotdogg69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me when i try to listen to my music",
            "score": 57,
            "author": "the_Soviet_cat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me:* listening to sabaton*\n\nMy family: “This is garbage. You actually like this?”\n\nMe: *“and that was too many ouchies for Benedict Arnold to handle”*",
                    "score": 40,
                    "author": "VietInTheTrees",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you need to talk about Sabaton in response to ever single comment.",
                            "score": 35,
                            "author": "danieldracer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol, I first thought reddit had a lot of sabaton fans until I noticed it the same guy respondning",
                                    "score": 27,
                                    "author": "notamaninahat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I thought it became a meta joke\n\nThis is more sad lol",
                                            "score": 10,
                                            "author": "M002"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Me *listens to hard ass rap and hip hop* \n\nVery Christian mom “what are you listening to can I hear”\n\nMe *changes to country or something real quick*",
                            "score": 8,
                            "author": "Undead_Cracker6",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me: puts on my cool like indie alternative playlist of a bunch of super small artists\n\nMy dad: put something else on, I don't want to feel like I smoked a joint\n\nmy dad: *literally doesn't realize that I was super excited to talk about the songs and bands etc*",
            "score": 54,
            "author": "beemovieee",
            "replies": [
                {
                    "level": 1,
                    "comment": "What kinda artists do you put on?",
                    "score": 7,
                    "author": "SadMusicBoi",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 24,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "playwriting is hard - don't be too discouraged! stick to it and try to improve. writing in general i've found to be a nice side hobby.",
                    "score": 10,
                    "author": "idk_12",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Legit I can tell anyone that I like anime, I can even tell my two sisters. But the only people I can’t tell are my parents cause I know all their gonna do is lecture me or tell me what’s wrong about it.",
            "score": 26,
            "author": "Pantherpaw2354",
            "replies": [
                {
                    "level": 1,
                    "comment": "My mom says that i like watching: \"chinese cartoons\"...",
                    "score": 15,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "My parents think all anime is porn so I usually just avoid all conversation with them regarding my interests. It’s insane to think that there are so many people in the same boat as me on this",
                    "score": 10,
                    "author": "Solodude_15"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mostly just go to my mom to show her dog or cat pictures/videos. If I start talking about games, stuff going on in a book series, or fantasy creatures I made up+drew, then she starts talking about how I gotta “get back into reality”\n\nWhen I go to my dad and talk about Minecraft or something he starts kinda relating it to other things that he does understand, and actually continues a conversation with a lil bit of interest- same with the weird fantasy creatures I draw and/or read about :&gt;\n\nEdit: I realized while reading other comments that I never talk about music I like around my parents ‘cause I’m afraid they’ll go listen to certain songs, not like those songs, and then tease me for it like one of my old friends did",
            "score": 26,
            "author": "The-Ewwnicorn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I listen to RichaadEB’s metal covers and basically my entire family dislikes it\n\nEdit: also anime",
            "score": 22,
            "author": "risingfatality",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's good but I prefer ToxicxEternity, FamilyJules and GaMetal",
                    "score": 5,
                    "author": "Charle_65",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I listen to the first too as well, never heard of GaMetal. The main reason I prefer Rich is, aside from my Touhou bias, the other two imo are great for their raw metal energy, while Rich has a little more quality",
                            "score": 8,
                            "author": "risingfatality"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shit that happened to me so recently, I told my parents I needed new shoes but I wanted to have full authority over which I buy cause now it’s my money (I didn’t have time to go without them) and when I said what store I wanted to go to my dad said « Oh no I’m sure you never saw inside that store, it’s full of ugly shoes » I knew what kind of shoes they had. Later when I chose to buy red shoes my parents said « Well I guess the good part is that cars will stop when you cross the streets, did you see how bright they are? » Makes it real fun to go shopping with them",
            "score": 44,
            "author": "Male_Rock"
        },
        {
            "level": 0,
            "comment": "I remember 2 years ago when my dad found out I liked anime,he said something along the lines of \"You know anime are just Japanese cartoons right?\",but having our relationship pretty much destroyed at that time,I really didn't care about his opinion on it nor have I ever tried to change his mind like I used to do in the past(though it still hurt to hear talk about the\" weird shit\" I was into).Surprisingly,he's much more okay with anime and manga now,even buying me 2 manga volumes this Christmas and one for my birthday and sometimes even tries to chat with me about the animes I'm watching or the mangas I'm reading(even though  he's clearly not interested in them lmao).Our relationship is still not on good terms and never think it will ever be what it once was,but I'm glad he's atleast trying",
            "score": 42,
            "author": "CosminSteel",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;You know anime are just Japanese cartoons right?\n\nHe's not wrong.",
                    "score": 6,
                    "author": "Criacao_de_Mundos",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I mean he makes a decent point, even if the demographics can be different",
                    "score": 5,
                    "author": "frogggiboi",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I desperately want to give you an award, I agree with you so much",
            "score": 20,
            "author": "h1tman1234",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This happened when I tried to show my family Oscilloscope music.",
            "score": 18,
            "author": "Dank_Jeb"
        },
        {
            "level": 0,
            "comment": "Man i really feel bad for you all. My parents are the most wonderful people in the world and even if they dont always like what i do they always listen to me talk about it and they are always trying to do things that i like even if they dont always care for it i really feel bad for yall with not so good parents cause my parents are the best people in the world!",
            "score": 15,
            "author": "youngerharp33956",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 13,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Looking back I feel like a total asshole for calling my little brother gay once because he liked anime.\n\nNow I just call him gay because he thinks One piece is better than jojo",
            "score": 21,
            "author": "Alphalark"
        },
        {
            "level": 0,
            "comment": "My dad found out I liked metal and took me to rock in Rio. I dont think he actually likes it, he's just supportive.",
            "score": 12,
            "author": "Tiagodias01"
        },
        {
            "level": 0,
            "comment": "Thank god Dad used to listen to System of a Down back in the day",
            "score": 10,
            "author": "Marooned6"
        },
        {
            "level": 0,
            "comment": "When my dad asks me what i like and answering anime tiddies and pussy isnt the rigt answer",
            "score": 11,
            "author": "fuckdemlife"
        },
        {
            "level": 0,
            "comment": "Me and anime",
            "score": 10,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My mom laughs at me whenever I want to be more eco-friendly, talk about comics/video games/movies, or state off random facts. My bad if I have I have a bunch of useless knowledge in my brain, I don't laugh at you when you watch soap operas in the summer.",
            "score": 11,
            "author": "RLG2523"
        },
        {
            "level": 0,
            "comment": "i showed this to my mom and she laughed",
            "score": 9,
            "author": "Troub1edTree"
        },
        {
            "level": 0,
            "comment": "Damn now I feel kinda bad about making fun of my fortnite playing brother",
            "score": 9,
            "author": "ordinary_chair"
        },
        {
            "level": 0,
            "comment": "Me talking about anime or some western cartoons (like Avatar: The Last Airbender).  Video games, too.  My brother is somewhat interested in video games, but I like RPGs, and he likes competitive shooters.",
            "score": 9,
            "author": "Gestrid"
        },
        {
            "level": 0,
            "comment": "I tried to share my love for mountain biking and it got shot down quick. I then tried to talk about a girl I'm interested in and they called her ugly",
            "score": 10,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You know my dad really supported my passion for basketball always cheered for me and got other parents all hyped real fun\n\nsince he has died my mother has come to my game but she barely even watches them as she does something on her phone or whatever",
            "score": 9,
            "author": "Aleksis111"
        },
        {
            "level": 0,
            "comment": "r/meirl",
            "score": 8,
            "author": "slimthiccbois",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s sad how well I can relate to this meme",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is the reason I avoid at all costs talking about JoJo with my family",
            "score": 14,
            "author": "Pablitosomeguy2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Relatable... I tried to talk about bts, but no one cared and they told me \"iT's jUSt a pHAsE\"...",
            "score": 7,
            "author": "Lil_bishhh"
        },
        {
            "level": 0,
            "comment": "Like cardistry fuck off dad it's not useless",
            "score": 3,
            "author": "Innocentius11"
        },
        {
            "level": 0,
            "comment": "A few years ago, my mother moved out of the state with my younger sister while I stayed with my dad. I only get to see my mom and sister a few times a year. It really sucks trying to be a teenager and getting by without my mom at my side. I've gotten pretty used to it by now since it's been about two and a half years since then but it still bothers me to some extent.\n\nI visited her this Christmas to spend time with her. I though the first few days were fine but that's because we were setting up things for Christmas. A few days after that I was staying with her and my sister at her house. So I thought this would be a good time to get to know my mom a lil more. However, she hasn't asked me shit about how I've been or how highschool is going since I got here. When ever I try to go talk to her she shrugs off whatever I say and shoots me down for the things I enjoy. \n\nAt this point I don't think she likes me. We went out for a dinner with an old friend of hers so they could catch up. Her friend asked her why she moved and my mom responded with \"I left everything that annoyed me being.\" ThAnKs mOM.",
            "score": 4,
            "author": "Soup_Spoon_official"
        },
        {
            "level": 0,
            "comment": "On Christmas my grandpa randomly started talking about politics when no one asked",
            "score": 7,
            "author": "CrazyTheKureiji"
        },
        {
            "level": 0,
            "comment": "I showed my family the music vid for \"no love\" by death grips. the whole room was completely silent.",
            "score": 6,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "man I hope this next generation of parents get it right",
            "score": 7,
            "author": "bloodflart",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thankfully, we tread towards fewer and fewer  parents.",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It be like that",
            "score": 6,
            "author": "Kuroath",
            "replies": []
        }
    ]
}