{
    "id": "q2w84y",
    "score": 139807,
    "title": "There was a shooting at my school today",
    "author": "HawkPotato",
    "date": 1633562958.0,
    "url": "https://www.reddit.com/r/teenagers/comments/q2w84y",
    "media_urls": [
        "https://v.redd.it/07t4ayrpzwr71"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This thread has been flaired as *[Serious]*. Please be aware that this marks it as a place for serious discussion only and that any unserious content in this thread will be met with [infraction point(s)](https://www.reddit.com/r/teenagers/wiki/rules#wiki_point_system.3A). If your comment does not contribute to the discussion in a serious manner it will be removed. Please report any comments that do not respect this rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/teenagers) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Once someone was gonna shoot my school it was when we were in lunch time and there’s always a police officer there so when he was pulling out the gun he got tackled",
            "score": 3302,
            "author": "randomskidd",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope it wasn't spicy chicken patty day. I would be pissed if someone ruined spicy chicken patty day.",
                    "score": 2260,
                    "author": "Phartidandshidded",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We’d go after the mf that ruined spicy chicken patty day.",
                            "score": 807,
                            "author": "AutomaticVegetables",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hopefully it was just cardboard pizza slab day",
                                    "score": 244,
                                    "author": "Jaykzuka",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Just gotta add that guy to the purge list",
                                    "score": 43,
                                    "author": "CreeperKiller336",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Now I'd shoot the mf my self if they got in my way and the spicy chicken patty",
                                    "score": 29,
                                    "author": "Neolpalm",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same happened in my highschool before i went there, a shooter walked in and luckily a jock was behind him and got tackled the FUCK out of (EDIT: i was wrong. It was in 2018, a student walked in with a 25-Caliber handgun (non loaded) and the school was immediately put on lockdown upon notice.)",
                    "score": 100,
                    "author": "Muted_Samurai_1337",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm both afraid and relieved",
                    "score": 58,
                    "author": "aekkko"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let me guess, that school in Arlington? Glad you're safe man, that's a fucking terrifying experience",
            "score": 9483,
            "author": "vantai0805",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh shit. Like Arlington VA? I live close to Arlington. I heard about it but thought it was a false call, from what people where saying.",
                    "score": 4369,
                    "author": "CrazyPridecat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, I'm talking about Timberview HS in Arlington, Texas. 4 we're wounded",
                            "score": 3114,
                            "author": "vantai0805",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh dang I live near there",
                                    "score": 966,
                                    "author": "ELITEREDDIT07",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same, used to drive by it all the time on my way home. Surreal to see this on reddit.",
                                            "score": 538,
                                            "author": "StopReadingMyUser",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh ok, then the other one was a false call.",
                                    "score": 284,
                                    "author": "CrazyPridecat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then the other one was a false call???!!!!??? Fuck being a student in the US. That’s terrifying",
                                            "score": 380,
                                            "author": "Frostbitnip",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Local school in Maine had a false call as well",
                                                    "score": 44,
                                                    "author": "mcphearsom1",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'm just astounded that there was confusion about \"which\" school shooting",
                                                    "score": 376,
                                                    "author": "drcatfaceMD",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Being born and raised in America, I’m not at all surprised that there was confusion as to which shooting. My kid just started high school, and already dealt with a kid threatening either a shooting or a bomb (details were not released) the kid said it was a “joke”, but authorities took it seriously enough to put the kid in custody. Sick times we live in, a lot of angry lost people. The Sandy Hook shooting really got me, I never thought that would happen at an elementary school, I’ll never forget that day, I heard it on the news at work, cried the whole way home that day. \n\nIt’s just a daily fact of living here that you can be at any random place and someone can just decide today’s the day their gonna open fire around here.",
                                                            "score": 125,
                                                            "author": "AdGlittering9727",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It’s amazing how different my high school days were to yours. I grew up in Australia and we didn’t have a single intruder drill. To the best of my memory we had one fire drill in 5 years and that was it. No shooter drills, no intruder training. It wasn’t even a consideration. \n\nHell we use to have a homeless elderly man walking through the school grounds in a pink bikini (obvious mental health issues) and no one batted an eye.",
                                                                    "score": 58,
                                                                    "author": "Roaming_Pie",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's not just the difference between countries, but the last 20 years. I graduated high school in 1998. All through my school years school buildings were open and easily accessible. If mom needed to pick me up for a doctor's appointment or just to bring in birthday treats for class she just walked right in the building and wandered to my class with no one knowing.  In high school the doors weren't locked down or alarmed. Sneaking in and out of school was ridiculously easy. The closest thing to school security was the disciplinarian, Mr G.\n\nMy freshman year of college I watched Columbine playout on the cafeteria TV and was shaken.\n\nBy the time my daughter was in preschool and kindergarten the all day lockdowns started. Have to be buzzed in if the busses aren't dropping off or picking up. Entire school layouts were changed so that now the main entrance was right next to the office and you never got past that point. NEVER. There have been entire school years where if I missed parent/teacher night I'd lost my only chance to actually see her class room. And then there's cops and school resource officers and oh, did I mention my daughter graduated from the same high school I did? \n\nI'm so very glad she made it out and into college. I can't imagine what it's like being in high school these days",
                                                                            "score": 16,
                                                                            "author": "Kneedeep_in_Cyanide",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 112,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 46,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I heard Springfield is hiring",
                                                                            "score": 20,
                                                                            "author": "poops-n-farts",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Try any of the Richmonds, I hear they're mostly nice this time of year.\n\nOr Detroit. Just. . .lol. . .Detroit.",
                                                                            "score": 8,
                                                                            "author": "Scarethefish",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man, wtf, there was just one a few days ago in Texas",
            "score": 7706,
            "author": "AngryHobo381",
            "replies": [
                {
                    "level": 1,
                    "comment": "There have been [five school shootings in the past 7 days](https://www.edweek.org/leadership/school-shootings-this-year-how-many-and-where/2021/03)",
                    "score": 7539,
                    "author": "wineberry_robot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "U.S rushing the whole “Get Back to Notmal” thing a little too fast",
                            "score": 5617,
                            "author": "MonsoonGlider",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wonder if covid made school shootings even worse (more public divide, depression etc)",
                                    "score": 1203,
                                    "author": "practiceperfect111",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "American school shootings actually completely stopped for a while thanks to Covid. It was the first time the country managed a month without a school shooting…\n\nMind you all the schools were closed at the time, but still",
                                            "score": 1052,
                                            "author": "CobaltSanderson",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But the rate of shootings within families and neighborhoods increased.",
                                                    "score": 464,
                                                    "author": "PhotoIll",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "abuse went up, abuse reports got spaced out really bad. no in person teachers to report the signs.",
                                                            "score": 300,
                                                            "author": "melancholanie",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Mhm, this is something which should be talked about more but it really isn’t",
                                                            "score": 53,
                                                            "author": "Char_Zard13",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "America moment",
                            "score": 3813,
                            "author": "Jaboyyt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "From 2009-2018, there were 314 school shootings in 10 countries in the world. 288 of those were in the US.\n\nEdit: Source: https://www.statista.com/chart/amp/13998/school-shootings-per-country-2009/",
                                    "score": 1943,
                                    "author": "Guido-Guido",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Holy shit I knew it was bad but wow that's shit",
                                            "score": 896,
                                            "author": "Much_Ash_7274",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You have no idea how many people say things like, \"it's not that bad, those things are overreported!\"",
                                                    "score": 593,
                                                    "author": "slickyslickslick",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This gives me south park vibes. Remember that episode where there was a school shooting every day and no one seemed to care abt it ?",
                                                            "score": 168,
                                                            "author": "Chmichmicha",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They were more worried about Stan’s Mom going through ‘The Change’. Great episode.",
                                                                    "score": 39,
                                                                    "author": "Harbinger2001"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "IIRC it’s the whole season not just one episode.",
                                                                    "score": 10,
                                                                    "author": "fourtwentyBob",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "There’s a chance they’re underreported too, hope not",
                                                            "score": 290,
                                                            "author": "derpballs69",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Only the ones where people die matters",
                                                                    "score": 103,
                                                                    "author": "BrilliantTarget",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Don't see other countries selling bullet proof backpacks do ya?",
                                                    "score": 49,
                                                    "author": "Willy_wolfy",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;American\n&gt;Go to school\n&gt;Get shot\n&gt;Die from medical bills",
                                    "score": 438,
                                    "author": "PykeTheDrowned",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Private medical sector: \"Education kills people!\"",
                                            "score": 52,
                                            "author": "Agent__Caboose"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Figgity fucked up reality",
                                            "score": 102,
                                            "author": "LeatherHousing",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Fr!",
                                    "score": 26,
                                    "author": "CloneDenmark"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Canada has had 19 school shootings in the past 37 years! https://worldpopulationreview.com/country-rankings/school-shootings-by-country\n\nEdit: *137, not 37 years",
                            "score": 78,
                            "author": "DeimosLyric",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Did I just read that 4/6 of the fatalities were from police shooting innocent bystanders?",
                            "score": 128,
                            "author": "BigCaregiver7285",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I noticed that. What the fuck?! I had to reread it a few times because I thought I read it wrong.",
                                    "score": 84,
                                    "author": "aliciathehomie",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m so sorry you had to go through that.",
            "score": 2417,
            "author": "BallofEnvy",
            "replies": [
                {
                    "level": 1,
                    "comment": "And hope you're well",
                    "score": 211,
                    "author": "averagesmasher03"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You good man? Your friends ok?",
            "score": 10371,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "everyone i know is okay, no one was killed thankfully, but one person is critical to my knowledge",
                    "score": 11555,
                    "author": "HawkPotato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "and the shooter?",
                            "score": 5335,
                            "author": "gg3322",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "he’s in police custody",
                                    "score": 7188,
                                    "author": "HawkPotato",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "did you like, know him? must be really crazy, thank god Ive never went though something like this\n\nedit: typo",
                                            "score": 3908,
                                            "author": "gg3322",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Apparently what happened was that the student ~~got in a physical fight~~ was beaten while onlookers filmed and left then returned with a gun to shoot the person ~~whom he was physically fighting with~~ who had physically assaulted him.  That’s my understanding as of now.\n\nEdited to reflect that he appeared not to have returned blows in the altercation.\n\nEdit2: It’s difficult to tell what happened as someone from outside of the school and the situation.  Was it self defense?  Was it assault with a deadly weapon?  More info needed.",
                                                    "score": 3035,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[That's not right. ](https://www.msn.com/en-us/news/crime/student-taken-into-custody-hours-after-texas-school-shooting/ar-AAPcTQW)\n\nThey got into fight kid pulled out a pistol and started shooting hit a teacher who was trying to break it up and some others. \n\nRan from the scene threw the pistol and got an attorney and turned himself in.\n\nEdit: after people posting the video it really looks like the shooter was the one beating the other kid but the news has gone mum for some reason so we shall see.",
                                                            "score": 2756,
                                                            "author": "Dmacjames",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Got an attorney holy shit that was fast",
                                                                    "score": 1598,
                                                                    "author": "Upupandaway072835",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "From what I read he lived in a nice suburb, drove a nice car. His family probably had one on dial already",
                                                                            "score": 842,
                                                                            "author": "no-mames",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Lol...Ted Cruz tried to blame the shooting on Biden's immigration policy, like WTF does that have to do with an upper middle class born American (not even what you would call an immigrant family) getting in a fight and pulling out a pistol?\n\nEdit: right wing media have scrubbed most of it out and just cut off after the does the obligatory thanking of the first responders...but I found a YouTube vid with a piece of it. \n\nhttps://youtu.be/ifQQwi5Osvw\n\nEdit #2: from the sounds of it maybe this is wrong, it was apparently a press conference about the \"border crisis\" and Ted (Rafael) Cruz took an appropriate moment to recognize the school tragedy and first responders. So maybe not as controversial as I had originally posted but just THE WORST SEGUE (not the scooter Segway) IN HISTORY.",
                                                                                    "score": 403,
                                                                                    "author": "Jumper5353",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm hiding in Honduras.  \n\nSend lawyers, guns, and money.",
                                                                            "score": 58,
                                                                            "author": "GumdropGoober",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Are high schoolers now trained to know what to do in case they become a school shooter?\n\nI didn't even know what an attorney was as a kid.",
                                                                    "score": 303,
                                                                    "author": "TheSchadow",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I assume he called his parents.",
                                                                            "score": 99,
                                                                            "author": "kabonk",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Dude looks like he called Stringer Bell",
                                                                                    "score": 45,
                                                                                    "author": "gastonsabina",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I assume he called his parents",
                                                                            "score": 19,
                                                                            "author": "LaminationStation-",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "We’re are trained since kindergarten",
                                                                            "score": 41,
                                                                            "author": "UnhappyOrder5382",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ooh so it was a shooting at a school, not a school shooting.",
                                                                    "score": 20,
                                                                    "author": "randoGee",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What state was this in?",
                                            "score": 77,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Texas",
                                                    "score": 127,
                                                    "author": "yeezus4prez",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh shit I saw something about a shooting in Texas hope y'all are ok",
                                                            "score": 78,
                                                            "author": "Amaturatsu",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "that's good, i hope that the person in critical state gets well",
                            "score": 44,
                            "author": "shrek_deus",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1869,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They have that device.  It’s the giant, heavy closet right next to the door that ten teenagers could have moved.",
                    "score": 726,
                    "author": "moronisunderpants",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I work for a school district and the elementary schools have lock bars on the walls beside the doors. These bars slot into the door itself and then drop into a reinforced recess in the ground. The locking mechanism is entirely unreachable from outside, and it would take an inhuman amount of force to bend the bar. I think that's more what he's suggesting. They seem very effective.",
                            "score": 367,
                            "author": "yugas42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The fact these lock bars are needed at an ELEMENTARY school… I don’t have any words",
                                    "score": 168,
                                    "author": "PazzoBread",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "One of the earliest recorded mass shootings in America was perpetrated by a man who used explosives to blow up an elementary school. This was in 1927 and is called [The Bath School Disaster](https://en.wikipedia.org/wiki/Bath_School_disaster). I think it's important for people to understand that this evil is not new to recent generations.",
                                            "score": 27,
                                            "author": "Atwotonhooker",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Schools use to have really heavy solid wood and metal desks, cabinets and tables. That stuff would block a door but now it’s all plastic garbage. I still have giant mid century wood tables and desks in my room and a 10’ long metal cabinet. There are at least half a dozen things that weigh over 100 lbs to barricade the door with. They wanted to remodel my room and I told them no. The plastic stuff breaks and it’s also no good for barricading doors. I have a 100 lb stone table top that’s a bit more narrow than the outward swinging door. If a shooter opens the door his privates or his feet are going to get smashed. If I have time I’m gonna booby trap the place. We’ve got fire extinguishers, table legs, razor blades, sheets of glass and a pile of claw hammers. I’d waste no time organizing an army of teenagers to fight back. My message would be “Everyone screamed like the devil and fight back if someone tries to get in that f*cking door.”",
                                    "score": 47,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I am sooo... so so unbelievably sad that we're rating our school equipment based on \"baricade\" efficiency vs ***any other reason*** including natural disaster",
                                            "score": 25,
                                            "author": "foodie42"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Good chance it's fastened to the wall, otherwise it would be a tipping hazard.",
                            "score": 78,
                            "author": "ampma",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "OSHA certified.",
                                    "score": 16,
                                    "author": "blasStois"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And it provides something to push/throw at them if they do end up entering.",
                    "score": 47,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; Redditor accidentally doxxes themselves",
            "score": 3558,
            "author": "Fascist05",
            "replies": [
                {
                    "level": 1,
                    "comment": "oh shit oh well",
                    "score": 2527,
                    "author": "HawkPotato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you fool i know where you go to school now",
                            "score": 1164,
                            "author": "egg_123",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't Shoot!",
                                    "score": 231,
                                    "author": "moconaid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Someone pray for these people.... someone else please give a shitton of money for their therapy...",
                                            "score": 65,
                                            "author": "foodie42",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "imma guess Arlington texas",
                            "score": 80,
                            "author": "kalzenbutbetter"
                        },
                        {
                            "level": 2,
                            "comment": "I'm gonna send you so many fuckin flowers",
                            "score": 15,
                            "author": "LurkLurkleton"
                        },
                        {
                            "level": 2,
                            "comment": "Fuck, never expected it to happen in arlington",
                            "score": 61,
                            "author": "Rookie_01122",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, I've never been to Arlington, but there is literally not a single place in the US that would shock me to have a school shooting. With that said, Texas shocks me least of all considering it has more guns per capita than anywhere else...",
                                    "score": 45,
                                    "author": "arksien",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol more like “person chooses not to be anonymous.” Doxxing implies something else dude. Usually ousting someone with malicious intent. It’s a weird comment to make for sure.",
                    "score": 29,
                    "author": "MapleA"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you ok? What happened?",
            "score": 1750,
            "author": "Revolutionary-Baby-1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kid was getting bullied, someone beat the shit out of him in class for quite a while (video was posted in another thread), kid pulled out a gun after fight and shot his attacker + some other people, ran from school and contacted an attorney before turning himself in.\n\nSchools are probably going to ban bags in school or something instead of dealing with the bullying and mental health problems that happen as a direct result of the public education system.\n\nEdit: don't read my comment, here is news articles with information released by police is in [this](https://www.reddit.com/r/Firearms/comments/q36uts/-/hfq53v0) comment. [Here](https://v.redd.it/ijznbi6qvur71) is a clip of the \"fight\" before the shooting. Tl:dr, kid was beating someone else in a classroom, teacher called for assistance, kid delivering the beating pulled a gun and shot 2 people with 2 more receiving an \"abrasion wound\" and the other refusing treatment, shooter ran to an attorney who drove him to the police to turn himself in.",
                    "score": 912,
                    "author": "SpookyDoomCrab42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Got some links to that shit?",
                            "score": 150,
                            "author": "Plopplopsploosh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://www.reddit.com/r/news/comments/q2myxq/-/hfmexbd",
                                    "score": 91,
                                    "author": "SpookyDoomCrab42",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Actual link\n\nhttps://reddit.com/r/news/comments/q2myxq/_/hfmzre8/?context=1",
                                            "score": 24,
                                            "author": "bobby4444",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It got removed.",
                                                    "score": 11,
                                                    "author": "xThaWolf",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "https://twitter.com/bob12vagene/status/1445782245277519882?s=21",
                                                            "score": 13,
                                                            "author": "Smoka_Lad",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "bullying is way bigger of a problem than people think",
                            "score": 197,
                            "author": "TobySchoon",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I swear they're banning schools before addressing the real problems",
                            "score": 15,
                            "author": "Jaszs"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's smart asf that you guys barricaded the door. Can you describe what happened when you were informed there was a school shooter?",
            "score": 4814,
            "author": "__babygiraffe__",
            "replies": [
                {
                    "level": 1,
                    "comment": "my school actually does smthn similar that we barricade incase of an intruder",
                    "score": 2756,
                    "author": "suzithecat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Looks like the cops really struggled to get past it.",
                            "score": 2427,
                            "author": "Jackripper1205",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It may have actually made sense if the door swung the other way lol",
                                    "score": 1298,
                                    "author": "Thecdog00",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well that cop was much larger and stronger than the average teenager, which wouldn’t break down the barricade so easily. Plus it delays the shooter for long enough that the police can neutralize the attacker if worst comes to worst.",
                                            "score": 905,
                                            "author": "atlanmail",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "True: from what i hear, the most important thing to shooters is time. They wont bother wasting time, even if its only 10 seconds",
                                                    "score": 661,
                                                    "author": "worstgam3r",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My highschool had a system where we would move ourselves and our supplies to a corner of the room that was out of the immediate sightline from the door. We would then turn off the lights. The thinking was that the room would look empty, so the shooter/intruder wouldn't even bother going in. I have no idea how well it would've worked, but I'm very glad that we never had to find out.\n\nEDIT: I should've mentioned it before. But we also locked the doors. I think a couple people beleive that we just sat in the room without the door locked, but that was not the case. The doors in the school were very sturdy, and while a normal person could potentially kick one in with enough effort, a shooter most likely wouldn't waste their time with it.",
                                                            "score": 279,
                                                            "author": "Blasted-Banana",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh I hate that, like the likelihood of the shooter being a student that was taught this is fairly high ... And if EVERY class is doing it, then a shooter who didn't go to the school would figure it out pretty fast",
                                                                    "score": 219,
                                                                    "author": "CookingWithDahmer85",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "They could add the rolly gates businesses use, if they had the funding. Equip them so they can be remotely closed from the office. Have an emergency escape button so those inside can leave, just in case. They could even have some areas of the hallway that can be set to trap someone inside - controlled by whomever has the cameras. \n\nThey could put LEGO’s out as caltrops.",
                                                                            "score": 36,
                                                                            "author": "ButtonholePhotophile",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wait, but wouldn’t the shooter know what you guys are doing since they would be there when you were told what to do?",
                                                                    "score": 42,
                                                                    "author": "TheBurntPie9",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Worst thing to do. If he makes it through that door all of you are packed in a corner as easy targets. Most people’s aim suck (esp moving targets) so spread out, chuck books at em",
                                                                    "score": 77,
                                                                    "author": "Glittering-Virus-617",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That's what I thought too. Most teachers actually didn't follow this protocol when we had lockdown drills. Luckily, we never had an extreme situation like this.",
                                                                            "score": 35,
                                                                            "author": "Blasted-Banana",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Especially bad since as a student at the school, the shooter would be aware of this trick and not fall for it.",
                                                                            "score": 47,
                                                                            "author": "zack907",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It's not a \"trick\". Like, oh what a dumb shooter, he actually thought this room was empty!\n\nSince just about any school has empty rooms at any given time, the shooter won't want to waste time with a locked room that *might* be empty. As with any criminal, they are looking for easy opportunities. They have a ticking clock and can't waste time.",
                                                                                    "score": 23,
                                                                                    "author": "Ideaslug",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That's what people say, but who really knows what goes through the mind of someone willing to shoot up a school? Especially if they're not looking for a way out of the situation.",
                                                            "score": 356,
                                                            "author": "GoombaGary",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": ".. or if they have specific targets and know exactly which room they're in.",
                                                                    "score": 263,
                                                                    "author": "frugal_masturbater",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yea fuck that. I'm running tf outta there",
                                                                            "score": 90,
                                                                            "author": "PM_ME_UR_BOOGER",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[deleted]",
                                                                                    "score": 79,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There’s a finite amount of time available before a SWAT team shows up and takes the shooter out. Slowing them down absolutely helps to limit casualties.",
                                                                    "score": 113,
                                                                    "author": "Socalinatl",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He barely put any effort in, it wasn’t some huge dude putting forth Herculean effort, wtf are you talking about",
                                                    "score": 16,
                                                    "author": "dingletwat47",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "lol thats the first thought I had but its better than nothing I guess. the shooter would be mildly inconvenienced for only a moment.",
                                    "score": 47,
                                    "author": "MrNudeGuy",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My school has 2 plans of attack in case something like this happens. After the whereabouts of the threat are known. Classrooms decide individually if they want to entrench themselves by barricading the doors and taking cover or if possible, attempt to escape the building.",
                            "score": 83,
                            "author": "Metallicultist88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My son's high school barricades and get armed to counter an attack if needed. All teachers and students are trained to throw anything at the shooters head IF they get into the locked room and to FIGHT. They had a lock down in his school last year due to threat and his AP Biology  class was armed with scalpels, knifes, class made flame throwers and a pile of anything they could throw if needed. Scary but empowering.",
                                    "score": 129,
                                    "author": "proudmommy_31324",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pretty sure everyone does that for the drills\nedit: i meant in america",
                    "score": 233,
                    "author": "thelegend90210",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh yeah, the school shooting drills, of course (holy shit the world we are in)",
                            "score": 207,
                            "author": "Fearinlight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Any time I hear this, it's fucking wild to me. I graduated in 04. We didn't think about school shootings back then. That's not a concern I   ever had to have. There weren't drills or plans, it just wasn't a thing we prepared for. Columbine was really the only major, highly publicized shooting to happen before I was in high school. \n\nMy sister in law graduated from the same school in 2018. She'd talk about shooter drills very casually, like... Eh, it's just what we do. Same as fire and tornado drills. Every time, it threw me off guard. Both that it was happening, and that to her, it wasn't weird... It's just the way it was.\n\nI'm not intending to turn this into any kind of political debate... Just... What the fuck happened in this country? \n\nI'm glad you're safe OP. I seriously can't imagine what it must be like to be in this situation as a teenager.",
                                    "score": 109,
                                    "author": "A_MAN_POTATO",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, it's pretty mind blowing to me too. Granted the late 90s was still the age of dial-up, flip phones and AOL/AIM. There was Columbine in 1999.\n\nIf you want to see a depressing list you can check:\n\n* https://en.wikipedia.org/wiki/List_of_school_shootings_in_the_United_States_(before_2000)\n* https://en.wikipedia.org/wiki/List_of_school_shootings_in_the_United_States",
                                            "score": 19,
                                            "author": "AudibleKnight",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The country",
                                    "score": 11,
                                    "author": "bigavz"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nah we just turned the lights out, locked the door, and hit out of sight of windows - never physically barricaded the door for a drill (and thankfully never been in a real situation).",
                            "score": 16,
                            "author": "LilacPanda21"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sadly a lot of schools have active shooter drills where they train us to do these things. \n\nI teach kindergarten and I keep a tactical vest and an extendable Billy club in my classroom. Just in case.",
                    "score": 31,
                    "author": "LittleWhiteBoots",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Dude broke it down in like 2 kicks tho.  Classrooms should keep a door jam mechanism so the shooter can't just do the same.  These people were probably cornered unless they could go out the window",
                    "score": 31,
                    "author": "SoManyQuestions180",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean, can we talk about how they barricaded a door that opens outward? Like, I'm glad everything worked out and it was law enforcement opening the door. But if it wasn't, that barricade did literally nothing to stop them, because it's not holding the door closed.",
                            "score": 21,
                            "author": "Sikorsky_UH_60",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As you saw it could’ve been knocked down easy enough but I guess it’s good to get some time to attack the shooter",
                    "score": 76,
                    "author": "Stopandthinkwhy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I heard about a school shooting in Texas, is this it?",
            "score": 457,
            "author": "Zane_Baby_Yoda",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah",
                    "score": 317,
                    "author": "HawkPotato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hope everyone is safe",
                            "score": 115,
                            "author": "Zane_Baby_Yoda"
                        },
                        {
                            "level": 2,
                            "comment": "Dam I lived very close to Arlington just moved to Oklahoma recently hope everyone is ok",
                            "score": 47,
                            "author": "Mrfroggyleggs101"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i'm so glad you're not hurt",
            "score": 730,
            "author": "yougoddangfool",
            "replies": [
                {
                    "level": 1,
                    "comment": "When the cop came through the door and said 'Everyone here alright?'\n\nI felt the relief!",
                    "score": 265,
                    "author": "Dboy777",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was distracted while the clip was loading and thought the desks falling were gunshots. Relieved that wasn't the case.",
                            "score": 63,
                            "author": "Outside_Scientist365",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There was a rumor going around that an active shooter was at one of the schools in my area. I say rumor because that was false, the police confirmed it, but it didn’t actually hit me what that could have meant until like an hour ago. Shits scary.\n\nOh and if I remember correctly that’s the 5th THIS WEEK. Not the 5th rumor the 5th school shooting this week.",
            "score": 757,
            "author": "mamsnrhbr_chehfde",
            "replies": [
                {
                    "level": 1,
                    "comment": "'murica",
                    "score": 287,
                    "author": "Swiglo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fuck yeah",
                            "score": 138,
                            "author": "mamsnrhbr_chehfde",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fuck nah",
                                    "score": 75,
                                    "author": "i_eat_water_and_soup",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "at least you are alive.\n\nedit: who the fuck gave the post a \"Table Slap Award\"?",
            "score": 591,
            "author": "floppy_disk_5",
            "replies": [
                {
                    "level": 1,
                    "comment": "A comedic genius clearly",
                    "score": 42,
                    "author": "Androreese"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah I've been hearing about school shootings happening everywhere recently, in fact there was even a threat at my school, stay safe man 👍",
            "score": 40,
            "author": "ButterCreamBobby",
            "replies": []
        },
        {
            "level": 0,
            "comment": "this is probably why I don't want to go to a school with life threatening situatuions\n\nis everybody safe?",
            "score": 801,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "sadly four were injured including a teacher who was shot and a student who was much worse off but still alive",
                    "score": 872,
                    "author": "HawkPotato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm really sorry to hear that. I hope you're doing ok, and please do reach out to someone if you need.",
                            "score": 138,
                            "author": "cCitationX"
                        },
                        {
                            "level": 2,
                            "comment": "well I hope they get better\n\nhave a nice day",
                            "score": 249,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Oh no, im so sorry to hear that! I hope ur doing okay, thats pretty traumatizing… sending love to u and ur friends and peers",
                            "score": 21,
                            "author": "TJdog5"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**DO YOU LIVE NEAR ARLINGTON TEXAS**\n\nThere was a school shooting there today and if so I live literally 20 min away from where that happened",
            "score": 136,
            "author": "tacodino200",
            "replies": [
                {
                    "level": 1,
                    "comment": "They confirmed it was",
                    "score": 74,
                    "author": "thelegend90210",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh fun. Backstory btw, the kid was in a fight with another kid and one of them pulled out a gun and started firing rounds at the other kids and a teacher. He was caught later at a house and taken into custody",
                            "score": 61,
                            "author": "tacodino200",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jesus fucking Christ. I’m sorry you and your classmates had to go through this. Goddamn it. Fuck.",
            "score": 24,
            "author": "NoWomanNoFry"
        },
        {
            "level": 0,
            "comment": "I saw this, glad your safe",
            "score": 70,
            "author": "stigtopgear",
            "replies": []
        },
        {
            "level": 0,
            "comment": "damn hope everyone’s alright. that’s the real shit.",
            "score": 169,
            "author": "dylaltchi"
        },
        {
            "level": 0,
            "comment": "That must have been fuckin terrifying",
            "score": 65,
            "author": "Bottle-nosed-dolphin"
        },
        {
            "level": 0,
            "comment": "This is a very calm post for such a traumatic event.",
            "score": 69,
            "author": "unknown45666",
            "replies": [
                {
                    "level": 1,
                    "comment": "if i’m being honest, besides knowing someone was shot in the school and possibly dead, they day as a whole was mostly boring, a lot of sitting around, we couldn’t leave or go to the bathroom or anything like that, and the wifi and data got overloaded so there was no internet, the shooting happened at 9:15 and i didn’t get to leave for home until 3 ish, thankfully no one was killed, but just a long day spent sitting around",
                    "score": 130,
                    "author": "HawkPotato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My school had a shooting in 2017 and this is so true. Ours happened at 7:35am and we didn’t leave until close to 2:00. You just had to sit and think about what happened. Over and over again. Truly horrible and incredibly boring. I hope you’re doing okay",
                            "score": 11,
                            "author": "spicermemes"
                        },
                        {
                            "level": 2,
                            "comment": "Glad you're alright though, that stuff is scary.",
                            "score": 35,
                            "author": "unknown45666"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was this in Arlington?",
            "score": 16,
            "author": "Bthegriffith",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just found [this on Tiktok ](https://vm.tiktok.com/ZM81FRWF1/), this country is something else",
            "score": 65,
            "author": "TheInsurgence",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did the school not have a second exit? They had to walk the kids past the blood stains?",
                    "score": 15,
                    "author": "und88",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Actually my worst nightmare",
            "score": 42,
            "author": "__babygiraffe__",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My school had a shooting back in 2017. I strongly encourage you to go to therapy after this. Some of the worst moments of your life just happened out of nowhere. Hope you’re okay",
            "score": 39,
            "author": "spicermemes"
        },
        {
            "level": 0,
            "comment": "Yeah those barricades held up well…",
            "score": 155,
            "author": "This_guy_Jon",
            "replies": [
                {
                    "level": 1,
                    "comment": "First thing I thought of when I watched that. Its like a pillow fort. They should have at least tried to move the teachers desk or that giant wooden cabinet to block the shit. Those things are heavy, well at least from what i remember.",
                    "score": 48,
                    "author": "WanderlustFella",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I assume the door was locked. Lead officer probably had a master key from administration. But you make a good point that the door opens outwards which is done via fire code. People get trapped, crushed, on a bottleneck when a door opens in. Google some club fires where that’s happened. I do wonder though if it wouldn’t be a bad idea to have inward opening classroom doors and a door wedge right next to it. Course that doesn’t account for if the gunman starts in the classroom and in turn traps the students. It’s a no win situation that does indeed require extensive gun control. This post seems to have been absolutely hijacked by pro gun nuts. Hopefully the mods will sort that shit soon because it’s ridiculous",
                    "score": 38,
                    "author": "TonyRobinsonsFashion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A way to drop the handle on the outside may be a nice solution. You can't grab and open a fully flat door.",
                            "score": 8,
                            "author": "that-robot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seems like a good idea, maybe except it instantly shows which rooms have people at a distance. But then again, school shootings Arent really something i have much experience with so the point may be moot",
                                    "score": 9,
                                    "author": "PossiblyTrustworthy",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What state if I may ask?",
            "score": 13,
            "author": "nxshs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm pretty sure it's Texas. Based off op's description it sounds like the one I heard of this morning.",
                    "score": 13,
                    "author": "dclphin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jesus there’s still shootings",
            "score": 93,
            "author": "CandidNegotiation652",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Texas?",
            "score": 11,
            "author": "Arkham1217",
            "replies": []
        },
        {
            "level": 0,
            "comment": "why they all bald tho 💀",
            "score": 121,
            "author": "cuminaglassbyosmosis",
            "replies": [
                {
                    "level": 1,
                    "comment": "the hair is not aerodynamic, therefore they cant chase the shooter as fast",
                    "score": 55,
                    "author": "SotB8",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They forgor💀",
                    "score": 102,
                    "author": "Fascist05",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bruh",
                            "score": 26,
                            "author": "llquartzllll",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They forgor their hair",
                                    "score": 23,
                                    "author": "Bukkitbrownie"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 71,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes this is true. I remember being in high school, and they pinpointed a red dot on the ceiling where everyone should go and sit under in an event such as this. The red dot symbolized the safest place in the classroom according to law enforcement and experts who came into the classes and inspected them. The lights were shut off, we all huddled together underneath the red dot or underneath desks (depending on the situation). Teachers went to lock the door then came to sit with us, but they were more propped up to be able to see what was happening. One teacher I had way back in elementary  also said “I will barricade the door or whatever else with my body in order to protect each of you guys”. At the time, she was also pregnant and a soon to be mom…. Sad to look back upon these things and realize how much we had to practice and know these things.",
                    "score": 25,
                    "author": "penguinzliz",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If anyone can get a gun so easily, specially people with serious problems, it's not weird that school shootings are frequent",
                    "score": 12,
                    "author": "Diprogamer",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tell me you live in USA without telling me you live in USA",
            "score": 41,
            "author": "mediocreguy93",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That’s scary bro hope nothing too bad happened",
            "score": 9,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is America 🇺🇸",
            "score": 24,
            "author": "SpartanBlender",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Being a student in America is terrifying because you have to always worry about something like this happening. Really sucks that happened to you man. Hope things get better",
            "score": 296,
            "author": "GAMRKNIGHT",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\\*school shooting\\*\n\n&amp;#x200B;\n\nThis guy: \\*whips out phone and opens camera\\*",
            "score": 526,
            "author": "sillybender",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean what else are you gonna do. Your literally just sitting in the class and you can’t really do much else.",
                    "score": 551,
                    "author": "Dirtpawgaming",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "God forbid anything happens to the game recording he might record the shooter and the police can find his phone and see exactly what the shooter looks like",
                            "score": 34,
                            "author": "oneeva044"
                        },
                        {
                            "level": 2,
                            "comment": "fair",
                            "score": 148,
                            "author": "sillybender",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey, may as well record it I guess",
                                    "score": 61,
                                    "author": "MyNameIsNitrox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i mean, you could hand the recording to police for investigation or something???? i dunno",
                                            "score": 48,
                                            "author": "WackyH",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What else is he supposed to do? No one was wounded and it’s not like the shooter was outside his classroom",
                    "score": 40,
                    "author": "Stopandthinkwhy"
                },
                {
                    "level": 1,
                    "comment": "yes",
                    "score": 124,
                    "author": "HawkPotato"
                }
            ]
        }
    ]
}