{
    "id": "11w5clu",
    "score": 10,
    "title": "Case Financial Aid",
    "author": "Puzzleheaded_Art_148",
    "date": 1679278155.0,
    "url": "https://www.reddit.com/r/cwru/comments/11w5clu",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just recently got into Case! I didn’t get my financial aid package since I had to do corrections but I am so worried I won’t be able to afford it seeing how expensive it is. I got the University Scholarship with 36k annually and my EFC is 0 so my family is poor poor. I am also an Ohio resident so I get that aid as well but I will be staying on campus because it’s a couple hours away from where I live. Do any of you guys have similar situation and what did Case cover? How much need based aid did they give you? What’s the typical amount they offer for an EFC similar to that? I really want to go but I am a strong believer of not paying for undergrad education especially since I don’t have any means to do so and hate the idea of taking out a large large loan. Thanks guys!\n\nedit: recently got my financial aid and they wanted me to pay around 10k per year which is a little too expensive for me. I decided even though it was my top school to commit to OSU instead because they are covering it fully for me plus offering me more money so I can do undergraduate debt free! Thank you all for helping!",
    "comments": [
        {
            "level": 0,
            "comment": "Hi! Senior at CWRU with an EFC of 0… I live on campus and am on the meal plan still bc my financial aid covers it. Expect your semesterly bill to be around 3-4k if you enroll full time and do not accept any loans.",
            "score": 4,
            "author": "Idk_what_career",
            "replies": [
                {
                    "level": 1,
                    "comment": "How did you pay for the semesterly bill? Did you just work? I have no money right now😭 Also were you an Ohio resident beforehand?",
                    "score": 2,
                    "author": "Puzzleheaded_Art_148",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I worked over the summers and usually make more than the needed 4K, I also had a scholarship throughout my 4 years that paid me directly and not the school, work-study is a good way to pay it off. You can also set up payment plans so the 4k is spread over a few months. Or take out loans and you usually get more money in loans than u need",
                            "score": 4,
                            "author": "Idk_what_career"
                        },
                        {
                            "level": 2,
                            "comment": "But also keep in mind you will need money to live… like money for food, personal products, money for fun, getting around the city…. So if u seriously have $0 and don’t think you’ll have enough money to pay school and some left over by the time the year starts, just take the loans and find a job on/near campus. It’s not realistic to go through college with $0",
                            "score": 3,
                            "author": "Idk_what_career",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think distant relatives can cover for basic necessities for me regarding food and personal products but having a lot to pay for tuition will be really difficult for me",
                                    "score": 2,
                                    "author": "Puzzleheaded_Art_148",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just expect a $1k bill each month …. Or take the loans … many of my friends took the loans, got jobs on campus and were able to pay them off and didn’t need the loans again after the first year. It’s manageable, the school encourages you to get food stamps, I would take them. I wish someone was this transparent when I came because I would’ve been a lot less stressed about it, but lmk if you have more questions. \n\nIf you’re looking into any other private university like CWRU, expect the bill to be the same…",
                                            "score": 2,
                                            "author": "Idk_what_career",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you so much! I expected like a 1-2k bill each month but I just didn’t want to pay tuition especially since my older brother got a full ride to John Hopkins so I don’t want to add unneeded stress to my family especially since they expect the same.",
                                                    "score": 1,
                                                    "author": "Puzzleheaded_Art_148"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea I think it was 0 for CSS profile as well",
                    "score": 3,
                    "author": "Puzzleheaded_Art_148"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! I’m a poor Ohio resident with an efc of 0 and my tuition is pretty much paid for(I’m an RA so my housing is covered, so not sure) but I only have a unsub loan of 1k and that’s it",
            "score": 3,
            "author": "Neuro_Nerd727",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can you give me the breakdown of your aid? That’s amazing! Did you receive any merit scholarships from case or outside scholarships?",
                    "score": 2,
                    "author": "Puzzleheaded_Art_148",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes! 11240 for RA, 16000 university scholarship, 33505 CWRU grant, 6545 pell grant, 2000 winter sea grant, first gen scholarship 900, Ohio college opp grant 4200, sub loan 1700(sorry I thought it was unsub 1000 but I mixed it up lol) but this is the breakdown!! I will mention that my family household size is 6 people, making under 30k and we were pretty much homeless so I’m not sure how that effects aid honestly, but I really hope this helps and I would love to see you at Case!! 🫶",
                            "score": 1,
                            "author": "Neuro_Nerd727",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also, I only applied for the first gen scholarship, everything else was offered from financial aid through things like alumni and Covid relief and stuff like that",
                                    "score": 1,
                                    "author": "Neuro_Nerd727",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Okay perfect! What was your first year like without RA position? How much did you have to pay?",
                                            "score": 1,
                                            "author": "Puzzleheaded_Art_148"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I wanted to be an RA too I just didn’t think I would get in Case and I think the applications closed too and I just got admitted!😭",
                                    "score": 1,
                                    "author": "Puzzleheaded_Art_148",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think RA positions happen after your first year, once you complete two semesters on campus you can apply to be an RA! :)",
                                            "score": 1,
                                            "author": "Neuro_Nerd727"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "To clarify this point too… they meet 100% via loans. So they will meet you in real aid about 90% of the way then the remaining 10% they can cover through loans, which is where the 3-4k per semester out of pocket cost comes in for students.",
                    "score": 3,
                    "author": "Idk_what_career"
                },
                {
                    "level": 1,
                    "comment": "Thanks! I was just seeing people talking about how expensive Case was and got worried even though I know it’s need based. I also didn’t know if they will decrease the aid they will give me because of the merit scholarship they offered initially.",
                    "score": 2,
                    "author": "Puzzleheaded_Art_148"
                }
            ]
        }
    ]
}