{
    "id": "124m49z",
    "score": 6,
    "title": "CWRU vs Fordham for finance/ economics?",
    "author": "AdditionalTough2449",
    "date": 1680003729.0,
    "url": "https://www.reddit.com/r/cwru/comments/124m49z",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys! I was just admitted to BA economics at CWRU with the option to concentrate in quantitative methods and to ‘BS Global Business with a concentration in global finance and business economics’ at Lincoln centre NYC Fordham University. I am hoping to work in finance, investment banking, corporate banking, etc. I am hesitant about the location of CWRU and it being a predominantly engineering school as well as the ranking of Fordham. Which is the better option to choose?",
    "comments": [
        {
            "level": 0,
            "comment": "Currently work in corporate banking, graduated from CWRU recently. At my current bank in NYC there is an established network of Fordham alumni. My bank goes there to recruit, and loves to hire kids from there. I've run into a number of people who have never even heard of Case at the company. \n\nI had to apply online and fight for a spot in the class.\n\nIf you want to go into finance, do not go to Case. You will be able to get a spot at KeyBank in Cleveland, or Fifth Third in Cleveland / Charlotte. Those will be the most common outcomes for IB aiming students at Case. Obviously there are exceptions and students go to bigger banks, but compared to Fordham it's not even close. \n\nGo to LinkedIn and filter employees at the big banks by Fordham grads and Case grads and it will be clear. \n\nIf I could go back I would not have gone to Case specifically because of the poor recruiting outcomes and recognition in the field.",
            "score": 6,
            "author": "OTM_Call",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is really helpful, thank you so much!",
                    "score": 1,
                    "author": "AdditionalTough2449"
                }
            ]
        },
        {
            "level": 0,
            "comment": "CWRU has the Weatherhead School of Management that is well known.\n\nDo you want to end up in NYC? Then Fordham may be better to get internships, etc.\n\nAlso what is the net price of each?\n\nAnecdote: My spouse got a B.A. in Accounting at CWRU and a job at then Big 8 accounting firm Ernst &amp; Whinney.",
            "score": 2,
            "author": "bopperbopper",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi, thank you for the reply! \nI think the cost for both is coming to the same, but for me CWRU will definitely be cheaper as I have a scholarship. But my end goal is to get a great job and meet new people.",
                    "score": 1,
                    "author": "AdditionalTough2449"
                }
            ]
        }
    ]
}