{
    "id": "126kj1j",
    "score": 3,
    "title": "How's the CS curriculum and opportunities at Case Western?",
    "author": "minklebonk",
    "date": 1680176706.0,
    "url": "https://www.reddit.com/r/cwru/comments/126kj1j",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just want to know if this is a good choice for CS. I am currently undecided between Case Western and Rose-Hulman. Please do inform me of both the pros and cons of CWRU for CS. Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "This question is asked and answered often including a few days ago, so you should check out those answers. \n\nOne difference between Rose Hulman and CWRU is the overall gender ratio. I think Rose Hulman is 76% male where it's a more even split at CWRU.",
            "score": 4,
            "author": "Awkward-Cuttlefish",
            "replies": [
                {
                    "level": 1,
                    "comment": "I spent some time previewing a Rose Hulman parent group and I got the impression that, like CWRU, it's an academically challenging environment but it seemed like students were pushed to their limits and were often devastated by low grades. I seem to also remember hearing about students spilling out into the hallways while awaiting math tutoring (and then helping each other there).  Maybe a CWRU student can speak to how Case compares in these aspects.\n\nThe parenting community seemed supportive.  They lovingly refer to their students as \"Rosies\".  There's a local guy who fixes all the students' cars. I remember hearing that students don't bother to secure their laptops and other possessions because nothing gets stolen.  They drop everything in a pile before entering the dining hall. That's about all I recall!\n\nThe location is another major difference.",
                    "score": 1,
                    "author": "Awkward-Cuttlefish"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are quite many posts about Case CS in this subreddit — [\\#1](https://www.reddit.com/r/cwru/comments/122042f/pros_and_cons_of_cwru_for_computer_science_major/) and [\\#2](https://www.reddit.com/r/cwru/comments/ty5vpa/questions_by_a_prospective_student/) are two comments of mine with a lot of links to similar posts — so I'd recommend you to read them up.\n\nI don't know much about Rose's CS. It seems like somewhere you can constantly get LAC-style small classes, which IMO is one of the most important factors for undergrad learning. However, Case is pretty small and teaching-focused compared to a lot of \"strong STEM schools\" as well. Also, looks like Rose's CS profs are not doing much CS research (not saying this is the exclusive standard, but they are not even on csrankings), and Case's location should have more to explore/enjoy for being urban.",
            "score": 2,
            "author": "choHZ"
        }
    ]
}