{
    "id": "12fbbnl",
    "score": 6,
    "title": "What do you like and dislike about this school?",
    "author": "BananaBeach007",
    "date": 1680927917.0,
    "url": "https://www.reddit.com/r/cwru/comments/12fbbnl",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am considering attending the university and was curious what you like/ dislike about the school and the area. I haven't heard much good about Cleveland but wanted to get your take. I love the fact that the area is affordable and there is a major airport close by. Also have heard many good things about Columbus, so it'd be cool to be close by there.",
    "comments": [
        {
            "level": 0,
            "comment": "Definitely the biggest negative about case is a lack of school spirit. Most people don't give a shit about the cwru sports teams, and they tend to be pretty cynical about professors, classes, and the college in general(although the second part is probably common is most colleges). Most people(like me) are fine with that, but it's definitely something you should know before coming.\n\nI think the academics are great, though- if you're smart about it, you can end up with some great professors, and some fields have really great career resources.\n\nThe area... university circle is pretty posh(comparatively), so if you're not a risk taker you can stay on campus and it's pretty safe.\n\nEdit: oh, and the airport is a huge plus. Cwru is probably one of the only colleges where you can take public transit(which is free for case students) directly, with no transfers, from the airport to campus.",
            "score": 12,
            "author": "notaboofus"
        },
        {
            "level": 0,
            "comment": "Depends on what you enjoy. Lived in Cleveland for a long time and there’s lots to enjoy. University circle has awesome museums, Little Italy is just a few blocks away and Coventry Rd with its shops and restaurants just a bit more. Wonderful parks (The Cleveland Metroparks aka the emerald necklace is an actual U.S. National Park). Downtown has lots going on and is a pretty quick ride down Euclid Ave in car or direct bus. I went to the Art Institute next door so only have second hand info from friends who went to CWRU. It’s a challenging school and that CWRU has many associated schools is a great plus (dental, med, nursing, law, business) if you’re interested in continuing in any of those fields. My friends all enjoyed it there. \nAs a con, weather  will always be brought up. It can be grey and cold for a few months out of the year. But Columbus is generally the same if maybe a few less cloudy days.\nETA: have a kid looking at CWRU 1.5 yrs from now…",
            "score": 9,
            "author": "Sn_Orpheus"
        },
        {
            "level": 0,
            "comment": "Concerning Cleveland:  I truly enjoyed the decade I lived in Cleveland. Case was no small part of that. \nI’ve considered moving back, but I currently live where there are no income taxes and low sales tax. That kills it for me. \nDon’t listen to the horror stories about the weather. They are only partly true and do make for the telling of good exaggerated tales for the purpose of frightening young children.",
            "score": 5,
            "author": "CaseyDip66"
        },
        {
            "level": 0,
            "comment": "Like: the people! Students, faculty, and staff are super friendly and collaborative. People want to help each other. There are so many great resources (career services, library advisors, counseling, peer tutors, etc) and they're all very accessible. Also, I love the area! Great restaurants and activities nearby and pretty good public transportation.\n\nDislike: the shuttle system. CWRU has shuttles but they are pretty dysfunctional and the app is inaccurate most of the time. Also, wish there was a little more class advising coming into college because it was very overwhelming. The academics are great, but I felt very unsupported when I was choosing classes for the first semester.",
            "score": 1,
            "author": "Cam-er-ah"
        }
    ]
}