{
    "id": "12qpp1j",
    "score": 4,
    "title": "How hard is it to get a single in Clarke tower as a freshman, any suggestion to snag a single room.",
    "author": "FlySea6175",
    "date": 1681829626.0,
    "url": "https://www.reddit.com/r/cwru/comments/12qpp1j",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I suggest not living in Clarke Tower to begin with",
            "score": 21,
            "author": "Skrubulon",
            "replies": [
                {
                    "level": 1,
                    "comment": "What are considered to be better choices for first year housing, if you don’t mind?",
                    "score": 3,
                    "author": "superRATural",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Any of the hall style dorms, particularly in Juniper",
                            "score": 10,
                            "author": "Skrubulon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don’t go Taplin, Taplin sucks",
                                    "score": 1,
                                    "author": "Dovahkiin12014"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Do not go Cedar Mag. They have quad style houses which is cool, but you are being straight up ripped off paying the same as Juniper students. Measly particle wood kitchens, horrific bathrooms, and very dingy. Meanwhile, Juniper has new furniture, appliances, granite countertops, small kitchens with kitchen sinks on the residential floors (something CedarMag doesn’t have), and all the Juniper buildings are connected so you can traverse multiple buildings without having to even go outside.",
                            "score": 1,
                            "author": "Desire4Gunfire",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much! Is there a quad style dorm that’s worth it? I like the idea of the clusters better than a hall, but if it’s that bad I’d definitely just settle for the other.",
                                    "score": 1,
                                    "author": "superRATural",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "All of the quad styles are Clarke and CedarMag to my knowledge. Mistletoe and Juniper are hall style. If you haven’t, I recommend looking at the floor plans for the buildings here: https://case.edu/housing/facilities/first-year-buildings The hall style floors have more of a connected design than the quads do in my opinion. You won’t be on the first floor, btw. I’d personally rank the communities (buildings, not people. good people can make any bad setting good) from best to worst as Juniper, Mistletoe, CedarMag, Clarke.",
                                            "score": 1,
                                            "author": "Desire4Gunfire",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you so so much.",
                                                    "score": 1,
                                                    "author": "superRATural"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "why",
                    "score": 2,
                    "author": "FlySea6175",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Broken elevators all the time 🫡",
                            "score": 12,
                            "author": "mans-too-hot"
                        },
                        {
                            "level": 2,
                            "comment": "Along with what everyone else has said, Clarke has a shit ton of people, much more than the other first-year houses. This makes it statistically more likely for some dumbass to set off the fire alarm, which happens quite frequently compared to the other houses. There’s nothing like waking up at 4AM to a fire alarm and then waiting outside in the freezing cold.",
                            "score": 13,
                            "author": "Desire4Gunfire"
                        },
                        {
                            "level": 2,
                            "comment": "Literally the worst quality dorms on campus",
                            "score": 10,
                            "author": "Skrubulon"
                        },
                        {
                            "level": 2,
                            "comment": "Lol Clarke sucks",
                            "score": 5,
                            "author": "casewesternreserve"
                        },
                        {
                            "level": 2,
                            "comment": "I heard my chances of getting a single there the best… I’d almost rather a shitty building and be alone!",
                            "score": 1,
                            "author": "FlySea6175",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s not how the housing application works. Don’t try to go for a specific house’s single if you want a single. Just try to get a single, don’t get picky. All rooms fly when applications opens up, especially singles, and that’s quite literally what screwed me over. I could have possibly had a single, but I thought “hm, not the house I want” thinking I’d get another opportunity and then bam, all gone. Very much like trying to get limited-edition shoe from retail. If you see a single pop up, you click that thing as quick as possible and pray.",
                                    "score": 2,
                                    "author": "Desire4Gunfire",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks so much….so do you just input that you want a single. It’s hard for me to imagine what we will see when I log in. When they open the sites is there a list that they keep adding to live time",
                                            "score": 1,
                                            "author": "FlySea6175",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I know they updated the housing website, so I’m not exactly sure how it will look, but last year, it was just a list of a couple rooms with information. There should be a category that shows if it’s a double or a single.",
                                                    "score": 2,
                                                    "author": "Desire4Gunfire"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Clarke is a shit place to live, but finding a single isn't impossible. I'd recommend living literally anywhere else though.",
            "score": 9,
            "author": "TCGnerd15"
        },
        {
            "level": 0,
            "comment": "Don't even try, there is somewhat minial chance above 0 that you can get a single room. Plus Clarke sucks, period. If you are from some southern places and spoiled by the AC like I am, the building is like a sauna room.",
            "score": 3,
            "author": "aenrikchan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aren’t all the rooms like a sauna?",
                    "score": 3,
                    "author": "FlySea6175",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had a first floor single in Storrs that faced like northeast, it didn't get too hot in there cause the sun didn't shine in as much. I lived in a suite on the seventh floor of Staley too, it faced due west and got so much sun in the afternoon, it got really hot up there.",
                            "score": 6,
                            "author": "scanlonsc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey neighbor, I live in 8th flr of Staley rn. For taller buildings in SRV, it's actually funny that the direction matters great hack a lot. My room is facing north, and I can totally deal with the heat by keeping the fan running and door/window open. I also lived in 4th flr of Tyler before. I think there are definitely problems with the building itself that it's unreasonablly hot in the summer and freezing in winter...",
                                    "score": 6,
                                    "author": "aenrikchan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Staley is definitely a...fun place to live haha, but the layout of the suites is nice and I loved having the kitchen. I'm long gone so I'll say I lived in 720C, it got very hot in there when the sun was setting. The 20 side C and D rooms have the best view [https://imgur.com/a/7GGHNoC](https://imgur.com/a/7GGHNoC)",
                                            "score": 3,
                                            "author": "scanlonsc"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "very true lmao",
                            "score": 1,
                            "author": "aenrikchan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Currently live in Clarke. Don’t do it. I’m pretty sure I have mold in my vents",
            "score": 4,
            "author": "OddWafer7"
        },
        {
            "level": 0,
            "comment": "Hey guys I'm looking for a roommate preferably vegetarian/vegan girl.",
            "score": -1,
            "author": "Asleep_Committee_648"
        }
    ]
}