{
    "id": "i4udb9",
    "score": 101,
    "title": "Does Case think literally everyone that goes there can literally just drive there in a couple of hours?",
    "author": "ryanmadden09",
    "date": 1596729495.0,
    "url": "https://www.reddit.com/r/cwru/comments/i4udb9",
    "media_urls": [],
    "other_urls": [],
    "postText": "They completely subvert their entire fall semester plans 6 days before move in starts completely out of thin air, fucking over both people who are forced to fly and who store their belongings in cleveland over the summer, forcing them to either fly out anyway or pay for months more of storage fees.  I forgave this level of oversight at the very beginning with their ridiculously fast move out requirements but we are almost a half a year in at this point and it's like these decisions and being made by a legion of brain dead troglodytes.",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 18,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Details are expected Monday. We've got 27 hours, so feel your pain!",
                    "score": 7,
                    "author": "Centauri2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah. Forgot that some have to quarantine. Not sure about that situation.",
                                    "score": 3,
                                    "author": "Centauri2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Seems admin did too.",
                                            "score": 6,
                                            "author": "Steamships"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just hope if the announcement that the entire student body must go remote comes out, that it comes out soon. I really do not want to move back onto campus housing and then be forced to leave a month in. Hoping for a little more notice than that of today’s announcement",
            "score": 17,
            "author": "SeanTwomey",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I'm getting really worried... My landlord gave me until August 1 to decide if I want to renew my lease (ends Aug 30) because I'm supposed to be moving into the Triangle. It's too late now to renew, and I don't have the option of \"living with an aunt or something\" for awhile, like an actual Case administration person literally fucking said to me. I'm still set to move in as of right now but this level of anxiety that they're forcing upon so many students rn is nothing short of cruel.",
                    "score": 6,
                    "author": "doctorelisheva98",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is literally their response plan to kicking people off with no heads up.  This college is either run by idiots or sociopaths or both.",
                            "score": 2,
                            "author": "ryanmadden09"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a CWRU faculty member, I really share everyone's anger and concern here.  To give you a sense of the madness from the faculty perspective, literally 16 hours before this announcement, the administrative was still pressuring faculty to teach in person.  Then the 100 percent turnaround.  Anyone on the faculty with any common sense is planning to teach remotely.  They know that there is no predicting the behavior of the administration.  One day there will be an out-of-the-blue announcement like this one that says everything is fully remote and not to come to campus.  I am almost sure of it.  What happens to the students who signed a one-year lease to an apartment in university circle?  That person is now living in Cleveland and taking classes remotely at much higher expense.  If I were in a student's shoes, no way would I risk coming back.",
                    "score": 6,
                    "author": "CWRUfaculty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for sharing your perspective! So many students are rapidly signing leases right now, as a senior I’m hoping to remain in village housing and not have to pay for a lease. But if that goes under (which based on what everyone seems to be speculating it will) I’ll probably end up signing a lease and commuting around to have some sort of college experience. But I totally agree, if I was a non senior or non freshman I would probably just stay home and save on the rent.",
                            "score": 1,
                            "author": "SeanTwomey"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Today's decision is the ultimate proof that CWRU doesn't give a goddamned fuck about any of its students.",
            "score": 34,
            "author": "tkrandomness",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait so you're telling me you guys AREN'T happy about the money we're getting from hosting a presidential debate in the middle of a pandemic going directly to Bon Appétit to pay the operating costs of their hippie market with prices that would make Whole Foods blush which you won't even be able to fucking use bc we're kicking you all off campus except for freshmen bc even though all their classes are large and will be remote anyway we need a way to not encourage them to transfer, except for lowering their tuition costs that is out of the question bc reasons.\n\n-Barbara Snyder probably",
                    "score": 35,
                    "author": "ryanmadden09",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 21,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay so they are willing to lose money to suck their own dick and give themselves nationally televised clout but suddenly turn into greedy little misers when it comes to housing/tuition refunds when they force us off campus and give us piss poor education at a premium price.\n\nThis school is run by cunts, my point still stands",
                                    "score": 11,
                                    "author": "ryanmadden09"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah man fucking Case not letting us live in cramped close quarters during a pandemic that spreads rapidly - damn why they gotta be so irresponsible with our health and safety \n\nBut nah, fo' real: it is frustrating that they keep drastically changing the plans on us, causing a lot of difficulties for the many students with a wide variety of other concerns",
                    "score": 29,
                    "author": "TheFrumiousWoodDrake",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like the sentiment is appreciative, but frustrating that they couldn't have done this at least 2+ weeks ago",
                            "score": 18,
                            "author": "DerpyMcYerp"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Case is balancing the desires of their students with the virus concerns, and doing well IMO. Closing the school entirely would be a failure - most students *want* to attend in person. They are doing their best to balance things.",
                    "score": 3,
                    "author": "Centauri2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -19,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People our age are low risk, but there are also plenty that are higher risk, including people with common conditions like diabetes and asthma. Plus, if you're asymptomatic, serious lingering conditions can impact your respiratory system, according to research",
                                    "score": 16,
                                    "author": "DerpyMcYerp",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -15,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Key differences:  \nInfluenza has around 30,000 deaths annually. It has a vaccine. \n\nPneumonia has around 50,000 deaths annually. It has a vaccine.\n\nCOVID has around 130,000 deaths this year, plus pneumonia related deaths are almost double than previous years. Don't trivialize the health of those around us. One of my best friends since freshman year is diabetic. My ex-gf has asthma. And you're telling me that I shouldn't be concerned for their well-being? Look at the COVID curve in Ohio. It spiked in April, peaking at about 1300 per day. Now, it's been an average of 1300 cases a day for the last week, following a prolonged dip in June. \n\nAs for long term conditions, it's rare, but possible. A 27 y/o baseball player got an inflamed heart from COVID, and that will probably affect his health in different ways down the line. Yes, the inflamed heart can be treated. But longer term health conditions affect your well being in the future. It's like smoking cigarettes. Even if you quit in 2 years, it still affects you down the line. \n\nDon't trivialize health.",
                                                    "score": 18,
                                                    "author": "DerpyMcYerp",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "THANK YOU. I am sick of the flu comparisons. This is not the flu. I know two seventeen year olds suffering from COVID-19 right now. Just because you are young does not make you invincible. Hell, the governor of Ohio himself has COVID-19. I don’t know why people can’t take this pandemic seriously.",
                                                            "score": 16,
                                                            "author": "BornIntoThePast"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": -10,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "https://twitter.com/cuyahogacounty/status/1289279271261765632?s=10\n\nYou can’t always put 100% trust in data. Especially with false negatives in testing and underreporting. Go ahead. Live in denial. Coronavirus is not the flu.",
                                                                    "score": 6,
                                                                    "author": "BornIntoThePast"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "God you’re an idiot. The difference between the flu and this is 1)the OVERALL death rate in corona is much higher, there is no vaccine for corona yet and there is no treatment for this",
                                                                    "score": 1,
                                                                    "author": "LArocketMan"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The curve doesn’t seem very flat to me. I like in Cuyahoga county and cases here have been skyrocketing.",
                                                    "score": 7,
                                                    "author": "BornIntoThePast",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 0,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Great chart, bud.  Did you notice the part saying it doesn’t include the city of Cleveland? Fat lot of good that does. You can find a chart to help you believe whatever you want to believe. I’m not going to sit here and fight you. The numbers are high. People are at risk. Evidently, you do not see the importance of protecting the general public’s health.  I’m sorry for those around you.",
                                                                    "score": 8,
                                                                    "author": "BornIntoThePast",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": -2,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "As I said before, I don’t feel like playing graph tag with you. Regardless of what statistics I find suggesting otherwise, I will never change your mind. The problem with data is that you often can find it presented in a way that fits in with what you want to hear and diminishes the value of the people behind the numbers.     If you’d lost someone close to you from coronavirus, perhaps you’d think differently. While I’m upset CWRU waited so long, I’m glad that they are finally taking action. Most students don’t need to be on campus this semester point blank.  Those with extenuating circumstances should definitely be allowed to return, but pretending things are safe as can be in Cuyahoga County is moronic. Have a good day.",
                                                                                    "score": 6,
                                                                                    "author": "BornIntoThePast"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Individuals who need to be back on campus for severe health, safety, or financial reasons should be allowed to return. NO ONE ELSE SHOULD BE ALLOWED TO RETURN. The pandemic is still a very serious threat and should be treated as such.  I’m sick of seeing people pretending that coronavirus is just like the flu. It’s not. And Cuyahoga County specifically is a very bad place to be right now.",
                                    "score": 6,
                                    "author": "BornIntoThePast"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Remember, you are a paycheck not a person to them",
            "score": 6,
            "author": "Bl00dyDruid"
        },
        {
            "level": 0,
            "comment": "I am an incoming freshman and have decided to go 100% remote for the fall semester after the recent announcement on dorm arrangement and email from professors that they have changed the classes to only on-line. Do I have to notify the registry office for not coming to campus? Can't find the link to cancel my housing contract either? Really frustrated.",
            "score": 4,
            "author": "curiousdental"
        },
        {
            "level": 0,
            "comment": "As a faculty member let me say I’m very sorry for the way this has been handled and the chaos and uncertainty it has caused. The conversation among faculty both here and nationwide has been strongly in favor of all remote for the fall to keep people safer and to ensure that the semester is not disrupted like the spring. Our input has only been sought by executives here on pedagogical matters related to different modes of teaching, not on the overall plan. I think there has also been a lack of appreciation that any change to the plan creates complex problems for students, especially when done at the last minute.\n\nThat said, there is another side to the story, which is that even though CWRU has a decent endowment our ongoing operations are heavily dependent on tuition and housing revenue being stable. We can only offset declines by drawing down on the endowment or borrowing to a limited degree. Having housing half-occupied will create big financial issues. Faculty and professional staff have already taken a 10% pay cut and that’s not going to be enough. More cuts are going to be needed. That’s bad because universities are harder to rebuild than, say, private companies. Given that this is a temporary crisis there is are strong arguments that higher ed should get a federal bailout to maintain operations until the pandemic is over. But as we’ve seen Congress can’t even pass extended unemployment so people don’t go hungry. The needle the administration is trying to thread is extremely difficult.",
            "score": 3,
            "author": "ThirstyVeblen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow a 10% percent pay cut y'all are really taking a hit here",
                    "score": 3,
                    "author": "ryanmadden09",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s coming out of retirement contributions, which on the one hand means we won’t feel it in paychecks but it’s also not taxed so the eventual hit will be bigger.",
                            "score": 3,
                            "author": "ThirstyVeblen"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Agreed. This is America!!! :)  :c",
            "score": -3,
            "author": "journeycomp"
        }
    ]
}