{
    "id": "s7chig",
    "score": 56,
    "title": "CWRU is denying remote attendance for disabled students",
    "author": "DeditusOceano",
    "date": 1642551949.0,
    "url": "https://www.reddit.com/r/cwru/comments/s7chig",
    "media_urls": [
        "https://www.reddit.com/r/cwru/comments/s7chig/cwru_is_denying_remote_attendance_for_disabled/"
    ],
    "other_urls": [
        "https://chng.it/9bCGXvBS)"
    ],
    "postText": "[Petition to make them change their minds](https://chng.it/9bCGXvBS)\n\nCase Western’s administration is denying immunocompromised and otherwise disabled undergraduate students’ requests for remote learning as an accommodation. Disability Resources is saying that if you are immunocompromised, then your condition is affected by the pandemic and therefore is no longer considered a disability, and that it is not a justifiable accommodation for any other disability. They also said that remote learning fundamentally alters the quality of the education, at the same time that they are fighting a lawsuit for refunds for Spring 2020 tuition by arguing that educational quality was not altered. When presented with a 2017 ruling by the Department of Education that remote learning was not an unreasonable accommodation, Disability Resources said “it’s not unjustifiable to ask. But we have to consider a lot of other things.” Disability Resources is also ignoring input from professors about the feasibility of hybrid classes, telling professors they don’t have the authority to grant remote attendance and then telling students that the office can’t grant remote attendance because they need professors’ permission. Professors are also reporting having their job security threatened by the administration when attempting to offer remote attendance. When the deans were contacted by department chairs, the deans refused to respond. When the deans were contacted by students, they said the decision isn’t up to them it’s up to disability resources. Who again said it wasn’t up to them.\n\nThis is unethical and illegal, but any legal struggle is going to take months to resolve. And the provost is calling us all back to campus on Monday. Not only is this going to endanger the lives of at risk students, it’s going to endanger the broader community because immunocompromised individuals can be more virulent carriers. Please take two minutes to sign this petition, and if you want, share it too.\n\nCase Western students have a right not to die. We have a right to receive an education. And we have a right not to be forced to choose between the two.",
    "comments": [
        {
            "level": 0,
            "comment": "Do you know if the Observer has covered this? If not, maybe reach out to them and see if they're interested.",
            "score": 27,
            "author": "Dramatic_Pirate_2924",
            "replies": [
                {
                    "level": 1,
                    "comment": "My opinion piece is gonna be in next week’s issue but they don’t allow writers to plug petitions",
                    "score": 16,
                    "author": "DeditusOceano",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you considered reaching out to the Scene or other Cleveland/NEO papers? This is disturbing and absurd. My former employer did something similar and we found that the only effective tool was external publicity",
                            "score": 9,
                            "author": "AstronomerImaginary",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have not but that is a really good idea! Thank you!",
                                    "score": 6,
                                    "author": "DeditusOceano",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It might also be worth it to reach out to local TV stations (in particular I'm thinking of WOIO aka Cleveland19)",
                                            "score": 5,
                                            "author": "salEducation"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Observer news writer here, if someone's already writing an opinion piece on this it may be redundant but I could definitely talk to my editor about it",
                    "score": 7,
                    "author": "CorruptedGems"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you please inbox me your Instagram? I want to work with y’all on this. Not just for this once but long term solutions. Would be really happy to schedule a call or meet in person to talk about this!",
            "score": 4,
            "author": "BabyRisin"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -10,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wait, so you DON'T want to be on campus? \n\nWhat are you paying all this money for?",
            "score": -1,
            "author": "Mund-Kiefer-Gesicht",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh gee I don’t know. Maybe the ability to get a degree without dying?",
                    "score": 6,
                    "author": "DeditusOceano",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you're uncomfortable being on a campus, why not apply for a leave of absence for a year? You can pick back up where you left off.",
                            "score": -2,
                            "author": "Mund-Kiefer-Gesicht",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because I have a right to be getting an education at this school just the same as any other student. Why are you so eager to exclude disabled people?",
                                    "score": 6,
                                    "author": "DeditusOceano",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My last comment was providing a suggestion - you don't want to be on campus, so a leave of absence is a way to avoid campus for a bit.\n\nFrom Case's perspective, they probably want to promote in-person activities to attract future students and they want to avoid professors' headaches about having to accommodate virtual teaching in addition to their regular teaching. They want the status-quo. They want a steady stream of incoming students and they want to retain faculty.\n\nPrivate institutions do what they want, and it's usually for money. But good luck with your appeal.",
                                            "score": -1,
                                            "author": "Mund-Kiefer-Gesicht"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why don't you just get vaccinated?",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am vaccinated lmao",
                    "score": 3,
                    "author": "DeditusOceano",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then why are you scared of dying? Do you think the vaccines don't work?",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you not understand what immunocompromised means?",
                                    "score": 3,
                                    "author": "DeditusOceano",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are you an anti-vaxxer? You sound like an anti-vaxxer.",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I noticed your deleted comment asking if my disability was “obtuseness.” But you’re calling a vaxxed person an antivaxxer because I’m immunocompromised. Since you seem too obtuse to understand how to use Google, I’ll make it easier for you “What does it actually mean to be immunocompromised? \nSimply put, it’s when your immune system isn’t working as well as it should to protect you from infection—or that your immune system can’t distinguish between normal and foreign cells. Seen through a COVID-19 lens, about 3% of the population in the United States is considered moderately-to-severely immunocompromised, making them more at risk for serious illness if they contract COVID-19, even after vaccination. This is because their immune systems don’t mount a strong response to the vaccines. A March 2021 study showed only about 56% of immunocompromised people built sufficient levels of protection against COVID-19 after a second mRNA (Pfizer or Moderna) dose.” There ya go, did your homework for you\n\nEdit: That’s straight from Yale’s School of Medicine btw",
                                                    "score": 2,
                                                    "author": "DeditusOceano",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So you're an anti-vaxxer then? Figured. We're done with accommodating your science denying.",
                                                            "score": -1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ah yes. The famous anti-science Yale School of Medicine, home to people who MUST be anti science for saying people aren’t immortal if they’ve been vaccinated. Call yourself brainless and ableist without calling yourself brainless and ableist",
                                                                    "score": 3,
                                                                    "author": "DeditusOceano",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Looks like the anti-vaxxer is lashing out. Have fun staying home forever hiding from the vaccine. We science believers will be outside living life and not dying.",
                                                                            "score": 0,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dude, the quote here literally says:\n\n&gt;making them more at risk for serious illness if they contract COVID-19, **even after vaccination.**\n\nIt is pretty nonsensical for you to label people as anti-vaxxer when they are vaccinated and have a legitimate concern of COVID-19 after vaccination.",
                                                                    "score": 1,
                                                                    "author": "choHZ",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "So they don't trust the science that the vaccine works. They're an anti-vaxxer. \n\nAre you one too? Cause if so... ew.",
                                                                            "score": 1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "**The vaccine works !=  there's no risk after getting vaccinated.** It is pretty absurd that I have to explain to a college educated person that the world — especially the science — is not binary.\n\nTake COVID vaccine for example. 3 months after booster the vaccine effectiveness against omicron hospitalization is 80-ish%. And we don't know if it will last well, cause 25+ weeks after the second shot the same VE is only 50-ish%.\n\nConsidered this VE will likely be lower for the immunocompromised population, and their symptom after getting infected is more severe. It seems reasonable for them to express worries and concerns.",
                                                                                    "score": 1,
                                                                                    "author": "choHZ",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}