{
    "id": "u0j87o",
    "score": 98,
    "title": "Am I the only one who hates how critical people are of Case?",
    "author": "casewesternreserve",
    "date": 1649602438.0,
    "url": "https://www.reddit.com/r/cwru/comments/u0j87o",
    "media_urls": [],
    "other_urls": [],
    "postText": "Like I understand, Cleveland doesn't have as many things to do as [insert whatever metropolitan area you’re from], but no one argued that it did. You did your research when you chose to come to school in *shudder* Cleveland.\n\n\nWhy does it feel like no one here even gives this school/city a chance? It's like we have anti-school spirit. I've talked to my friends attending other schools, and sure they shit on their unis occasionally, but not nearly to the extent we do. Students here are so happy to tell you how much they hate the place, it's almost their entire personality. But if you ask them, they struggle to say anything beyond a couple tired statements (nothing to do here, food sucks). \n\n\nIt's honestly kind of strange. I'm from a *very* metropolitan area relative to Cleveland and have found it fairly easy to adjust to this place. The school and the city have their issues, that is undeniable, but it's not bad by any means. The education is solid, research opportunities are plentiful, food is pretty good if you use swipes, and housing is comparable to universities we compete with. University Circle has a shit-ton of stuff to explore. And once you go outside of the bubble of U.C., there's so much more. I feel like so many people are locked in the headspace of hating the school/city, they won't even try to open up to what it has to offer. If you're a STEM student especially, Case/Cleveland has everything you need to succeed.\n\n\nI feel like part of it is because Case was a lot of people's \"target\" school when they failed to get into their reaches. I've talked to a lot of students here who feel like they made a compromise to attend this place. \"If X happened / didn't happen, I could've been at [T20] rn.\" \n\n\nIt's unfortunate. As someone who actually likes this place, the constant negativity in conversations/social media can get irritating. CWRU doesn't deserve all the bashing.",
    "comments": [
        {
            "level": 0,
            "comment": "The unofficial hobby at Case that everyone does is complain about:\n\n* The weather\n* Cleveland\n* The food \n* SAGES, gen ed,\n* That hard class you enrolled in\n* The lack of things to do\n* How they shot for the stars (ivy and related schools) and landed on the moon (CWRU)\n\n  \n\nWe just love to complain.",
            "score": 31,
            "author": "personAAA",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For dining halls that cook fresh everyday and have to feed that many people plus catering, the food is good. \n\nI mean the food is what like fast casual quality food. That is way better food than industrial grade food.",
                            "score": 13,
                            "author": "personAAA"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I also find this really annoying. I feel like all my friends are constantly hating on the school saying how they're embarrassed to be here or how they got waitlisted at xyz school. I was talking with a bunch of spring admits this semester, and all of them were saying how they were gonna try and transfer literally before classes had even started. Sure, Case isn't the best school in the world, but it's still a privilege to be here at all. Like if you hate the school so much, why did you choose to come here? Obviously there are people who dislike the school and transfer because it's not the right fit for them, and that's understandable. But I definitely agree that we have an anti-school spirit here overall.",
            "score": 41,
            "author": "staycoolioyo"
        },
        {
            "level": 0,
            "comment": "CWRU is a good school in a good location and I'm glad I'm here. I feel like there are things to be justifiably critical of the school for such as never offering enough USNA courses and the whole housing fiasco earlier in the semester so I don't begrudge anyone for being critical of the uni.\n\nHowever, being critical is not the same as hating and bashing the school and I do often interact with people who hate it here because they feel they belong somewhere better and that attitude does get tiresome very, very quickly.\n\nI think it doesn't help that there is very little to actual be spirited about at CWRU. Sports aren't a big part of the culture and we have about 0 name recognition outside the region, so there really aren't ever any of the things that drive school spirit and positive conversation about the place that exist at other schools.",
            "score": 10,
            "author": "salEducation",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"0 name recognition?\" As a CS, you've heard about the guy named Don Knuth, right? 😀",
                    "score": 7,
                    "author": "nashvilleNash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gotta say that, at least in the realm of CS, having some strong alumni does not provide much boost on name recognition. Like do the general CS students know where did LeCun, Hinton, Bengio, or anyone of the CLRS graduate? At least I mostly don't.   \nI do know where most of them work right now, and that does help with name recognition. But unfortunately, we don't have that caliber of faculty at Case CS yet — though this is kind of the norm of top 40-ish non-public schools anyway.\n\n  \n*(Don't get me wrong, I love Case, and I think our CS program is pretty decent with many wonderful profs. Given the small student body, I think the education experience at Case is likely to be better than many comparable alternatives; yet many students take it for granted.)*",
                            "score": 4,
                            "author": "choHZ"
                        },
                        {
                            "level": 2,
                            "comment": "Okay, I concede that CWRU has one crumb of name recognition because Knuth went to case for undergrad :P",
                            "score": 2,
                            "author": "salEducation"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People who talk about college admissions on Reddit are also more likely to be vocal about this viewpoint. I went to Case from a more \"desirable\" area but tried not to hang around people with such a negative viewpoint. I met friends, had fun, explored the city, and ended up with a great job that I enjoy. No regrets.",
            "score": 24,
            "author": "thewildrose"
        },
        {
            "level": 0,
            "comment": "It's because a lot of people look at Case as their Backup Ivy school. It's all about perspective, and you have a good one.",
            "score": 19,
            "author": "nprnpbr"
        },
        {
            "level": 0,
            "comment": "Truly and honestly, most of my beef with the school is the crap that admin has continuously pulled since I've been here. The BME department is also atrocious (and I think many upperclassmen BMEs would agree).\n\nOverall though, the trash talking I do with friends (aside from genuine complaints) is largely just entertainment/bonding lol. I don't think any of us actually hate it here.",
            "score": 6,
            "author": "2point0Katt"
        },
        {
            "level": 0,
            "comment": "For me it's more about the administration. I was a student starting ~20 years ago and then I worked for the university for a number of years. The insurance was good but they were total cheapskates when it came to staff raises and promotions. And they had no qualms about going way over budget on ridiculous projects like the Peter B. Lewis building, but they would rarely construct things that would benefit students or Cleveland like a bridge over Euclid Ave.",
            "score": 14,
            "author": "Deconceptualist",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly, kind of glad that those plans fell through. Any kind of bridge over Euclid would be ridiculously out-of-place for the entire area and just a really bad eyesore. Beyond that, it would only ever be a temporary solution. The only way Euclid will stop being a wall that cuts through campus is if the city somehow gets the state to cut it down to 2 lanes from 4, with real protected bike lanes and a sheltered median like outside Thwing, as well as a reduced speed limit or one that's actually enforced to the current 25 mph. \n\nCleveland also seems to be pivoting towards better pedestrian/bike/public transportation infrastructure (there's now a big push to redevelop around the lake), and the whole University Circle corridor is super important to the city. So who knows, maybe in a pie in the sky future, the stretch of Euclid that runs through Case/Uptown will be [closed off and pedestrianized](https://c8.alamy.com/comp/2A13KNN/tram-passing-through-the-pedestrian-zone-in-frechen-near-cologne-nrw-germany-2A13KNN.jpg), but doubtful.",
                            "score": 3,
                            "author": "Laptop_Looking",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "On this we'll have to agree to disagree, but the area in and around Case has probably the highest number of pedestrian, cyclist, and public transportation traffic in the entire city, [likely far more than the car traffic.](https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Passenger_Capacity_of_different_Transport_Modes.png/400px-Passenger_Capacity_of_different_Transport_Modes.png) So, the fact that a massive piece of car infrastructure, which is actively hostile, dangerous, and space inefficient to the other modes of transportation, exists in that area is a disgrace. Also the Euclid ave that we know today came way after Western Reserve/Case existed, so in that way it's Euclid that came along later and divided the area. \n\nRight now, Euclid is pretty much wasted space to anyone who's not in a car. Making Euclid far less of a barrier, where pedestrians have only like 3 kind of safe areas to cross, would unite the two sides of campus much more. I agree that the BRT and lane reduction was a  good change, but more needs to be done in the future. Theoretically, the state can reach an agreement with the government to reroute U.S. highways, but there's a moratorium and they would likely have to repay some of the funding they got back in the 50s/60s. A re-route and closing is definitely possible, especially with the [recent construction of the opportunity corridor.](https://www.google.com/maps/place/Opportunity+Corridor+Rd,+Cleveland,+OH/data=!4m2!3m1!1s0x8830fb76eb53b9d5:0x2eb93d1deffbc668?sa=X&amp;ved=2ahUKEwjHiu_X5Yz3AhXkdc0KHUxhB88Q8gF6BAhYEAE)\n\nThe larger problem is that a reduction/closing of Euclid is a drop in the bucket of Cleveland infrastructure problems, with multiple freeways in I-490, 71, and 77 cutting downtown off, and I-90/shoreway cutting the city off from the lake. It's also a drop in the ocean of the changes that need to be made to U.S. infrastructure, but any progress is good progress.",
                                            "score": 2,
                                            "author": "Laptop_Looking",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "u/profanitycounter",
                                                    "score": 1,
                                                    "author": "Schmedly87",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "UH OH! Someone has been using stinky language and u/Schmedly87 decided to check u/Laptop_Looking's bad word usage.\n\nI have gone back 1000 comments and reviewed their potty language usage.\n\n|Bad Word|Quantity|\n:--|:-:|\n|ass|3\n|asshole|4\n|bastard|2\n|bullshit|2\n|crap|1\n|damn|2\n|dick|1\n|fucking|2\n|fuck|1\n|go to hell|1\n|hell|18\n|pissed|2\n|re**rded|1\n|shitty|1\n|shit|7\n|wank|3\n\n^(Request time: 12.3. I am a bot that performs automatic profanity reports.)^( This is profanitycounter version 3. Please consider )^([buying my creator a coffee.](https://www.buymeacoffee.com/Aidgigi))^( We also have a new )^([Discord server](https://discord.gg/7rHFBn4zmX))^(, come hang out!)",
                                                            "score": 1,
                                                            "author": "profanitycounter"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "UH OH! Someone has been using stinky language and u/Laptop_Looking decided to check u/Schmedly87's bad word usage.\n\nI have gone back 997 comments and reviewed their potty language usage.\n\n|Bad Word|Quantity|\n:--|:-:|\n|ass|5\n|bastard|1\n|booty|2\n|crap|3\n|damn|5\n|fucking|4\n|fuck|7\n|go to hell|1\n|hell|13\n|heck|2\n|lmao|2\n|piss|1\n|porn|1\n|shit|8\n\n^(Request time: 12.7. I am a bot that performs automatic profanity reports.)^( This is profanitycounter version 3. Please consider )^([buying my creator a coffee.](https://www.buymeacoffee.com/Aidgigi))^( We also have a new )^([Discord server](https://discord.gg/7rHFBn4zmX))^(, come hang out!)",
                                                                    "score": 1,
                                                                    "author": "profanitycounter"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The dental school is very much like this. People tend to apply to Case just for the hell of it when they think they have a shot at securing an acceptance, because when applying you're taught to apply all over and hope that some school accepts you, but they don't even give Case the slightest consideration as long as they get into an Ivy league or their state school. With the dental school tuition does have a lot to do with it though, since dental school at anywhere is so busy it's not like undergrad where you have time to enjoy this and that outside of school, there's really no use in considering much else besides money. And since an accreditation board governs what dental schools across the country are to teach you, there's really nothing Case's dental school gives you that justifies such a huge price difference compared to a state school.",
            "score": 5,
            "author": "cwrudent"
        },
        {
            "level": 0,
            "comment": "I think people just like to complain to relieve stress (but don’t hate the school). The people who genuinely hate the school transfer out.\n\nCase is definitely not a bad school, just depends on what you do to get the most out of it.",
            "score": 5,
            "author": "sikoyo"
        },
        {
            "level": 0,
            "comment": "I think it might have something to do with Case not requiring any essay on common app (at least for a couple years back, don't know if this is still the case right now). So a lot of students just apply to Case casually without having much research &amp; mental commitments done.\n\nCase is a great school. It is kind of hard to find another university with small student size + strong STEM school image among Case's range. Many \"haters\" take it for granted.",
            "score": 3,
            "author": "choHZ",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd also say the small/medium STEM school in an urban area, like Case, can be a bit hard to find and strikes a really good balance. The issue will always be that most students don't take full advantage of the resources of living in a city because they don't go beyond the radius of Cleveland Clinic or Dave's in Cleveland Heights.",
                    "score": 4,
                    "author": "Laptop_Looking",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;The issue will always be that most students don't take full advantage of the resources of living in a city because they don't go beyond the radius of Cleveland Clinic or Dave's in Cleveland Heights.\n\n\\+1 on both. Honestly I think the food of Cleveland is pretty decent, though access can be a bit tricky without a car.",
                            "score": 4,
                            "author": "choHZ"
                        }
                    ]
                }
            ]
        }
    ]
}