{
    "id": "npu31n",
    "score": 2,
    "title": "Practical Nursing September 2021",
    "author": "Cduong94",
    "date": 1622554190.0,
    "url": "https://www.reddit.com/r/durhamcollege/comments/npu31n",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi!\n\nI'm entering into my first year at Durham College for their Practical Nursing Program (Regular). I'm super excited and nervous at the same time. I don't know what to expect from the program LOL. I'm not sure if there are things I need to do in order to prepare myself?\n\nI do have some questions about the program itself and tips/ advise to be passed down to a future Nursing student. I know that the program does offer Math for Nursing, and I was wondering if  the professors prefer students to solve dosage calculations without a calculator? In addition, what kind of shoes are we expected to purchase for the Clinical placements?\n\nIn terms of tips, what advice would you give to a first year Nursing student?\n\nI would appreciate it a lot!",
    "comments": [
        {
            "level": 0,
            "comment": "Hello! Fellow September 2021 nursing student here :) honestly all your questions will be answered at our orientation! I’ve tried asking so many questions to online staff chat or even came to Reddit to answer some questions and haven’t gotten a lot! I’m always told orientation will help answer questions. \nSo far this is what I know:\nYou can purchase any scrubs just have to be in the colour Hunter Green\nWe have placement every semester- starts with retirement homes then progresses into hospitals. Your fifth semester you get to choose where your placement is.\nNot too sure about the calculator question but I know we have a specific nursing math class that they may answer that question in the class!",
            "score": 1,
            "author": "Aliciamcg13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey Alicia, I appreciate you getting back to me in terms of what to expect for the clinical placements. Let’s hope all of our questions can be answered on Orientation, which I’m looking forward to. Plus meeting the rest of our Nursing cohort! :)",
                    "score": 1,
                    "author": "Cduong94",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you living on residence or commuting??",
                            "score": 1,
                            "author": "Aliciamcg13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m commuting to school this September",
                                    "score": 1,
                                    "author": "Cduong94",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can’t wait to meet you!! Hopefully we will find out everything with orientation; my name is Alicia by the way :)",
                                            "score": 1,
                                            "author": "Aliciamcg13",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A pleasure to meet you, I’m Cynthia",
                                                    "score": 1,
                                                    "author": "Cduong94"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Third semester student here!\n\nYou are absolutely allowed to use a calculator for math! For math and in the lab. \nThey prefer you to wear all white, black or brown non-slip shoes that can be wiped down. \n\nIn terms of tips just don’t get behind! Breath. Believe in yourself. Best of luck and if you have any more questions please ask!:)",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would you recommend using transfer credits and PLAR. How would this affect opportunities for bridging program?",
                    "score": 1,
                    "author": "HopefulPAcan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "100% use them. The less course load you have the better. I’m not sure how it would affect you going into a bridging program. I’ve looked into the Ontario tech bridge program and it says the normal cut off is 86% average. So the more time you have available to study for courses, the better!",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}