{
    "id": "u7suz7",
    "score": 7,
    "title": "Working on getting things organized",
    "author": "EveryFkinNameIsTaken",
    "date": 1650448359.0,
    "url": "https://www.reddit.com/r/durhamcollege/comments/u7suz7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone,\n\nI've recently taken over as a mod with /r/durhamcollege. It looks like whoever ran it last set the posting to restricted and pretty much abandoned it. I've opened it back up for people to post again.\n\nI'm a former student that has a passion for higher education. As a side project, I would like to get this sub in better shape, with as many resources and links available to those coming here for answers.\n\nI'd just like to state that anything posted on behalf of moderators here does not represent Durham College or its stakeholders. I'm just a former student that wants to help others through their post-secondary journey.\n\nStay well, and congratulations to all of those who are completing the winter semester!",
    "comments": [
        {
            "level": 0,
            "comment": "Yup I abandoned it, nope I didn't set posting to restricted. That probably happened as a result of me un-modding myself without any other mods left behind.\n\nI took over this sub at a time when it was derelict and full of garbage, so I cleaned it up for the people coming into ask questions, but never had the time to do any community building as I'm already doing that full time at the college itself. With the stress of the pandemic this sub was one of the things I had to cut lose as an unfinished, albeit aimless, project. I would have made a post or something, but like the college, there is little to no organic community here.\n\nStoked to see a fresh face take it over to do something with it and hopefully inject some vibrance and energy.\n\nWishing you luck mod person!",
            "score": 3,
            "author": "schrodingersBox",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cool, thanks for that. Makes sense about the restricted posting, so I apologize for the speculation.\n\nI understand a time comes when you need to do what's best for you.\n\nI find the community between this sub, and OT, nearly non-existent in contrast to other Ontario Colleges and Unis. I've often wondered why.",
                    "score": 1,
                    "author": "EveryFkinNameIsTaken",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for understanding.\n\nThere is, in my opinion, a long list of contributing factors as to the lack of community. Pre-deep digital age there as *some* but still not much and it doesn't appear to be on track to improve.",
                            "score": 2,
                            "author": "schrodingersBox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Definitely, I've been involved in the campus since about 2008, but it seems the culture has changed quite a bit in the 5 or so years. The pandemic hasn't helped much either in terms of building a community around the college.\n\nHard to think some students just went the last 2 years to get a diploma without ever stepping foot on campus.",
                                    "score": 1,
                                    "author": "EveryFkinNameIsTaken"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}