{
    "id": "v5hv9p",
    "score": 1,
    "title": "Seat Deposit",
    "author": "Emergency_Pickle_822",
    "date": 1654449243.0,
    "url": "https://www.reddit.com/r/durhamcollege/comments/v5hv9p",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi there, I have recently paid my $500 deposit to hold my seat at Durham in my program (I’m an osap student). Just curious as to how long it takes the school to process the deposit so I can gain access to my actual school account. Do you get an email once the deposit has been received?",
    "comments": [
        {
            "level": 0,
            "comment": "I emailed them and they replied that they haven't started to send the instructions email yet.",
            "score": 2,
            "author": "IndependentRecover98",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh really? Jeez they’re super slow. I was at Niagara and Georgian college prior to this and they were always on the ball. I have all of my forms filled, just doing cpr in august and then I’ll be ready to upload it all to be cleared for school. I hate leaving things to the last second lol",
                    "score": 1,
                    "author": "Emergency_Pickle_822",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too. I have a vacation plan and after coming back, I will have literally few days left to start the classes.",
                            "score": 1,
                            "author": "IndependentRecover98",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah and there’s literally so much to have filled. The medical forms take 2 weeks in total to complete because you have to do a 2 step tb test (7-12 days in between each other) so that was a whole process and now 2 full days of cpr and I still have to do modules and upload those certificates like ugh. I want it all done so I can enjoy the rest of my summer before I’m back to stress city",
                                    "score": 2,
                                    "author": "Emergency_Pickle_822",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You have 3 months. It sounds like you're in a competitive program and I can imagine it would take time to process all of this data not only for you but likely 100+ others.  \n\n\nYou will get what you need in a timely fashion.",
                                            "score": 1,
                                            "author": "EveryFkinNameIsTaken",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I’m entering my first year of Dental Hygiene. I took dental assisting prior to this and my checklists were always out in May so I just wanted to check and see",
                                                    "score": 1,
                                                    "author": "Emergency_Pickle_822"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}