{
    "id": "xqitgo",
    "score": 3,
    "title": "Paralegal program starting Jan 2023",
    "author": "Shot-Journalist-371",
    "date": 1664386065.0,
    "url": "https://www.reddit.com/r/durhamcollege/comments/xqitgo",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just got excepted into the paralegal program starting Jan 2023, anyone have any experience with the paralegal program? and how is the Oshawa campus? and the people?\n\nAlso for anyone commuting from Brampton, do you drive or take transit?",
    "comments": [
        {
            "level": 0,
            "comment": "Accepted*",
            "score": 3,
            "author": "Ok_Recipe7031",
            "replies": [
                {
                    "level": 1,
                    "comment": "my bad🤦🏽‍♀️😂",
                    "score": 1,
                    "author": "Shot-Journalist-371"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i applied for practical nursing in january no offer yet.. i will be commuting from brampton, but the program is weekend only. so i'll be commuting only on weekend",
            "score": 2,
            "author": "pswdee"
        },
        {
            "level": 0,
            "comment": "This campus sucks compared to George brown waterfront lol or UofT  and York. In general, there’s nowhere to buy food here. Everything closes at 4pm so if you have a late class, good luck. Bring your own food. The Tim hortons is usually the self serve express mini booths. There’s one actual Tim hortons. Starbucks is extra expensive here. There’s booster juice too. The cafeteria has crappy food but it’s cheap. It closes at 4pm as well. The closest food place near the campus is around 10 min walk to the plaza near it. \n\nWashrooms are not the best. Study spaces are not the best either. They’re okay. Commuting from Brampton? That’s gonna be long. Rush hour is so bad if you’re driving. Bussing isn’t any better either, rush hour = good luck getting on a bus cause it’s always full. \n\nSorry, I’m just sharing what I’m experiencing in this campus so far. It’s a cute small campus. It’s the people that I like here. Making friends is probably the best thing I’ve experienced here other than the awesome professors.\n\nAnyway, good luck! Find someone to carpool with.",
            "score": 2,
            "author": "Tradition-Necessary",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for sharing, yeah I've been going to Ryerson the last few years so itll be a change for sure! im glad the people are good, itll be nice to make some new friends",
                    "score": 1,
                    "author": "Shot-Journalist-371"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been on the Oshawa campus for a month now, and made a lot of new friends. The food here (at least marketplace, starbucks and tims) have all been good, and theres tons of spots to hangout and study/relax. Most people are chill. Haven't had any issues with a group of people are the people on campus in general",
            "score": 1,
            "author": "fuckthetitanic",
            "replies": [
                {
                    "level": 1,
                    "comment": "thats good to know! thanks",
                    "score": 1,
                    "author": "Shot-Journalist-371"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The faculty has great full-time paralegal instructors - especially Dalton Burger, Kandace Wileman, Sandra Smith and Laurie Marshall. Drew Samuels is awesome too - he's part-time so it isn't guaranteed you'll have a class with him though. The program itself is pretty unique, with the opportunity to complete your field placement with the Access to Justice Hub as a big selling point. \n\nIf you participate in class and do the bare minimum - you can likely achieve honour roll. This is a bit of a sidenote but this program seems to attract lots of disruptive students as well as students with major competency issues - beyond a reasonable proportion. There's tons of group work so be prepared to pull your hair out a lot. Also, a lot of the assignments are repetitive so if you get the hang of one you should be fine with the others. The price of textbooks are steep for how often you use them. You really only need the physical copy if you're in a class with Laurie Marshall or Mary Aroukatos.\n\nThe Oshawa campus is okay, I wouldn't say it's anything remarkably special. It's a quiet campus and not a lot of activity extracurricular or club wise. **Be prepared to buy a parking permit as soon as registration opens** **or you will not get one, period.** \n\nOther than that, good luck! Feel free to DM me if you have any other questions.",
            "score": 1,
            "author": "ZealousidealBase7066",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is great ! Thanks for reply",
                    "score": 1,
                    "author": "Shot-Journalist-371"
                }
            ]
        }
    ]
}