{
    "id": "10lsc8a",
    "score": 7,
    "title": "Thinking of Majoring in Psychology here",
    "author": "success_is_a_mindset",
    "date": 1674741330.0,
    "url": "https://www.reddit.com/r/FAU/comments/10lsc8a",
    "media_urls": [],
    "other_urls": [],
    "postText": "35, M. I am entertaining the idea of going back to school and strongly considering going for psychology and ultimately getting into sports psychology so I can work with athletes. I am curious if this school has a good psych program and if it's worth it for the price? There are a couple other options in South Florida but this is the most local school to me. Any suggestions or advice is appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "Good or bad for psych and good neuroscience. There’s a lot of brain research. Most of it is geared to clinical and medical applications however. There are a lot of sociology type psych classes but all the good ones are medical, anatomy, clinical, and biologically heavy. Alumni with psych degree.",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok thank you.",
                    "score": 2,
                    "author": "success_is_a_mindset"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My advice is to come up with a different plan. The chance of getting a good sports psychology job is pretty small. Psychology is notorious for bad job outcomes. The same bad outcomes are evident in every country. You would get a much better return from a different major. At 35 you don't want to be wasting time.\n\nCheck out this long post which outlines what a bad choice Psychology typically is.\n\nhttps://www.reddit.com/r/australia/comments/10j41aj/psychology_is_probably_not_a_good_choice_of/",
            "score": 2,
            "author": "AnalyticalAardvark1"
        }
    ]
}