{
    "id": "117rgyt",
    "score": 7,
    "title": "What is a day (or week) at FAU like for a freshman",
    "author": "ariana61104",
    "date": 1676945066.0,
    "url": "https://www.reddit.com/r/FAU/comments/117rgyt",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I went to the event at the university today however, I am a first gen student and therefore I know nothing about how college works or what the hell you do there. I am going in the fall and will not be living on campus (if that adds anything to your response). Thank you",
    "comments": [
        {
            "level": 0,
            "comment": "It is like high school except instead of 6 classes a day it is like 10 classes a week.  In the unfathomable amount of new free time you'll have, you can attend clubs and work a job.  Some people party?",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Instead of having the same 6 classes everyday like in high school, you have different classes everyday . You have the choice to pick your schedule, your class times, and your professors. Here’s an example of my schedule:\n\nMonday: Class from 11:00-11:50. Another class from 1:00-1:50\nTuesday: Class from 12:30-1:50\nWednesday: Class from 9:30-10:50. Another class from 1:00-1:50\nThursday: Class from 10:00-11:50. Another class from 12:30-1:50\nFriday: Class from 9:30-10:50. Another class from 1:00-1:50.\n\nDuring my free time I’m either in the food court, dining hall, or in the library. I recommend joining clubs bc that is one of the best ways to meet new people. If you want, you can add me on Snapchat. My Snapchat is @jblakes03",
            "score": 5,
            "author": "Holiday-Material6504",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you! Yours along with all of these answers are so incredibly helpful!",
                    "score": 3,
                    "author": "ariana61104"
                }
            ]
        },
        {
            "level": 0,
            "comment": "thank you for everyone who has commented so far, and anyone who may comment after. I really appreciate all of this!!!",
            "score": 3,
            "author": "ariana61104"
        },
        {
            "level": 0,
            "comment": "here’s a day example, today wake up 9:30, exam at 10:30, class at 12:30, club at 2:00, dinner at 5, gym at 6, and the rest just relaxing/doing homework (which isn’t much if i time managed correctly)",
            "score": 2,
            "author": "Gloomy-Presence-6539"
        },
        {
            "level": 0,
            "comment": "Like Initial said, instead of having classes in one long 8 hour block such is the case in High School, you’ll generally have them more spread out throughout the week. How many classes you end up taking and when you’ll take them is really up to you - you can have classes on only 2 days a week, or maybe 1 every day of the week. It’s your choice as long as you register early.\n\nThere’s many clubs and organizations on campus that you can take part in to fill your newfound time with. Maybe join the CSC to get some community service done, or SG to have a voice in what gets done on campus, or a fraternity / sorority if that’s your thing (I personally could never do that, but more power to you if you choose to rush). There’s also many part-time jobs that you can take on campus, and the best part is they’ll work around your schedule. I’d recommend working the front desk at one of the housing buildings - it’s a fairly easy job and you get to interact with some cool people.\n\nAnd about housing - I know you said you’re not on campus but if you ever decide to go down that route - housing is extremely limited and in extremely high demand. In the off chance you do get housing, you’ll likely be assigned roommates (or you can pick them if you have someone in mind). For my summer semester I shared a room with 1 and my suite had 4 people (1 shared room and 2 singles). Make sure you reach out to your roommate and coordinate what you want to bring, because common household items are your responsibility now.",
            "score": 2,
            "author": "Ma02rc"
        },
        {
            "level": 0,
            "comment": "Essentially when you pick your classes, try to condense them into like a 2-3 day period. It helps with not having to wake up at the wee hours of the AM for a class, just keep on top of the date to submit for courses etc.",
            "score": 2,
            "author": "College_collegiate"
        },
        {
            "level": 0,
            "comment": "An example of my day would be waking up in the morning and going to class then going to the beach for a couple hours then i would get back workout and do homework. Hope that’s helpful!!",
            "score": 1,
            "author": "Intrepid_Bit5964"
        }
    ]
}