{
    "id": "7psox6",
    "score": 27,
    "title": "Caught this hit and run in the parking garage",
    "author": "b0op",
    "date": 1515716883.0,
    "url": "https://www.reddit.com/r/FAU/comments/7psox6",
    "media_urls": [
        "https://v.redd.it/l4dj80yj4j901"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "When she stopped in front of me, I politely told her that the garage was a one way and that she backed into the car. She seemed so shocked at both of the things I said. I told her she couldn't leave after hitting the car. She said, \"I would never do that! I'll leave a note.\" By the time she parked again there were maybe 5 cars behind me. I parked and went to check on her and the car she hit. **SHE LEFT AND THERE WAS NO NOTE!**\n\nSo I left a note on this person's car, but I was so upset that someone could drive away that I also called campus PD, showed the officer the footage and gave him the woman's license plate number (which I took note of as I passed her to park my car). ",
            "score": 15,
            "author": "b0op",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Are you J Walter Weatherman?](https://youtu.be/eNZsWIzEhP4)",
                    "score": 2,
                    "author": "palehorse864"
                },
                {
                    "level": 1,
                    "comment": "Good on you. That was painful to watch. Wonder if she was on something. ",
                    "score": 2,
                    "author": "abctuba21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think she was trying to pretend nothing happened and when I called her out on it she was ashamed to have been caught and acted like she didn’t know. But come on, how do you not know if you hit another car?! Even if it’s just a tap like that. No one will be angry with you for accidentally hitting the car- it’s called an accident for a reason. But she chose to leave without owning up to it and THAT’S shitty. ",
                            "score": 2,
                            "author": "b0op"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow what an idiot that lady is! Watching this entire thing was so cringey. You’re an awesome person though and if that my car that she hit, I know I would really appreciate everything you did plus that fact you got it all the dash cam. Some people at this school though... jeez",
                    "score": 1,
                    "author": "Jbaconnn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for saying that. I’m actually a bit worried nothing came of it because after talking to the officer, he told me he would go check out the car, but there was nothing he could really do if the person who was hit didn’t make a complaint. After class I came back to the garage to find that the car was still there, but my note was gone and the scratch looked like someone tried to rub it out. I really feel like the officer took my note because no one has contacted me about it. And I feel guilty that I didn’t leave another note right then :( \n",
                            "score": 2,
                            "author": "b0op"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just wanted to say I have the same dashcam and for the price, it's simply the best! ",
            "score": 2,
            "author": "DTFpanda",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is! The only problem I have with it is I've had to re-stick it to my windshield maybe three times (it's probably because of the South Florida heat). I'm on my last sticky thingy and I have to get my windshield replaced because a rock hit a sweet spot on I95. ",
                    "score": 2,
                    "author": "b0op",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What dashcam is it?",
                            "score": 1,
                            "author": "abdhjops",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[This one](https://www.amazon.com/gp/product/B01IEQUABA/ref=oh_aui_search_detailpage?ie=UTF8&amp;psc=1)",
                                    "score": 1,
                                    "author": "b0op"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A student too smh she had to be on drugs 💀",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}