{
    "id": "z4jtny",
    "score": 16,
    "title": "Hello Fellow Owls! It is me, Owlsley the Owl! Ask Me Anything!!! Hootie Hoot!",
    "author": "FAUOwlsley",
    "date": 1669399427.0,
    "url": "https://www.reddit.com/r/FAU/comments/z4jtny",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "What's the craziest party you've been to during your time at FAU, Owlsley!",
            "score": 4,
            "author": "Fantasiadreamcicle",
            "replies": [
                {
                    "level": 1,
                    "comment": "One time me and three friends from my math class went to Mizner park and walked around!!! Wow!!!",
                    "score": 16,
                    "author": "FAUOwlsley"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please tell me the story of your entire family Owlsley. Hootie hoot!",
            "score": 4,
            "author": "rekipsj",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was born in a hole, inside the earth.. I take to the skies despite my origin. My father was God himself. And my mother was nature. I have six brothers, and one sister. My sister's name is hoot. My brothers are all also named Owlsley and I had to defeat them to prove myself as True Owlsley.i drank their blood",
                    "score": 9,
                    "author": "FAUOwlsley",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see you in a far different light and with a greater respect than ever before. Hootie hoot indeed.",
                            "score": 3,
                            "author": "rekipsj"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this a party school?",
            "score": 3,
            "author": "Fantasiadreamcicle",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a party school if you have a good imagination! Hootie hoot!",
                    "score": 13,
                    "author": "FAUOwlsley"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How much do you make",
            "score": 2,
            "author": "FireBeard1501",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lane Kiffin used to pay me in mice, but now that he has left I just eat garbage outside the library, hootie hoot!",
                    "score": 8,
                    "author": "FAUOwlsley"
                }
            ]
        },
        {
            "level": 0,
            "comment": "where can people go to meet new people at this university?\n\nalso, what differentiates FAU from other universities?",
            "score": 2,
            "author": "erenwasjustified",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you have an in-person class, break the ice and ask your classmates what their names are. And introduce yourself. Should be much more easy once this first step is taken. Seems like a lot of the students at FAU are so afraid of this,  but everyone wants to be friends wants you get past that. Then invite to get grub at food court. \n\nThere should be some school clubs around if you dig a little bit- probably more difficult after 2020 though. See about a club for whatever your major is. Also check out the math learning center or the one writing center next to it, ask for help on assignments and you might make some new amigos probably. \n\nAnime is really popular now so you can probably find someone who will talk about attack on titan with you.",
                    "score": 3,
                    "author": "FAUOwlsley"
                },
                {
                    "level": 1,
                    "comment": "Fau is special because FAU has a pretty good business program and a petty good nursing program and is located in BEAUTIFUL BOCA RATON FLORIDA!!! And the mscot is ME  OWLSLEY",
                    "score": 2,
                    "author": "FAUOwlsley"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What kind of birds hang out at the top of east side of the football game on non-game days.\n\nThere are literally thousands of pits from some sort of berries littering the top few rows up there.\n\nAlso... please come find me and my daughter tomorrow in section 214 row K and give her a fluffy hug!",
            "score": 2,
            "author": "jaxpaboo"
        },
        {
            "level": 0,
            "comment": "Which resident building is your favorite?",
            "score": 2,
            "author": "Ma02rc",
            "replies": [
                {
                    "level": 1,
                    "comment": "Algonquin hall RIP in piece :(",
                    "score": 1,
                    "author": "FAUOwlsley"
                }
            ]
        }
    ]
}