{
    "id": "zszxp9",
    "score": 7,
    "title": "Will taking a year of community college out of state improve my admissions chances as opposed to straight out of high school?",
    "author": "Sam242424242424",
    "date": 1671750961.0,
    "url": "https://www.reddit.com/r/FAU/comments/zszxp9",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Yes it’s call dual enrollment. I don’t think you have to take it out of state though. if you’re in the broward county area, meaning west-palm, broward, and Miami. you can go to broward college there are 3 campuses north for west-palm beach central for broward and south for Miami",
            "score": 2,
            "author": "Professional_Lack828",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry I was talking about as a transfer student. I am currently out of state and looking to start at FAU",
                    "score": 2,
                    "author": "Sam242424242424"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can take the train to school if you want to stay close to family",
            "score": 2,
            "author": "Professional_Lack828"
        },
        {
            "level": 0,
            "comment": "Yes absolutely. It shows you can be outside the public school system, buckle down and survive. Please do this.",
            "score": 2,
            "author": "rekipsj",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn’t go to a public school, but I believe your point stands regardless",
                    "score": 2,
                    "author": "Sam242424242424"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes! When I applied to FAU after high school I was denied but they told me to try cc. I went to a community college and applied to FAU again with a 3.7 GPA and I was accepted.",
            "score": 2,
            "author": "Serious_Warning697"
        },
        {
            "level": 0,
            "comment": "What’s your gpa",
            "score": 1,
            "author": "Signal-Chapter-9182",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was like a 2.5 in HS but it’s much better now at the community college in my state",
                    "score": 1,
                    "author": "Sam242424242424",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay as long as it’s a 3 or higher you should be good as a transfer",
                            "score": 2,
                            "author": "Signal-Chapter-9182"
                        }
                    ]
                }
            ]
        }
    ]
}