{
    "id": "zwrtp8",
    "score": 20,
    "title": "Just finished my first semester at FAU, still know absolutely no one",
    "author": "Suspicious_Degree_88",
    "date": 1672179107.0,
    "url": "https://www.reddit.com/r/FAU/comments/zwrtp8",
    "media_urls": [],
    "other_urls": [],
    "postText": "So, I finished my first semester at FAU and I don't know anyone. I don't live near the Boca Campus at all, 50 minute's drive for me. I am set to only have class at the Boca campus twice a week. I live closer to the Davie campus, but it is lifeless. Any advice on how to meet new people who go here? Should I give up on meeting people if I'm not dorming?",
    "comments": [
        {
            "level": 0,
            "comment": "Join a group/club/sport during the time you're on campus",
            "score": 6,
            "author": "FireBeard1501",
            "replies": [
                {
                    "level": 1,
                    "comment": "Will look into it",
                    "score": 0,
                    "author": "Suspicious_Degree_88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m there a few times a week but Ik there are some people, especially in up that don’t come at all",
                            "score": 1,
                            "author": "Valuable_Mango_1866"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "tbh you’re most of the time not going to just meet people randomly without living in the dorms. join some clubs or organizations ! that’s how i got to meet people",
            "score": 5,
            "author": "CyanideIncense",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well that sucks for me",
                    "score": 1,
                    "author": "Suspicious_Degree_88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "clubs and sg, or plenty of other orgs on campus",
            "score": 3,
            "author": "DanSheman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dont know how many are ideal for my situation",
                    "score": -1,
                    "author": "Suspicious_Degree_88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you would've known if you've fucking checked ‐ go to owlcentral and join something you find interesting, if you don't have hobbies just join a fraternity/student government. there's good people out there that want to meet new people.",
                            "score": 2,
                            "author": "DanSheman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That was aggressive but ok also I did check owlcentral doesnt mean their itll be a fit for commuters",
                                    "score": 0,
                                    "author": "Suspicious_Degree_88",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yea my bad...\n\nBut yeah. only way to find out is to try and join. some will work out, many will not, but just a few of solid groups will make a huge impact on your college experience.\nGood luck bro",
                                            "score": 1,
                                            "author": "DanSheman"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There’s plenty of orgs where you can be involved from a distance! I joined student media and live far from campus owl tv, owl radio, university press",
            "score": 3,
            "author": "Valuable_Mango_1866",
            "replies": [
                {
                    "level": 1,
                    "comment": "How often are you at the boca campus?",
                    "score": 1,
                    "author": "Suspicious_Degree_88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "pbfau is a great place to start tons of free events and most people who attend are very nice. \n\nalso if you’re a gym person there’s that, which includes many different programs like yoga, cycling, karate, kick boxing (all of these are free). playing basketball the gym is fun too, also if you’re into volleyball there’s people who play volleyball at 3-6pm fridays. the gym also provides free rock climbing.\n\nboth basketball teams are great this year (especially the men’s). if you stand in the student section there are alot of people you can meet who are very easy going. all sports events are free for students. \n\nthe game center (idk what it’s called, it’s connected to student union) is fun. there’s pool tables, ping pong tables, free computers to game on, free consoles to use, and im pretty sure board games too. this place is always busy past 4pm. \n\nthere’s loads of student groups/organizations; for example i have been in a spanish dancing one, a nursing one, and band. all these organizations can be found on a fau website with contact info on who to contact if you wish to join. \n\nthere’s greek life as well, idk if it’s for you and idk if you think it’s for you either, but i’ve seen a friend who was going through tough times and he said he was going to join one. it was a large time commitment but he was a lot happier after a month, now anytime i’m walking with him he knows everyone. also if im getting this right after the first semester of initiation you can be as involved as you want, they do stuff like every other day. \n\nif you want any more info feel free to dm me, i just want everyone to have a great experience while at fau",
            "score": 3,
            "author": "Gloomy-Presence-6539",
            "replies": [
                {
                    "level": 1,
                    "comment": "I dont know much about the program board but I'll google it. Into the gym and didnt know they did volleyball kinda wanna do that. Not big into watching college sports, but that's just me. Also I have no clue what greek life is.",
                    "score": 2,
                    "author": "Suspicious_Degree_88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "pbfau has a insta where they advertise for their events and their insta is “pbfau”. volleyball is fun, there’s normals and some people who rarely go, also some are experienced and some just started playing like me but it’s fun regardless. also greek life is frats and sororities, also there are “frats and sororities” but for your major and they aren’t like traditional frats or sororities. for example my friend she’s in a sorority for law and it’s literally just a club.",
                            "score": 1,
                            "author": "Gloomy-Presence-6539",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So for my major being management information systems they'd have a frat for that?",
                                    "score": 1,
                                    "author": "Suspicious_Degree_88",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "first of all great major and actually there is, i dm’d you the info",
                                            "score": 1,
                                            "author": "Gloomy-Presence-6539",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you and I got really lucky with that major because I had no idea what I was going for up until 4 months ago",
                                                    "score": 2,
                                                    "author": "Suspicious_Degree_88"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I also go to campus twice a week from an hour away and have made lots of friends. Gotta make an effort and reach out. I’ve met people through a class discord to study or hang",
            "score": 1,
            "author": "Tasty-Bugg",
            "replies": [
                {
                    "level": 1,
                    "comment": "I havent heard of a class discord as of yet",
                    "score": 1,
                    "author": "Suspicious_Degree_88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean individual class. For a subject. Someone usually makes them and if they don’t I do",
                            "score": 1,
                            "author": "Tasty-Bugg"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You livin in 2023. Everyone just talks to their phone. We living in the future now",
            "score": 1,
            "author": "lirik89"
        }
    ]
}