{
    "id": "13vf12g",
    "score": 512,
    "title": "One of the stranger perfect fits",
    "author": "oftenerwonder34",
    "date": 1685416779.0,
    "url": "https://www.reddit.com/r/Perfectfit/comments/13vf12g",
    "media_urls": [
        "https://i.redd.it/umzs5pkuzv2b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Never seen a Babelfish in real life.",
            "score": 37,
            "author": "offarock",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll never have an original thought on this website.",
                    "score": 9,
                    "author": "loulan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Reddit hive mind experience...",
                            "score": 1,
                            "author": "MartianTurkey"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In fairness they *are* probably the oddest thing in the universe.",
                    "score": 3,
                    "author": "tehrmuk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did he do that himself? What on earth. Very funny though. Cute kid, I hope he had fun (presumably) eating goldfish.",
            "score": 3,
            "author": "Majulath99"
        },
        {
            "level": 0,
            "comment": "“The Babel fish is small, yellow and leech-like, and probably the oddest thing in the Universe. It feeds on brainwave energy received not from its own carrier but from those around it. It absorbs all unconscious mental frequencies from this brainwave energy to nourish itself with. It then excretes into the mind of its carrier a telepathic matrix formed by combining the conscious thought frequencies with the nerve signals picked up from the speech centres of the brain which has supplied them. The practical upshot of all this is that if you stick a Babel fish in your ear you can instantly understand anything said to you in any form of language. The speech patterns you actually hear decode the brainwave matrix which has been fed into your mind by your Babel fish.  \nNow it is such a bizarrely improbable coincidence that anything so mindbogglingly useful could have evolved purely by chance that some thinkers have chosen it to see it as a final and clinching proof of the non-existence of God.  \nThe argument goes something like this: \"I refuse to prove that I exist,\" says God, \"for proof denies faith, and without faith I am nothing.\"\n\"But,\" says Man, \"the Babel fish is a dead giveaway isn't it? It could not have evolved by chance. It proves you exist, and therefore, by your own arguments, you don't. QED.\"  \n\"Oh dear,\" says God, \"I hadn't thought of that,\" and promptly vanishes in a puff of logic.  \n\"Oh, that was easy,\" says Man, and for an encore goes on to prove that black is white and gets killed on the next zebra crossing.”  \n― Douglas Adams, The Hitchhiker's Guide to the Galaxy",
            "score": 2,
            "author": "haemaker"
        },
        {
            "level": 0,
            "comment": "[Dude stole one of the top posts on the sub lol. ](https://old.reddit.com/r/Perfectfit/comments/adwmp8/one_of_the_stranger_perfect_fits)",
            "score": 2,
            "author": "_not-here"
        },
        {
            "level": 0,
            "comment": "So it’s a great perfect fit but as a PSA that doesn’t even need to be said- don’t put things in babies ears",
            "score": 4,
            "author": "Feudalist"
        },
        {
            "level": 0,
            "comment": "So when someone says 'the little snack that smiles back', how do you know which one are they talking about ?",
            "score": 2,
            "author": "Bokbreath"
        },
        {
            "level": 0,
            "comment": "Uhh this is a terrible idea, don’t put things in kids’ ears.",
            "score": 1,
            "author": "backflip10019",
            "replies": [
                {
                    "level": 1,
                    "comment": "lmao the kid definitely this himself come on now",
                    "score": 2,
                    "author": "blankfrack125",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you🙌 🤦‍♀️ tell me you don't have kids without telling me you don't have kids lmfao, right?",
                            "score": 3,
                            "author": "PaperCasts"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm pretty sure I still have a cracker jack deep inside my nose. *when perfect fits go wrong*",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That earhole was made for the fish. It was its earhole.",
            "score": 1,
            "author": "MadR__"
        },
        {
            "level": 0,
            "comment": "AirPods should be shaped like that. 😂",
            "score": 1,
            "author": "Powerful_Look69"
        },
        {
            "level": 0,
            "comment": "Thought it was a hearing aid at first😂😅🤦‍♀️",
            "score": 1,
            "author": "PaperCasts"
        },
        {
            "level": 0,
            "comment": "Sounds fishy",
            "score": 0,
            "author": "tayloriser"
        }
    ]
}