{
    "id": "140xgnx",
    "score": 35,
    "title": "Pill bottle in my Hyundai Sonata.",
    "author": "OriginalRoombaJuice",
    "date": 1685927986.0,
    "url": "https://www.reddit.com/r/Perfectfit/comments/140xgnx",
    "media_urls": [
        "https://v.redd.it/ejylkochp34b1"
    ],
    "other_urls": [],
    "postText": "For the curious among you those are anti anxiety/depressants I take to cope with the fact I own a Hyundai",
    "comments": [
        {
            "level": 0,
            "comment": "I assume that whoever tested that car during its development also got depressed, and asked the engineers to add that in.  \nJokes aside, which Hyundai do you own?",
            "score": 2,
            "author": "gundi_salvus",
            "replies": [
                {
                    "level": 1,
                    "comment": "2015 Hyundai Sonata GL. Had to buy a vehicle with very limited time. I didn’t know their reputation and faults until it was too late. I actually like the car I just don’t trust it.",
                    "score": 2,
                    "author": "OriginalRoombaJuice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If it's running well and you're servicing it properly, that's what matters for the time being. Has it given you any issues so far?",
                            "score": 2,
                            "author": "gundi_salvus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "More or less. Only has 78,000 kilometers (48k miles) on it. I also have it under a 20,000 KM drivetrain warranty so if the Theta engine does what it’s known for I’m covered for a short while. I plan to sell it and grab a Toyota. It’s maintenance history was alright so I doubt it will blow anytime soon but I’ve had terrible luck with cars and can’t afford to roll the dice.",
                                    "score": 2,
                                    "author": "OriginalRoombaJuice",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In that case, you should be good to go for the time being. Given that context, I can see why you want to play it safe. May I ask which cars did you own before that one?",
                                            "score": 2,
                                            "author": "gundi_salvus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "‘91 Civic Hatch (crashed), ‘94 MX3, ‘01 Celica (bottom end), ‘98 Maxima (head gasket), ‘05 Mustang (transmission and diff), ‘08 Golf (everything including engine). \n\nMost cars I owned for less than 20k. My motorcycles have all been relatively trouble free thankfully.",
                                                    "score": 2,
                                                    "author": "OriginalRoombaJuice",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oof. At least the Civic didn't grenade itself. Did you buy all of those cars used? If so, neglect from previous owners may have gotten you that \"bad luck\".  \nAt least there's that. I was going to buy a motorcycle, but ended up changing my mind (sadly).",
                                                            "score": 1,
                                                            "author": "gundi_salvus",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "All my vehicles are used. The notion of buying new has never appealed to me even when considering my luck. Rapid depreciation and what not. I don’t mind taking partial blame for each vehicle but previous owners were the largest factor. Then again most people I know drive used cars and have almost no issue so I consider myself fairly cursed. 😎\n\nMotorcycles are pretty amazing for the right people. There’s something be said about getting super car performance from a sub $10k bike that has the reliability of a 90’s Corolla. But it takes a certain individual to accept and mitigate the risk to reward of being on two wheels.",
                                                                    "score": 2,
                                                                    "author": "OriginalRoombaJuice",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I feel like the Lemon Law and long warranties would be benefitial to you, given your luck and previous owner history. I agree that depreciation sucks, though. I also drive a used car. As of right now, zero key issues. Only very minor stuff.  \n\n\nExactly. I wasn't going for performance, though: I wanted fuel economy and cheap zero mileage transport coupled with fun cornering. I was looking at 125cc bikes, but the cost of gear (helmet, jacket, etc.) and cold Winters made me change my mind.",
                                                                            "score": 1,
                                                                            "author": "gundi_salvus"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}