{
    "id": "9g6idq",
    "score": 31921,
    "title": "Had a pair of prescription lenses which fit perfectly in my mask. I could see all the fishies clearly!",
    "author": "growup_andblowaway",
    "date": 1537058561.0,
    "url": "https://www.reddit.com/r/Perfectfit/comments/9g6idq",
    "media_urls": [
        "https://i.redd.it/ekns01iqyhm11.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Way cheaper than a mask with prescription lenses in it too!!",
            "score": 2594,
            "author": "RedditIsFiction",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup!! I had my lenses replaced with sunglasses and they thought I was weird to keep these ones they popped out, had no plan for them. So glad I thought to try this today, it was perfect!",
                    "score": 1372,
                    "author": "growup_andblowaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Such a great idea! Thanks OP ",
                            "score": 364,
                            "author": "adrenaline2020",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": ";) ",
                                    "score": 187,
                                    "author": "growup_andblowaway",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Another thing I have thought of is a visor maybe like a tennis type. I think it would really help underwater visibility just by cutting out the overhead glare.",
                                            "score": 37,
                                            "author": "RealJeil420",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Come dive i denmark the weather is always shit so there is never any glare. Tho we do have plenty of amazing sunken ships from the last 200 years around at quite nice depths, from 20-50 meters are the most, the best ships are around 35-45 meters.",
                                                    "score": 58,
                                                    "author": "TheNordicMage",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This sounds really interesting. Any dive guides you'd recommend?",
                                                            "score": 16,
                                                            "author": "I_saw_that_coming",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No sadly not as denmark (Kattegat) mostly consists of club divers rather then turists, however i do have a collection of known positions i can post when i get near a computer.\n\nThe majority of our sunken ships are from around the second world war. At least the ones with alright viss",
                                                                    "score": 17,
                                                                    "author": "TheNordicMage",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I love (and hate) learning the history with WWII if you could reply with that I'd really appreciate it! If not no worries and have a good one!\n\nIt just really sounds very interesting to see in person.",
                                                                            "score": 9,
                                                                            "author": "I_saw_that_coming",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Here is the map i ment, it has been put together by a fellow redittor.\n\n https://www.google.com/maps/d/viewer?mid=1spFZVMpqL3ccYMlz4l4oiR7TzpQ&amp;ll=48.34558534943425%2C3.9899472676045207&amp;z=3 \n\nby u/pubocyno",
                                                                                    "score": 13,
                                                                                    "author": "TheNordicMage"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Also i must say that the water is quite cold here, so while a dry suit isnt nesserary its deff. Recomended",
                                                                    "score": 4,
                                                                    "author": "TheNordicMage"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "metric username reference?",
                                            "score": 2,
                                            "author": "Layman76",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I bought a pair of prescription sunglasses 10 years ago.  Cost me $300.  They were stolen a month later and someone probably put them on and realized what they were and threw em out.  Since then I just by cheapo shades that look good and hot glue in some old lenses into the sunglasses. Works like a charm.  ",
                            "score": 77,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Check out Zennioptical.com they have SUPER cheap and quality stuff, highly recommend (obviously)",
                                    "score": 98,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’ll check it out. I typically use eyebuydirect for my regulars. Thanks. ",
                                            "score": 24,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Zenni Optical had darker tint maximum than Eye Buy Direct in my experience. Even with the darkest option from EBD they were never dark enough on any of the three pair I bought. \n\nZenni does have ‘lower’ quality acetate though. They tend to look dull after a couple months where EBD kept their shine longer. I think it may just be a difference in the density of the materials? ",
                                                    "score": 22,
                                                    "author": "Bhole_Aficionado",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The pessimist in me thinks you two are getting paid to advertise, the side of me that has no fashion sense thanks you because some of those are awesome and very affordable. ",
                                                            "score": 14,
                                                            "author": "zionxgodkiller",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I wish I was getting paid to shill. They’re pretty much the only two decent sub $100 glasses companies that by broke ass can afford. ",
                                                                    "score": 10,
                                                                    "author": "Bhole_Aficionado",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No harm no foul, right?",
                                                                    "score": 3,
                                                                    "author": "gamingchicken"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Darker tint isn't always good for your eyes. Your pupils open up super wide to compensate and if there isn't proper coatings or enough wrap to cut sunlight, even more sun will be entering your eyes. ",
                                                            "score": 18,
                                                            "author": "Kallisti13",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's deep. Esp as darker tints make no difference to UV protection, all sunglasses should have the same level of UV protection",
                                                                    "score": 6,
                                                                    "author": "phoneguymo"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I used to buy 5 pairs at a time from Zenni before i got LASIK because I was terrible with glasses. ",
                                            "score": 2,
                                            "author": "Coloneldave"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "eyebuydirect is also a great place for cheap prescription glasses! I got 2 pair a year ago for like $30. They always have awesome sales. :) ",
                                    "score": 10,
                                    "author": "br00mie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Eyebuydirect is awesome. I’ve never had vision insurance in my adult life. Have been using them for years. ",
                                            "score": 6,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I bought the two after, very stupidly, spending $600 AFTER insurance on one pair of glasses. Sure, they were the expensive progressive lenses, but I hate every minute of wearing them. :( I honestly have a hard time driving with them. The bifocal part makes looking in side mirrors very blurry. I could tilt my head more, but I would rather have separate glasses for driving. 0/10 not worth the money in my opinion. Huge regret. ",
                                                    "score": 8,
                                                    "author": "br00mie"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I just buy all my sunglasses online from zenni optical; they’re sunglasses so I’m not as picky as I am with my clear glasses and I don’t stress about not being able to try them on first. They always end up looking decent anyway. \n\nYou can get a pair for like $20 but they’ll look kind of cheap - I spent $50 on my last pair (all in including shipping) and they look almost identical to wayfarers. ",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am taking a diving course right now and have been debating buying a prescription mask. This is genius!! I'll have to dissect a few old pairs of glasses and see if any fit!",
                            "score": 3,
                            "author": "queenofcheebah",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just join the military and get gas mask inserts and you’re golden",
                                    "score": 3,
                                    "author": "One_pop_each",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I paid a stupid amount for my lenses if i got them changed then fuck yes i'm keeping the old ones. I would attach them to some safety glasses",
                            "score": 2,
                            "author": "beheldcrawdad"
                        },
                        {
                            "level": 2,
                            "comment": "My glasses cost me hundreds of dollars so, yeah, I'd do the same :)",
                            "score": 2,
                            "author": "smokeypies"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I usually wear contacts within my mask/goggles.",
                    "score": 13,
                    "author": "Exastiken",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wtf isn’t this the top comment ",
                            "score": 3,
                            "author": "spliced_chirmera",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is it? I spoke from my own experience, though, as a\nswimmer, high school water polo player, and certified open water diver.",
                                    "score": 2,
                                    "author": "Exastiken",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think he meant WHY isn’t this the top comment. Agreed",
                                            "score": 2,
                                            "author": "eazyd"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It *is* a mask with prescription lenses in it.",
                    "score": 11,
                    "author": "udder-chaos"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even cheaper. I bought some for 17 dollars from Amazon two months ago ",
                            "score": 5,
                            "author": "TerminallyTrill"
                        },
                        {
                            "level": 2,
                            "comment": "Guess it all depends on how bad your eyes are. Paid around 50 for a prescription mask too, and was overjoyed because regular glasses usually cost me at least 300!",
                            "score": 3,
                            "author": "fazalazim"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Amazon has prescription swim goggles for like 12 bucks.  I bought a pair.  They worked fine.",
                    "score": 6,
                    "author": "altiuscitiusfortius"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People w/ 20/20 likely won’t appreciate how awesome this is. ",
            "score": 1372,
            "author": "linkinparklily",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got lasik and now have 20/20 after bring pretty much blind my whole life. Holy shit the world is beautiful!!!!",
                    "score": 533,
                    "author": "0_o0_o0_o",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I kinda want lasik but I'm a little worried about it. Do you know if the risks are minimal, and if someone with a somewhat low prescription could get it? ",
                            "score": 192,
                            "author": "kaybet",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also look into PRK. Different procedure, same results, no flap in your cornea. Generally more reliable. Got it done in December and still a bit better than 20/20! ",
                                    "score": 102,
                                    "author": "spacecadence",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "PRK has a vastly longer recovery time and the results can take a lot longer to come so a lot of people need contacts/ glasses for weeks/ months afterwards. My up close vision took about a week to stabilize but my distance only took about a day and the flap healed in a day. LASIK vs PRK is about near instant recovery vs cost. But with days of missed work for PRK you still have a raised cost, just not the full difference to LASIK. Also, if I recall correctly, I don't think PRK fixes astigmatisms. I wasn't dropping that much money to still have an astigmatism and need corrective lenses.\n\nBoth surgeries have benefits and drawbacks. I'd consult a doctor.",
                                            "score": 80,
                                            "author": "DefinitelyNotAliens",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "SMILE is also another newer option that’s available. Same price generally as LASIK as the procedure is mostly the same, it involves a much smaller incision without the need of lifting the flap. Reduced halos and less dry eye are some benefits, however it does not fix astigmatism. I asked if I was a good candidate, but my doctor said he’d much rather I go with LASIK so he could address the very minor astigmatism I had in one of my eyes.",
                                                    "score": 24,
                                                    "author": "AvenueNick",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "All you people talking about lifting flaps, I'll stick with contacts for the rest of my life, damn. ",
                                                            "score": 19,
                                                            "author": "BubonicAnnihilation",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The thought of it was a little terrifying, but damn if the process wasn’t swift and painless. It was somewhat uncomfortable feeling a little pressure against the eye, but that’s one surgery I’d 100% tell people it’s worth doing. Best of all, you save money in the long run if you consider costs of glasses and contacts.",
                                                                    "score": 6,
                                                                    "author": "AvenueNick"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "SMILE can't correct as far as LASIK either, from what I read two years ago. Due to the degree of correction and my astigmatism I went with LASIK over SMILE. ",
                                                            "score": 3,
                                                            "author": "DefinitelyNotAliens"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah you’re right on a lot of that for sure. It was easier for me as a student with a winter break to not have to drive for about a week, and no night driving for like 2-3 weeks. Full 20/20 took about 3-4 weeks. But it does fix astigmatism! So that’s nice. Definitely doctors know best. ",
                                                    "score": 3,
                                                    "author": "spacecadence"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I got prk 11 years ago and it's been fantastic ever since. Best thing the army gave me",
                                            "score": 8,
                                            "author": "Underwater_Grilling"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I got LASIK with fairly bad vision, my prescription lenses were -7.25 on both eyes. I had an astigmatism as well. I did full LASIK with a laser-cut flap and waveform scan. I was fully awake and alert, no relaxer like vallium or anything. It was a little odd and smelled like burning hair but was not painful or uncomfortable in the moment.\n\nSide note- after a TON of research and against my eye doc's wishes I did it in Seoul, South Korea. I was a confirmed 'perfect' candidate in the US from my eye doctor of twenty years and a opthomologist who could perform the procedure. I saved about two grand doing it overseas and got a cool trip out of it. My Korean doctor was US board certified, had recommendations from the company that makes eye surgery lasers and spoke perfect English. I definitely took a risk, though.\n\nMy surgery had me blurry but better than before right away. I had my surgery my first full day in, got my eye drops and wore sunglasses back to my hostel. Things were clearing up minute by minute but the soreness and light sensitivity were insane. I walked with sunglasses on and grabbed a backpack of a friend who went with through the subway and had eyes closed and followed directions to squint when we hit stairs. The next day I wore sunglasses but my vision was perfect. It was still sensitive but manageable. My first checkup the day after had me at 20/20. Day two the soreness was gone and I was perfect. I went for a one-week with my doctor and got my all clear to fly home.\n\nOne month later my eye doctor of twenty years scolded me and gave me a 20/15. A year later I was still 20/15. I'm two years post-LASIK and my 3500 was well-spent, that was surgery, airfare, hostel and food/drink/souvenirs/tours.\n\nI don't think my method of flying overseas is for everyone. Any surgery has risk for complication. Being in a country where you do not speak the language means if you have a medical emergency where you need to go to an ER there is a risk of not finding a doctor who speaks your language.\n\nA few sites run these horror-story stats on LASIK but it seems to be unfounded. I've not met one LASIK patient who regrets it bar one person who had PRK back twenty years ago. She had the halos at night. Except, as explained by my doctors halos occur when you were never a good candidate. Basically, they can correct a certain width of cornea. If your iris dialates beyond the corrected field you have halos due to the unfocused light. Your eyes dialate further at night, hence nightime halos. Also, some people have too thin of corneas or the cornea is the wrong shape and you cannot correct evenly or to 20/20. Most complications occur for people who should have never been told yes by a doctor.\n\nThe rate of complications like infection run about 1/1000 and my clinic had 1/3000 so I felt confident having been confirmed as a good candidate by two doctors, one who would be losing a patient and stood to gain no money from it and in the clinic I chose.\n\nWhatever you do, look into the doctor you choose, understand the different types of procedures, be honest on whether you can actually afford an out of pocket procedure and get confirmed as a good candidate for LASIK. Some places advertise 299/ 599 an eye but you won't want the level of care that provides, more than likely. They have sales reps who upsell and you'll spend just as much as having a non-pushy doctor who isn't jamming through patients like a factory worker. Also, the eye drops are about $500 and most insurance covers 0% of your costs for LASIK, including eye drops.\n\nGood luck!",
                                    "score": 30,
                                    "author": "DefinitelyNotAliens",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hey, thanks for sharing! Out of interest, how old were / are you? Did your eyesight get worse over the years (before the surgery)? What about after the surgery, any changes since?",
                                            "score": 3,
                                            "author": "addandsubtract",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I got LASIK two years ago and am in my twenties! I wanted surgical correction for about 8 years before I got it. My vision got progressively worse from about age six or seven until I was about 20 to 21 years old. After that it was fixed at that prescription for a few years before I got LASIK. My personal doctor won't give recommendations without stable vision for two years. I think mine was three years no change or so before I got LASIK. It's been a little over two years and I'm still at 20/15 vision.\n\nI haven't had any issues with halos/ dry eyes, either.",
                                                    "score": 2,
                                                    "author": "DefinitelyNotAliens",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ok, sounds good! I'm a bit older, but still notice my eyesight getting worse ever so slightly each year. I'm definitely tempted to get LASIK done at some point because contact lenses and allergies combined are the worst. Guess I can start doing the research and finding a suitable doc.",
                                                            "score": 2,
                                                            "author": "addandsubtract"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "/r/lasik",
                                    "score": 41,
                                    "author": "AFreshBowlOfSoup",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I want some soup",
                                            "score": 7,
                                            "author": "Goliath_Gamer",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "what kind",
                                                    "score": 8,
                                                    "author": "AFreshBowlOfSoup",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lentil",
                                                            "score": 6,
                                                            "author": "Goliath_Gamer",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "gross",
                                                                    "score": 7,
                                                                    "author": "AFreshBowlOfSoup",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Wtf",
                                                                            "score": 2,
                                                                            "author": "montarion"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Whaaaaat?!",
                                                                            "score": 2,
                                                                            "author": "Goliath_Gamer",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "bro don't talk to me ",
                                                                                    "score": 9,
                                                                                    "author": "AFreshBowlOfSoup",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Here's a sneak peek of /r/lasik using the [top posts](https://np.reddit.com/r/lasik/top/?sort=top&amp;t=year) of the year!\n\n\\#1: [(Hopefully) encouraging words for people dealing with post lasik depression](https://np.reddit.com/r/lasik/comments/7y0qsl/hopefully_encouraging_words_for_people_dealing/)  \n\\#2: [Morning after surgery; I am a fucking eagle.](https://np.reddit.com/r/lasik/comments/8vtjpw/morning_after_surgery_i_am_a_fucking_eagle/)  \n\\#3: [Got lasik last Friday 3/30/18 and I hate that I waited so long to get it](https://np.reddit.com/r/lasik/comments/89bwre/got_lasik_last_friday_33018_and_i_hate_that_i/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/8wfgsm/blacklist/)",
                                            "score": 13,
                                            "author": "sneakpeekbot"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Didn't know that was a subreddit. Thanks!",
                                            "score": 2,
                                            "author": "kaybet",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": ":)",
                                                    "score": 3,
                                                    "author": "AFreshBowlOfSoup"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 18,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'll probably do that later. I'm actually a optician, lol",
                                            "score": 4,
                                            "author": "kaybet",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 12,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So you didn't end up getting Lasik?",
                                                            "score": 4,
                                                            "author": "SultanOilMoney",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I had one place try to schedule me immediately after the screening (the actual doc hadn't even seen my file yet) whereas the 2nd told me to come back for another test then approved me for only PRK. The last one just outright said no, and \"your results won't be as clear as you're getting with contacts for near vision\".\n\nI ended up not doing it because contacts and glasses didn't bother me enough to risk it. Always get a 2nd or even 3rd opinion.",
                                                            "score": 2,
                                                            "author": "3162081131"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I had the procedure a few years ago...\n\nThe risks are very, very low. \n\nThere are certain contraindications for the procedure; any ophthalmologist worth their salt will go over any and all details when you go in for your consult.   \n\nOne of the best decisions of my life. \n\n\n\n",
                                    "score": 9,
                                    "author": "meisaustin"
                                },
                                {
                                    "level": 3,
                                    "comment": "What scared me off from Lasik and similar procedures is just how few doctors, especially eye doctors, get it.",
                                    "score": 15,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yeah, wtf. Noticed my optometrist had glasses(while pitching me lasik from his doctor friend) and I decided to get the anti reflective lenses and live like that",
                                            "score": 14,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Mine had it like 20 years ago and now wears reading glasses.\n\nI got it two years ago. My vision was so bad everything was funhouse mirror effect with glases on. Straight lines were bendy in my glasses and I didn't like contacts. I wore plastic frame glasses with ultralight lenses and the lenses still stuck out past the frame edge. I had zero peripheral vision and without glasses I literally couldn't see three inches from my nose. I don't regret LASIK one bit. Best money I ever spent.",
                                                    "score": 8,
                                                    "author": "DefinitelyNotAliens"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm an optometrist. I think what usually stops us from getting it is that because we are 'in the trade' we know what developments are being worked on.\n\nIt's not that we don't think it's safe - it is, it's just that we're always holding out for that next new thing.",
                                            "score": 10,
                                            "author": "bassboy87",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;It's not that we don't think it's safe - it is, it's just that we're always holding out for that next new thing.\n\nMe with computers.",
                                                    "score": 4,
                                                    "author": "Green0Photon"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "What should we be waiting for?",
                                                    "score": 2,
                                                    "author": "maichiemouse",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Mostly the options coming through are better correction of presbyopia (the need for reading glasses).\n\nOriginally laser treatments would give you clear distance vision but you'd still need glasses for reading past the age of about 45. Now there are laser and lens exchange options that give multifocal vision.\n\nMost of the stuff coming through at the moment is refining this so that the distance has to be compromised less in order to give the reading vision.",
                                                            "score": 2,
                                                            "author": "bassboy87"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "FWIW I had laser eye surgery (PRK) in 2015 in order to be eligible for the Air Force’s flight career field. Until recently Lasik was not even approved, even though PRK has a harsher recovery period. Regardless of PRK’s reputation for being more a of a pain in the ass than Lasik, it was still very smooth. A good amount of pain in the first three days, for which I was prescribed Oxycotin. After that, no pain. A little bit of blurriness at night for the first several months, but after 6 months of the steroid eye drops to encourage the tissue to grow back, my vision was 20/15 in all conditions. I am very happy with the results. And for only ~$3500 after a military discount, I think that the ROI is very good, considering it’s easy to spend that amount for 10 years of contacts and glasses. In my mind it was very worth it, even if it wasn’t a military requirement. ",
                                    "score": 3,
                                    "author": "CptSandbag73"
                                },
                                {
                                    "level": 3,
                                    "comment": "While risks of the operation maybe minimal - that risk is to get stuck with a constant discomfort of vision-artifacts or distortion, irritation and dry eyes.  \n\nI understand when people who are near totally blind go for it, but risking it when you are on low prescription is dubious.\n\nPersonally I feel that lasik is like throwing a pair Dice once where anything but 1+1 will win you $50k, but rolling snake-eyes means losing entirety of your possessions and property - the odds just doesn't match and this kind of bet is outside of reasonable bankroll anyway.",
                                    "score": 2,
                                    "author": "AllThunder",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As someone who is super myopic and has extreme astigmatism, I haven't been able to have a successful consultation. Were you* specifically far or near sighted?",
                            "score": 2,
                            "author": "YossarianTheSysAdmin",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Did you wear contacts before?",
                            "score": 2,
                            "author": "wABgtbRS79EDLfaSC3W2",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "As someone who's been wearing glasses for the entire life and is looking into getting lasik . Did you feel anything during the procedure? ",
                            "score": 2,
                            "author": "mignight12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You don't feel a thing at all and they give you Valium for the stress. All in all I was done after about 20 minutes and when I woke up the next day I had perfect vision. Best money I've ever spent by far. ",
                                    "score": 2,
                                    "author": "0_o0_o0_o"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 33,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wearing contacts does the trick as well, though.",
                            "score": 8,
                            "author": "Exastiken",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But you actually have to put that in your eye, I'm really squeamish. ",
                                    "score": 9,
                                    "author": "SultanOilMoney",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Begrudgingly took my nephew to look at Halloween costumes today. Halloween with glasses, a big head, and being overweight is hell.",
                    "score": 8,
                    "author": "GaiusOrpheus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Weird. I can see perfectly underwater in goggles, but need glasses to see above the water",
            "score": 248,
            "author": "AboveUnderscores",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was thinking the same thing. I am horribly nearsighted (been getting worse and worse since I was 8) but I've always been able to see perfectly underwater if I had goggles on. I wonder if OP, and all these others commenting, are farsighted, and have had a different experience with goggles?",
                    "score": 110,
                    "author": "DrawStringBag",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My parents are both eye doctors and I may be wrong but i believe this is because the refractive index of your eyes (cornea/sclera) and water is so similar that you should be able to see stuff underwater because the light was already refracted when it passed from air to water.  Now that i say this its not making complete sense. Any ideas?",
                            "score": 101,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is correct, turns out the origin of the physiology of vertebrate eyes evolved in aquatic animals, and didn’t really change since then.  Our eyes are designed to focus correctly under water.",
                                    "score": 88,
                                    "author": "worldspawn00",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Huh... TIL... So octopus and squid won't probably ever need glasses.",
                                            "score": 38,
                                            "author": "asoge",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Until they start invading land at least. ",
                                                    "score": 41,
                                                    "author": "Skepsis93",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Inevitably.",
                                                            "score": 13,
                                                            "author": "Digitonizer"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Would you by chance remember which episode that is?",
                                                    "score": 2,
                                                    "author": "Ymich",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 5,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is so cool, thank you! I've been nearsighted since 12 and only realized this after about 20 years. I've been wondering what the deal was ever since!",
                                    "score": 3,
                                    "author": "thisoneagain"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you’re SUPER nearsighted, the water doesn’t correct it enough. My father has this problem. If you’re even pretty badly nearsighted but not to the point you can’t see the the goggles, then it’s fine. It also depends on how far away the goggles are vs how far you can see clearly",
                            "score": 8,
                            "author": "Bishop51213"
                        },
                        {
                            "level": 2,
                            "comment": "Me too! This is crazy, I just thought it was a thing for everyone who needs glasses, but I guess some people still need a prescription for goggles?",
                            "score": 7,
                            "author": "SecretlySpiders",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm short sighted, about -8, and definitely need lenses underwater if I want to see fish/danger etc. I took the arms off an old pair of glasses and put them on elastic. Just lived with a certain amount of leakage into the mask. Love this taking the lenses out idea!",
                                    "score": 5,
                                    "author": "SAHM42"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you have a mild correction power then you will have it corrected underwater due to refraction, the same thing which corrects your vision with glasses, I believe. When I scuba dived I got prescription goggles and my doctor adjusted my prescription by a few points off my glasses to account for the water. My vision got worse but I kept my slightly off goggles as it was better than replacing the lenses. Now that I got LASIK my dad inhereted my scuba goggles and they're close enough for him.",
                    "score": 13,
                    "author": "DefinitelyNotAliens"
                },
                {
                    "level": 1,
                    "comment": "I came here to see if anyone else was like this. ",
                    "score": 13,
                    "author": "poop_creator"
                },
                {
                    "level": 1,
                    "comment": "Objects underwater appear 33% larger or 25% closer due to differences in light refraction.",
                    "score": 4,
                    "author": "oszillodrom",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did this with one of those VR Cardoard type viewers for my Phone.  Worked great.",
            "score": 94,
            "author": "WiseWordsFromBrett",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Vive actually has little cutouts in the foam to fit glasses, it's great.",
                    "score": 41,
                    "author": "xVeterankillx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you, I know what I'm buying with my next paycheck!",
                            "score": 7,
                            "author": "Sabre5270",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Have to be super careful though, the lenses scratch really easy",
                                    "score": 5,
                                    "author": "pingo5"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a person with glasses, I’m seriously so jealous ",
            "score": 84,
            "author": "br094",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are contacts not an option for a lot of people? ",
                    "score": 19,
                    "author": "cassius_claymore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 47,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "so what was the issue that the colored drops showed?",
                                    "score": 4,
                                    "author": "projectkennedymonkey",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My eyes are too sensitive to wear contacts. When I get them in, my eyes immediately turn red and itchy, then it's nearly impossible to get them out. My eye doctor said if I want to wear contacts I would probably always need prescription eye drops, and even then my eyes could still react badly. So, I'll stick with my nerd glasses thankyou",
                            "score": 26,
                            "author": "TheWickedGlitch"
                        },
                        {
                            "level": 2,
                            "comment": "Some SCUBA divers will not wear their contact lenses when diving to prevent the possibility of losing one/both of the contacts if their mask comes off while under water. Prescription masks, or inserts like these, solve that issue. ",
                            "score": 11,
                            "author": "meisaustin"
                        },
                        {
                            "level": 2,
                            "comment": "My girlfriend and I don’t wear contacts when we dive because it’s basically impossible to fix them underwater. We both have prescription masks. ",
                            "score": 6,
                            "author": "The_cynical_panther"
                        },
                        {
                            "level": 2,
                            "comment": "I had contacts at one point, and ended up scratching my eye because I tried to take the lenses out at the wrong angle. It was my second day wearing them and I wasn't used to grabbing something stuck to my eye. Needless to say I've never gone back and happily wear glasses. ",
                            "score": 9,
                            "author": "nobodyissaying"
                        },
                        {
                            "level": 2,
                            "comment": "I can’t use them. I tried. My eye forces itself closed when I put the contact anywhere near it. Some of us have this issue. ",
                            "score": 9,
                            "author": "br094",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Took me an hour the first few times to get my contacts in... It's hard to train your body to react well to putting things in your eyes. ",
                                    "score": 19,
                                    "author": "Zomeese",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "No one keeps their eye open through the sheer power of will when putting in contacts lol. You’re supposed to keep your eyelids open using your other hand.",
                                    "score": 12,
                                    "author": "Illuuminate_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't use my other hand anymore. Took me about 6 months of regular wear to getting it down to one hand. I can do it without a mirror now too! Nice skill for camping or if you forget and you're laying in bed. ",
                                            "score": 9,
                                            "author": "Kallisti13"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My optician explicitly forbade me from swimming or showering in contact lenses for fear of microorganisms in water getting between the eye and the lens where simple blinking and tears will not clear them out immediately, which can cause infection.",
                            "score": 4,
                            "author": "AllThunder",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wish I had listened to that advice. I recently got pink eye from swimming in the lake with contacts, and not properly cleaning then afterward.",
                                    "score": 3,
                                    "author": "TaxationIsMemes"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Underwater you dont need glasses \nI am heavily nearsighted and can see just fine when I’m underwater",
                    "score": 2,
                    "author": "Jeschkoo",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's awesome. Before I had laser eye surgery I always hated not being able to see underwater or see during rollercoaster fully. It really is a whole different experience",
            "score": 16,
            "author": "MCSkaboss",
            "replies": [
                {
                    "level": 1,
                    "comment": "Going paintballing sucks too. Also, not being able to take part in any sports like martial arts, rugby, American football etc etc ",
                    "score": 6,
                    "author": "newblackpillabuser"
                },
                {
                    "level": 1,
                    "comment": "Don’t forget you had to make sure your glasses had zero smudges on them when going to go see a movie!",
                    "score": 3,
                    "author": "camdoodlebop"
                },
                {
                    "level": 1,
                    "comment": "For anyone else reading this, there are straps with rubber things that attach to your glasses arms, then the strap goes around your neck to hold them on on roller coasters. On rides wear glasses are normally band, I've always seen an exception made if you have a strap that holds them on. \n\n I leave mine on for all rides, even the ones where they make you take them off. But mine fit on pretty tightly. ",
                    "score": 2,
                    "author": "imnotminkus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Probably the most randomly convenient perfect fit I’ve seen on this sub. Cheers!",
            "score": 43,
            "author": "Croughman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. Beats shower speaker. Why do you need music in the shower. The music was inside of you all along",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No way, this works in mine! Thanks man! I didn't even have to adjust ",
            "score": 13,
            "author": "noodlesteam",
            "replies": [
                {
                    "level": 1,
                    "comment": "Happy news story",
                    "score": 5,
                    "author": "growup_andblowaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Aré you far sighted?",
                            "score": 2,
                            "author": "FitnessD7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope, near",
                                    "score": 3,
                                    "author": "growup_andblowaway",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What!? Now you can sea! ",
            "score": 36,
            "author": "Shanilla_bear",
            "replies": [
                {
                    "level": 1,
                    "comment": "Scrolled down to find this. Was not disappointed.",
                    "score": 7,
                    "author": "CheekyYoghurts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I only disappoint my girlfriends and my closest friends. NEVER a fellow, pun-enjoying redditor. ",
                            "score": 4,
                            "author": "Shanilla_bear",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You have a girlfriend? Lucky you. I only have a wife :(",
                                    "score": 3,
                                    "author": "CheekyYoghurts"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fun fact. My aunt has \"pointy\" eyeballs and can't wear contacts. And no, she is not Liz Lemon. But I'm glad you were able to enjoy your underwater endeavors!",
            "score": 6,
            "author": "legoribs",
            "replies": [
                {
                    "level": 1,
                    "comment": "r/Keratoconus\n\nSeems its likely that. Special contact are needed. Unless glasses work for her then its not that and shes lucky. ",
                    "score": 2,
                    "author": "Icanhaswatur"
                }
            ]
        },
        {
            "level": 0,
            "comment": "r/mildlyinteresting",
            "score": 12,
            "author": "variq"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought so too, but they actually sit much closer then I expected! The only thing was they were a bit farther apart then normal so my depth was slightly off, but didn’t bother me while swimming!",
                    "score": 15,
                    "author": "growup_andblowaway"
                },
                {
                    "level": 1,
                    "comment": "Less unclear than you might think. Probably depends on how his sight is, but for nearsighted people the water can be like a pair of glasses, so it might be the effects combine just right, or it could be like mine at least where putting my glasses about twice as far from my eyes mostly just means more unclear area at the side than the part where I’m looking through the lenses is is mostly still clear. ",
                    "score": 4,
                    "author": "Mario55770"
                }
            ]
        },
        {
            "level": 0,
            "comment": "HOW THE FUCK HAS NOBODY MENTIONED THAT THESE LOOK LIKE GOGGLES MADE FOR E.T.",
            "score": 3,
            "author": "Throwawayscreen4"
        },
        {
            "level": 0,
            "comment": "Reminds me of Costanza’s prescription goggles. ",
            "score": 4,
            "author": "leejoness"
        },
        {
            "level": 0,
            "comment": "Is there a problem wearing contacts with goggles?  Maybe the water getting into them?  Not sure because I don’t wear glasses but have a fiancé with glasses so just wondering for her!",
            "score": 7,
            "author": "SenatorBrizown",
            "replies": [
                {
                    "level": 1,
                    "comment": "Works just fine, the thing you have to be careful with though is leaking water into your mask and being incapable of clearing your eyes out or recentering your contacts if they fall out of slip onto or under your eye.\n\n\n\n\nIt's not for me, I just invested in some prescription lenses for my goggles-they were only $90 ea compared to $250 ea for my regular glasses.\n\n\n\n\nI know some people who dive with contacts and have no issues with it, nor have I personally heard of anyone having an issue with it, but it's very difficult to get to a hospital from -50ft considering the extra time for safety stops and getting to shore and calling an ambulance and waiting for them to get there if shit really hit the fan. Not trying to fear monger this or anything but it's not worth the risk to me having already once had a contact slip behind an eye.",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Snorkeling has always been fine for me with contacts. If your mask fits properly and there's a good seal, very little water will leak in. When it inevitably does, you can always surface to drain it. Lasik is better obviously, but this is not an all-or-nothing sort of game.",
                    "score": 2,
                    "author": "perfect_for_maiming",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I use contactlenses ",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have terrible vision, and can’t see anything clearly further than 1ft in front of my eyes. But whenever I wear goggles in a pool, I have like 20/20 vision. Is this not the same for everyone?",
            "score": 3,
            "author": "RemarkableRyan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, refraction. ",
                    "score": 2,
                    "author": "Imma_Explain_Jokes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Contacts are great for stuff like this.",
            "score": 3,
            "author": "thegreatbrah",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately my eyes are too sensitive for them :(",
                    "score": 2,
                    "author": "growup_andblowaway",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "/r/NottingHill ",
            "score": 3,
            "author": "rMBP"
        },
        {
            "level": 0,
            "comment": "THANK YOU for not dropping another soda can into another jar! This is an example of what this subreddit should be. ",
            "score": 3,
            "author": "kochatj"
        },
        {
            "level": 0,
            "comment": "Yeah I was gonna say even free diving I still feel pressure. Was hoping u wouldnt say u were gonna try and scuba with then haha. ",
            "score": 2,
            "author": "coastalboy21",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you have a mask and not just goggles you can equalize the pressure by blowing out with your nose. This is a bad idea, but not because of pressure.",
                    "score": 2,
                    "author": "smithsp86",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Blind people problems. Can relate, am blind and glasses 👓 ",
            "score": 2,
            "author": "PatriotCat"
        },
        {
            "level": 0,
            "comment": "The camera lens has better vision through the lenses. ",
            "score": 2,
            "author": "TheRealWizzaard"
        },
        {
            "level": 0,
            "comment": "I have some work goggles that my glasses fit perfectly inside. It’s glorious.",
            "score": 2,
            "author": "_skank_hunt42"
        },
        {
            "level": 0,
            "comment": "I have the vision of a 65 year old man so I’m jelly as hell and I want some. ",
            "score": 2,
            "author": "sonellia"
        },
        {
            "level": 0,
            "comment": "Omg I so need this ",
            "score": 2,
            "author": "viegietjeereana"
        },
        {
            "level": 0,
            "comment": "the best kind of perfect fit",
            "score": 2,
            "author": "newlyfenewme"
        },
        {
            "level": 0,
            "comment": "Wow, considering they had to form a water tight seal, one of the most perfect fits I've ever seen in this sub",
            "score": 2,
            "author": "NotARussianTrollDoll"
        },
        {
            "level": 0,
            "comment": "Damn I take having good vision for granted. If my eyes get bad I’m going to die inside.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I've been trying to set one up and can totally appreciate how awesome that is! So happy for you! 8)\n\nBet you can't wait to see world with the greater ease",
            "score": 2,
            "author": "wildurbanyogi"
        },
        {
            "level": 0,
            "comment": "That's a really pretty photo ❤️",
            "score": 2,
            "author": "KPOP_AND_ANIME_TRASH"
        },
        {
            "level": 0,
            "comment": "Any problems with fogging?",
            "score": 2,
            "author": "Hammock2Wheels",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not really, I treated the goggles with anti-fogging spray and it worked great! After ~1.5 hrs there was a little on the lenses so next time I’ll make sure to treat them as well and I bet that would fix it! ",
                    "score": 2,
                    "author": "growup_andblowaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seeing clearly is one of the most under appreciated things in life. I’ve worn glasses since I was 6 (now much older). The two biggest things for me were getting prescription sunglasses which absolutely blew my mind, and when I got contact lenses. It was such an amazing feeling to be able to see clearly without this fucking hardware stuck to my face. I must admit to getting a touch emotional :)\nYou think you’d get used to glasses but many years on as my sight is getting far worse, I curse them. ",
            "score": 2,
            "author": "iGraveling",
            "replies": [
                {
                    "level": 1,
                    "comment": "I generally don’t mind wearing glasses, but you’re right, people with good vision likely don’t realize how unnerving it see the world blurry.  Fortunately my prescription isn’t too strong (yet), by the prospect of it getting worse is scary.\nI’ve worn glasses since I was maybe 10, and I begged my parents to let me try contacts. I did wear them but they severely irritated my eyes. \n I work in a lab so I can’t wear contacts at work anyway so instead I now have prescription safety glasses, prescription sunglasses and now prescription snorkel mask! Maybe I’d try lasik down the road, have you considered it?",
                    "score": 3,
                    "author": "growup_andblowaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I bought a pair of prescription goggles for swimming, and it was downright amazing. I take part in a big lake swim every summer, and suddenly I could actually see my Dad on the bridge cheering for me. That was cool.\n\nAlso: +1 for the Metric reference",
                            "score": 2,
                            "author": "kenlubin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shhhh. No one tell this person about contact lenses.",
            "score": 2,
            "author": "ahandmadegrin"
        },
        {
            "level": 0,
            "comment": "I see what you did there",
            "score": 1,
            "author": "frankytemps82"
        },
        {
            "level": 0,
            "comment": "Very jealous!!!",
            "score": 1,
            "author": "vortexvagina"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nova Scotia, St Margaret’s Bay",
                    "score": 1,
                    "author": "growup_andblowaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please tell me you flipped them all off? Those slimey little sea suckers",
            "score": 1,
            "author": "tomasmyth"
        },
        {
            "level": 0,
            "comment": "r/parahumans",
            "score": 1,
            "author": "Probablynotspiders"
        },
        {
            "level": 0,
            "comment": "Brilliant!!",
            "score": 1,
            "author": "puppyplants"
        },
        {
            "level": 0,
            "comment": "U are swimming with the fishes in hd ",
            "score": 1,
            "author": "weddle_seal"
        },
        {
            "level": 0,
            "comment": "So I bought my dad a mask from the below link.  Apparently it corrects vision and you see more than people with 20 20 vision and a flat mask.\nhttp://www.hydrooptix.com/ps_45dd_vision_guide.html\n\n Before Lasik I tried super gluing lenses in. I did not wait long enough and felt like someone pepper sprayed my eyeballs from the glue fumes.  Oops",
            "score": 1,
            "author": "RobXIII",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh no!! I hope your eyes were okay! I was going to try taping them in before I found out they fit perfectly! We were looking into prescription masks as well but this one works great so no need to replace it anymore! Hope your dad likes his mask!",
                    "score": 1,
                    "author": "growup_andblowaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why does your mask look like E.T.?",
            "score": 1,
            "author": "chalupabest"
        },
        {
            "level": 0,
            "comment": "I did this too! Except my lenses were still in the frames but the ear pieces fell off. I stuffed them into my mask &amp; it worked far better than my contacts. Now I gotta see if I can find a picture. ",
            "score": 1,
            "author": "einalem13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice! ",
                    "score": 1,
                    "author": "growup_andblowaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "4k Ultra HD live underwater 2 hour footage",
            "score": 1,
            "author": "chizEboi"
        },
        {
            "level": 0,
            "comment": "the thumbnail looks like a westie with sunglasses.",
            "score": 1,
            "author": "Xcelentei"
        }
    ]
}