{
    "id": "141i6dp",
    "score": 1597,
    "title": "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "author": "jospence",
    "date": 1685978925.0,
    "url": "https://www.reddit.com/r/news/comments/141i6dp",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I love how this is an actual quote in the lawsuit:\n\n\"we are operating as a fking unlicensed securities exchange in the USA bro\"\n\nhttps://twitter.com/TheStalwart/status/1665755220175978496",
            "score": 378,
            "author": "JeffreyElonSkilling",
            "replies": [
                {
                    "level": 1,
                    "comment": "From the Big Short: \n\n&gt;Mark Baum:\nI don't get it. Why are they confessing?\n\n&gt;Danny Moses:\nThey're not confessing.\n\n&gt;Porter Collins:\nThey're bragging.",
                    "score": 247,
                    "author": "open_door_policy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My favorite part of this movie is Porter asking Danny if he wanted to go eat at a Cuban place with him. Danny sounded so surprised by it and said yes. What a wholesome moment.",
                            "score": 37,
                            "author": "Vagabond21",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a nice shirt, by the way. Do they make it for men?",
                                    "score": 6,
                                    "author": "Hostillian"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are you taking notes on a criminal fucking conspiracy?",
                    "score": 44,
                    "author": "Vagabond21"
                },
                {
                    "level": 1,
                    "comment": "Is it possible to be a licensed crypto exchange in the US?  (Nope.)",
                    "score": -68,
                    "author": "punchheadkick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That message is evidence of consciousness of guilt. They knew they were supposed to register with the SEC and comply with certain regulations around operating a securities exchange. Senior management chose to not comply with the law. \n\nThis has nothing to do with the novelty of crypto. Just because you’re a new fancy tech does not mean the old rules are suddenly gone. By your logic I could argue that crypto exchanges should be free to discriminate against protected classes because the law protecting against discrimination was written about *banking* and not specifically crypto. Come on man, get a grip. As an aside, I think it’s ironic how the crypto community slowly rediscovers all the lessons from 19th century banking that led us to the centralized system we use today.",
                            "score": 104,
                            "author": "JeffreyElonSkilling",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"*But... We were supposed to be the good guys taking the power away from the bad guys!*\"",
                                    "score": 33,
                                    "author": "SinisterCheese",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"But then we made money doing it.\"\n\n*Nods head in melancholic reflection.* \"Yes. Then we made money.\"",
                                            "score": 22,
                                            "author": "Sonifri"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nah.  The message could be interpreted as \"There should be a law against this.\"",
                                    "score": -38,
                                    "author": "punchheadkick",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No chance. \"We are operating as a fking unlicensed securities exchange\" means they know they are operating a securities exchange. They specifically said the word \"securities\" and not \"crypto\".",
                                            "score": 34,
                                            "author": "JeffreyElonSkilling",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, they know it and it's allowed.  That's fking insane!  Can you believe this?  Why isn't there a law defining cryptocurrency as a security?  Why aren't there laws requiring crypto exchanges to register with the SEC?\n\nThat's what the message meant.",
                                                    "score": -39,
                                                    "author": "punchheadkick",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;Yes, they know it and it's allowed.  \n\nWell, it appears that you are wrong.",
                                                            "score": 3,
                                                            "author": "Actual__Wizard",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Are Coinbase and Gemini not licensed in the US? They seem above-board with respect to regulations and are US-based.",
                            "score": 8,
                            "author": "dak4f2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gemini is moving to Ireland. Wonder why.......\n\nCoinbase is US based, but that makes no difference for the stuff that Binance is going down for.\n\nAll these cryptos are scams at worse and securities at best.\n\nBitcoin is the only exception. There is no second best.",
                                    "score": 8,
                                    "author": "DaVirus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And even bitcoin is currency only for niche areas.",
                                            "score": 12,
                                            "author": "impy695",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "For now. Bitcoin is like \"everyone comes for the profit, but you stay for the revolution\"",
                                                    "score": -23,
                                                    "author": "DaVirus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, but the problem is, the longer things go on without that revolution happening, the less people will want to stick around. I think it had the potential to be what peoppe want it to be, but between being used as an online casino, crypto scams, and all the coins that blew up as memes, I think people see it as a joke. The number of people I've seen caring about it as a tool for change has dropped significantly. I hear more people talking about ethereal as the chosen coin now.",
                                                            "score": 8,
                                                            "author": "impy695",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "https://twitter.com/MitchellHODL/status/1665818936225722368?t=RlpS13QLihKixBjc9vECvw&amp;s=19",
                                                                    "score": -17,
                                                                    "author": "DaVirus",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "He may (or may not, I’m not up to speed enough to say) have good points, but is awfully difficult to take a guy seriously when his twitter tag has HODL in it.",
                                                                            "score": 10,
                                                                            "author": "IamJewbaca"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Ok? That has nothing to do with what I said, but fine, bitcoin doesn't have anything to do with this case. It doesn't change anything I said.",
                                                                            "score": 6,
                                                                            "author": "impy695"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"We've tried, and there's just no way to do it,\" Coinbase chief policy officer Faryar Shirzad told Yahoo Finance in an interview. \"In fact, we submitted a petition with the SEC back in June, where we enumerated the specific issues that the agency would have to resolve for crypto platforms to be able to come in and register.\"\n\nhttps://news.yahoo.com/coinbase-says-just-no-way-to-register-with-sec-amid-calls-for-compliance-161129587.html\n\nCryptocurrency legally is not a \"security\".  The SEC \"believes\" it is, and that's the extent of the legal basis.\n\n&gt; SEC Chair Gary Gensler has made clear he believes the vast majority of cryptocurrencies are securities, based on the Howey Test, which comes from a 1946 Supreme Court ruling in the SEC v. W.J. Howey Co.\n\nhttps://www.forbes.com/advisor/investing/sec-crypto-regulation/\n\nSo without the Supreme Court ruling on it or Congress passing a law specifically for crypto, we're in a limbo state where Gary Gensler gets to decide what is and isn't legal.",
                                    "score": -8,
                                    "author": "punchheadkick",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Let me Google that for Coinbase's CPO lmao. \n\nhttps://www.investor.gov/introduction-investing/investing-basics/glossary/registration-under-securities-act-1933\n\n&gt;The SEC accomplishes these goals primarily by requiring that companies disclose important financial information through the registration of securities. This information enables investors, not the government, to make informed judgments about whether to invest in a company's securities. Here’s an overview of how the registration process works. In general, all securities offered in the United States must be registered with the SEC or must qualify for an exemption from the registration requirements. The registration forms a company files with the SEC provide significant information, including:\n\n&gt; * A description of the company's properties and business;\n&gt; * A description of the security to be offered for sale;\n&gt; * Information about the management of the company; and\n&gt; * Financial statements certified by independent accountants.\n\nNone of that is impossible for a crypto exchange to provide. His quote is ridiculous - how can it be that Coinbase doesn't know the answers to these questions? Last I checked, industry doesn't get to make demands of regulators so the idea of them saying \"clear up these issues and then maybe we'll register \\*teehee\\*\" is absurd. Coinbase is playing games because they don't want regulatory scrutiny. \n\nI work in the insurance industry, which is very highly regulated. I wouldn't dream of making such demands of a regulator - that kind of behavior is a problem. \n\n&gt;So without the Supreme Court ruling on it or Congress passing a law specifically for crypto, we're in a limbo state where Gary Gensler gets to decide what is and isn't legal.\n\nFirst of all, the Supreme Court has already ruled on it. You just cited the case - there's a test and everything! Here are the 3 requirements:\n\n&gt;The first criterion is a financial investment, which means that participants in the transaction must be risking their own money. This comprises both financial and in-kind investments.\n\n&gt;The second requirement is a shared enterprise, which denotes that the financial success of the investors is somehow connected. This can be proven by providing evidence of the investors’ resource pooling or reliance on a third party to manage their investments.\n\n&gt;The third criterion is an expectation of profits solely from the efforts of others, which means that the investors are relying on someone else to generate a return on their investment. This could include, for example, profits generated by a third-party manager or profits generated by the efforts of a particular group or organization.\n\nYou're implicitly making the argument that *all* crypto fails the test and shouldn't be regulated. But if a single token satisfies all 3 requirements then these exchanges are breaking the law. As the quote up top says, management clearly knows that at least 1 token on the platform is a security.",
                                            "score": 15,
                                            "author": "JeffreyElonSkilling",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A lot of people would argue that cryptocurrency is not an investment but rather currency.  The third most certainly doesn't apply to cryptocurrency.",
                                                    "score": -3,
                                                    "author": "punchheadkick",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Come on now. As a crypto enthusiast you must know that not all tokens are currencies.",
                                                            "score": 13,
                                                            "author": "JeffreyElonSkilling",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh I'm not a crypto enthusiast.  It's a stupid technology with no practical implication or purpose.  However, it is intended as a currency even though the reality is it's all speculative bullshit.  \n\nMy point is there should be laws addressing cryptocurrency rather than trying to force it into existing ones.  That's probably true for most of the Internet to be honest.  We prosecute Internet crimes as \"phone crimes\" because the Internet used to be over phone lines, and we have essentially no regulations of any Internet companies unless we can make some old law fit close enough.",
                                                                    "score": 1,
                                                                    "author": "punchheadkick"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Meanwhile, the rest of the world measures the value of their crypto holdings in their local currency denomination. The theory that it’s currency doesn’t match the reality that you can’t readily exchange it for goods and services. It’s a chicken-and-egg scenario for crypto, but we already have chickens. And eggs.",
                                                            "score": 3,
                                                            "author": "nDQ9UeOr"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "A lot of people are idiots. The value is not stable enough (never will be) to be very useful as a currency. Most of them are also inherently deflationary which incentives hoarding for profit.",
                                                            "score": 3,
                                                            "author": "jschubart"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Found CZ alt account",
                            "score": 2,
                            "author": "luffy1301"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "These are the guys who passed on buying FTX because FTX was too shady, right?",
            "score": 86,
            "author": "c53x12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not that it was too shady but that the government was already looking into them, didn’t want to shine the spotlight onto themselves.\n\nWhich doesn’t work out well when you go out in public and announce your plans to commit crimes.",
                    "score": 28,
                    "author": "ponbern"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's almost like every single one of those crypto exchanges is just an enabler for scam artists and memelords.",
            "score": 268,
            "author": "MyOldUsernameSucked",
            "replies": [
                {
                    "level": 1,
                    "comment": "CZ has sealed indictment for Iran sanctions violations too",
                    "score": 59,
                    "author": "SpaceTabs"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 52,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Spam is going to go into overdrive",
                            "score": 21,
                            "author": "DepletedMitochondria",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 16,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "would not surprise me. These \"AI\" things are just spam machines",
                                            "score": 4,
                                            "author": "DepletedMitochondria",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Great for helping with my D&amp;D prep though. Need a description of a village for my players? Write in a little bit about the town and boom.",
                                                    "score": 6,
                                                    "author": "AstreiaTales",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well yes... that is what it is supposed to be. Another tool for people to use in the work. \n\nI did few easy courses on AI applications as part of my engineering degree, even though I am a mechanical engineer. Because... Why the fuck not easy points and interesting topic.\n\nAnyways. There the people at the very frontier of the field talked about the actual *boring* applications: \n\nYou got a spreadsheet and you want to ask a question about it instead of doing the long work of analysing it manually? Well... AI can do that for you - but you still need to know what question to ask.\n\nTechnical reports are done in very rigid and standardised language. Instead of you spending time typing this out, what if you dictate the facts and information and have the AI format it out for you. You still need to know what information and facts to give. Meaning that engineers can actually focus on the engineering instead of technician level work. \n\nDo you need to search a massive library but only have a vague idea what it is you are looking for? What if an AI has read through all the books of the library and can find what you are looking for you? As in... **what we for a long time had professional librarian do for us.** Librarian actual job is to find information - many libraries still have a service like this where someone will find a book for you. University libraries are still like this, where they find the book for you if you need citations or find the source material for you according to a citation.\n\nMy friend is doing a doctorate at this moment, and they use chatgdp all the time to find clues and threads to chase. Once I introduced them to it, it basically became widespread in the department they work in. You aren't supposed to take stuff at face value straight from it, but you can get clues about where to go get information. And they have **actually found notable and significant material with it** for their actual Phd work.\n\nLook. I'm an engineer and before that I was a fabricator. I had many tools for welding and fabrication work. Now in Engineering the AI is just another tool for me to use which will allow me to focus on the engineering side of things and be more efficient on it.",
                                                            "score": 8,
                                                            "author": "SinisterCheese",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; You got a spreadsheet and you want to ask a question about it instead of doing the long work of analysing it manually? Well... AI can do that for you - but you still need to know what question to ask.\n\nidk, sometimes this feels like pulling nails\n\nfor instance, I just wrote a table of 33 encounters for this place my players are going to. However, I put all the hazards at the end since I thought of them last, so I asked chatgpt \"please rearrange this list\". \n\nIt still hasn't done it correctly.",
                                                                    "score": 3,
                                                                    "author": "AstreiaTales",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Ok... You aren't understanding what I mean. Mainly since we speak in totally different magnitudes of scale.\n\nI work with spreadsheet with **thousands** of rows of data with tens to hundreds of columns. It is easier and quicker to learn to do simple VBA or python scripts to process this than to do it manually. (Which mind you as a mechanical engineer who's speciality is in practical side of things, is not in my realm of knowledge or interests).\n\nWhen I have to track weld filler use and batch IDs for ISO standardised documentation for a project that can span year or two along with who what and when. The sheer volume of data along with other duties I might have at the same time makes this impossibly impractical and inefficient.\n\nHowever if I could just tell an AI via my phone to add this and that to the sheet, then also give me answer to what and who with a simple chat message to my own computer. I would be able to focus on doing engineering and not data entry. And I have very little interest in becoming a software developer so I can do my job properly - especially when I am not paid to do such development work.",
                                                                            "score": 3,
                                                                            "author": "SinisterCheese"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; a lot of shitty self-published books that can't be copywrited.\n\nThere are already a ton of awful ebooks. More bottom tier content is only going to make finding other bottom tier content difficult. It won't be drowning out people that actually put time in. \n\nAs for the rest. I do think we will see a shift representative of losing access to a single \"testing\" method (testing as in a general test of ability), but it will be replaced by something else. It's not the first time we've had to adapt education techniques due to new technology, and it won't be the last. Hell, it's not even the biggest. So far none of them have been true and we've adapted. In a lot of cases the new technology ended up fitting perfectly and actually improving education even if it happened later than it should.",
                            "score": 8,
                            "author": "impy695",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey now, there is plenty of bottom tier content produced by people trying their best. They just will get further drowned out by the AI garbage.",
                                    "score": 12,
                                    "author": "IamJewbaca"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's concerning to witness regulatory violations by these exchange. It's difficult to differentiate between responsible exchanges and those that fall short. That's why self-custody wallets metamask, trustwallet and solutions like oreid continue to play a crucial role towards widespread adoption of crypto.",
                    "score": -3,
                    "author": "Ok-Western-5799",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You seem generally into crypto and so I'm going to ask you an unrelated question as an outsider, what do you see crypto being used for in a 5-year timespan?",
                            "score": 2,
                            "author": "SnowyBox"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought Binance didn't operate in the US why is the photo CZ?",
            "score": 8,
            "author": "Raptorheart",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Binance.com](https://Binance.com) isn't supposed to be used by people in the US, but [binance.us](https://binance.us) can.",
                    "score": 9,
                    "author": "uncoolcat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crypto will go down as the biggest scam in human history in terms of both the sheer number of people involved as well as the amount of wealth transferred from victim to perpetrator.",
            "score": 177,
            "author": "TurboSalsa",
            "replies": [
                {
                    "level": 1,
                    "comment": "It wasn’t one of the biggest. Just one of the most novel.",
                    "score": 28,
                    "author": "BlindWillieJohnson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it really that novel? It's just the stamp vouchers Mr. Ponzi used back in the day, *but digital*.",
                            "score": 4,
                            "author": "FuzzyBacon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The tech was novel. The structure was a classic Ponzi scheme, but the tech was novel.",
                                    "score": 2,
                                    "author": "BlindWillieJohnson"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Organized religion would like a word",
                    "score": 103,
                    "author": "dratseb"
                },
                {
                    "level": 1,
                    "comment": "Uber driver here. couple years ago I would pick up one of these crypto bros; the conversation would turn toward crypto; they would ask \"what do you think about it\". I would say \"you don't really want to know\"; they would say \"no please, indulge me\". \n\nI would dissect the topic in several of the usual ways (it was never backed by anything real, just hype and FOMO; it's neither a store of value nor a handy medium of exchange; the blockchain is a solution in search of a problem; etc). And invariably the crypto bro would get nervous and be like \"wait a minute, I'm just not explaining this well.\" I was like \"no I understand every word you're saying; it's just that every premise that crypto is built on is bullshit.\"\n\nThe only response they had left was \"well then why does crypto keep rising and rising?\" To which I said \"cheap money, full stop. When the low-interest-rate party ends, so will crypto.\" Boy they sure didn't like hearing that. But I did warn them that they wouldn't want to   XD",
                    "score": 23,
                    "author": "AintEverLucky",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And then everyone clapped?",
                            "score": 18,
                            "author": "WeeniePops",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Uber drivers name? Albert Einstein.",
                                    "score": 12,
                                    "author": "nrq",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I wonder how many other financial market experts drive Uber.",
                                            "score": 4,
                                            "author": "WeeniePops"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wait until you hear about organized religion",
                    "score": 2,
                    "author": "DJ_Crunchwrap"
                },
                {
                    "level": 1,
                    "comment": "Here goes le reddit cirlcejerk again. Crypto is just a technology.\n\nGreedy idiots will always find ways to lose their money.",
                    "score": -72,
                    "author": "qsdf321",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A technology with no obvious uses after 14 years in the wild. Well, aside from relieving suckers of their money.",
                            "score": 78,
                            "author": "TurboSalsa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "StIlL eArLy",
                                    "score": 15,
                                    "author": "Cybertronian10"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thousands, millions, and billions of dollars are regularly transfered in seconds all around the world. If you're in a country with hyperinflation and weak currency, crypto is a Godsend. My BIL from Venezuela bought .5 BTC back in 2015 with a month's wage rather than save it in the Bolivar or USD. Sold it for around 25k in '21 when he emigrated and has a new car to show for it.\n\nBut sure, Crypto has no use.",
                                    "score": -56,
                                    "author": "rationis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So cryptos use is as a speculative investment?\n\nDoes that make beanie babies, star trek action figures and tulips \"useful\"?",
                                            "score": 40,
                                            "author": "terminalzero",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "At least you can play with beanie babies and action figures and tulips smell nice",
                                                    "score": 20,
                                                    "author": "WeArePanNarrans"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 29,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can beanie babies be transferred across the ocean at the speed of light as part of a decentralized global ledger?",
                                                    "score": -23,
                                                    "author": "Comar31",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "can bitcoins be shaken in front of a child's face to make them stop crying?\n\nalso - [can bitcoins be transferred across the ocean at the speed of light?](https://ycharts.com/indicators/bitcoin_average_confirmation_time#:~:text=Bitcoin%20Average%20Confirmation%20Time%20is,K%25%20from%20one%20year%20ago.)",
                                                            "score": 17,
                                                            "author": "terminalzero",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;can bitcoins be shaken in front of a child's face to make them stop crying?\n\nNo and how is that important?\n\n&gt;also - can bitcoins be transferred across the ocean at the speed of light?\n\nYes, if you ever sat down for 5 minutes to actually study bitcoin instead of comparing it to tulips and beanie babies you would have learned about the lightning network.",
                                                                    "score": -13,
                                                                    "author": "Comar31",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt; No and how is that important?\n&gt; \n&gt; \n\nsame question about a distributed ledger without additional utility\n\n&gt; you would have learned about the lightning network.\n\noh, so not actually bitcoin, opening yourself up to either counterparty fraud or requiring centralization through watchtowers, and still not at 'the speed of light' even after opening the channel, which takes as long as a normal bitcoin transaction?",
                                                                            "score": 11,
                                                                            "author": "terminalzero",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt;same question about a distributed ledger without additional utility\n\nNo additional utility? You should read Alex Gladstein. He has published tons of material on how bitcoin is helping the unbanked. That's just one example. It has the potential to wreck bloodsucking third parties like western union.\n\n\n\n&gt;\nyou would have learned about the lightning network.\n\n&gt;oh, so not actually bitcoin, opening yourself up to either counterparty fraud or requiring centralization through watchtowers, and still not at 'the speed of light' even after opening the channel, which takes as long as a normal bitcoin transaction?\n\nActually bitcoin. A lightning channel is between nodes, which are decentralized and on chain. You can run your own.",
                                                                                    "score": -10,
                                                                                    "author": "Comar31",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You can't tout global decentralization without also acknowledging the unsustainable energy consumption required to operate it. \n\nEach Bitcoin transaction consumes over 1.5 million times more energy than a standard Visa one. 1.5 million. Do you wanna know why global adoption can't happen? Because if even a quarter of the world fully adopted Bitcoin for all their currency needs, the power needed to operate the network would start to exceed the global supply of ALL the energy produced by the world.\n\nFortunately, Bitcoin is so shitty it can't handle more than 7 transactions per second. Our salvation from Bitcoin's apocalyptic energy consumption is it's insanely shitty throughput ...\n\nBut yes tell me more about how Bitcoin is the future of finance lol",
                                                            "score": 5,
                                                            "author": "DKMuppy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yet another one who never heard of the lightning network",
                                                                    "score": 1,
                                                                    "author": "Comar31",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah because that's what Bitcoin's workflow needs - more steps and greater complexity. Oh and also you need to forfeit security and the system is no longer trustless which was the whole point of Bitcoin to begin with ... I wonder why LN hasn't seen any meaningful adoption in the last 5 years outside of theoretical white papers?\n\nPointing to an L2 solution that compromises the core tenets of BTC to try (and fail) to achieve viability is not the 'win' you think it is",
                                                                            "score": 1,
                                                                            "author": "DKMuppy",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The ease of access to the lightning network is on a whole different level compared to parasitic companies and institutions. It's a huge win for the unbanked and underbanked.",
                                                                                    "score": 1,
                                                                                    "author": "Comar31",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You're just describing gambling. Gambling is always wonderful if you're winning.",
                                            "score": 38,
                                            "author": "HowManyMeeses"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Uh huh.",
                                            "score": 23,
                                            "author": "TurboSalsa",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea, that's what I thought. Ever heard of Fednow? Metal Blockchain? See, while you all are claiming it's a scam, the Fed is going to start using the tech.",
                                                    "score": -40,
                                                    "author": "rationis",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So this is...good for bitcoin?",
                                                            "score": 20,
                                                            "author": "TurboSalsa"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol. What a band aid solution. You don't need crypto or blockchain for that. The US banking system is like 20 years behind the curve",
                                                            "score": 3,
                                                            "author": "Ichabodblack"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Cool anecdote, bro.",
                                            "score": 14,
                                            "author": "Theemuts"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No one seems to be addressing your first sentence.",
                                            "score": -6,
                                            "author": "1833432",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Of course not. They have no rebuttal. \"Because I don't use crypto, it must be a scam!\" Meanwhile, I've supported my MIL in Venezuela with XRP for the past two years.",
                                                    "score": -12,
                                                    "author": "rationis"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If it had no obvious uses it would never have survived for so long.",
                                    "score": -44,
                                    "author": "qsdf321",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's definitely useful for money laundering, the drug trade, and murder for hire.",
                                            "score": 38,
                                            "author": "TurboSalsa",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "To be fair, those are all future proof",
                                                    "score": 5,
                                                    "author": "thedeathmachine",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Unless you got murdered by a drug dealer accusing you of laundering money you stole trom them.",
                                                            "score": 1,
                                                            "author": "alborigano"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Lol. You don’t read a lot of history, do you? There’s a lot of things that survived longer that they should have because they were nothing but speculative vehicles.",
                                            "score": 23,
                                            "author": "BlindWillieJohnson"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's gotta be the worst argument I've ever heard. \n\nThat's like saying \"Bernie Madoff's investment advisory business must be legitimate because it's been around for 30 years! If it was fraud, it would not have survived that long\"",
                                            "score": 18,
                                            "author": "DKMuppy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's very relevant to note that ponzi scheme was ignored by the SEC and only ultimately prosecuted because his sons forced him to confess. The SEC had no choice but to act, though they retroactively claim they were proactive. The truth is they cast a blind eye over years of evidence and appeals from market participants.\n\nWhy is crypto different? The SEC doesn't have a revolving door with the crypto industry like they do Wall Street, so it's the perfect thing for them to move on to make the public think they're being protected while the big sharks continue their silent swim.",
                                                    "score": -8,
                                                    "author": "Iconoclastices",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;Why is crypto different?\n\nIt's not different at all. SEC is equally slow to move against known fraud in the Crypto space whether that be Celsius, FTX, 3AC, Voyager, Gemini, Terra/Luna, etc... Hell, everyone knows Tether isn't fully backed and yet the SEC just sits on its ass.\n\nThe only thing slower than the SEC is the DMV ...",
                                                            "score": 7,
                                                            "author": "DKMuppy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;SEC is equally slow\n\nMadoff's scheme was on the go for ~20 years, longer than crypto has existed, using market mechanics the SEC should understand intimately. And again, they did *nothing* of their own volition in that case - there was a straightup confession from family.\n\n&gt;FTX\n\nThere is a very distinct reason FTX wasn't moved against and it's failure has spurred all subsequent action from the SEC. Look into Gary Gensler's meetings with SBF if you're interested.",
                                                                    "score": 0,
                                                                    "author": "Iconoclastices",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Fair enough. FTX definitely has a lot of shady relationships going on. But if anything that only further contributes to the idea that “Crypto isn’t being treated differently”",
                                                                            "score": 2,
                                                                            "author": "DKMuppy",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I don't see how a\n- much newer tech/industry,\n- the SEC staff shouldn't be as familiar with,\n- that is being bombarded with suits (Coinbase, FTX *after* failing, XRP with the SEC's shenanigans being called out by the judge, as well as others)\n\nis comparable to a traditional finance ponzi scheme which the SEC were repeatedly warned about over a ~10 year period, that ran for ~20 years, and they only did anything after a confession to the FEDs, is similar. \n\nBut if you really believe that, best to leave this discussion here.",
                                                                                    "score": -1,
                                                                                    "author": "Iconoclastices",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Found the bag holder.",
                                            "score": 16,
                                            "author": "VampireNibbles"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Name a use",
                                            "score": 5,
                                            "author": "Ichabodblack",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Triggering reddit smartasses.",
                                                    "score": 1,
                                                    "author": "qsdf321",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Any use. Name one. This is a real softball question...",
                                                            "score": 7,
                                                            "author": "Ichabodblack"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Any use at all buddy. You got this",
                                            "score": 1,
                                            "author": "Ichabodblack"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Dude lives in a bubble. Even the Fed is getting in on it. Fednow is being rolled on the Metal Blockchain, but no, crypto has no use!",
                                            "score": -24,
                                            "author": "rationis",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That the Fed is getting involved in your unusable speculative vehicle isn't proof that it's not an unusable speculative vehicle. In fact, the Fed over the years have been involved in a whole lot of things that were just pointless speculative vehicles. If you don't believe that, explain to me what the point of a synthetic CDO was, apart from a thing Wall Street assholes could gamble on.",
                                                    "score": 8,
                                                    "author": "BlindWillieJohnson",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;If you don't believe that, explain to me what the point of a synthetic CDO was, apart from a thing Wall Street assholes could gamble on.\n\nThe irony is that Bitcoin constantly proclaims to be a reactionary response to the reckless gambling going on in Wall Street when in reality, Bitcoin is just the newest iteration of speculative gambling ... only this time it has fun tech gimmicks that consume inordinate amounts of energy!",
                                                            "score": 9,
                                                            "author": "DKMuppy"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If you know of another way to directly and securely transfer $2 billion in value anywhere in the world inside of 15 minutes for under a dollar, let me know. https://cointelegraph.com/news/bitcoin-worth-2-billion-moves-for-just-78-cents",
                                    "score": -1,
                                    "author": "RecipeNo101",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not an oligarch or in a cartel so I've never needed to do that.",
                                            "score": 3,
                                            "author": "thwack01",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I guess no other organization over the size of an individual has ever needed a fast and secure solution for transferring large amounts of value globally. Only oligarchs and cartels. No possible utility for anything of any smaller quantity, either, nope. We also definitely support big banks and their fees.",
                                                    "score": 0,
                                                    "author": "RecipeNo101",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You can move large amounts of value globally without crypto. How do you think Coca Cola moves money from one part of the world to another?",
                                                            "score": 2,
                                                            "author": "thwack01",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "How often do you need to do that?\n\nYou realise the fact that it's cheap isn't to do with technology but the fact it's going to be bypassing all border laws right?\n\nBitcoin is only capable of 7 transactions a second. You're not going to be getting many of those transfers done now are you?",
                                            "score": 1,
                                            "author": "Ichabodblack",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you want to claim Bitcoin can only do 7 transactions a second, then by the same logic Visa only does a couple thousand a day, under 2 per second.\n\nOr maybe you don’t know how either of them actually works?",
                                                    "score": 1,
                                                    "author": "7366241494",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;If you want to claim Bitcoin can only do 7 transactions a second, \n\nErm, how are you claiming that Bitcoin exceeds that limit given the difficulty adjustment to a 10 minute average and the transaction block size? Happy to see your maths which shows it is considerably more.\n\n&gt;then by the same logic Visa only does a couple thousand a day, under 2 per second.\n\nVisa, demonstrably, every single day performs thousands of transactions a second.\n\n&gt;Or maybe you don’t know how either of them actually works?\n\nGoing to have to see your numbers before you realise it's the opposite champ",
                                                            "score": 2,
                                                            "author": "Ichabodblack",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Bitcoin’s Lightning Network works similarly. Lightning transactions are debits against a Lightning node, which rolls up aggregated transactions to finally settle their net positions on the Bitcoin blockchain. Lightning does this every ten minutes instead of overnight, provides stronger guarantees of creditworthiness, and costs much less than the credit card merchant fees.",
                                                                    "score": 1,
                                                                    "author": "7366241494",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Lightning has fundamental security flaws which cannot be addressed, they are literally part of the design.\n\nIt also requires that someone else has funded a channel *AND* that you have a route to the destination - which isn't guaranteed.",
                                                                            "score": 0,
                                                                            "author": "Ichabodblack"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Binance bank run coming soon. \n\nInb4 ftx 2 crypto boogaloo",
            "score": 26,
            "author": "iberico_ham",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sigh, I'm going to need to move back to localbitcoins and their stupid fees to send money to my bananarepublic of a birth country......",
                    "score": 3,
                    "author": "guareber",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or you know you could just not use bitcoin like a normal person. I bet there is s different option that Is both faster and cheaper.",
                            "score": 2,
                            "author": "iberico_ham",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, there's definitely no cheaper option.  Probably not faster either, but Binance is widely used in said banana republic due to it being the biggest no-fees crypto exchange. If there was, I'd use it in a heartbeat. I've been sending money back home for a decade now, and I've switched methods a few times thanks to fucked up currency-exchange-control laws.\n\n\nI'm no crypto-bro, I hold 0 crypto assets, I literally use it as a 3rd world Transferwise. The alternatives just suck worse.",
                                    "score": 4,
                                    "author": "guareber"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s about time. Binance is just Chinese FTX.",
            "score": 2,
            "author": "TheFan88"
        },
        {
            "level": 0,
            "comment": "How is it that Gensler said in 2021 \"right now the exchanges trading in these crypto assets do not have a regulatory framework either at the SEC, or our sister agency, the Commodity Futures Trading Commission, that could instill greater confidence. Right now, there is not a market regulator around these crypto exchanges, and, thus, there is really not a protection against fraud or manipulation.\" And now he's exercising authority over Binance.\n\nHe can't have it both ways. Either the SEC has jurisdiction here or they don't.\n\nhttps://www.govinfo.gov/content/pkg/CHRG-117hhrg44837/pdf/CHRG-117hhrg44837.pdf",
            "score": 2,
            "author": "gaxxzz"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;I don't even like crypto, but having zero exposure seemed worse somehow\n\nOfficially the stupidest thing I've read on the internet today and there was some stiff competition",
                    "score": 9,
                    "author": "Ichabodblack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The same has been said by many about every novel industry, from motorized cars to personal computing. An extremely small amount of exposure to fringe securities is not a bad idea.",
                            "score": 2,
                            "author": "RecipeNo101",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's a 100% speculative asset.\n\nDo you also allocate some of your portfolio to Beanie Babies?",
                                    "score": 4,
                                    "author": "Ichabodblack",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes I did back in the day when I thought it was going to blow up.\n\nP.S. it did blow up for about a week and I missed my chance.",
                                            "score": 1,
                                            "author": "MENNONH"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes, I'm aware. New sectors, whether they survive or not, are inherently speculative. That's why exposure to speculative assets should be an extremely small part of a balanced portfolio.\n\nCan I securely transfer $2 billion in value of beanie babies anywhere in the world inside of 15 minutes for under a dollar? https://cointelegraph.com/news/bitcoin-worth-2-billion-moves-for-just-78-cents",
                                            "score": -2,
                                            "author": "RecipeNo101",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As I posted elsewhere this is an absolutely asinine claim. For these reasons:\n\n1) There's probably 5 people in the entire world who have a need for transferring billions between countries.\n2) You ignore all of the onboarding and offboarding costs. You are not sending 2Bn USD without this.\n3) The difficulty of transferring between countries isn't technological it is legislative. You are ignoring of the legal requirements of source and destination country - which all adds costs.\n4) Bitcoin is limited to 7 transactions per second. Good luck onboarding anyone other than your single lone Billionaire.\n\n&gt;Yes, I'm aware. New sectors, whether they survive or not, are inherently speculative.\n\nIt's not new. It's 14 years old. 14 years and still sees next to zero real world usage",
                                                    "score": 5,
                                                    "author": "Ichabodblack",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Do you even diversify? I'm out here getting called stupid as though I have to justify my investment decisions to strangers online. Thanks for that. Good luck with your quest to read stupid things, I guess.",
                            "score": 1,
                            "author": "dctucker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely I diversify.\n\nBut I would never load up on tulips, beanie babies, Bitcoin or any other 100% speculative asset",
                                    "score": 1,
                                    "author": "Ichabodblack"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "SEC just wants a cut, not stop financial crime.",
            "score": -15,
            "author": "Previous-Bother295"
        },
        {
            "level": 0,
            "comment": "As a bisexual i cant believe the United States government is banning us from finance \n#Free🅱️ig🅱️inance",
            "score": -17,
            "author": "swibnio"
        },
        {
            "level": 0,
            "comment": "There are US crypto rules?  That's news to me!  Does Congress know?",
            "score": -30,
            "author": "punchheadkick",
            "replies": [
                {
                    "level": 1,
                    "comment": "They intentionally subverted laws intended to prevent money laundering/terrorism which is the issue here. Scamming people with crypto is still safe lmao",
                    "score": 42,
                    "author": "angiosperms-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which is my point.  It's ridiculous to hold any of these exchanges accountable because Congress has yet to make any rules regarding crypto.  Instead the SEC and IRS are acting with impunity, which also means they can decide whatever the fuck they want and go after whoever they want (with valid reasons or not).  Until there are actual rules on the book, it's the Wild West and the marshals are just a bunch of Earps shooting people they don't like the look of.",
                            "score": -26,
                            "author": "punchheadkick",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are actual rules on the book, especially around securities. They've been repeatedly warned too. Every time they got a warning they'd say there was a lack of clarification and continue doing the things they specifically told not to do.   The \"US has no idea what they are doing with crypto\" excuse is just bullshit they kept spewing to keep people from pulling their money.",
                                    "score": 30,
                                    "author": "mrdilldozer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There are no legal rules.  There are \"guidelines\" (whims, at best) put out by the SEC and IRS, but they don't get to make laws so we shouldn't treat their words as anything more than they are.",
                                            "score": -14,
                                            "author": "punchheadkick",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But when the agents come to arrest the executives and seize assessts, those words become real. That's sort of the threat of the SEC.",
                                                    "score": 7,
                                                    "author": "AboveBoard",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm not saying there aren't legal threats.  I'm just saying those legal threats are not legally sound.  If Binance faces a legal action over this (as seems to be the case here), it will likely go up to Supreme Court to decide.  Just because the police perform a search, arrest or seizure, though, doesn't make it lawful or right.  That's why we have a court system in the first place.",
                                                            "score": -2,
                                                            "author": "punchheadkick"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The rules are already in place. Binance is simply trying to argue that the rules don't apply to them (because they aren't a security) while secretly admitting \"yeah the rules definitely should apply to us\" (because they are a security).\n\nThe thing is, this isn't the wild west, it's a developed metropolis with rules clearly posted and Binance is the drunk, homeless guy firing wildly into the air saying \"this is the wild west\"",
                                    "score": 8,
                                    "author": "DKMuppy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Care to cite the law passed by the US Congress?",
                                            "score": -1,
                                            "author": "punchheadkick",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Securities Act of 1933 for starters",
                                                    "score": 14,
                                                    "author": "DKMuppy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That only applies to securities.",
                                                            "score": -3,
                                                            "author": "punchheadkick",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The SEC and Binance would tell you that they are 100% securities.",
                                                                    "score": 15,
                                                                    "author": "DKMuppy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "In America, we don't let the Executive Branch or private companies make or interpret the law.  So if they believe that, they should tell Congress, not me.",
                                                                            "score": -5,
                                                                            "author": "punchheadkick",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You're mistaken. The Executive Branch interprets laws all the time in the course of executing the duties of its office. But the Judicial Branch has final authority on interpretation of the law and can override and limit executive authority. So if this truly is overreach, the Supreme Court could overrule the SEC. But that seems highly unlikely when both parties to the action (SEC and Binance) both agree that it's a security ...",
                                                                                    "score": 10,
                                                                                    "author": "DKMuppy"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You seem desperate. How down are you?",
                                                                                    "score": 8,
                                                                                    "author": "Ichabodblack"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "KYC laws are established laws that all places selling securities must follow. Binance was aware of this and put a bunch of workarounds in place to keep allowing people in the US to use their platform. It's not them doing \"whatever the fuck they want\"",
                                    "score": 17,
                                    "author": "angiosperms-",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What law makes cryptocurrency a security?",
                                            "score": -3,
                                            "author": "punchheadkick"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://twitter.com/MitchellHODL/status/1665818936225722368?t=RlpS13QLihKixBjc9vECvw&amp;s=19",
            "score": -14,
            "author": "DaVirus"
        }
    ]
}