{
    "id": "142tmmp",
    "score": 482,
    "title": "Ethan Orton, teen who brutally killed parents in Cedar Rapids, Iowa, sentenced to life in prison",
    "author": "ArmandNinja",
    "date": 1686086412.0,
    "url": "https://www.reddit.com/r/news/comments/142tmmp",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; Orton told investigators at the scene that he killed his parents to \"take charge of my life.\"\n\nWhelp, dude has no charge over his own life now, and has instead just thrown it all away.",
            "score": 131,
            "author": "Dalisca"
        },
        {
            "level": 0,
            "comment": "&gt;Forensic psychologist Tracy Thomas, who holds a doctorate in clinical psychology, testified that Orton sought acceptance and validation from his parents but felt rejected by them, according to KGAN-TV. Thomas said Orton killed them after he received an email from Slade that she and his father wouldn't be a part of Orton's life after he turned 18, according to the station.\n\nTelling irrational teenagers \"so long get fucked never contact us again\" probably ain't the smartest thing.\n\nParenthood doesn't just end after 18 years, especially in the current economic climate.",
            "score": 222,
            "author": "Levonorgestrelfairy1",
            "replies": [
                {
                    "level": 1,
                    "comment": "In general, I agree. On the other hand, since this teen believed brutally murdering them was a reasonable response to that, I wonder if the parents didn't have specific hang ups about him. (Which they presumably failed to deal with for whatever reason)",
                    "score": 131,
                    "author": "illy-chan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thinking about it from a teenagers pov, mom and dad kicking you out no contact probably means homelessness, for a lot of them they'd see their lives already over.",
                            "score": 90,
                            "author": "Levonorgestrelfairy1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, but I don’t see how that leads someone to murder",
                                    "score": -41,
                                    "author": "Donut_of_Patriotism",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People are most dangerous when they feel they have nothing left to lose.",
                                            "score": 109,
                                            "author": "Levonorgestrelfairy1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, but still murder?",
                                                    "score": -69,
                                                    "author": "Donut_of_Patriotism",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You’re trying to rationalize something that is irrational.",
                                                            "score": 56,
                                                            "author": "UniqueMeasurement161"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "at least he's not homeless?",
                                                            "score": 21,
                                                            "author": "wrath_of_grunge"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "What does murder mean to you? \n\nYou're implying some level of common value and judgment that just isn't universal to human experience beyond maybe a fear of reprisal from the legal system which has its own subjective valuation of cost, benefits, and risks. \n\nMurder is a term already loaded with history and connotation, but there are more neutral understandings of violent death.\n\nWhat if we used the word killed, executed, slayed/slaughtered, or referred to the parents as  casualties? These are all terms that diminish blame, agency, and the value of the object that we use on a regular basis to excuse or sanctify violence.",
                                                            "score": 11,
                                                            "author": "AymRandy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dad slain with knife, mom slaughtered with ax after killer realized she survived stab wounds still sounds pretty brutal.",
                                                                    "score": 1,
                                                                    "author": "overlord7517",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You're right, but I think this only reflects a very specific societal aversion of violence/homicide. My use of slain and slaughter was in the sense that is reserved for beasts or animals, a neutral kind of violence. \n\nMy original point is that murder is a very charged word, implicit with a moral or legal judgment and I wanted to understand the basis for the commenter's insistence of this word.",
                                                                            "score": 1,
                                                                            "author": "AymRandy"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Did the teen kill them in self defense? I wasn't there but all public knowledge of the incident doesnt seem to point to that. They definitely were not enemy combatants, and he wasn't a doctor giving treatment that went abadly. The only remaining option is murder. He murdered them.",
                                                                    "score": -15,
                                                                    "author": "Donut_of_Patriotism",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I see. Thanks for replying. This is part of my own fascination with societal and personal justifications and condemnations of homicide.",
                                                                            "score": 7,
                                                                            "author": "AymRandy"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Unless you’re severely mentally ill, you don’t just wake up one morning and decide to kill your parents. Either something’s wrong with the guy, or they abused him.",
                            "score": 16,
                            "author": "KulaanDoDinok",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If they were ready to abandon him and not be a part of his life at 18 I'd say he was probably abused.  Maybe not physically, but certainly mentally.  I've never met 'caring loving' parents who say they're completely done with their kids once they hit 18.",
                                    "score": 24,
                                    "author": "WalkerBRiley",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have. It’s almost always a situation that involves younger children in the household, and violent/oppositional tendencies of the older boy (pretty much always a boy) who has caused enough destruction and fear to cost their families tons of money if not the literal roofs over their heads. \n\nAnd since they have younger kids to consider the safety and stability of- they kick out the problem kid once they legally can.\n\nIt goes without saying that these are never wealthy people. Always working class barely making it types. They just don’t have the resources to deal with all of it, or recover from the financial disasters the kid causes multiple times.",
                                            "score": 4,
                                            "author": "Lady_DreadStar"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He was a child.\n\nHis parents bear the majority of the responsibility in this case.",
                            "score": -41,
                            "author": "reflect-the-sun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The parents that were murdered bear majority of responsibility for being murdered? Yeah no. Teenagers are old enough and mature enough to know the consequences of murder and know it’s wrong.",
                                    "score": 38,
                                    "author": "Donut_of_Patriotism",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sure, normal teenagers who were taught right from wrong and/or aren’t mentally ill do know it’s bad to murder. Normal teenagers also don’t murder their parents so obviously something else is up here.",
                                            "score": 17,
                                            "author": "Shamewizard1995",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Every issue a child/person has is not automatically the fault of the parents.",
                                                    "score": 2,
                                                    "author": "upgrayedd69"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I don’t really buy mental illness as an excuse for murder. Not being taught right from wrong may explain that, however given how even the most negligent parents usually still find a way to teach that lesson I’m hard pressed to believe that’s what happened here. I’m not saying it definitely didn’t I’d just need a lot more proof.\n\nI do agree something is up. Most parents do just cut off their kids financially AND cut off all contact, not even wanting to see their kids ever again. I mean that’s a very big deal, even for shitty parents. Given the fact he then murdered them? I mean this is speculation but to me it sounds like the parents knew their son was a whack job, maybe they knew he was a psychopath. Hard to say but they gave up on him and didn’t want anything to do with him for what sounds like a good reason.",
                                                    "score": -18,
                                                    "author": "Donut_of_Patriotism",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It’s not an excuse, it’s an explanation.",
                                                            "score": 27,
                                                            "author": "Wizzenator"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You don't *buy* mental illness as an excuse for murder? Of course it isn't an excuse but it can definitely lead to and directly cause it to occur. It is real whether you want to believe it or buy it or not. Just because your parents weren't negligent monsters doesn't mean negligent monstrous parents don't exist, and mental illness isn't something you can really understand unless you've experienced it first or second hand (or have studied it for years). Just because some parents are capable of teaching their kids empathy doesn't mean every parent has that ability and not every child has the same sanity or capacity to feel empathy as you've been blessed with. Turns out things happen whether you buy them or not! Brains are funny that way.",
                                                            "score": 10,
                                                            "author": "awfulachia"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Your black and white view of the world must be comforting to you.  It's nonsense,  but comfortable, I imagine.",
                                            "score": 2,
                                            "author": "MetaJonez",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I’m not changing my “black and white” view that murder is bad. I was an edgy teenager once and even then I could never justify murder. And as a former teenager I can say with absolute confidence that teenagers are mature enough to know to not murder.",
                                                    "score": 0,
                                                    "author": "Donut_of_Patriotism",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Enjoy your moral superiority.  It's extremely unlikely that kid reached that point all on his own.  But, as long as you treat your frame of reference as the only frame of reference, certainty you'll never be bothered by the nuances of morality or ethics.  You can ride through life an obnoxious and obtuse.  What an accomplishment.",
                                                            "score": 1,
                                                            "author": "MetaJonez",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Look I’ll admit that as an outsider I don’t know a lot about the situation beyond what is in the news. That being said it sounds like the parents knew their kid was fucked up and decided they didn’t want anything to do with him. And based on what happened afterwards sounds like they were correct in their choice.",
                                                                    "score": 0,
                                                                    "author": "Donut_of_Patriotism",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Do you think that revelation came out of nowhere?  Was he just a bad seed? \n\nWhat I have seen in far too many situations, is that toxic parents raise toxic kids that they then cannot stand.  Kicking the kid out is just the last act of shirking *any* responsibility.\n\nI don't know any more than you do, but while they did not deserve death, it is highly unlikely that they were the Cleavers and he was Lucifer.",
                                                                            "score": 2,
                                                                            "author": "MetaJonez"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "He was 17, not 12. \n\nI'm not saying his parents were 100% blameless but, short of some sort of self-defense (which doesn't seem to be the case here or the defendant has really awful lawyers) not much justifies murder. \n\nEven if they were awful people, he doesn't seem like a gem either. Again, possibly because of their influence, possibly not.",
                                    "score": 17,
                                    "author": "illy-chan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Were not talking justification, were talking motive.",
                                            "score": 14,
                                            "author": "Levonorgestrelfairy1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm sure he had some reason but so do most people who commit crimes. Only someone really twisted would kill for \\*no\\* reason. \n\nHaving said that, without knowing more about the family, it's hard to say where this falls on the scale of \"sociopath\" to \"wrong but understandable.\"",
                                                    "score": 8,
                                                    "author": "illy-chan",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No shit, idk why every internet commenter thinks they need to speculate on something they know next to nothing about",
                                                            "score": 1,
                                                            "author": "awfulachia"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This shit doesn't happen in a vacuum but it isn't isn't their fault he murdered them either.",
                                            "score": 2,
                                            "author": "awfulachia"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You are blaming the victims? What if he would have been a few months older and was 18? Would it still be his parents fault that they were murdered by their own child? Wow. Just wow.",
                                    "score": 5,
                                    "author": "fitandstrong0926",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well they did raise that child...",
                                            "score": 3,
                                            "author": "Levonorgestrelfairy1"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They literally raised him, so yea? They raised a murderer. A better parent would be someone who raises their kid to not murder. They didn't deserve to get murdered but they sure are responsible.",
                                            "score": -9,
                                            "author": "MrDhojo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Can you point to any evidence that they raised a murderer?",
                                                    "score": -6,
                                                    "author": "zumera",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "1.  They raised the kid that murdered them after they told him they were abandoning him once he turned 18.\n\nSo there are the basic facts like that, for instance.",
                                                            "score": 7,
                                                            "author": "PigSlam"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They got murdered?",
                                                            "score": 20,
                                                            "author": "slurmz-mckenzie"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "No.....just no. This is obviously mental illness.",
                                    "score": 1,
                                    "author": "overlord7517",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why do people have a problem with this? He can be mentally ill without being legally insane.",
                                            "score": 1,
                                            "author": "awfulachia"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I love how you're victim blaming without knowing anything about the case, or really anything from the sounds of it.",
                                    "score": 1,
                                    "author": "che85mor"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\\&gt;parenthood doesn’t just end\n\nWell, I mean…",
                    "score": 19,
                    "author": "cis-het-mail",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes, but actually no",
                            "score": 4,
                            "author": "StillMeThough"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My son moved out last December, five years after his motorcycle accident where he spent 2 months in a coma. I still told him he could stay as long as he wants",
                    "score": 3,
                    "author": "Shadrach_Jones"
                },
                {
                    "level": 1,
                    "comment": "Sounds like they were horribly emotionally abusive from that statement alone.  There are so many shitty parents out there doing similar shit on the regular I’m shocked more kids don’t kill them.",
                    "score": 5,
                    "author": "cash_slut"
                },
                {
                    "level": 1,
                    "comment": "So... wait.  \n\n\nHis parents were going to disappear from his life after 18, so he murdered them *so they wouldn't be a part of his life?*  \n\n\nThere's bad at math, and then there's this dumbfuck.",
                    "score": 20,
                    "author": "swing_axle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not everyone has the most positive reaction to their parents announcing an impending abandonment.",
                            "score": 23,
                            "author": "PigSlam",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cool sadness, still murder.",
                                    "score": -4,
                                    "author": "swing_axle"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You won't let me be part of your life....now no one will be part of your life.",
                            "score": 5,
                            "author": "sweetpeapickle"
                        },
                        {
                            "level": 2,
                            "comment": "That's probably not why he murdered them, though. That italicized part you just...... made up. Not sure who is the dumbfuck tbh.",
                            "score": 1,
                            "author": "kukukachu_burr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How am I making it up? He murdered them, thus they are no longer a part of his life.  \n\n\nThe italics are the obvious outcome of the first part of the sentence that he obviously wasn't considering, because he's a dumbfuck.",
                                    "score": 1,
                                    "author": "swing_axle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "His motive. You poor dear. You invent his motive. You do not know why he killed his parents and - for the second time- the part you italicized is his motive which you are inventing. You uses the wors \"so,\" right before it - I am guessing you do not understand how this word is used? \n\nNo offense but can you read? Seriously asking. Thank you for definitively settling the question on who the dumbfuck is. If you still want me to believe you just cannot understand, I just do not have the time or the crayons to break this down any further.",
                                            "score": 0,
                                            "author": "kukukachu_burr",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I was going to try and explain hyperbolic rhetorical questions as an enhancement device for emphasis, because I thought maybe you might have been ESL, given your syntax here, and I didn't want the whole thing to just be built on some basic misunderstanding, but then I looked at your post history and saw you picking on trans people, seemingly intentionally misconstruing innocuous statements in order to start arguments, and just being an overall unpleasant discussion partner, and I def think you're just fucking with people on the whole for pleasure.",
                                                    "score": 1,
                                                    "author": "swing_axle",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Why would you want to explain that? That isn't what you used. You have to know how to apply the things you Google, dear, but thank you for proving who the dumbfuck is a third time. Lmao at you, ya dumbfuck. Admit your entire argument is based off an assumption of motive or stop whining. You got caught talking out of your ass. Get over it or stop posting online. Dumbass. Your assessment of my syntax means nothing. Fancy ad hominems are still ad hominems. All you have to prove to be right here is that the motive you stated is fact. You cannot, and using fancy insults changes nothing. Obviously.",
                                                            "score": -1,
                                                            "author": "kukukachu_burr"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -47,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "X to doubt.",
                            "score": 17,
                            "author": "Levonorgestrelfairy1"
                        },
                        {
                            "level": 2,
                            "comment": "As I white American I don’t say this and most others I know of don’t say this either",
                            "score": 19,
                            "author": "Donut_of_Patriotism",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -30,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There’s a difference between not supporting your child financially after 18, vs just stop being a parent all together. Personally I don’t agree with cutting children off at 18 as I think that’s unrealistic in today’s society (although a cut off does need to happen eventually if they don’t do so themselves), but doing so doesn’t make you stop being a parent.",
                                            "score": 15,
                                            "author": "Donut_of_Patriotism",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": -32,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The number one goal of a parent is to make yourself obsolete..I would absolutely love for my child to be totally on his own at 18, but I don't expect them too.",
                                            "score": 9,
                                            "author": "djamp42"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Your N=1 survey is astounding.",
                            "score": 4,
                            "author": "ThatGuy798"
                        },
                        {
                            "level": 2,
                            "comment": "I'm a white American and I know a lot of other white Americans and I have no idea what you're on about MATE",
                            "score": 1,
                            "author": "awfulachia"
                        },
                        {
                            "level": 2,
                            "comment": "You choose shitty friends.",
                            "score": 1,
                            "author": "che85mor"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They sent him an email saying they wouldn't be in his life anymore lol, shitty parents raise shitty kids.",
            "score": 45,
            "author": "GreatBayTemple",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe they sent the email because they were justifiably afraid of him.",
                    "score": 2,
                    "author": "overlord7517"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; I even said I’d give my left arm just to get both of them back, see what I could do…\n\nWhat a guy…",
            "score": 41,
            "author": "tbarb00",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm surprised his lawyer didn't ask the judge to go easy on him 'cause he was an orphan.",
                    "score": 7,
                    "author": "madman1969"
                },
                {
                    "level": 1,
                    "comment": "wow, only his left arm? Why not his right arm, or his left arm and left ball?",
                    "score": 12,
                    "author": "bros402"
                },
                {
                    "level": 1,
                    "comment": "Bet you this guy is a righty. “I’d give the limb whose loss would least inconvenience me to bring them back.”",
                    "score": 2,
                    "author": "AndreaDTX"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;\"..thankfully I made peace with that\"\n\noh.... you will never be truly at peace.",
            "score": 17,
            "author": "bshepp"
        },
        {
            "level": 0,
            "comment": "In any healthy society, the kid would've just shrugged it off as there are sufficient social safety nets to help him get off the ground. Too bad he was born in America.\n\n3 more lives ruined because of a terminally sick nation.",
            "score": 45,
            "author": "spaghettischolar",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is why I'm not even trying to \"become successful in life\" or whatever. I'm not playing the life game anymore. For those of us unfortunate enough to be from the Untidy Shits of Abhorrent, it isn't even worth it.",
                    "score": 4,
                    "author": "GuntherSpiermen"
                },
                {
                    "level": 1,
                    "comment": "More than that, as you started a sentence with a numeral.  \n\nAnd you have \"scholar\" in your user name.",
                    "score": -10,
                    "author": "dittybopper_05H",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's Reddit, not a research symposium you absolute clown",
                            "score": 11,
                            "author": "spaghettischolar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There you go again.   I'm not an absolute clown.   I don't wear makeup or a wig or any of the other assorted clothing/footwear associated with clowns, nor am I especially funny.   \n\nThough you are giving me fits of laughter.   I scoff at thee.",
                                    "score": -4,
                                    "author": "dittybopper_05H",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You just proved you are an absolute clown with this, though. Pretending to be too stupid to know when people are using metaphors is exactly what a clown would do. *shrug*",
                                            "score": 1,
                                            "author": "kukukachu_burr"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot more sympathy for a literal ax-murderer in this sub than I expected.",
            "score": 29,
            "author": "overlord7517",
            "replies": [
                {
                    "level": 1,
                    "comment": "Empathy doesn’t have to only be given to the victims. This kid clearly was raised in a fucked up situation and you’re allowed to be empathetic to him without making excuses. What he did was obviously wrong but his parents fucking sucked too.",
                    "score": 51,
                    "author": "UniqueMeasurement161",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh so you know his parents sucked? How?   How could you know that? Maybe they wanted to cut contact with him because he was a scary, violent psycho? You have no fucking clue!\n\nSome people have broken brains and minds, and become scary looking ax-murderers.",
                            "score": -25,
                            "author": "overlord7517",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you bring a child into the world and they become a scary, violent psycho, isn't it your responsibility to contain them instead of refusing to have anything to do with them and inflicting them on the world.",
                                    "score": 6,
                                    "author": "Ponder625"
                                },
                                {
                                    "level": 3,
                                    "comment": "How do you know they didn’t suck? The article doesn’t paint them in a great light. I’m guessing axe murderer wasn’t treated to a loving home from what it looks like.",
                                    "score": 4,
                                    "author": "UniqueMeasurement161"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh so you know his parents didn't suck? How? How could you know that? Maybe they wanted to cut contact with him because they were scary, violent psychos? You have no fucking clue!\n\nOh look, it works both ways.  The difference is we have evidence that his parents did kinda suck.  What loving parent just outright rejects their kid soon as he turns 18?",
                                    "score": 0,
                                    "author": "WalkerBRiley"
                                },
                                {
                                    "level": 3,
                                    "comment": "You have no fucking clue either, therefore your defense of the parents is just as illogical as the judgment of the parents you are attempting to condemn with this argument. How do you not see your own hypocrisy? All you can logically argue here is that no one can judge or defend the parents since no one actually knows why they were cutting themselves out of his life. Everyone here is putting that one fact through a filter of their own biases. Your filter, which leads you to assume the fact the kid killed his parents means they had a good reason to cut the kid out, is not any more supported in fact than the opposing filter, which leads them to assume the fact the parents cut him out means he had a fucked up childhood. Neither filter is supported in fact. Your bias isn't any more ethical or logical than anyone else's. Glass houses and all that.",
                                    "score": 0,
                                    "author": "kukukachu_burr"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The second most upvoted comment literally blames the system instead of the individual that perpetrated the act.\n\nNews flash. We all live in the system and most of us choose not to kill our parents.",
                    "score": 2,
                    "author": "tristan957",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most of us have no earthly idea what frame of mind someone must be in to commit such a crime.  We don't \"choose not to kill our parents\".  We don't even contemplate it.  It never crosses our minds.",
                            "score": 9,
                            "author": "MetaJonez"
                        },
                        {
                            "level": 2,
                            "comment": "News flash. We do not live the same lives in that system, nor do we act and think the same way. 9 billion people on this planet and you think this makes sense? Yikes. The social systems we grow up do matter and have an impact, and no, even within each state they are not the same. Are you really so simple minded and incapable of critical thinking that you cannot understand violent acts can have more than just one singular cause? That's so weird, to reveal that about yourself so proudly. Do you not know you can empathize with people AND hold them personally responsible for their choices at the same time??? What a weird way to represent yourself.",
                            "score": 2,
                            "author": "kukukachu_burr"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And? This just tells us you don't have any empathy. It's not like people are pushing to let the kid out. It's like you don't understand what sympathy is or why people feel it or what it means.",
                    "score": 0,
                    "author": "kukukachu_burr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He’s kind of like Batman",
            "score": 2,
            "author": "Quick_Parsley_5505"
        },
        {
            "level": 0,
            "comment": "What a terrible thing to do to an orphan.",
            "score": 7,
            "author": "ryevermouthbitters"
        },
        {
            "level": 0,
            "comment": "That would be my second preference but not my first.",
            "score": -16,
            "author": "1320Fastback",
            "replies": [
                {
                    "level": 1,
                    "comment": "It does seem like a waste of tax payer money in food and prison maintenance...",
                    "score": -16,
                    "author": "jd52995",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The death penalty is more expensive than life in prison",
                            "score": 18,
                            "author": "AlekRivard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not if those in charge just Epstein him. Huge tax relief, everyone wins.",
                                    "score": -7,
                                    "author": "BagOpening6002"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Orton told investigators at the scene that he killed his parents to \"take charge of my life.\" \"\n\n\"sentenced to life in prison\"\n\nThanks, police!",
            "score": 1,
            "author": "shf500"
        }
    ]
}