{
    "id": "144pjzz",
    "score": 1608,
    "title": "Saudi crown prince threatened ‘major’ economic pain on U.S. amid oil feud",
    "author": "EaglesPDX",
    "date": 1686268903.0,
    "url": "https://www.reddit.com/r/news/comments/144pjzz",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Why do we still even bother with this asshole? This is all he does and has proven to not be reliable in any sense. And with their hands getting more and more involved in the US markets just seems like a continual downward spiral.",
            "score": 125,
            "author": "CosmicBlessings",
            "replies": [
                {
                    "level": 1,
                    "comment": "You have no choice in this, It's the same reason the middle east still deals with the US.",
                    "score": 2,
                    "author": "Ornery-Sandwich6445"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We should probably expect steep cuts to production and skyrocketing oil prices before the election next year",
            "score": 674,
            "author": "nirad",
            "replies": [
                {
                    "level": 1,
                    "comment": "Saudis and Putin will try to help Trump, no doubt.\n\nFor US, with all domestic oil, price is not affected by cost of international oil market, so US can impose price restraints or simply tax oil company profits and return them to consumers so no net effect.",
                    "score": 288,
                    "author": "EaglesPDX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Let's be real we both know that's not going to happen they're going to pass off the price increase to the consumers.",
                            "score": 84,
                            "author": "ragglefragglesnaggle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "With a GOP House, a tax or price controls would be hard to do but you never know with the radical Trumpers, they were calling for Pentagon cuts during the budget negotiations.  Stranger things.\n\nPolitically, if Democrats point out the oil industry profiteering as the cause of the pre-election inflation and propose actions to take, it can be as good as actually taking action.",
                                    "score": -15,
                                    "author": "EaglesPDX",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Democrats taking action? I have that spot in my bingo card for years now, and it’s just collecting dust… \n\nBut tbf I haven’t expected much from the party since Biden can’t even keep his student loan promise",
                                            "score": 8,
                                            "author": "fezmessiter",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Democrats? Take action???",
                                            "score": 2,
                                            "author": "Vitiger"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Saudis could probably expect cuts to military support and supplies too",
                            "score": 25,
                            "author": "IndicationHumble7886",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wish it worked that way!",
                                    "score": 17,
                                    "author": "spinyfur"
                                },
                                {
                                    "level": 3,
                                    "comment": "We really should start telling them that the amount of military support is going to be directly proportional to the price of oil and if you are using oil price as blackmail.",
                                    "score": 16,
                                    "author": "ryrobs10"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "this isn't the case at all. where did you get that idea?",
                            "score": 48,
                            "author": "nirad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[In 2022, U.S. net energy exports grew to 5.94 quads, which is the highest number on record. Total U.S. energy production was also the highest on record. Overall, the U.S. produced 2.5% more energy in 2022 than we consumed. By comparison, in 2005 the U.S. consumed 44% more energy than we produced.](https://www.forbes.com/sites/rrapier/2023/05/02/us-energy-independence-soars-to-highest-levels-in-over-70-years/?sh=7340c4bf977f)\n\n[In conclusion, 2022 marked the highest level of US energy independence since before 1950. This milestone was achieved through a combination of factors, including the shale boom which led to a steady decline in net energy imports](https://www.forbes.com/sites/rrapier/2023/05/02/us-energy-independence-soars-to-highest-levels-in-over-70-years/?sh=7340c4bf977f),",
                                    "score": 95,
                                    "author": "EaglesPDX",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The US oil market isn’t siloed. Global oil prices still largely determine the cost of fuel here as they do nearly everywhere (unless it’s heavily subsidized or taxed).",
                                            "score": 76,
                                            "author": "nirad",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Global oil prices still largely determine the cost of fuel here\n\nJust the price.  It's why US oil companies with no change in cost were able to jack up prices and had record profits from the US inflation they largely caused.",
                                                    "score": 54,
                                                    "author": "EaglesPDX",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And that will hurt consumers, who will then vote for the guy who says, “I have a tremendous relationship with the Saudis and I alone can fix this!”",
                                                            "score": 35,
                                                            "author": "nirad",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "“And we helped get that liberal reporter murdered too! I think they chopped him up folks” - trump *probably*",
                                                                    "score": 28,
                                                                    "author": "AMC_Unlimited"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "We should reinstate the export ban on domestically produced oil",
                                                    "score": 4,
                                                    "author": "ccasey"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\"Energy independence.\" I.e, it's [meaningless](https://www.reuters.com/article/factcheck-energyindependence-explainer/fact-check-which-factors-determine-u-s-energy-independence-idUSL2N2VQ2ZV). \n\n&gt;For Andrew Campbell, Executive Director of the Energy Institute at Berkeley Haas ( here ) “energy independence” is a “political slogan, not an economic or technical concept with a clear definition” often used by politicians to “imply that a country is insulated from global energy markets”.\n\n&gt;“This is rarely the case,” he said.\n\n&gt;“If a country produces all of the energy that it consumes, does not participate in international trade in energy, does not import energy-intensive products and does not send energy-related pollution to its neighbors or the atmosphere, then I would consider it energy independent. I don’t think any country meets that definition.”",
                                            "score": 16,
                                            "author": "blackluck64",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Energy independence.\" I.e, it's  meaningless\n\nFor US it means that when market price for oil rises US, like Saudi, Russia and other oil exporters profits as did US when [Trump/Putin/Saudi's](https://www.detroitnews.com/story/news/politics/2020/04/13/trumps-oil-deal-inside-story-price-war-ended/111542544/) engineered the oil price hikes in 2020.",
                                                    "score": 12,
                                                    "author": "EaglesPDX",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "nice pedantry.",
                                                    "score": 1,
                                                    "author": "lonewolf420"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not going to pretend to be an expert but this situation is far more complicated then production and consumption. Many of our US refineries are jetted for thinner more easily processed  Saudi oil, much of our oil produced is more viscous and problematic. We ship that out. And of course that is barely scratching the surface.",
                                            "score": 30,
                                            "author": "Ok_Loquat_2692",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "5% oil imports from Saudi's, you can argue that our refineries like thinner oil but its a wild stretch to say we are remotely dependent on them for our energy needs.",
                                                    "score": 14,
                                                    "author": "lonewolf420"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "its still a free market. if europe is buying oil at 500 dollars a barrel there is an incentive to sell it in the europe market instead of the US market despite there being a much more significant transportation cost. it may be possible to reduce it somewhat with taxes but the US doesnt live in a bubble regarding energy prices despite being a net energy exporter",
                                            "score": 12,
                                            "author": "wtfiswrongwithit",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Unfortunately not all oil is the same and our refiners aren’t built to be fed shale oil (what’s really grown). We have to blend sour oil found in places like Venezuela, Russia and the Middle East to run our refiners. \n\nSince no refiner is really building new refineries for some time now this won’t change",
                                            "score": 2,
                                            "author": "BigBobbiB",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not at all, you don't seem to understand the market.",
                            "score": 3,
                            "author": "aitorbk"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which is why the US should not allow the Saudi royal family to invest in US businesses.",
            "score": 801,
            "author": "LodossDX",
            "replies": [
                {
                    "level": 1,
                    "comment": "That, and also the time he had a journalist murdered and dismembered in a consulate.",
                    "score": 492,
                    "author": "DragoonDM",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And 9/11",
                            "score": 418,
                            "author": "NaturalBornHater",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, kinda weird how everyone overlooked Saudi Arabia's involvement on this one",
                                    "score": 133,
                                    "author": "woundedmrclown",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The PGA CEO reminded us all right before he threw the victim's families under the bus.",
                                            "score": 56,
                                            "author": "preprandial_joint",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That was crazy. He was pissed when LIV tried to butt into their market and reminded everyone about KSA's complicity in 9/11 and Kashoggi, etc, then suddenly he gets presumably a ten-figure deal and everything's kosher. Imagine that lol",
                                                    "score": 27,
                                                    "author": "br0b1wan",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And Rednecks are pissed at Bud Light.",
                                                            "score": 19,
                                                            "author": "TribalVictory15"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The PGA CEO reminded us all right before he threw the victim's families in front of the plane. \n\nFTFY",
                                                    "score": 3,
                                                    "author": "t-rex_on_a_treadmill"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "And buying top secret documents from the Trump family.",
                                    "score": 28,
                                    "author": "RAGEEEEE"
                                },
                                {
                                    "level": 3,
                                    "comment": "And buying the PGA 🤣",
                                    "score": 9,
                                    "author": "ccasey"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes, the journalist who was technically an American citizen.",
                            "score": 61,
                            "author": "degreesBrix",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Like the Saudi company **FONFOMONTE** growing alfalfa in the desert siphoning unlimited California and Arizona water?",
                    "score": 54,
                    "author": "hotassnuts",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Add Canada to that list too.\n\nWe have all these albertans here going on about how great oil is. And all the same, Saudi royals are just gifting entire oil companies between each other and making off with all the money.",
                    "score": 10,
                    "author": "KJBenson"
                },
                {
                    "level": 1,
                    "comment": "But the US is run by the people who make the money from those businesses, why would they give up their golden goose?  \n\n\nThe problem here is the current batch of people in power are all rotten to the core and should have been dragged into the public square and made examples of a long time ago for their transgression against their own countrymen",
                    "score": 9,
                    "author": "TOMisfromDetroit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's not just the current batch, friendo.",
                            "score": 2,
                            "author": "slipsect"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Good time to become an LPGA fan",
                    "score": 43,
                    "author": "YouFeelShame",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Not so Fun fact, Chicago parking money also goes to the saudis",
                    "score": 3,
                    "author": "GreyDalcenti"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 206,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "And are major investors in the twitter acquisition by Musk.",
                    "score": 111,
                    "author": "Diablojota",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The world is run by jackasses.",
                            "score": 45,
                            "author": "Armano-Avalus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Extremely rich jackasses.",
                                    "score": 11,
                                    "author": "preprandial_joint",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Control the message.",
                            "score": 30,
                            "author": "Easy_Explanation4409"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They’re the second largest owner in twitter with an approx 5% stake.",
                                    "score": 4,
                                    "author": "Diablojota",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They just rolled over their stake into the Musk purchase. But at the % they own, they can assuredly use that to control their messaging.",
                                                    "score": 5,
                                                    "author": "Diablojota",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It would, but what would the employees say? It’s more about moderation of message or lack thereof. There’s plenty of content out there demonstrating that twitter is no longer moderating dangerous content. That’s how Larry wants it, that how the Saudis want it, etc.",
                                                                    "score": 2,
                                                                    "author": "Diablojota",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 2,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Whole moderation teams were wiped out. And automod code changed. I’m not the expert on this, but I have read employees discuss the changes made. There’s a reason why the security leadership at twitter have left.",
                                                                                    "score": 5,
                                                                                    "author": "Diablojota",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh yeah whatcha going to do?  Knock down two more of our towers and blame it on Iran this time?",
            "score": 68,
            "author": "HereWeGoAgain-77",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Another good reason why we should be less reliant on oil is that we aren't as sensitive to the whims of assholes like MBS and Putin, who run a good chunk of the global oil market.",
            "score": 31,
            "author": "Armano-Avalus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Electric cars are part of national security.",
                    "score": 6,
                    "author": "tequilavip",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Electrification is important, but far less important than reduction. Most car trips are less than 3 miles and should be able to be done without one, but in most of the US you cant. To reduce the need for cars in general also removes the costs of manufacturing and shipping those cars.",
                            "score": 3,
                            "author": "MurlockHolmes"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yup. makes you wonder where all of the anti-EV, anti-nuclear, anti-lithium mining propaganda is really coming from. NIMBYs can be amplified by a handful of paid users or bots.",
                    "score": 7,
                    "author": "Cunninghams_right",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "New theory. Disclosure is happening because \"they\" have finally had enough of the Saudi's shit. Bring on the zero point energy baby, topple that evil, biggoted empire of fossil fuel.",
            "score": 23,
            "author": "theycallme_JT_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Henry Kissinger: \"You guys should form a cartel. Raising oil prices will help our oil companies as well.\"",
            "score": 20,
            "author": "kstinfo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is that speculative or did he really suggest the idea of the cartel?",
                    "score": 2,
                    "author": "MarkHathaway1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't actually think it was his idea.\n\nThis is pretty informative. The first mention of Kissinger is in 1974.\n\nhttps://www.cfr.org/timeline/oil-dependence-and-us-foreign-policy",
                            "score": 3,
                            "author": "kstinfo",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "More than using our water to grow Alfalfa in the US desert for your fucking horses? Horses?",
            "score": 18,
            "author": "hotassnuts",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fodomonte is a Saudi company using our water for their animals. Fuck that.",
                            "score": 9,
                            "author": "hotassnuts",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -1,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is because Miami is signing Messi, isn't it?",
            "score": 173,
            "author": "Nerdlinger",
            "replies": [
                {
                    "level": 1,
                    "comment": "And again, not an original thought in my head...\n\nI still can't believe he reportedly turned down a $1 BILLION+ deal.\n\nI mean I have principals, but 1 billion dollars is 1 billion dollars.",
                    "score": 29,
                    "author": "TheDesktopNinja",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean, the MLS deal is still likely pretty lucrative, with revenue sharing from Apple (TV deal) and Adidas (jersey sales), a non-Saudi market salary (edit: just saw it was ~$55MM/year), and likely the ability to get ownership in a new MLS team at a massive discount like Beckham did when he bought Miami (current expansion fee is ~$500 MM).\n\nMessi definitely turned down hundreds of millions, but his wife and kids get to live in Miami as opposed to on a compound in Saudi Arabia.",
                            "score": 20,
                            "author": "dragmagpuff",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He’s also an ambassador for Saudi so he didn’t reject them for ethics or moral reasons. As you say his family prob just wanted a more enjoyable life for the next few years.",
                                    "score": 8,
                                    "author": "timsadiq13"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[you can’t put a price on ethics](https://youtu.be/hWcEgxr--Wc)",
                            "score": 18,
                            "author": "sCeege"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really can't wait for the ocean of oil under them to dry up. It won't be in my lifetime, and they will still have tremendous wealth, but it will be a great day for the world when these clowns have no reason to be included in any negotiations.",
            "score": 17,
            "author": "Corwyntt",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Remember that it was Saudi Arabia who funded and trained the 9/11 terrorists. Could be the time for a little payback?",
            "score": 170,
            "author": "Severe-Revenue1220",
            "replies": [
                {
                    "level": 1,
                    "comment": "He could really use a taste of democracy.",
                    "score": 48,
                    "author": "LordPennybag",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you want them to taste democracy so much then why don't you draft yourself in the front line instead of acting like a typical war mongering idiot ? enough people died because of the US fucked up foreign policies which destabilized a whole region and created a refugee crisis which fucked up Europe even more, but you typical war mongering idiots don't fucking think before you speak. You just want to kill people and destabilize another safe country for no fucking reason.",
                            "score": -27,
                            "author": "arabicwhiterose",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So we shouldn’t retaliate for 9/11 and 3000 American citizens dead on American soil?  \n\nHey are Arabs responsible AT ALL for their countries?  Or is it all the CIA’s fault?",
                                    "score": 5,
                                    "author": "shadowszanddust",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;  first attack on the WTC\n\nSaudis did that one, too.\n\n&gt;the attack on the Murrah building\n\nWe killed that guy.",
                                            "score": 7,
                                            "author": "fight_your_friends",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This ties in with the Trump/Saudi/Putin oil deal that raised oil prices and US/world inflation prior to the 2022 election in hopes of a pro-Saudi GOP Congress.\n\n[Trump’s oil deal: The inside story of how the price war ended](https://www.detroitnews.com/story/news/politics/2020/04/13/trumps-oil-deal-inside-story-price-war-ended/111542544/)",
            "score": 331,
            "author": "EaglesPDX",
            "replies": [
                {
                    "level": 1,
                    "comment": "I try to explain this to people and idk why it's so hard to wrap their heads around",
                    "score": 86,
                    "author": "DanKloudtrees",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "b-b-b-but I thought Joe Biden has a dial on his desk that he uses to control the price of gas",
                            "score": 86,
                            "author": "kosmonautinVT",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He did, but trump sold that desk along with the silverware.",
                                    "score": 38,
                                    "author": "Nolsoth"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I try to explain to people how Trump pulling out of the [Iran nuclear deal](https://www.cnbc.com/2018/05/08/trump-will-kill-the-iran-nuclear-deal--and-thats-a-long-lasting-boost-for-oil-prices.html) (which [Russia](https://www.atlanticcouncil.org/blogs/iransource/russia-secretly-feared-the-iran-nuclear-deal-heres-why/) and [Saudi Arabia](https://www.aljazeera.com/news/2015/4/14/why-saudi-arabia-and-israel-oppose-iran-nuclear-deal) opposed) had a huge impact on current oil prices by blocking millions of barrels of oil in the global market, but apparently people don't understand how global supply and demand works.",
                            "score": 29,
                            "author": "Armano-Avalus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It didn’t block the global market.\n\nTrump stormed away from the Iran deal and found himself outside on his own. Europe was perfectly happy with the deal and kept their side of the agreement.\n\nIranian oil flowed into Europe as per the agreement.",
                                    "score": 3,
                                    "author": "more_beans_mrtaggart",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;It didn’t block the global market.  \n&gt;  \n&gt;Trump stormed away from the Iran deal and found himself outside on his own. Europe was perfectly happy with the deal and kept their side of the agreement.  \n&gt;  \n&gt;Iranian oil flowed into Europe as per the agreement.\n\nHe destroyed U.S. deal-making credibility (a not-incorrect view from the global perspective; if he's elected again, Americans who criticize him could well be on the way to their own camps...how could one trust him maintaining something as 'silly' as 'treaties').\n\nRipping Iran out of that deal was why Iran pivoted so hard to Russia and added yet another PITA to the Axis chesspieces.\n\nThis is Trump's Carnival of Flames and Bibi and MBS and Erdogan loved \"their man in the middle\" because all you had to do was whisper sweet things in his ears and he'd tell you anything from the passcode to Ivanka's panic room to the most vulnerable points in the U.S. water/food supply system.\n\nThe damage he has done will take generations to repair if we proceed the way we have these last two decades with the GOP emulating the Duma whilst engaging in doublethink that Russia/China conducting military drills together is \\*just\\* China.",
                                            "score": 3,
                                            "author": "TheMindfulnessShaman"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You can explain until you're blue in the face, but unless you create a media-machine to mass control the easily influenced you'll never achieve any change. It's sad what we've devolved to as a populace.",
                            "score": 12,
                            "author": "rangerryda",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is front page material, but alas, people have short memories.",
                    "score": 21,
                    "author": "mewehesheflee",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "They. Are. Not. Our. Friends. \n\nWe need energy independence to obtain the power to tell this bully to go fuck himself.",
            "score": 14,
            "author": "makashiII_93"
        },
        {
            "level": 0,
            "comment": "I think as an American we should no longer provide military support to Saudi Arabia as they are no longer Allie’s of the United States.",
            "score": 12,
            "author": "shawnewoods"
        },
        {
            "level": 0,
            "comment": "Muhamid Bonesaw at it again with his other BS. If he’s not dismembering US journalists in an embassy he is threatening others with his oil.",
            "score": 9,
            "author": "SaladAssKing"
        },
        {
            "level": 0,
            "comment": "How long before they buy the NFL?",
            "score": 22,
            "author": "Hot-Bint"
        },
        {
            "level": 0,
            "comment": "As if you needed another reason to get off oil",
            "score": 23,
            "author": "zorbathegrate"
        },
        {
            "level": 0,
            "comment": "Every time I read about the Saudis, I can't help but think of the old adage \"With friends like these, who needs enemies\".",
            "score": 7,
            "author": "bandit69"
        },
        {
            "level": 0,
            "comment": "Take back any land or assets they have in the us and say \n\n\"Thank you for a bountiful gift\"",
            "score": 18,
            "author": "Al3rtROFL"
        },
        {
            "level": 0,
            "comment": "Vicious barbarians, the Sauds should not be allowed anywhere in civilized society.\n\n(Edited Saudis to Sauds for clarity. )",
            "score": 20,
            "author": "SpindriftRascal",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This ceases to be a problem if we 1) accelerate the transition from fossil fuels and 2) stop letting Saudi Arabia buy up assets from Football teams to golf leagues to American Presidents.",
            "score": 37,
            "author": "whyreadthis2035",
            "replies": [
                {
                    "level": 1,
                    "comment": "The transition off fossil fuel will take 15-20 years.",
                    "score": 4,
                    "author": "kmelby33",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If we do it at all. We can also accelerate the process.",
                            "score": 3,
                            "author": "whyreadthis2035",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -12,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is more of a stop concentrating wealth. And on that front. The US is the biggest contributor. So yes tax the hell out of the rich. And especially find a global tax on fossil fuel companies where the money goes to transitioning and climate change mitigation instead of a few people buying all the toys.",
                            "score": 5,
                            "author": "whyreadthis2035",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This will have as much of an impact on right wing attitudes about oil prices as the fact that all the major oil companies have been posting billions and billions of profit gains over the past year. It will still be “Biden did this!\". 🤡🤡🤡",
            "score": 58,
            "author": "MrDangerMan"
        },
        {
            "level": 0,
            "comment": "Raising the price of foreign oil simply makes the US oil industry more lucrative, creates more jobs and spurs investment into EVs and hybrids.  Bring it on.",
            "score": 51,
            "author": "darkpaladin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also brings inflation to transportation and energy sectors which eventually flow to every other sector.",
                    "score": 24,
                    "author": "Darkstar197",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ll gladly pay an extra dollar per gallon as long as I don’t have to hear what this dirtbag has to say.",
            "score": 64,
            "author": "Kalip0p"
        },
        {
            "level": 0,
            "comment": "I wonder if intentionally cutting oil production earlier this year was part of the deal that Trump made with the Saudis for those classified docs. They got the classified docs, he got 2 billion (or however much it was) and their promise to make energy prices rise as much as they can, before the midterms all the way until the 2024 election is decided. \n\nIf Biden in Oct 2022  found the timing of the sabotage by Saudi Arabia to be suspicious (few months before midterms),  ask people to do some more digging into Trumps relations with the Saudis which revealed they met with each other quite a bit…and documents were possibly exchanged, the very ones Trump used for profit… and the ones he’s being indicted for ‘mishandling’\n\nIt would seem pretty on brand given the link the OP put in the comments about what happened *prior* to the 2020 presidential election about conspiring to raise oil prices to get a Saudi friendly Congress and Trump Presidency. \n\nAll conspiracy though",
            "score": 20,
            "author": "NaughtyTrouserSnake",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeah, but which one is going to end up hung by his heels?",
            "score": 4,
            "author": "FrostyYouCunt"
        },
        {
            "level": 0,
            "comment": "*Jamal Khashoggi has entered the chat*",
            "score": 5,
            "author": "BigBradWolf77"
        },
        {
            "level": 0,
            "comment": "Fuck the Saudi’s they killed Jamal Khashoggi because he was critical of not just their own government, but Trump and other dictators as well.",
            "score": 19,
            "author": "Assassin_by_Birth"
        },
        {
            "level": 0,
            "comment": "Americans go wacky w Russia-phobia, but haven’t been told to be angry w Saudis, so we ignore them, despite the fact every speck of evidence points they’re responsible for 9/11",
            "score": 14,
            "author": "IOM1978"
        },
        {
            "level": 0,
            "comment": "No jets for you, Prince.",
            "score": 11,
            "author": "lesChaps",
            "replies": [
                {
                    "level": 1,
                    "comment": "At this rate they'll get a up close and personal look at our next gen aircraft...",
                    "score": 12,
                    "author": "PPQue6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;At this rate they'll get a up close and personal look at our next gen aircraft...\n\nYou can't see those.\n\nNor the ordinance.\n\nBut it \\*can\\* be felt.",
                            "score": 2,
                            "author": "TheMindfulnessShaman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "MBS = Mega Bowel Syndrome",
            "score": 12,
            "author": "CinSugarBearShakers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Majorly Big Shithead",
                    "score": 9,
                    "author": "Express_Helicopter93"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good luck with Iran then.",
            "score": 4,
            "author": "Sorry-Letter6859"
        },
        {
            "level": 0,
            "comment": "Strawberry Jam Jar Lid said what now…?",
            "score": 4,
            "author": "Captain_CatDad"
        },
        {
            "level": 0,
            "comment": "Bruh already running into major financial struggles trying to build your Deathstar Trench city really think you wanna march deeper into the red?",
            "score": 4,
            "author": "Superbunzil"
        },
        {
            "level": 0,
            "comment": "Then we might have to dig into green sources. Oh, horrors.",
            "score": 5,
            "author": "frog_jesus_"
        },
        {
            "level": 0,
            "comment": "Wouldn’t this just increase oil profits for us oil companies if oil goes up? That’s what happens every time, the price per barrel increase, and so their profits.",
            "score": 9,
            "author": "Throwaway-6384",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Which drives up gas prices, which increases trasportion costs for businesses and individuals, which drives up cost of goods (and gives companies an excuse to add a \"temporary fuel rider\"), all of which results in inflation for the US consumer. But yes, US oil companies do get to enjoy increased profits.",
                    "score": 2,
                    "author": "Number6isNo1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We need to hop on renewables and nuclear and tell these guys to take a hike",
            "score": 10,
            "author": "zstandig",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don’t understand why we still have diplomatic relations with clown . In my opinion he is just as terrible as Putin. He is not a benevolent leader he terrorizes his own people and kills or jails those that disagree with his policies. I know for the longest time we time we put up with Saudi Arabia because of oil. . I don’t believe we are as dependent on their oil now.",
            "score": 8,
            "author": "Real_Border9457",
            "replies": [
                {
                    "level": 1,
                    "comment": "MNCs, oligarchs, and the fact that even our allied nations have significant \"Money Vision\" when it comes to unlimited Saudi \"wealth\".\n\nWealth that would disappear for generations if conflict were to break out.",
                    "score": 3,
                    "author": "TheMindfulnessShaman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There will come a day when we don't need them anymore.  I look forward to it.  They will have nothing after that but sand.",
            "score": 3,
            "author": "EternallyImature"
        },
        {
            "level": 0,
            "comment": "It’s disgusting that it’s still even a debate that we need to get off oil ASAP. This should be a national project right now. No good comes from our dependence on fossil fuels",
            "score": 3,
            "author": "ccasey"
        },
        {
            "level": 0,
            "comment": "Wouldn't that be cool if we had solar powered cars or green energy for this stuff? Maybe within the next 20 years I guess. In the meantime, let's play world politics.",
            "score": 3,
            "author": "lizard81288"
        },
        {
            "level": 0,
            "comment": "oh please, you muthafuggas can’t even fight for yourselves.",
            "score": 3,
            "author": "Ensho-Sai"
        },
        {
            "level": 0,
            "comment": "This is reason enough for people to switch to evs",
            "score": 10,
            "author": "AWDriftEV"
        },
        {
            "level": 0,
            "comment": "this is why we cannot fuck around with oil and gas anymore we need to go full green energy like 10 years ago.\n\nnow that Saudi Arabia and Iran Russia and China are all playing for the same team there's going to be an oil crisis before every American election. \n\nthey got half the country already trained like puppies.",
            "score": 7,
            "author": "Bawbawian"
        },
        {
            "level": 0,
            "comment": "How come we haven’t stomped this country into the sand.",
            "score": 11,
            "author": "The_Sad_Whore",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Please do, Saudi prince.",
            "score": 8,
            "author": "-lousyd"
        },
        {
            "level": 0,
            "comment": "Maybe it's time to put the divine right of kings to the torch.  To hell with all these royal fascist brats, a little liberation of their oppressed is long overdue.",
            "score": 2,
            "author": "BoffoZop"
        },
        {
            "level": 0,
            "comment": "Did we ever refill the strategic reserve?",
            "score": 2,
            "author": "Pomp_N_Circumstance"
        },
        {
            "level": 0,
            "comment": "Time to end our cozy alliance with the Saudis",
            "score": 2,
            "author": "legofarley"
        },
        {
            "level": 0,
            "comment": "We should threaten them, they did fund and orchestrate 9/11.",
            "score": 2,
            "author": "Inner_University_848"
        },
        {
            "level": 0,
            "comment": "It’s been 50 years since the first oil crisis. We could have (and still could) take action to use less oil while having a better quality of life, but no. We build more highways, more sprawl, bigger vehicles, and still pretend that having to drive for every single thing you do is “freedom.” Its freedom to have a choice to be able to walk to something, to be able to take transit to something else, to be able to bike without being in mortal danger.\nSo we are held hostage by one of the most evil governments on the planet.",
            "score": 7,
            "author": "LongMemoryLady",
            "replies": [
                {
                    "level": 1,
                    "comment": "You gonna bike from Houston to Miami this summer for vacation?",
                    "score": -10,
                    "author": "NFLBengals",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These cool things called airplanes exist, buddy. Oh, also, if we could unwrap our head from car culture and set up a good passenger rail system in this country, then you'd have that option too.",
                            "score": 6,
                            "author": "newge4",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wonder how airplanes go anywhere... hmm couldn't possibly be from some type of fuel, friend",
                                    "score": -8,
                                    "author": "NFLBengals",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Waaay more efficiently than cars bub",
                                            "score": 2,
                                            "author": "newge4",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Can't exactly use airlines regularly to get to work &amp; practically ever other function there, guy",
                                                    "score": -8,
                                                    "author": "NFLBengals",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Regularly driving back and forth from Dallas to Miami for work, are we? Hell of a commute there.",
                                                            "score": 3,
                                                            "author": "newge4",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Cars are essential is the point.",
                                                                    "score": 6,
                                                                    "author": "NFLBengals"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They're manipulating oil prices to create an agenda against dems. Only the GOP would enlist the help of a foreign enemy to terrorize Americans.",
            "score": 3,
            "author": "Bigdaddylovesfatties"
        },
        {
            "level": 0,
            "comment": "Go electric. Fuck him.",
            "score": 3,
            "author": "zubaz69"
        },
        {
            "level": 0,
            "comment": "I mean they will do anything to help a Republican win the election so I'm sure oil will skyrocket and Biden will be blamed.",
            "score": 6,
            "author": "chriskot123"
        },
        {
            "level": 0,
            "comment": "Sounds more like an argument to nationalize the PGA to me...",
            "score": 2,
            "author": "Pholusactual",
            "replies": [
                {
                    "level": 1,
                    "comment": "PGA just did get nationalized...by the Saudis.",
                    "score": 9,
                    "author": "EaglesPDX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup.  They wanna play this game, time to make that investment worth a bit less to them.",
                            "score": 6,
                            "author": "Pholusactual",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, I'm kind of like a right winger and their relationship with Target.  I can't actually boycott something I never was actually using in the first place.",
                                            "score": 4,
                                            "author": "Pholusactual"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly no better time to liberate the Saudi elites of their wealth.",
            "score": 2,
            "author": "zmunky"
        },
        {
            "level": 0,
            "comment": "The major pain of realizing golfers are terrorist supporting bud light loving.....sorry bud light hating white supremacists must be difficult",
            "score": 2,
            "author": "Odd_Bag_289"
        },
        {
            "level": 0,
            "comment": "Let's just quit this for once and for all that's due domestic oil and gas we've got plenty. The Permian base and his exploding right now and for all of you that forgot we drove the Saudi oil prices down with the tar sands. However before we switch from whale oil way back in the 1800s it got to it today's pricing about $70 a gallon before we switched to oil crude. You know if we just didn't drive one day a week they would be at our Mercy far be it from American citizens to ever get together and do anything as a group now.",
            "score": 2,
            "author": "WolfThick"
        },
        {
            "level": 0,
            "comment": "US loves their golf tour, but not their oil policy.",
            "score": 2,
            "author": "wulf_rk"
        },
        {
            "level": 0,
            "comment": "These statements were made last fall and don’t apply to current conditions.",
            "score": 1,
            "author": "Dry-Stop2000"
        },
        {
            "level": 0,
            "comment": "Yes, push everyone to renewables faster.",
            "score": 1,
            "author": "dragonpjb"
        },
        {
            "level": 0,
            "comment": "As soon as the infrastructure for electric vehicles is standard nationally Saudi Arabia will be politically irrelevant",
            "score": 1,
            "author": "SomeJustOkayGuy"
        },
        {
            "level": 0,
            "comment": "And do we will know how gave him this power. DJT and Kushner.  No Aramco US IPO no top oil producer in the world.",
            "score": 1,
            "author": "Jhewitt1111"
        },
        {
            "level": 0,
            "comment": "Cool statement bro, you plan on buying support for ANY of your US made equipment? Like the Patriot batteries, F-15's, M1A1s, Apaches, C-130's or training or maintenance or anything? Cause there's no Patriots on sale at Inshallah-Mart and the Yemeni Houthis kinda wanna burn your ass.  No one answering the phone t 1-800-pent-a-gon? Too bad. Welp goodluck!",
            "score": 1,
            "author": "Bouncer214"
        },
        {
            "level": 0,
            "comment": "I think that the ability of the Saudis to control oil prices is very limited.",
            "score": 0,
            "author": "gizmozed"
        },
        {
            "level": 0,
            "comment": "Wonderful! Something else to make my life harder.",
            "score": 0,
            "author": "mrchris69"
        },
        {
            "level": 0,
            "comment": "Usually when we find a Country with oil we instigate a War and install a friendly Government. Is that what the crown prince is requesting?",
            "score": 0,
            "author": "Batmobile123"
        },
        {
            "level": 0,
            "comment": "All MBS would need to do is start a PAC for Trump with, say, with a billion dollars.  Joe would be biding his last days in the WH.",
            "score": -25,
            "author": "littleMAS",
            "replies": [
                {
                    "level": 1,
                    "comment": "Except that would be illegal, and Trump has enough indictments coming his way already.",
                    "score": 15,
                    "author": "RareBeautyEtsy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What is one more indictment for a man who collects them like NFT cards?",
                            "score": 5,
                            "author": "littleMAS",
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}