{
    "id": "145hqtt",
    "score": 2053,
    "title": "France hails 'hero with a backpack' who intervened in knife attack on very young children",
    "author": "drkgodess",
    "date": 1686346968.0,
    "url": "https://www.reddit.com/r/news/comments/145hqtt",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;\"...knife attack that critically wounded four children between the ages of 22 months and 3 years old, and also injured two adults.\"\n\nWho the actual fuck is attempting to stab a bunch of toddlers?!??",
            "score": 319,
            "author": "remberzz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like it happened in Thailand recently.",
                    "score": 73,
                    "author": "thatisnotmyknob",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah the ex-cop went to a daycare and killed 24 children.",
                            "score": 101,
                            "author": "SG_wormsblink"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The video is crazy, he goes up to a fucking stroller just stabbing away. It was horrific",
                    "score": 9,
                    "author": "hibelly"
                },
                {
                    "level": 1,
                    "comment": "It happened in Belgium once. Google 'kim de gelder'.\nPeople who do su h thongs are probably missing screws",
                    "score": 38,
                    "author": "ih-shah-may-ehl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm missing screws myself, but damn, not the \"don't stab literal toddlers\" screws",
                            "score": 28,
                            "author": "Odie4Prez",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Meme or not, hope you can get all the help and support",
                                    "score": 9,
                                    "author": "Techsoly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you 🩵 I mostly can't because American healthcare but I appreciate the sentiment",
                                            "score": 17,
                                            "author": "Odie4Prez"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Probably someone who’s very mentally ill",
                    "score": 14,
                    "author": "J_House1999",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; \"was incoherent, saying lots of strange things in different languages, invoking his father, his mother, all the Gods.\" \n\nGranted, it's probably a safe bet that someone who would attack random children probably isn't wired right. Not really the sort of thing well-adjusted and balanced adults get up to.",
                            "score": 53,
                            "author": "illy-chan"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Christian extremists",
                    "score": 0,
                    "author": "RockSaltnNails",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He was invoking \"all the gods\" according to the article. Not particularly Christian (or Muslim for that matter).",
                            "score": 18,
                            "author": "Nyghtshayde"
                        },
                        {
                            "level": 2,
                            "comment": "Every extremist.",
                            "score": 19,
                            "author": "Desert4tw"
                        },
                        {
                            "level": 2,
                            "comment": "The Christian extremist in this story was the hero who risked his life to save others.",
                            "score": 6,
                            "author": "Getrektself"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 22,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A previous article said he “invoked the name of Jesus Christ”. There’s about a million Syrian Christians so it is possible",
                                    "score": 157,
                                    "author": "Redqueenhypo"
                                },
                                {
                                    "level": 3,
                                    "comment": "He’s Christian/Catholic. He was also holding a cross and had tattoos, which is harem in Islam. It’s not up for debate. He’s a confirmed, long term Christian.",
                                    "score": 100,
                                    "author": "UnprofessionalGhosts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People don’t seem to know the middle east has Christians even though they absolutely exist. I mean, it’s not like Christianity started in that region or anything. No one tell ‘em about Maronites in Lebanon or their *interesting* activities in 1982",
                                            "score": 86,
                                            "author": "Redqueenhypo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I lived in the Mid East and right across from my street was a church run by German nuns. Just in my city alone there were 3000 Christians. It was actually really cool to hear the Islam call to prayer then after hearing the church bells.",
                                                    "score": 8,
                                                    "author": "capricabuffy"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Christianity is present in most of the world\n\nSurprised people don't realize that",
                                                    "score": 13,
                                                    "author": "Saquon"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "haram, not harem",
                                            "score": 13,
                                            "author": "Drachefly",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Semitic languages: *Exist*\n\nRest of world: Would you like to buy a vowel?\n\nSemitic languages: No, I’m good.",
                                                    "score": 2,
                                                    "author": "El_dorado_au",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Those words have different spellings in the language used in this conversation.",
                                                            "score": 1,
                                                            "author": "Drachefly"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A harem is a group of wives/concubines/female servants.",
                                            "score": 6,
                                            "author": "MrTurkle"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Leviticus 19:28—\"Ye shall not make any cuttings in your flesh for the dead, nor print any marks upon you\"\n\nJust saying some Christians are anti-tattoo.",
                                            "score": 2,
                                            "author": "DesignedToStrangle"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Depends on which part of Reddit you’re in.",
                                            "score": 2,
                                            "author": "dalerian"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's not how my experience has  been but maybe we run in different circles",
                                            "score": 2,
                                            "author": "awfulachia"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hey that’s just Catholic! There’s different kinds of Christian! He’s clearly not evangelical either, bc they’d just buy/adopt the kids then horribly neglect them after getting bored",
                                            "score": 6,
                                            "author": "Redqueenhypo"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Classic Reddit, downvoting a true statement.",
                            "score": -2,
                            "author": "MonkeyOnATypewriter8"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That doesn't mean the terrorist wasn't.",
                                    "score": 16,
                                    "author": "stugster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 3,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The hero with a backpack, who risked his life to save people, is a christian. The attacker was apparently from a different religion that is not christian...",
                            "score": 1,
                            "author": "-Michael-Robert-"
                        },
                        {
                            "level": 2,
                            "comment": "*religious extremists (enough insane religious crazies in all religions)",
                            "score": 0,
                            "author": "Jonnny"
                        },
                        {
                            "level": 2,
                            "comment": "He actually was a Chistian extremist. He was originally a Syrian refugee allowed into Sweden ten years ago.",
                            "score": 0,
                            "author": "Ponder625"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "to be fair I've seen a lot of news about them being armed now.. could have been gang related turf war over the swings",
                    "score": -20,
                    "author": "uknow_es_me"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Henri, who is documenting his pilgrimage around France on social media, said he’d been setting off to hitchhike to another abbey when the horror unfolded in front of him. \n\nMan's a wandering hero, incredible.",
            "score": 519,
            "author": "XLauncher",
            "replies": [
                {
                    "level": 1,
                    "comment": "He saw a sidequest and went for it",
                    "score": 106,
                    "author": "Desert4tw",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Random encounter.",
                            "score": 42,
                            "author": "raitchison"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is a ready made anime where he starts out fighting bad guys with a backpack full of water bottles and books, then makes it a full time thing going town to town with a heavier duty backpack full of gravel, then, when faced with an exceptionally tough challenge, releases his 'secret technique': Duffel Bag Full of Bricks.",
                    "score": 121,
                    "author": "The-Duck-Of-Death",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Boy do I have a video for you then](https://youtu.be/1oPMw8ftL6w) enjoy my friend",
                            "score": 25,
                            "author": "Seastorm14",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fucking awesome",
                                    "score": 4,
                                    "author": "neildegrasstokem"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Master Po: Seek not to know the answers, but to understand the questions",
                    "score": 22,
                    "author": "Hour-School-2255"
                },
                {
                    "level": 1,
                    "comment": "Done more than those useless cops at Uvalde",
                    "score": 9,
                    "author": "Murky_Conflict3737"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; The attacker slashed at the 24-year-old Catholic pilgrim with the knife that he used to [savagely stab one young child after another](https://apnews.com/article/france-knife-attack-d47bf333537fd98d1a9cfca3007bd3c0). But rather than run, Henri held his ground — using a weighty backpack he was carrying to swing at the assailant and fend off his blade.\n\nIt could be a scene from a spy film. I'm glad he was there to prevent further harm to the children.",
            "score": 259,
            "author": "drkgodess",
            "replies": [
                {
                    "level": 1,
                    "comment": "He definitely got main character energy as there are nearby pedestrian but seems like no one is invested enough to put themselves in harms way. Which I get but damn..toss a rock, stick, trash or something from afar. You don’t have to be a hero but enough to distract him would slow him down.",
                    "score": 24,
                    "author": "MountainServe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reading the article, apparently more people chased and attempted to scare off the assailant while others immediately got around to give first aid and organize rescue. The guy himself said he wasn't acting alone but his backpacks probably gave him a means of protectionother might not have had. Two other adults got injured by the attacker while attempting to stop him",
                            "score": 54,
                            "author": "LastWalker"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I saw the video of the attack, the dude was fucking scary and the knife looked huge, this man has some balls",
            "score": 36,
            "author": "eccojams97"
        },
        {
            "level": 0,
            "comment": "\"a critically injured adult — who was both knifed and wounded by a shot that police fired as they detained the suspected attacker — is regaining consciousness, Macron said.\"\n\nThat poor guy!",
            "score": 130,
            "author": "RedLicorice83",
            "replies": [
                {
                    "level": 1,
                    "comment": "Man. You charge in to be the hero, get knifed, the police shoot you, and you don’t even get lauded for the brave act.",
                    "score": 33,
                    "author": "Ink_Witch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They may be trying to protect his privacy since he is still a pt in a hospital. He may not be conscious or aware enough right now to consent to have his name released just like Henri and his father didn't want their last names published. I have a feeling he will be lauded soon but probably not until he is out of the woods. I have a feeling the heros from this incident will be rewarded with something more than a coveted invite to Notre Dame. Probably some kind of offical ceremony.",
                            "score": 6,
                            "author": "tillieze"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Much respect, I would want this guy at my 6 o'clock vs. the entire Uvalde police force.",
            "score": 156,
            "author": "SpottedRussianBot",
            "replies": [
                {
                    "level": 1,
                    "comment": "People seriously need to stop making uvalde about incompetent police when it's about guns, above all.",
                    "score": -72,
                    "author": "pirate-private",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It can be about more than one thing.\nGuns, AND the cops who stood around outside, refusing to help and preventing parents from trying to help.",
                            "score": 49,
                            "author": "dalerian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That is entirely true.",
                                    "score": 4,
                                    "author": "pirate-private"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "While guns are a problem. Uvalde was more tragedy because of police incompetence. Don’t give them an inch.",
                            "score": 26,
                            "author": "Sweet-Idea-7553",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course it was. Pointing out hero-stories\n\n(or the lack thereof in Uvalde, where the gun nut terrorist legally obtained a gun and would've killed children _even if_ the police had acted better)\n\npointing out those aspects _without_ mentioning the gun aspect\n\n(which btw seems what the people in Uvalde seem to want for their children given their voting behaviour)\n\nis yet another gun propagandist talking point as it deflects from the main issue, intentional or not.",
                                    "score": -22,
                                    "author": "pirate-private"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Two things can be true",
                            "score": 1,
                            "author": "j6all"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look at that face.\n\nHe’ll never be single again.",
            "score": 99,
            "author": "ACertainKindOfStupid",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm digging his eyebrows, very bountiful.",
                    "score": 30,
                    "author": "KeyRageAlert"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This should have NEVER happened in the first place. But Salute to the HERO for trying every little helps.",
            "score": 27,
            "author": "jefferymr15"
        },
        {
            "level": 0,
            "comment": "Hero with a backpack is a lame nickname, call him Henri the Hero ffs.",
            "score": 14,
            "author": "WhistlingDead",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's mysterious. Who is this man and what was he carrying in that backpack?",
                    "score": 5,
                    "author": "H00Z4HTP"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you, Mr. Henri.  Your heroism saved the lives of such young children.  May the light shine upon you.",
            "score": 13,
            "author": "Fordrynn"
        },
        {
            "level": 0,
            "comment": "Followed by all political spectrum freaking out cuz the attacker is an arab christian and backpack guy is a suprematist christian.",
            "score": 7,
            "author": "Mediumaverageness",
            "replies": [
                {
                    "level": 1,
                    "comment": "For real people always need to get on some soapbox about their feelings towards religion instead of just looking at the story as is",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And he’s hot too? damn l-",
            "score": 2,
            "author": "ZucchiniFlex"
        },
        {
            "level": 0,
            "comment": "This is how insanity based violence should end. In America it’s much more violent because you know.. military grade machine guns.",
            "score": -37,
            "author": "DauOfFlyingTiger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, France apparently did do things the American way a bit, by which I mean the police shot and critically wounded *one of the stabbing victims* before apprehending the actual guy",
                    "score": 45,
                    "author": "Redqueenhypo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How embarrassing. A lot more common than people think.",
                            "score": 3,
                            "author": "ADarwinAward"
                        },
                        {
                            "level": 2,
                            "comment": "Some of our police don’t do anything at all.",
                            "score": 2,
                            "author": "DauOfFlyingTiger"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why does Americans always have to make everything about them?, it’s very narcissistic",
                    "score": 15,
                    "author": "Beagle_Knight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry. I think that point is well said. It is a an enormous tragedy and I as an American am sadly used to reading these things. Again, apologies.",
                            "score": -8,
                            "author": "DauOfFlyingTiger"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;This is how insanity based violence should end. In America it’s much more violent because you know.. military grade machine guns.\n\nYou know what the rest of the world doesn't have?\n\nMass shootings every other day like the USA.\n\nMass shootings are an America specific problem.",
                    "score": 1,
                    "author": "Tyndael87",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "no they’re not",
                            "score": 0,
                            "author": "notgreys",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;no they’re not\n\nThe past 6 months says otherwise dude.\n\nThere was just another one a couple days ago.",
                                    "score": 2,
                                    "author": "Tyndael87",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "there are mass shootings in third world countries every single day, they just don’t get the same level of news coverage",
                                            "score": 0,
                                            "author": "notgreys",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes.\n\nBut you can't try to call your self a \"first world nation\", when you clearly have the same issues (per your comment) as a third world country.",
                                                    "score": 1,
                                                    "author": "Tyndael87"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "When your standard is fucking \"country in Africa in the middle of a civil war\" for \"well, mass shootings in America aren't that out of the norm,\" your bar is so fucking low that you aren't even getting ready to limbo, you're drilling for oil.",
                                                    "score": 0,
                                                    "author": "isitaspider2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "nobody is talking about countries in the middle of a civil war. It may be difficult for Westerners to understand that mass shootings are a normal occurrence in many stable countries",
                                                            "score": -1,
                                                            "author": "notgreys",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dude, they ABSOLUTELY are not. No other 1st world country has so many mass shootings. I mean, fucking hell, most third world countries don't have so many mass shootings. Your statements are so unbelievably false and so demonstrably false that it borders on incomprehensible that somebody would actually argue this.\n\nThe ONLY reports that have tried to argue that America isn't the leader of the world in mass shootings was that stupid as fuck report by CRPC, the pro-gun association created literally to attempt to provide legitimacy to usa's insanely lax gun management (it's not even control at this point), where they cherry picked the data so hard and fudged the numbers so much that a country with ONE mass shooting was somehow worse than the hundreds upon hundreds of mass shootings in the USA because they just excluded a large portion of America's mass shootings.\n\n\"Well, when you calculate as a percentage of population, and exclude incidents where the shooter only killed 3 people instead of 5, and only record based on deaths and not woundings, then America is doing great! All this media is just those evil liberals trying to take away your guns because every country is Europe is just like America, they just don't report it unless the number is big.\"\n\nNo, that's not how it fucking is. America's gun deaths are so astronomically high that no other country comes even withing a fraction of a fraction of America's numbers. No other 1st world country comes close.\n\nDamn well near every metric not funded by American pro-gun think-tanks puts America so far above and beyond every single other first world country that you have to combine them. Multiple times over. To even get remotely close to america' s numbers.\n\nAmerica counts mass shootings by the week while other countries do it by the decade. It's not even remotely close.",
                                                                    "score": 2,
                                                                    "author": "isitaspider2",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "can you read or are you just here to repeat yourself? Do you genuinely believe that the US has a greater firearm problem than countries in Latin America or is America the world to you? The US is unique in its rate of firearm ownership, but is not at all unique or even among the worst countries in terms of firearm related deaths (and becomes even safer if you exclude suicides). The US is so safe compared to these countries in terms of shootings that people who are hundreds of miles away freak out about weekly mass shooting events, when it is literally an everyday occurrence in some Latin American countries to have places indiscriminately shot at",
                                                                            "score": -2,
                                                                            "author": "notgreys",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Dude, for fucks sake, compare a 1st world country to a first world country, not to fucking South America. You're the one who brought up third world countries but want to compare the safety of America to something like Brazil or Venezuela where the government has no teeth and can't police their own streets? Why the fuck bring them into the equation? That's the whole point I'm making. The only countries America can be compared with and seem normal are literally fighting internal criminal forces that have more guns and manpower than some nations. \n\nAmerica is the fucking WORLD police and the countries you're comparing it to can't even police their own neighborhoods with drug gangs so large they're essentially small militaries.\n\nCompare the USA to countries like Britain, France, Japan, South Korea, etc. This is statistics 101.\n\nAND EVEN THEN AMERICA'S NUMBERS ARE REALLY BAD.\n\nEven when we include these countries, America is STILL WORSE except for the absolute bottom of the barrel like Mexico or Venezuela.",
                                                                                    "score": 2,
                                                                                    "author": "isitaspider2"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You’re being downvoted but I agree with you. I literally just had a Reddit back and forth about how “gEtTiNg RiD oF gUnS wOn’T dO aNyThInG uNtiL sOcIeTy BeCoMeS lEsS vIoLeNt” which is, of course, bullshit.\n\nGetting rid of guns would at least give us a chance to drastically reduce the number of casualties and hopefully deaths in these sorts of violent events.",
                    "score": -10,
                    "author": "_PM_ME_YOUR_FORESKIN",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or the fact that you are trying to always make it about America and it’s guns?\n\n“Stabbing in France”\n“Yeah, here in America guns hur hur”",
                            "score": 14,
                            "author": "Beagle_Knight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sorry not sorry, I guess. I’m all for cultural relativism *and also* nearly 1 in 2 redditors is American. We’re obviously going to compare international headlines to our own experiences.\n\nThere are plenty of redditors who post shit like “wow, what is going on the the US? I can’t believe women pay so much to have a baby. It’s free here.” Or “I can’t believe the police are so violent there. Here’s they just talk to us like normal people.” And when those comments happen I don’t whine about *“well this isn’t about YOUR country. This is about AMERICA!”*\n\nThere are hundreds of other comments. If you don’t like mine just find another, I guess. 🤷🏽‍♂️",
                                    "score": -1,
                                    "author": "_PM_ME_YOUR_FORESKIN"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, the idea that guns don’t make a difference is just willful ignorance.",
                            "score": 0,
                            "author": "DauOfFlyingTiger"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Master Po: Seek not to know the answers, but to understand the questions\n\nEdit:  please watch kung Fu the legend continues, then decide if this deserves down voted",
            "score": -6,
            "author": "Hour-School-2255"
        },
        {
            "level": 0,
            "comment": "Guy laying on the ground bleeding out like \"ahhh I've been gutted!\n\n*cops arrive and shoot him*\n\n\"ahhh I've been shot and gutted!\"",
            "score": 1,
            "author": "itasteink"
        }
    ]
}