{
    "id": "1489b7q",
    "score": 836,
    "title": "Okinawa police arrest US sailor, Marine on suspicion of trespassing on balconies",
    "author": "Awkward-Action2853",
    "date": 1686641087.0,
    "url": "https://www.reddit.com/r/news/comments/1489b7q",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;The woman called police at 12:17 p.m. to report an unknown foreigner with excrement in his pants sleeping on the balcony, the spokesman said.\n\nWay to represent America dude. Now we're gonna have to send Party Boy over again to repair our image.",
            "score": 281,
            "author": "SunsetKittens",
            "replies": [
                {
                    "level": 1,
                    "comment": "I could hear the music start as I read that lol",
                    "score": 35,
                    "author": "MamasCupcakes"
                },
                {
                    "level": 1,
                    "comment": "And his name is fucking Bladen Weed...of course he's gonna pull this kinda shit",
                    "score": 29,
                    "author": "Chad_Broski_2"
                },
                {
                    "level": 1,
                    "comment": "Occupying someone else’s territory and shitting yourself isn’t an inaccurate representation.",
                    "score": 49,
                    "author": "Arseh0le",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s not an occupation if it’s requested by the government. \n\nThe Diet of Japan requests the bases in Okinawa.",
                            "score": 29,
                            "author": "PHATsakk43"
                        },
                        {
                            "level": 2,
                            "comment": "The US occupied Okinawa until 1972 and considered annexing it(they did annex the Northern Mariana Islands), but ultimately returned Okinawa to Japanese rule. LT General James Lampert was the last American Governor of Okinawa. Since 1972, US forces have been present under a status of forces agreement(SOFA) with the government of Japan, and it's no longer an occupation. The Governor of Okinawa has been Japanese since that time, and the Japanese can kick the Americans out.",
                            "score": 10,
                            "author": "Nickppapagiorgio"
                        },
                        {
                            "level": 2,
                            "comment": "So much edge!",
                            "score": 0,
                            "author": "ChristopherGard0cki",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Angry lil guy.",
                                    "score": -10,
                                    "author": "AGodNamedJordan"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Send him to San Clemente CA to get straightened out",
                    "score": 2,
                    "author": "Cucumber_Basil"
                },
                {
                    "level": 1,
                    "comment": "Trust me, this is not even in the top 1,000 worst things drunk sailors have done.",
                    "score": 1,
                    "author": "Artanthos"
                },
                {
                    "level": 1,
                    "comment": "There is a foreigner on my balcony!! Better check if he has shit his pants before I call the police!",
                    "score": 2,
                    "author": "nhjuyt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's gonna cost him.",
            "score": 48,
            "author": "cantproveidid",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh yeah. Even if he doesn't go to jail, they'll still make him pay the apology money, and that'll probably cost more than whatever fee he gets hits with.",
                    "score": 50,
                    "author": "Awkward-Action2853",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "After the local authorities finish with him, I image it will be our military's turn.",
                            "score": 40,
                            "author": "cantproveidid"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s gonna cost him his rank and pay.",
                    "score": 10,
                    "author": "deletable666"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wait, this wasn't from 30 years ago when I was there?",
            "score": 89,
            "author": "harmospennifer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, one of my friends has the same story. He somehow managed to find a girlfriend in Oki, and after a night of drinking he set out to find her place but ended up banging on some local's balcony window. No one got arrested but it's easy to understand why the locals are sick of us being there.",
                    "score": 34,
                    "author": "headzoo"
                },
                {
                    "level": 1,
                    "comment": "No, that was the other drunk sailor and marine that did that. Or maybe the air force and army guy. I've lost track.",
                    "score": 69,
                    "author": "Awkward-Action2853",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, those guys! I know them...",
                            "score": 14,
                            "author": "harmospennifer"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or 20 years when I was there?",
                    "score": 9,
                    "author": "tworaspberries"
                },
                {
                    "level": 1,
                    "comment": "As someone who had a stopover there on a WestPac in 95/96, I thought these were weekly occurrences.",
                    "score": 7,
                    "author": "Rambos_Beard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1992, thought it was daily",
                            "score": 2,
                            "author": "harmospennifer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you listen hard enough, you can hear liberty being restricted island wide.",
            "score": 28,
            "author": "greenweenievictim",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup, the bowling alley will be the best place for the squids and jarheads for a few months.",
                    "score": 9,
                    "author": "PHATsakk43"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So basically a regular weekend for Marines in Oki. Not much has changed since the last time I was stationed there.",
            "score": 86,
            "author": "dxmkna",
            "replies": [
                {
                    "level": 1,
                    "comment": " Nope, pretty normal sadly. At least, from the report, they didn't damage or hurt anyone this time, and got picked up. That'll be a tough lesson to learn.",
                    "score": 41,
                    "author": "Awkward-Action2853"
                },
                {
                    "level": 1,
                    "comment": "Not much has changed since they opened in 1945.",
                    "score": 15,
                    "author": "8-bit-Felix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can roll that date back to commodore Matthew Perry’s visit to the islands .",
                            "score": -1,
                            "author": "-Kadekawa-"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If there's two things I learned that Marines on Okinawa love, and can't stay away from, it's driving drunk and sexually assaulting the locals.",
                    "score": 16,
                    "author": "VengefulKyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A very small percentage of Marines there drive. Many are rotated through on deployments. And those stationed have libo bus service to Gate Street.",
                            "score": 7,
                            "author": "AKMarine"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Except it happened in C-Town instead of Gate Street or Whisper Alley. 🤔",
                    "score": 1,
                    "author": "AKMarine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How does one make it to the 4th story balcony, drunk? I'm impressed honestly.",
            "score": 38,
            "author": "Awkward-Action2853",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some people are sleepy drunks, some turn into Spider-Man",
                    "score": 23,
                    "author": "oOoleveloOo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Had an uncle that turned into spiderman, unfortunately his legs didn't get the message when he jumped off the pillar he climbed and absolutely broke his leg",
                            "score": 4,
                            "author": "Dirxcec"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Without a care in the world, clearly.",
                    "score": 13,
                    "author": "IlluminatedPickle"
                },
                {
                    "level": 1,
                    "comment": "With shit in their pants",
                    "score": 6,
                    "author": "602Zoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The smell of freedom.",
                            "score": 4,
                            "author": "KorgX3"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it's a little weird how you can't join the military if you are a cannabis user, but can get intoxicated on alcohol while in active service to the point where this happens.",
            "score": 133,
            "author": "Setamies46",
            "replies": [
                {
                    "level": 1,
                    "comment": "Huuuuge and probably eternal drinking culture in bases like Okinawa and Korea because that's all they let you do other than work over there. Fuck every tour in Korea its expected for us maintainers to just work and drink the whole tour.",
                    "score": 18,
                    "author": "Diddintt"
                },
                {
                    "level": 1,
                    "comment": "Yeah, they've been arguing that for years. But you know, \"drugs are bad\" and all. \n\nMaybe one day someone will realize how stupid it is.",
                    "score": 48,
                    "author": "Awkward-Action2853",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone who enjoys it myself, I will say one major drawback exists. Most of the countries that people get deployed to, it's illegal. Drug scandals on deployment always get way more news time.",
                            "score": 32,
                            "author": "IlluminatedPickle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup. Think it's a 3 year jail sentence in Japan, if I recall right, just for smoking. They are super strict about it here.",
                                    "score": 16,
                                    "author": "Awkward-Action2853",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "all depends on the status of forces agreement, also know as SOFA with Japan is.  Example in Germany a solider drunk drives, the police would deliver them to the front gate and hand them over to the military police.  I know US/Japan SOFA is different.  \n\nBest he can hope for is to be given back to the US to undergo article 15 punishment, a captain mast is to light, but with the egg on the US face he might face a court martial under article 134 conduct unbecoming.  I've known a few that were stationed there and they said usually the Japanese tells the US to remove said solider from Japan. \n\nedit just looked at it and the Japan is quite a bit different than European one.  Especially after the 1995 rape in Okinawa.  Since then, only a few select crimes under certain circumstance as covered the rest the Japanese get.",
                                            "score": 7,
                                            "author": "dragon38",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, the SOFA here gives Japan the right to prosecute first. The issue is, unlike America, a lot goes into it. They won't take a case to trial unless they know you're 100% guilty.\n\nIn most cases, if the local office that processes these doesn't want the case or doesn't feel they can win, they'll hand them back to the Americans. There are some politics that go into it and all, but it's really up to Japan on what they'll do first.",
                                                    "score": 7,
                                                    "author": "Awkward-Action2853",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "*they won't take a case to trial unless they 100% know they'll get a conviction\n\nA slight difference but an important one",
                                                            "score": 5,
                                                            "author": "DangerousBeans1",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "In this case they know they are being watched. But otherwise they get a conviction simply because they can hold you without bail almost indefinitely while they 'investigate'. Andvyour right to representation is limited. So you either plea guilty or sit in jail in near isolation for a long, long time.",
                                                                    "score": 2,
                                                                    "author": "ih-shah-may-ehl"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah, happened to Paul McCartney",
                                            "score": 2,
                                            "author": "wrathmont"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You can smoke THC-H tho so if You really want to smoke You can.",
                                            "score": 1,
                                            "author": "summerlad86",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, they got weird laws about that here. Can't smoke pot, but you're fine with (correct me if I'm wrong), synthetic stuff.\n\nSeems legit.",
                                                    "score": 1,
                                                    "author": "Awkward-Action2853"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That’s a scare tactic First Sergeants used during their libbo speech. Servicemembers caught with drugs (or most other crimes) were handed over to the MPs. \n\n— 5811, Foster/Butler PMO",
                                            "score": 1,
                                            "author": "AKMarine"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I heard Japan bans substances on a case by case basis which means research chemicals are available and sold legally in CBD shops.  LSD prodrugs are legit and to most indiscernible from the real deal.\n\nhttps://www.vice.com/en/article/93kakd/its-surprisingly-easy-to-get-legal-lsd-in-japan",
                                            "score": 1,
                                            "author": "PiratexelA"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't know how true it is but getting drunk like this can have repercussions. At least that's what my JROTC instructor had told us from his time in the army",
                    "score": 1,
                    "author": "No-Appearance1145"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I was there a Marine drunkenly slept in the wrong house and when a 12 yr old Japanese boy woke him up he assaulted the child then jumped out the window and compound fractured his leg.",
            "score": 8,
            "author": "Awellplanned",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was that around 2011 or something? If not, we had pretty much the exact same incident while I was there.",
                    "score": 9,
                    "author": "Awkward-Action2853",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was around 2011",
                            "score": 5,
                            "author": "Awellplanned"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "These young guys are treated like human meat missiles for two weeks straight at a time. Then they get a paycheck and a weekend off. Very often it doesn’t end well. \nAnd the Japanese prison system is heavy on punishment, we don’t do so well in there.",
            "score": 8,
            "author": "pjlaniboys",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"human meat missiles\"\n\nThat's a new one, and made me laugh.",
                    "score": 5,
                    "author": "Awkward-Action2853"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been hearing scattered stories of military misbehaving in Japan. Not sure what leadership needs to do to stop it, but this isn't the kind of image we want to present to our hosts.",
            "score": 7,
            "author": "Timely_Summer_8908",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Marines have always been treated, from an outside perspective, bad. They get treated worse than kids, so when they're finally let off base, they go crazy. In turn, they get locked down, treated like crap and the cycle repeats.\n\nSuppose the only way to fix that is to treat them like real people and not a pile of crap.",
                    "score": -17,
                    "author": "Awkward-Action2853",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I get acting out, but there's a difference between getting drunk and getting a tattoo you'll regret later and raping, trespassing, and getting into fights.  If you must act out, at least try not to take it out on others.",
                            "score": 24,
                            "author": "Timely_Summer_8908",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup. Can't say why it's so prevalent with the Marines. All 4 branches are represented on Okinawa, and a majority of the crime is committed by the Marines. Not saying the others don't partake, but they usually don't do the horrible stuff.\n\nOnly thing I could ever think of was something to do with how the Marines are treated. Most other branches enjoy relative freedom, while the Marines are kept rigged at all times. Always seems like when they get a little freedom, they go nuts. I could be wrong, but that's how we always viewed them from the Army.",
                                    "score": 10,
                                    "author": "Awkward-Action2853",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lower enlisted military grunts tend to attract the dregs of society. That's what you get when the qualification is a 30 on the ASVAB.\n\nSpent 4 years in the Army infantry. This kind of behavior was not abnormal.",
                                            "score": 13,
                                            "author": "weaver787",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "From my recollection, the USMC has higher standards for enlistment than the U.S. Army for equal career tracks. \n\nGranted, I’ve been out for 17 years, but that was how it used to be.",
                                                    "score": 0,
                                                    "author": "PHATsakk43",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If the marines have higher standards to get in why are they the leading cause in incidents in Japan? Lots of Navy and Army stationed there. Its the culture in the Marines thats the problem always has been.",
                                                            "score": 2,
                                                            "author": "tacmac10",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Marines are treated like complete shit by their command, in my experience. It is sort of like beating a dog and then wondering why the dog is a piece of shit. The USMC culture is completely different from the other branches. There was also a sailor involved in this incident, but, without knowing more, it may have been a Corpsman, which is effectively a Marine as well, but with USN insignia.",
                                                                    "score": 3,
                                                                    "author": "PHATsakk43",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Having worked with the marines a couple times I agree, the way they treat the junior enlisted is borderline criminal. The Corp needs a new culture, the Army did a full reset in the 90s and it was a huge improvement in performance, professionalism, and discipline. I enlisted in 96 and the stories the NCOs had about how out of control things were in the 80s and right up to the post Gulf war recovery were insane. CQs having to carry pistols in the barracks at Fort Bragg, brothels in the barracks, wide spread use of coke and heroin, gun running. My first unit at fort hood had two vietnam vet platoon sergeants and 15 known gang members ( wore their colors to mandatory fun events ). It was so much better by the time I retired in 2018, almost like two different Armies.",
                                                                            "score": 5,
                                                                            "author": "tacmac10",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah, I missed out on a lot of that as the USN had cleaned house pretty thoroughly after the 1981 crash on the USS Nimitz by an A6 that was linked to rampant drug use among the crew. While I think there was a bit of hysteria about the whole thing, the end result was that the USN was a pretty straight-laced organization by the time I got in. Add to that the officer corp getting their word of prayer after Tailhook in the early 1990s. \n\nMy current opinion is that the JSOC guys need to be rebuilt from the ground up at this point, as the whole \"quiet professional\" thing has flown out the window and the whole organization is filled with bros who are completely infatuated with themselves. That's a personal opinion based on observations and collogues that work with the group.",
                                                                                    "score": 3,
                                                                                    "author": "PHATsakk43",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "ASVAB score requirements for 0311 (infantry) are lowest in the Corps. The health requirements (physical, psychological, criminal…) are higher than the Army. The training is more rigorously demanding than the Army’s as well of course.",
                                                            "score": 0,
                                                            "author": "AKMarine",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Things change over time and needs of the military as well. \n\nThe military I enlisted into in 1999 was completely different than the one I was seeing in 2004 and 2005 before I got out. The USN was booting people out for not advancing past E-5 at 12 years, and the Army was taking high school dropouts again. On the other hand, in 1999, the only branch that would even talk to me with a 99 ASVAB was the USN, because I had broken my arm at 15 skateboarding, and the navy only took me because they put in for nuke school.",
                                                                    "score": -1,
                                                                    "author": "PHATsakk43"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Shit, the qualification is only 30 on the ASVAB?\n\nI took it to get out of class during my senior year and ended up getting a 91. \n\nI sometimes wonder how different my life would be if I considered more the time the navy called me and asked if I would be interested in nuclear engineering.",
                                                    "score": 1,
                                                    "author": "jobadiahh"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I guess a test wouldn't hurt.",
                                            "score": 1,
                                            "author": "Timely_Summer_8908"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Another Tuesday in Okinawa. Send the lady a fruit basket and rolls of toilet paper. Move along",
            "score": 9,
            "author": "epsilonzer0",
            "replies": [
                {
                    "level": 1,
                    "comment": "You make it sound like US military members are a plague.",
                    "score": -10,
                    "author": "RandomActOfMindless",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately, this incident is very tame compared to the norm. Anyone who’s stopped there on a deployment seems to have a really bad story. (Including me)",
                            "score": 3,
                            "author": "branflake777"
                        },
                        {
                            "level": 2,
                            "comment": "Its a specific base culture problem in Okinawa. It’s hard to pinpoint when it started but probably during the Korean War when guys would get shore leave.  Many commanders have tried to root it out and to some success but everyone leaves Okinawa with more than a few stories to tell.",
                            "score": 1,
                            "author": "epsilonzer0"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How much trouble all depends on the status of forces agreement, also know as SOFA with Japan is.  Example in Germany a solider drunk drives, the police would deliver them to the front gate and hand them over to the military police.  I know US/Japan SOFA is different.Best he can hope for is to be given back to the US to undergo article 15 punishment, a captain mast is to light, but with the egg on the US face he might face a court martial under article 134 conduct unbecoming.  I've known a few that were stationed there and they said usually the Japanese tells the US to remove said solider from Japan.\n\n&amp;#x200B;\n\nedit just looked at it and the Japan is quite a bit different than European one.  Especially after the 1995 rape in Okinawa.  Since then, only a few select crimes under certain circumstance as covered the rest the Japanese get.",
            "score": 2,
            "author": "dragon38",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was an MP on the Rock during the 1995 rape incident and the 1997 drug busts (largest drug operation in Oki history at that point). \n\nThere were significant changes to SOFA (both formally and informally).  Early 90s service members will remember Oki as a party deployment — getting wasted at Gate Street, and getting ____ at Whisper Alley. Service Members (especially Marines) were given very little wiggle room in off-base behaviors in the late 90s. PMO had MPs constantly on duty off base at night, and multiple MPs walking the beat on weekends. \n\n—5811 stationed at Bulter PMO.",
                    "score": 3,
                    "author": "AKMarine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My dad was stationed in Oki back in the late 70's and I was like 4 at the time so don't remember a lot.  However, as I grew up, he told a lot of stories about his time there.  One time he got drunk off wormwood and drove through the gate not once but three times and each time they just waved him through.\n\n&amp;#x200B;\n\nattitudes were alot different back then.\n\n&amp;#x200B;\n\nedit I think it was absinthe which contains wormwood that he drank.",
                            "score": 2,
                            "author": "dragon38"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " Why does this sound like the plot of a JAG episode",
            "score": 2,
            "author": "The-Potion-Seller"
        },
        {
            "level": 0,
            "comment": "throw the book at him",
            "score": 3,
            "author": "dmtandcrumpets"
        },
        {
            "level": 0,
            "comment": "My family was deployed here for 4 years and for most people involved in this experience it's definitely a blessing yet time and time again something like this happens. While this is mild there has been multiple incidents where rape and theft had cause wild scale retaliation from the native Okinawan residents and calls to remove the Americans. It's really sad to see in my opinion the most peaceful place in the world with insanely low crime tainted by our horrible influence",
            "score": 1,
            "author": "JaggerDeSwaggie"
        },
        {
            "level": 0,
            "comment": "Insert *NCIS THEME SONG*",
            "score": 1,
            "author": "commentman10"
        },
        {
            "level": 0,
            "comment": "Good.....Another command failure. Too many incidents under their control.",
            "score": 1,
            "author": "torrfam15"
        },
        {
            "level": 0,
            "comment": "Seriously, there have been a LOT of incidents with US Servicemen there over the years. Time for some changes. Harsher penalties or something for perpetrators.",
            "score": 1,
            "author": "LucasJackson44"
        }
    ]
}