{
    "id": "148cmyz",
    "score": 1394,
    "title": "Jack Dorsey: India threatened to shut Twitter and raid employees",
    "author": "fastclickertoggle",
    "date": 1686653855.0,
    "url": "https://www.reddit.com/r/news/comments/148cmyz",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Jack Dorsey: officially endorsed Robert F. Kennedy Jr. for president, saying he was the best Democratic candidate who had a shot at beating Republican rivals Ron DeSantis and Donald Trump.\n\n🤭🤡",
            "score": 545,
            "author": "neridqe00",
            "replies": [
                {
                    "level": 1,
                    "comment": "So many VC tech bros are on the RFK war path. I just don’t get it… it’s so out of touch with reality.",
                    "score": 67,
                    "author": "Pleroo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which should is hilarious because all the supporters of RFK talk about how he is super anti-corruption and anti- corporate...",
                            "score": 40,
                            "author": "edgarapplepoe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's anti-vax as well",
                                    "score": 41,
                                    "author": "cheridontllosethatno",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What did he say that is anti-vaxx? I've been googling for 10 minutes and I'm tired. All the articles just call him an 'anti-vaxx activist' without elaborating.",
                                            "score": 1,
                                            "author": "FranticToaster",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Go on YouTube..I found some vids",
                                                    "score": 1,
                                                    "author": "cheridontllosethatno"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's not physically possible to accumulate that level of wealth and be anti-corporate. I dare say it's not even possible to be truly \"anti-corruption\" at that level of wealth. So basically, he's full of shit.\n\nPeople might as well endorse someone for saying they're anti-weed while smoking a blunt on live TV.",
                                    "score": 27,
                                    "author": "candr22",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did he accumulate wealth or just inherit it?   Same for his reputation.",
                                            "score": 8,
                                            "author": "Megalocerus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In this context, I’m not sure the distinction is relevant but I’m open to discuss/hear your thoughts.\n\nI don’t know how well any of us can realistically track his personal finances, at least well enough to know how much of his wealth has been earned through his personal ownership in various entities vs what has been inherited. There’s some overlap as well, presumably. But my point doesn’t really hang on whether he personally earned it. He could’ve inherited every dime and profit interest he has and the fact remains that he can’t possible be anti-corporate while maintaining those interests. \n\nTo be clear, this is not a per se attack on anyone who earns money from corporations, whether passively or through actual employment. I’m just tired of politicians being allowed to run on platforms that are blatant and verifiable bullshit.",
                                                    "score": 5,
                                                    "author": "candr22"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I really need to know why this is a thing. I’ve seen it all over recently.",
                            "score": 8,
                            "author": "NotYetSoonEnough"
                        },
                        {
                            "level": 2,
                            "comment": "All rich people are out of touch.\nRegardless of party leaning, religion or even location. \n\nYou think Warren buffet has ever gone hungry? Or Elon, Amazon's Lex Luther?? \n\nThey are all utterly and completely out of touch.",
                            "score": 9,
                            "author": "DevourerJay"
                        },
                        {
                            "level": 2,
                            "comment": "Just like every other wealthy politician. Unfortunately,  no one votes for candidates with no money.",
                            "score": 2,
                            "author": "DAecir"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Seriously? Man talk about a bad take...",
                    "score": 103,
                    "author": "zZaphon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who do you think is the best democrat option?",
                            "score": -6,
                            "author": "TheDisappointed",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not the person you’re replying to, but unfortunately it looks like Biden is the only one with enough support to have a shot at winning. Also the least crazy current candidate, despite the obvious issue of his age.",
                                    "score": 41,
                                    "author": "czar1249"
                                },
                                {
                                    "level": 3,
                                    "comment": "Joe Biden. \n\nEveryone makes this shit too complicated.\n\nOld people vote more than young people. People vote for people of their generation and names they know. They don't care that Biden is old as fuck so they will vote for him. The most people every voted for him last time.",
                                    "score": 45,
                                    "author": "Dr_Edge_ATX",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Old person here who does find him rather unreasonably old.  I feel like I'd be voting for Harris, and I'm not crazy about her.  \n\nThere seemed to be several decent governors of reasonable age out there.",
                                            "score": 4,
                                            "author": "Megalocerus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah there's plenty of more qualified people but if voters don't know who they are they won't care. It's been this way forever and somehow has gotten worse in the social media age.",
                                                    "score": 7,
                                                    "author": "Dr_Edge_ATX",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Media will give us their list of approved candidates to pick.  I still blame media and Hillary for Trump",
                                                            "score": 0,
                                                            "author": "boredatwork813"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "And if any of them get on the ticket, they can't be as sure to win over Trump or DeSantis. And those two would be way worse than old Biden and Harris put together.",
                                                    "score": 1,
                                                    "author": "DAecir"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It is important to vote for the one that can beat Trump and DeSantis... right now, that is Biden. We can not have either of these half wits as our president. My real dream is that Trump splits the Republicans and takes his base to another party. Then, neither Trump nor DeSantis would have enough votes to win. We are already stuck in limbo because of the Republican House members that can't focus on the job they were elected to carry out for their constituents. These guys are on strike because they are pissed about McCarthy being out maneuvered by Biden on the debt ceiling hostage farce... Gotta give it up to the old guy. Biden has been in politics longer than McCarthy, and most of his crew have been alive. In that time, he learned a lot of tricks.",
                                            "score": 1,
                                            "author": "DAecir"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He's the natural best choice v. Trump specifically. I would like to play devil's advocate by saying that in the highly unlikely scenario that the Republicans choose a young candidate, he could be a liability.",
                                            "score": 1,
                                            "author": "dwarfinvasion"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Exactly this. Older people show up and show up for every election. You'll be lucky to get a low percentage of younger people to vote period.",
                                            "score": 1,
                                            "author": "Trix_Are_4_90Kids"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Probably the one who’s already show he can beat trump once…. Was that an actual question??",
                                    "score": 17,
                                    "author": "Vols86"
                                },
                                {
                                    "level": 3,
                                    "comment": "Bernie Sanders",
                                    "score": -2,
                                    "author": "MadScienceBro",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because Biden is not old enough.",
                                            "score": 10,
                                            "author": "Megalocerus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Send in Cthulu",
                                                    "score": 4,
                                                    "author": "too_old_to_be_clever"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He only said that elmo is the only person who could save twitter. He's a twit.",
                    "score": 9,
                    "author": "rmpumper"
                },
                {
                    "level": 1,
                    "comment": "&gt;Jack Dorsey: officially endorsed Robert F. Kennedy Jr. for president, saying he was the best Democratic candidate who had a shot at beating Republican rivals Ron DeSantis and Donald Trump.\n\nAre you serious??\n\nJesus Fucking Christ. All these people are fucking crazy...",
                    "score": 168,
                    "author": "Barneyk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is why I'll never feel bad for a rich guy like Jack. He's Elon-lite with his behavior and outlook on life.",
                            "score": 54,
                            "author": "crevassier",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People like him are so rich they can afford to treat national politics like a casual experiment.  If things turn out bad, they are well insulated from the problems.",
                                    "score": 15,
                                    "author": "255001434"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not crazy, just out of touch with the same reality the rest of us poor slobs have to deal with.\n\nWhen you're so rich, you literally can't spend it faster than the interest accumulates. It's hard to relate to the problems of other people.",
                            "score": 124,
                            "author": "malphonso",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wealth-induced psychosis 💀",
                                    "score": 22,
                                    "author": "a_butthole_inspector"
                                },
                                {
                                    "level": 3,
                                    "comment": "You seem to be implying that there’s is a causal relationship between having a lot of money and endorsing a known anti-vaxer. I think a simpler explanation is that being smart in one area (internet technology) does not necessarily translate into being smart in other areas (medicine, government).",
                                    "score": 9,
                                    "author": "gregor-sans",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;  explanation is that being smart in one area (internet technology)\n\ntwitter is not a clever idea, webpage or service",
                                            "score": 3,
                                            "author": "Legitimate_Air9612"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I totally agree with this. 👍",
                                    "score": 19,
                                    "author": "neridqe00"
                                },
                                {
                                    "level": 3,
                                    "comment": "For most people, the crazy thing is, it would only take a few million in a high yield Mutual Fund to make money faster than they could spend it. 8% is pretty typical for mutual funds, and 8% of 10 million is $800,000. I could live a much more extravagant life with that kind of returns and still be putting away hundreds of thousands of dollars a year.",
                                    "score": 2,
                                    "author": "Dt2_0"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's called vote-siphoning.",
                            "score": 20,
                            "author": "SpaceTabs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "RFK is more likely to siphon anti vaccine right wingers than any other group.",
                                    "score": 17,
                                    "author": "Haunting-Ad788",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right wingers aren't going to vote for a Kennedy. Agreeing on one thing isn't enough.\n\nHe'll attract the left wing antivaxxers and siphon Dem votes.",
                                            "score": 2,
                                            "author": "255001434",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't know, wasn't one of the big Qanon things that JFK was going to come back and and reinstall Trump as president using magic beans or something?",
                                                    "score": 6,
                                                    "author": "bajesus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes, but they meant the real JFK, not a relative.",
                                                            "score": 0,
                                                            "author": "255001434"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Right wingers aren't going to vote for anyone that says they care about the environment, even when they're obviously lying about it.",
                                                    "score": 3,
                                                    "author": "Diarygirl"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Wouldn’t he be running in the primaries against Biden? Would a 3rd party run in the general election be vote siphoning?",
                                    "score": 2,
                                    "author": "RyanWilliamsElection",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, like the entire Green Party is just a vote siphoning operation by the Republicans.",
                                            "score": 22,
                                            "author": "Anlysia",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Jill Stein had more votes than the difference between trump and hrc in 2016 (in Wisconsin). So all those people that care so much that they voted for a green party candidate helped put trump in office. \nSame with Nader in 2000. Same with republicans trying to get Kanye on the ballot in 2020.",
                                                    "score": 21,
                                                    "author": "lazyfacejerk",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hillary helped Trump win.  I'll take the down votes.",
                                                            "score": -3,
                                                            "author": "boredatwork813"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He also thought bitcoin would bring about world peace.",
                            "score": 3,
                            "author": "tubbablub"
                        },
                        {
                            "level": 2,
                            "comment": "RF Kennedy Jr. is a lunatic. Rich people inbreeding has been used to describe this guy.",
                            "score": 2,
                            "author": "DAecir"
                        },
                        {
                            "level": 2,
                            "comment": "Am I the only one that thinks the use of the word \"shot\" is probably not best used in combination with a Kennedy?",
                            "score": 3,
                            "author": "SirLoopy007",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ha!  I thought you were referring to his anti vax bullshit and not the dude who was shot 60 yrs ago.",
                                    "score": 2,
                                    "author": "DebMo_Cu"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dorsey has been very anti-gov for a while now. He just does it from the left.",
                            "score": 1,
                            "author": "sonoma4life"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Jack has been to too many Hampton's parties with the rich folk. Robert Kennedy has no clue what real people do for work.\n\n  \n\n\nRich upbring and neuvorich love in an echo chamber.",
                    "score": 47,
                    "author": "RuairiSpain"
                },
                {
                    "level": 1,
                    "comment": "&gt;endorsed Robert F. Kennedy Jr. for president,\n\nI can't understand a word that dude says, man. I need subtitles for him.",
                    "score": 59,
                    "author": "ManfredTheCat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That unfortunately does not help make what RFK Jr is saying make sense.",
                            "score": 51,
                            "author": "code_archeologist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Need that goo from Quantumania.",
                                    "score": 3,
                                    "author": "buriedego"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dorsey is a libertarian like Musk.  \n\nWants government gone and everything be “decentralized”. \n\nThey’re into longtermism. \n\nThese people are dangerous.",
                    "score": 11,
                    "author": "gravtix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's a new word for me.\n\nLongtermism reads as a good idea on paper, why isn't it?",
                            "score": 2,
                            "author": "axonxorz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because people are liars, and will not put the long term good before their own short term gain. Its just another big lie, like libertarianism itself.",
                                    "score": 5,
                                    "author": "basics"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Jack Dorsey has the exact beard I would expect someone like Jack Dorsey to have.",
                    "score": 3,
                    "author": "Cartoonlad"
                },
                {
                    "level": 1,
                    "comment": "Dorsey's always been a piece of garbage so this isn't surprising.  He was busted following a bunch of right wing people like Cenovich a few years back and immediately started clearing out his follows and sanitizing his profile.\n\n\nThe Kennedy family is a series of failsons of failsons, Joe Kennedy III throwing away a safe Congress seat to primary a hugely popular Dem senator for example (not only did he lose but a Republican won his Congressional seat iirc).  Political dynasties in the US are a blight and none reinforce this more strongly than the Kennedys.",
                    "score": 10,
                    "author": "Squire_II",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; He was busted following a bunch of right wing people like Cenovich a few years back and immediately started clearing out his follows and sanitizing his profile.\n\nWhy does this make him a piece of garbage? I don't have a Twitter account, but when I did, I'd follow Influential people I disagreed with because I think it's important to read what they say directly from them. I have no idea what the guys politics are and frankly, I don't care, but it's insane to me that keeping up with opposition people is a bad thing. \n\nI don't blame the guy for clearing people out either, since people like you see following someone bad, as a bad thjng. If I was a public figure and started facing backlash for something dumb that doesn't matter, I'd just stop doing it because I'd rather avoid internet hate mobs.",
                            "score": -5,
                            "author": "impy695",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree with you to an extent; I also follow people I don’t agree with to sort of keep an eye on what people are saying. But it was sort of clear that Jack and Elon aren’t following these guys for that reason and are actually following them because they think they’re credible/like what they’re about.",
                                    "score": 0,
                                    "author": "shoefly72"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dafaq has that anything to do with this post??",
                    "score": -27,
                    "author": "can_be_therapist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Quite a lot actually if we are sharing dorsey quotes. \n\nShows his head is in the clouds with the rest of the loons. Take what he says with a grain of salt and all that jazz.. IE its hard to take anything he says seriously. 🤡",
                            "score": 30,
                            "author": "neridqe00",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I get what you're saying, but one is a political opinion, and the other is stating (alleged) facts about something that happened in the past.\n\nIt's not really a direct comparison, especially when you really read Indias response. They're responding to accusations that he never made and not really directly disputing anything specific, just a generic \"he's lying\" followed by nothing of substance.\n\nWe also know that under Musk, Twitter has complied with significantly more takedown requests by governments, which is directly what the quote from the OP is attacking.\n\nWhile Dorsey may not be someone I'd  enjoy talking politics with, based on everything we've seen, I think it's fair to believe him with this claim.",
                                    "score": 0,
                                    "author": "impy695"
                                },
                                {
                                    "level": 3,
                                    "comment": "So you saying he's lying about Indian govt doing that? And what might be the reason?",
                                    "score": -14,
                                    "author": "can_be_therapist",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are you putting words in my mouth? Did I say, suggest, comment about, or share that he's lying about the Indian government?\n\nNo I did not. I simply mentioned anything this person says, take it with a grain of salt(just to repeat myself) because he's a loon who's head is high in the clouds and supports rfk. If you support rfk you're on a completely different planet then the rest of us \n\nBut to touch on your misinterpretation of my words, if india did this while he was the boss, why didn't he make a bigger deal about it? You need not answer though because he's not the boss any more and has lost a lot of relevancy in today's world SPECIALLY when he endorsed rfk.",
                                            "score": 11,
                                            "author": "neridqe00"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Alright the clown car is getting full. everyone out.",
                    "score": 1,
                    "author": "shrekerecker97"
                },
                {
                    "level": 1,
                    "comment": "Geriatric Biden’s your man of choice huh?",
                    "score": -16,
                    "author": "LeftistYankee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Over RFK or a GQP'er? \n\nIt has to be. \n\nVoting for a GQP or rfk will do nothing but fuck this country up more. Inexperienced god fearing racist lying jagoff fundamentalist's don't need to be in office nor should they be public servants.",
                            "score": 17,
                            "author": "neridqe00"
                        },
                        {
                            "level": 2,
                            "comment": "Trump supporters don't like old people now?",
                            "score": 3,
                            "author": "Diarygirl"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why did he have Ali Alexander on payroll? You know the guy who organized buses for Jan 6th.",
            "score": 132,
            "author": "icantfindanametwice",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wasn't Twitter the official sponsor of Jan 6th?",
                    "score": 59,
                    "author": "Tedwynn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man, India is real hardcore. They don't raid offices but raid the employees.",
            "score": 36,
            "author": "HulkSmashTh",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Open up Carl, We're coming inside you!\"",
                    "score": 7,
                    "author": "too_old_to_be_clever",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't threaten me with a good time.",
                            "score": 8,
                            "author": "PorkThruster",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Username checks out.",
                                    "score": 1,
                                    "author": "Siegfoult"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wish they would go to that one office block in Kolkata where all the call center scammers are.",
                    "score": 2,
                    "author": "Dt2_0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People on India subs are losing their shit over this. Claiming that a U.S company has to abide by their laws and their policies, which is only true if they actually care about operating in that country, otherwise the country can choose to blanket ban all requests going to the service.",
            "score": 56,
            "author": "MenstruatingMuffin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just like in China and Islamic countries. They ban anything and everything they don't like.",
                    "score": 25,
                    "author": "bpqdl"
                },
                {
                    "level": 1,
                    "comment": "Of cause you have to abide by a countrys laws if you want to do business there.\nThats why Facebook and Twitter alway threatening to stop business in the EU, but they won't and cave into the laws because the business is to big to leave out Europe.",
                    "score": 16,
                    "author": "mudokin"
                },
                {
                    "level": 1,
                    "comment": "The CMA is doing the same over Microsoft in the UK. Their concern is Cloud Gaming monopoly.\n\nUK citizens could use vpn to access cloud gaming Indian citizens could use a vpn to access twitter.",
                    "score": 9,
                    "author": "RyanWilliamsElection",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Absolutely they could, they still don't have any jurisdiction to force the companies to do anything about it. Microsoft maybe a bit more so because I believe it has physical locations in most countries.",
                            "score": 4,
                            "author": "MenstruatingMuffin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good riddance.",
                            "score": 1,
                            "author": "Brocky445"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -19,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 36,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "A different revenue stream to replace it.",
                    "score": 18,
                    "author": "8-bit-Felix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought international drug trafficking would be enough tbh",
                            "score": 1,
                            "author": "TheDriftersEscape"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For anyone interested the full interview with Jack Dorsey was on the News program Breaking Points. I listened to the podcast version last night and found it quite interesting.",
            "score": 17,
            "author": "7milefish"
        },
        {
            "level": 0,
            "comment": "Too bad they didn't follow through and shut down Twitter (only) in India. That app is social cancer.",
            "score": 45,
            "author": "JumpyFail5461",
            "replies": [
                {
                    "level": 1,
                    "comment": "Totally agree! Only government approved apps should be permitted over there. Keep ‘em isolated.",
                    "score": -1,
                    "author": "smellysurfwax"
                },
                {
                    "level": 1,
                    "comment": "Still better than Reddit and it's pedos.",
                    "score": -26,
                    "author": "bpqdl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've never seen pedophile subs but I don't go to conservative subs so I can't say they're not there.",
                            "score": 15,
                            "author": "Diarygirl"
                        },
                        {
                            "level": 2,
                            "comment": "I'd ask for a citation for why you think that, but after checking your post history, I don't know if you know of *any* decent sources.",
                            "score": 12,
                            "author": "Captain_Kuhl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lmao I had to look too. What a fuckin loon \n\nPeople that have no personality inevitably make a political one and it’s always the most nonsense bullshit youve ever heard of. Left and right",
                                    "score": 6,
                                    "author": "spinblackcircles"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm surprised Jack had time to say this between endorsing Robert Kennedy (a clear right wing plant to try to take votes from Biden) and spreading right wing conspiracy theories about Biden and other liberals.",
            "score": 13,
            "author": "bauN7",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't understand why anyone ever said Dorsey was liberal.",
                    "score": 4,
                    "author": "Diarygirl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My issue is him spreading misinformation with a giant platform. Not his personal politics.",
                            "score": 2,
                            "author": "bauN7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "India isn't really a democracy under the radical hindutva government",
            "score": 40,
            "author": "tripple_little",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s a government elected by the people with a thumping majority. Not sure what definition of democracy you are using. FYI - Democracy doesn’t mean following western values.",
                    "score": -13,
                    "author": "Brocky445",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Democracy is an echo chamber. It's why public education is so important in democratic countries.",
                            "score": 5,
                            "author": "MemphisAmaze"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As much as I am not a fan of the so called radical elements, such blanket statements are equally pointless. Did the US stop beinv a democracy when the Capitol was stormed by militia or when they couldn't announce election results for days?",
                    "score": -19,
                    "author": "FailedFizzicist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did those people successfully seize the government?",
                            "score": 22,
                            "author": "Haunting-Ad788"
                        },
                        {
                            "level": 2,
                            "comment": "Yes, the idea of wanting to get an accurate count in a number of close states before saying someone won is... so *very* undemocratic.\n\nAlso, said loons did not in fact take over so yeah.",
                            "score": 1,
                            "author": "Aurion7"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh boy...based on your statement I really don't want to know what your definition of democracy is.\n\nIndia is not a perfect country but it has become politically stable over the years. There been an assassination or impeachment in over 30 years for the prime minister.\n\nAs days go by I keep see so much corruption in the USA that I wonder how is this country considered stable. Big corporations are looting the American people and there is nothing being done in a significant scale to hold the corrupt people accountable. There are too many similarities to India on how the politicians, police, judges, and the 1%ers are behaving in the US.",
                    "score": -7,
                    "author": "Aviyan"
                },
                {
                    "level": 1,
                    "comment": "Still better than all Islamic countries.",
                    "score": -15,
                    "author": "bpqdl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "/r/TimPool'er. Yeah your stance checks out.",
                            "score": 10,
                            "author": "axonxorz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not surprised. India and turkey are \"democracies\"",
            "score": 37,
            "author": "Sivick314",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -12,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What future? Caliphate? India is becoming a superpower because of cheap labour (slaves), but I don't see any future for Turkey. Just because they allow women with bikinis on their beaches doesn't mean they have a future.",
                            "score": 5,
                            "author": "bpqdl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're right, it's a slim chance, but it is still more than India's chance. The idea that India becomes a Superpower this century is laughable.",
                                    "score": -1,
                                    "author": "ThatOneMartian",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why laughable ? I’m a slave from India living in a 3 Bedroom house with the Peanuts my 60 Billion Board Indian Startup pays me.",
                                            "score": 0,
                                            "author": "tapertapper"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes. Very much so. Is there a problem with it? Any organization or individual that does not line with India's policies will be demolished in the country.",
                    "score": -73,
                    "author": "lincolnblake",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The notion, every organisation or individual unaligned with India’s (or rather the current governments) policies was crushed is plainly wrong; India has free elections and mostly honours civil liberties.\n\nOn the other hand there are issues regarding (civil liberties generally but more precisely) the freedom of the press and opposition, which is why the allegations mentioned in the article seem more than credible, at least possible.\n\nThese limited undemocratic practices are the exact reason why India is deemed to be a flawed democracy (as opposed to a full democracy) by the EIU democracy-Index.\n\nAnd to answer your question: Yes, there is a problem with it democracy itself and the firmly protected civil liberties it enables and guarantees are the very Badis of fair and just society.",
                            "score": 19,
                            "author": "SadAd36",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you murder the functionality of the 4th estate can you really call yourself a democracy?",
                                    "score": 8,
                                    "author": "SimbaOnSteroids",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We both know you can’t wholly, but I think it’s important to clearly express the differences between a flawed democracy and authoritarian regime; the same applies to the differences between a flawed and functioning democracy.",
                                            "score": 2,
                                            "author": "SadAd36"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That scale is a little biased if you ask me. The fact that the UK is listed as a “full democracy” when the monarch literally has the power to dissolve all democratic institutions in the country by stroke of a pen, is utter nonsense. I get that doing that would be political suicide, but their monarchy is *absolute*. And while “democracy” has existed in the country for hundreds of years (mostly reliably) it only takes one rogue decree to get rid of it (it’s happened before, another Charles). By definition, this is not democracy, despite their implementation of their parliamentary system.",
                                    "score": 1,
                                    "author": "SgtDirtyMike",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Surely the scale is biased, the UK are no indication for that though.\n\nAs you rightfully observe there are constitutional powers granted to the monarch (albeit being much rather formal than factual powers); this directly leads to the inference that it is not an absolute monarchy, as an absolute monarchy inherently has no means of restricting the (absolute!) power of the monarch (I.e. by a constitution).\n\nLastly the UK is a parliamentary monarchy; despite the formal declaration of the monarch as sovereign, he holds no power an couldn’t abolish democracy with whatever effort, the UK on the other hand could abolish the monarchy by decision if the parliament and plebiscite. The democratic and constitutional state is not graciously permitted by the monarch, it cannot be abolished by the monarch, which is precisely why the UK is a full democracy.\n\nI cannot begin to envision the mental acrobatics you had to undertake to come to your conclusion.",
                                            "score": 1,
                                            "author": "SadAd36",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If by mental gymnastics you mean my assertion that previous monarchs have dissolved parliament entirely, meaning there is actual historical precedent for it then yes, by all means insult me with such slander. \n\nThe fact is, that “constitution” is one in name only. It applies when convenient, and requires a contrived and esoteric legal analysis to understand in its entirety. There is no formal written document.  The only formal written documents that guide that government are those given royal assent. Even if the courts uphold laws concerning the sovereign, that sovereign had to first give assent to those laws, and even then, the sovereign is immune from all prosecution. \n\nThis whole circular reasoning of “well the monarch is restricted by the constitution, the constitution is established in a body of case law, but the monarch also approves the laws but is also above the law” is just absolutely absurd. A wolf in sheep’s clothing — and absolute monarchy under the guise of a parliamentary constitutional democracy. Let’s call a spade a spade.",
                                                    "score": 1,
                                                    "author": "SgtDirtyMike"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And that's why they are \"democracies\"",
                            "score": 18,
                            "author": "Sivick314"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How about just raid the scam call center.",
            "score": 8,
            "author": "KYWizard"
        },
        {
            "level": 0,
            "comment": "If they want we can send them Elon too. He seems to be taking up valuable real estate.",
            "score": 4,
            "author": "shrekerecker97"
        },
        {
            "level": 0,
            "comment": "I get Brad Pitt from 12 Monkeys vibes from RFK Jr.",
            "score": 4,
            "author": "Leafybug13"
        },
        {
            "level": 0,
            "comment": "That will make them surpass many countries in terms of online quality.",
            "score": 5,
            "author": "Thick_Information_33"
        },
        {
            "level": 0,
            "comment": "Same thing happens in Europe, follow the rule or get the F out :)",
            "score": 1,
            "author": "Tony_Slark_"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "From the beginning of the article:\n\n&gt;In an interview with a US-based YouTube channel, Mr Dorsey said India requested removal of several tweets and accounts linked to the farmers' protest in 2020.",
                    "score": 4,
                    "author": "nimcau2TheQuickening"
                },
                {
                    "level": 1,
                    "comment": "Yeah this dude manages square/cash app and has nothing to do with twitter. He also does a ton of humanitarian work in Africa. Two sides of a coin always.",
                    "score": 2,
                    "author": "PornstarVirgin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which India? I heard there are two Indias.\n\nedit: wow, no one understood my Succession reference lol",
            "score": -15,
            "author": "inconsistent3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe it was a shitty reference cause I’m a big fan and I don’t remember that line",
                    "score": 1,
                    "author": "spinblackcircles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s when Mattson admits to Shiv that the GoJo subscriber numbers in India are bullshit and that it would take two Indias to have the numbers they’re publishing.",
                            "score": 1,
                            "author": "faceisamapoftheworld"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just another day for you and me in paradise!",
            "score": 1,
            "author": "PsychologicalCod3712"
        },
        {
            "level": 0,
            "comment": "That’s odd - musk loves the autocrats.",
            "score": 1,
            "author": "Alternative-Flan2869"
        }
    ]
}