{
    "id": "148hd94",
    "score": 3153,
    "title": "Pride flags vandalized at Stonewall National Monument",
    "author": "repulsive_angel",
    "date": 1686668338.0,
    "url": "https://www.reddit.com/r/news/comments/148hd94",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The operatives at the Manhattan Institute are some of the characters behind this latest push. It's been several years of re-seeding this paranoia on the conservative base, and it's working as planned.  I recently went on vacation to Mexico and overheard two American women with their kids enjoying the nice weather and beach and casually chatting about Democrats having underground tunnels and dungeons to convert all toddlers into transgender rainbow militants and that something \"has to be done.\"  They are not joking.",
            "score": 588,
            "author": "southpalito",
            "replies": [
                {
                    "level": 1,
                    "comment": "How the fuck do they actually, earnestly believe this? I mean, if you actually believe that a massive pedo underground railroad is going on in your country, why would you just be walking around joking about it on vacation? Your brain would be melting 24/7.\n\nI don't think they actually believe this shit, but pretending they do gives them an excuse to do actual harm unto perceived enemies. Fuck these people.",
                    "score": 328,
                    "author": "Training_Mud3388",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Many people believe conspiracies not because they were convinced by shoddy evidence but because it says something they *already believe* about the social world. \n\nIf you already believe the world has exactly two sides, and your side is good, then that means anyone not on your side is therefore evil. Once you believe that, you can buy literally any story someone pitches to you as to why. Even if it's not exactly literally true, it's true enough in essence, they'll tell you.",
                            "score": 196,
                            "author": "Nix-7c0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cognitive dissonance, combined with an echochamber of constant confirmation bias and ragebait.",
                                    "score": 36,
                                    "author": "Lazerspewpew",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 0,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Folding ideas is goat at explaining the crazies",
                                    "score": 7,
                                    "author": "lockezwill",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hah, yes this is absolutely a borrowed observation from his essay, \"[In Search of a Flat Earth](https://youtu.be/JTfhYyTuT44)\"",
                                            "score": 11,
                                            "author": "Nix-7c0",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; If you already believe the world has exactly two sides, and your side is good, then that means anyone not on your side is therefore evil.\n\nHence why I'm an Anti-theist, one of the biggest gripes and arguments I get from religious people is always \"How does it hurt you if people want to believe in a higher power\"         \n          \nIt's that uncritical thinking that is so dangerous and our society's passive reluctance to call people out on their bullshit, that's how we got MAGA, that's how we got Covid Deniers, that's how we got the Proud Boys, that's how we got \"Karans/Kevins\". By standing by and staying quiet, minding our own business and \"Not my problem\" we have a large portion of deranged schizophrenic-lites who talk to people who aren't there, make wishes instead of plans, suffer from superiority complexes, take advice from randoms off Facebook and shun experts.         \n             \nAnd before anyone responds with \"But that's not ME!? I'm a good  &lt; insert unsupported belief here &gt; ! Don't lump me in with people who can't tell the difference between delusion and reality, I would never mistreat a minority because &lt; insert Holy book here &gt; says to kill/enslave/convert them!\" maybe read that Holy text sometime.",
                                    "score": 37,
                                    "author": "dizorkmage"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;It says something they already believe about the social world\n\nThis also ties into psych projection. \"Democrats are doing (insert conspiracy)!\" Because they themselves have thought about doing it",
                                    "score": 23,
                                    "author": "d0ctorzaius",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And almost definitionally people with low empathy will think that you think like they think",
                                            "score": 12,
                                            "author": "Nix-7c0"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This seems like a flimsy argument. Couldn't I just say the same thing to the other side? Anyone accusing anyone of anything is just projecting? \n\nPlease do not take this as endorsing these wackjobs.\n\nBut with your logic, if I accuse the GOP of being fascist, I am projecting that, in fact, I am fascist?",
                                            "score": -5,
                                            "author": "Redspade_ED",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It would depend on whether the accusations have any evidence behind them. Do GOP policies match some objective measure of fascism? If not, then you'd possibly be projecting. But the conspiracies on the far-right are typically backed by zero evidence, so the accusations must have come from somewhere (like one's own thinking or personal experience)",
                                                    "score": 8,
                                                    "author": "d0ctorzaius"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It depends if you are empathic, which is a positive trait most people might ascribe to themselves if asked.\n\nA person actually lacking in empathy is the one who projects as such. Empathic people understand that others don't act or think the same way they do, so would not jump to that conclusion.\n\nHowever, \"accuse the enemy of that which you are doing\" is a tried and true propaganda technique, and the best propagandists *are* empathic. So it's hardly a rule.",
                                                    "score": 8,
                                                    "author": "dedicated-pedestrian"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;I don't think they actually believe this shit\n\nSome don't, but a lot really, wholeheartedly do. Don't underestimate how stupid some people truly are.\n\n&gt;an excuse to do actual harm unto perceived enemies.\n\nYup, the cruelty is the point. Always has been.",
                            "score": 16,
                            "author": "Lazerspewpew",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One of the things that concerned me the most was thinking that here we are in a paradise setting, with excellent weather, bright sun, a fantastic beach, lovely food, and drinks, everyone is having a great time, and you're thinking of pedo conspiracies as something to chat about casually?",
                                    "score": 7,
                                    "author": "southpalito",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The Satanic Panic saw some really strange behavior.  In Manhattan Beach, the police and child psychologists and parents were 100% on board with believing children when they were led to say that teachers put them on a plane in the morning to fly somewhere for satanic blood orgies and there were animal and baby sacrifices, satanic rituals, all sorts of crazy sex acts, and somehow the children made it back to school by the end of the day to come home with zero marks on their bodies and absolutely nothing seemingly amiss.  It culminated with parents showing up to the school with shovels to dig for the secret sex tunnel dungeons.  An archaeological firm was even hired to help in the search for secret underground sex dungeons.  The whole thing is absurd and completely unreasonable.  People today talking about outlandish nonsense and believing it to be real is not uncommon.",
                            "score": 58,
                            "author": "TheSquishiestMitten",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Reminds me of a story from the lockdown.  Woman takes her kid into the hospital for something.  She's asked if she's gotten her shots.  Bravely, the mother denounces Covid as a whole as a hoax.  \"Well, we're going to have to put you with the at risk of Covid waiting room then.\" \n\nHer responce? \"You can't do that, we'll catch Covid!\"  \n\nHypocracy and double think are a feature.",
                            "score": 33,
                            "author": "MephistoMicha",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like the satanic panic all over again.",
                            "score": 9,
                            "author": "Eunuch_Provocateur",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This is what gives away the lie and the stupidity of it - there's no logical consistency and there's no evidence to back up their lies. Any thinking person could determine it is nonsense in seconds.\n\nTucker Carlson was on his dumb Twitter \"show\" this week claiming that aliens have basically invaded earth and \"in any reasonable country\" (not the exact words, too lazy to go back and check) it would be big news. Like, no, dude, if it was REAL, it would be the ONLY news, that's how it's so obviously bullshit.",
                            "score": 19,
                            "author": "katieleehaw",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seriously? Jesus christ.\n\nIts going to end up with another pizza-gate incident and probably actual violence, isn't it? For the dumbest thing possible.. Like showing up at Target looking for bud light-drinking transexual alien's from Guatemala or something.",
                                    "score": 3,
                                    "author": "cadium"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you’re super unintelligent and looking for an excuse for your homophobia like the Nazis they are is why",
                            "score": 6,
                            "author": "PrincipalFiggins"
                        },
                        {
                            "level": 2,
                            "comment": "My aunt believes this. No matter what I try to say, she believes it. This is what you get when people are indoctrinated by religion and a political party starts espousing conspiracy theories. Religious people have already been shown to be more susceptible to conspiracy theories. And when their party tells them this is true, even if it's fringe members in the party, they believe it.\n\nIt's just insane. But what do you get when most in the US have a reading and comprehension level that's less than a High School graduate?",
                            "score": 18,
                            "author": "GrymanOne",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "They believe it because they’re idiots",
                            "score": 3,
                            "author": "SmokinGreenNugs",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "To people who believe in a magical sky being that controls all things in their lives then it's not a hard stretch to add more to that.",
                            "score": 1,
                            "author": "Soppywater"
                        },
                        {
                            "level": 2,
                            "comment": "So, here’s the real problem with such people; they don’t believe what they’re saying. They don’t care about what they’re actually saying. Wait an hour and they’ll be outraged about something else. The truth is they don’t believe in anything. It’s all about outrage, righteousness, and being the victim of…..*something.* The actual details don’t matter, it never matters.",
                            "score": 1,
                            "author": "Someoneoverthere42",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;How the fuck do they actually, earnestly believe this?\n\nWell, ***you*** believe something based solely on the unsubstantiated anecdote in the reddit post you replied to, presumably because it aligns with what you already believe about a certain group of people. \n\nSo...similar to that, I'd say?",
                            "score": -30,
                            "author": "iiiiiiiiiiiiiiiii20",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bruh, do you honestly think hoax induced anti gay hate crimes and reporting on those are comparable? r/EnlightenedCentrism over here",
                                    "score": 14,
                                    "author": "PrincipalFiggins"
                                },
                                {
                                    "level": 3,
                                    "comment": "You have \"Fuck Pride\" as your avatar.\n\nAllow me to just say, FUCK YOU.\n\nReport or ban me, I don't care, homophobe",
                                    "score": 11,
                                    "author": "PreciousRoy78"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;Well, you believe something based solely on the unsubstantiated anecdote in the reddit post you replied to\n\nPlausibility is a thing, though.",
                                    "score": 17,
                                    "author": "TheReaperAbides"
                                },
                                {
                                    "level": 3,
                                    "comment": "Go lie to some left leaning women to get laid instead of spreading your horseshit here.",
                                    "score": 3,
                                    "author": "Faptain__Marvel"
                                },
                                {
                                    "level": 3,
                                    "comment": "Is “Fuck Pride” your actual stance? Or are you just trolling?",
                                    "score": 16,
                                    "author": "elpajaroquemamais",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Either way, it is a piece of shit",
                                            "score": 9,
                                            "author": "PreciousRoy78",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How the hell do they think we even have the money to do this kind of stupid shit?",
                    "score": 6,
                    "author": "chenjia1965",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Every Republican accusation is actually a confession.  Conservative 101.  With pedo priests and support for underage marriage.....who are the sickos again?",
                    "score": 24,
                    "author": "coskibum002",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": ".....so where are all the missing toddler reports? Lol",
                    "score": 6,
                    "author": "FrostByte_62",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They point at the fact nearly 1 million children are reported missing every year in the US but ignore the fact 97% of them are found.",
                            "score": 8,
                            "author": "The-link-is-a-cock"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The funniest part about that to me is for some reason they're so obsessed with tunnels.\n\nMaking tunnels is *hard*. Especially without letting anyone know. Why would every conspiracy theory (earliest one I know of this being attributed to was the satanic panic and that kindergarten) bother using tunnels when you can just build a nondescript building.",
                    "score": 1,
                    "author": "IlluminatedPickle"
                },
                {
                    "level": 1,
                    "comment": "I mean, US Marshalls did rescue 225 children from a trafficking ring in Mexico last month. Maybe they were talking about that:\n\nhttps://www.spectator.com.au/2023/05/us-marshals-rescue-225-children-from-trafficking/",
                    "score": 3,
                    "author": "beobabski"
                },
                {
                    "level": 1,
                    "comment": "r/thathappened",
                    "score": 1,
                    "author": "BloodyChrome"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There was an incident in Collin County where parents had their children stomp on gay flags.  I love it when parents use their children as political pawns.  It is so healthy for their mental development.  /s",
            "score": 537,
            "author": "txholdup",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who’s grooming who ?",
                    "score": 285,
                    "author": "meow_purrr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The sad part is some of these kids will live closeted or repressed lives thinking they are wrong or broken. Another sad part is some of these parents are living closeted repressed lives and still insist on putting their children through the pain they've surely repressed for years.",
                            "score": 119,
                            "author": "diqholebrownsimpson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can confirm. One of my biggest fears is that I'll get dementia as I age, and regress back into the self-loathing and bigotry that Illitucky put into me as a kid.",
                                    "score": 49,
                                    "author": "Professional_Hand191",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "They have to uphold the lie their life is based on, with all means. Admitting to the truth would likely crush them.",
                                    "score": 3,
                                    "author": "r_coefficient"
                                },
                                {
                                    "level": 3,
                                    "comment": "Unfortunately some of their kids will feel so hopeless they might try to end their own lives",
                                    "score": 21,
                                    "author": "VegetableYesterday63",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ah. I love Aretha Franklin.",
                            "score": 1,
                            "author": "Traherne",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "(That went through my head too.)",
                                    "score": 2,
                                    "author": "fuzz_nose"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well these kids have to learn to publicly and unapologetically shit themselves in public, at SOME point.",
                    "score": 21,
                    "author": "AnythingClassic1024"
                },
                {
                    "level": 1,
                    "comment": "This happened in Ottawa, Canada this past week \n\nhttps://twitter.com/TheRealKeean/status/1667192126235639808",
                    "score": 2,
                    "author": "christmasbulb"
                },
                {
                    "level": 1,
                    "comment": "Isnt that the same scene from starship troopers? Where the kids are stomping on roaches? \n\nWasnt that supposed to be satire?",
                    "score": 5,
                    "author": "SonOfAhuraMazda"
                },
                {
                    "level": 1,
                    "comment": "You can downvote me all you want. I'm speaking specifically about the parents teaching their kids to stomp on the flags. No child is born with hate towards another person, and no adult has the inept ability to throw stones at people they hate. It is learned behavior, passed on through the generations, and the sooner it stops, the better the world will be.",
                    "score": 0,
                    "author": "Sephiroth11th",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " \"We shouldn't teach children to be bigoted and ignorantly generalize about other groups of people, like this other group of bad people always do.\"",
                            "score": 2,
                            "author": "fastolfe00",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You shouldn't teach your kids to hate anyone based on perceived, surface level differences. You SHOULD teach your kids to be wary and critical of people who act in bad faith.",
                                    "score": 3,
                                    "author": "SpoZoTheRisen"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They were Muslim parents teaching the kids to stomp on the flags, Lol\nThrowing stones seems like the next logical step toward passing on their cultural customs.",
                    "score": -18,
                    "author": "Sephiroth11th",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow, you saw a thread condemning bigots, and decided everyone would love to hear your Islamophobia? S-M-R-T",
                            "score": 3,
                            "author": "JP058"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I virtually guarantee the parents put them up too that they should charge the kids and the parents with a hate crime.",
                    "score": -57,
                    "author": "enduracolorfl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re going to charge kids of a hate crime? These kids need education not a record.",
                            "score": 22,
                            "author": "thewolf9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Since when is vandalism not a crime?\n\n\nMassachusetts General Laws Chapter 266, Section 126A governs vandalism and defines the crime as follows:\n\nWhoever intentionally, willfully and maliciously or wantonly, paints, marks, scratches, etches or otherwise marks, injures, mars, defaces or destroys the real or personal property of another including but not limited to a wall, fence, building, sign, rock, monument, gravestone or tablet shall be punished…",
                                    "score": -19,
                                    "author": "enduracolorfl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Vandalism isn’t a hate crime. And children need to be treated differently, which they are.",
                                            "score": 5,
                                            "author": "thewolf9"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes, great idea! Instead of ensuring that these kids are removed from such a toxic environment and given the opportunity to live the lives they want to live, let's lump them in with the same people who are likely already far gone and can't be saved.\n\nThat's totally not going to repeat the process and create even more hateful people or anything!",
                            "score": 3,
                            "author": "FloatyMoogle"
                        },
                        {
                            "level": 2,
                            "comment": "I'm trans, so I have skin in the game.\n\nThey're *children*. They shouldn't be charged. They're middle school twerps like we all were, not fucking criminals. Punished, sure. Forced to clean it up or volunteer for something or the usual ways you handle mild vandalism by *children*.",
                            "score": 23,
                            "author": "Morat20"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 190,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "🧱🌈✨🧱 get your pride merch ready.\n\nRespect our Existence or Expect our Resistance!",
                    "score": 64,
                    "author": "meow_purrr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pride bricks™",
                            "score": 23,
                            "author": "JimGerm"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We had 3 different houses here in Tacoma, WA targeted. All were within the same night. There could have been more but those were just the ones reported on the Ring Neighborhood app.",
            "score": 15,
            "author": "jayken424"
        },
        {
            "level": 0,
            "comment": "Gay people: exist\n\nRepublicans: OUR VALUES AND FREEDOM ARE UNDER ATTACK",
            "score": 391,
            "author": "HasNoMouthButScreams",
            "replies": [
                {
                    "level": 1,
                    "comment": "Republicans still too slow to figure out that pride gets more attention when they do shit like this. There is no better endorsement of pride than angry republicans.",
                    "score": 89,
                    "author": "Lucky7Lenny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Strom Thurmond spent his political career whipping close-minded people into a furer over what he considered to be degenerate art. At one point, an exhibition he had spent weeks rallying against prior to its opening decided not to display the controversial pieces. They received an irrate phonecall from Thurmond demanding they display the pieces, because what mattered to him was being seen as someone fighting against indecency. \n\nIt's a mistake to assume bigots would be happy if Pride went away quietly. What they want is attention, validation for their resentment, and some sense of admiration among their peers for being willing to \"stand up for their beliefs.\"",
                            "score": 39,
                            "author": "bananafobe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know the infamously polarizing “Piss Christ” was recently sold at Sotheby’s. Your Thurmond story made me wonder who purchased it and how it has a lot of cultural outrage capital if it were to strategically and anonymously show up in the right place. A crucified Jesus submerged in urine *and* funded by the National Endowment for the Arts would still have cultural legs.",
                                    "score": 8,
                                    "author": "Rich_Charity_3160"
                                },
                                {
                                    "level": 3,
                                    "comment": "Reminds me of something Rollins said on [Big Think](https://youtu.be/kF7vNVmb2fo)",
                                    "score": 5,
                                    "author": "Kuges"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The fact that they do stuff like this is the reason why pride has to exist.",
                            "score": 9,
                            "author": "deekaph"
                        },
                        {
                            "level": 2,
                            "comment": "Every time they do something like this it just reinforces why these kind of events are needed in the first place. Their attempts to fight and oppress minority communities only serve to demonstrate why we have visibility events.",
                            "score": 33,
                            "author": "canada432"
                        },
                        {
                            "level": 2,
                            "comment": "Pride only exists because of these people. If we could just live our lives as freely as everyone else we wouldn’t need marches for our rights which is what pride was always meant to be.",
                            "score": 8,
                            "author": "icouldstartover"
                        },
                        {
                            "level": 2,
                            "comment": "OTOH, Trump gets more attention the more he’s paid attention to by clickbait hungry media and it seems no lessons are learned there either.",
                            "score": 3,
                            "author": "HasNoMouthButScreams"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kind of telling on themselves about what said values are, don't you think?",
                    "score": 28,
                    "author": "Aurion7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I grew up around those people. They've never hidden their values with regards to us. The reason this is getting big now is that the liberals have recently decided that maybe we shouldn't be murdered for existing. Though there is still no shortage of liberals willing to negotiate on which types of abuse should be allowable to inflict on us when we're young.",
                            "score": 25,
                            "author": "Professional_Hand191"
                        },
                        {
                            "level": 2,
                            "comment": "Spoiler: it has been for the last 60 ish years thanks to projecting their own statements onto others.",
                            "score": 10,
                            "author": "EasterBunnyArt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The thing is, they are right. Their values are bad, racist, fascist, theocratic, and homophobic. They are under attack. They're losing generation by generation and are in the spasmodic rage filled flailing of a dying ideology. Doesn't mean they aren't dangerous, they're a cornered animal and will rip their own feet off to bleed on their enemies.",
                    "score": 6,
                    "author": "JonWake"
                },
                {
                    "level": 1,
                    "comment": "I read this like the Lego commercial meme",
                    "score": 2,
                    "author": "SyrousStarr",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It sounds like someone didn’t learn their lesson…who’s down for another stonewall riot?",
            "score": 6,
            "author": "darkhelmet436"
        },
        {
            "level": 0,
            "comment": "I mean, the Stonewall bar was right there. If these guys wanted to man up, they would have gotten their asses beat back to whatever rock they crawled out from under. Instead, they attacked an inanimate object, real tough.",
            "score": 137,
            "author": "Douglaston_prop",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sounds like people need an education in the history of bricks",
            "score": 15,
            "author": "DerCatrix"
        },
        {
            "level": 0,
            "comment": "Hate grows as conservativevism rises.",
            "score": 213,
            "author": "CATSCRATCHpandemic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Back up and look at the big picture.\n\nConservatives aren't winning. They're just freaking out because they can tell they're losing",
                    "score": 137,
                    "author": "autoposting_system",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which is why they’re trying to cement their bigotry into law now, nailing down their beliefs into schools to indoctrinate and groom children into their beliefs. \n\nIt’s the only way to keep their hatred alive after they’re gone, and they see their time ticking away. The sad things is how many of them believe they’re doing this to save the souls of their children and families - preserving hatred instead of seeing their fellow citizens as human beings who deserve the same rights as them.\n\n* Edit: Corrected a typo.",
                            "score": 88,
                            "author": "johnhummel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We can't count on hate going away when the older generation dies. We need to be vigilant and fight both hate and bigotry whenever they rear their ugly heads.",
                                    "score": 26,
                                    "author": "kalekayn"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Cornered animals are the most dangerous.\n\nTraditional elites united with fascist movements to protect their power when it came under challenge in the 1930's. Germany was a liberal cosmopolitan society which had even achieved legal recognition for trans people ... right before a reactionary backlash demonized them and started banning and burning their literature \"to protect ze children.\"",
                            "score": 25,
                            "author": "Nix-7c0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is a valid observation, although I didn't know that about trans people",
                                    "score": 3,
                                    "author": "autoposting_system",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[The Forgotten History of the World's First Trans Clinic:](https://www.scientificamerican.com/article/the-forgotten-history-of-the-worlds-first-trans-clinic/) The Institute for Sexual Research in Berlin would be a century old if it hadn’t fallen victim to Nazi ideology\n\nThe most famous pictures of Nazi book burnings were when they razed the first trans research clinic in Europe. They'd go on to burn or murder many of its patients as well before too long. Again, to \"protect the children\" from \"degeneracy\" since they didn't want anyone \"groomed\" from seeing trans people living happy normal lives.",
                                            "score": 15,
                                            "author": "Nix-7c0",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And/or, they don't have any constructive ideas or policies to move the country forward so they have to stoke the flames of division in order to remain relevant.",
                            "score": 17,
                            "author": "NinjaLanternShark",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I agree with you, but damn their freak-outs are not benign.\n\nI was recently on the receiving end of a fragility tantrum, and boy was it BIZARRE. Guy got unhinged. And because he was unhinged his politics emerged, and then it clicked. This is not about me.\n\nBut the fact that people are spilling out like that, it's fuckin' scary-gross.",
                            "score": 9,
                            "author": "Other-Ambassador7988",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh sure, it's terrifying. \n\nWe have apocalyptic technology, too. It's plausible that this sort of thing could actually end civilization as we know it -- and I think everyone knows that that is actively happening in more than one way.\n\nBut we have to go through this part to get to the other side. We have to reach the safe part, the part where reasonable people are calling the shots and we can build a world that works for all of us and the Earth too.\n\nI hope you guys get there. I won't make it, but some of you might, and that can only be a good thing.",
                                    "score": 6,
                                    "author": "autoposting_system"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Right they’re grasping at straws",
                            "score": 1,
                            "author": "ElaineMK2222"
                        },
                        {
                            "level": 2,
                            "comment": "Don't fall for that naive and idealistic shit. We're the same species that thought even worse shit back 200 years ago and we aren't going to become magically enlightened as time goes on. Thinking that way is complacent and naive.",
                            "score": -1,
                            "author": "EggRelevant2035",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm not saying stop. I'm saying we're winning. Really I was just trying to cheer up the person I was replying to.",
                                    "score": 5,
                                    "author": "autoposting_system"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’d like to think this is more so the panicked lashing out of a dying movement",
                    "score": 24,
                    "author": "HeadfulOfSugar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These people train their children to hate.",
                            "score": 22,
                            "author": "mewehesheflee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And studies are showing a drastic reduction in youths that subscribe to conservative ideals.  Apparently it’s harder to use isolationist techniques to maintain your cult like mentality in the internet age.",
                                    "score": 16,
                                    "author": "mocap",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The problem is the people that support conservative ideals are extremely vocal.",
                                            "score": 6,
                                            "author": "Huskies971",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They do like to drive around in their pickups shouting slurs at people.",
                                                    "score": 3,
                                                    "author": "mocap"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "When have conservative ideals EVER been popular with kids?",
                                            "score": 1,
                                            "author": "livsjollyranchers",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They where pretty popular around here a few months ago when the community threw a pride event at the local fair grounds.  It was very discouraging to see and hear them all shouting hateful things at the group.",
                                                    "score": 10,
                                                    "author": "mocap",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Younger people have historically been more progressive, and they become more conservative as they get older. Typically this shift happens around the 30s and into the 40s. We're not seeing this anymore, though. Millennials and GenZ have been swinging more progressive through their 30s instead of becoming more conservative as every generation prior has done. And GenZ has even less conservative leanings than even young people in previous generations have.",
                                                    "score": 2,
                                                    "author": "canada432",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They do, but every generation it fails a bit more and more. More and more children are actually exposed to the groups their parents hate, and when you're actually exposed to people it's a lot harder for somebody to demonize them and make shit up about them. \n\nIf a kid has reached the 6th grade and never in their entire life met or seen a gay person, it's easy to get them to believe literally anything you make up about gay people. They have no point of reference. \n\nIf they grow up with classmates and friends who are gay, or have 2 dads, or have gay siblings, or whatever else, then when dad says that gays are evil degenerate perverts the kid thinks \"but Sally is my friend and her moms are really nice ladies\", and it doesn't stick.",
                                    "score": 6,
                                    "author": "canada432",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yup, it's why homeschooling is so popular among people like that.",
                                            "score": 3,
                                            "author": "MartokTheAvenger"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, but children's tend to go through a rebellious phase in their teen years. Some of those children might actually find out that they are in the LGBT community.",
                                    "score": 3,
                                    "author": "gobblox38",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Like me. My big push is actually for people to pay attention to what they are doing to public libraries, because that was my lifeline. I was radically educated by my parents in a private school system, but reading gave me the tools I needed to find that I was bi and to start reprogramming myself silently while still living right under their noses. Back then, there wasn’t a push to sensor the libraries. Now there is and my heart aches for these kids, I feel like I’m watching their final door closing.",
                                            "score": 10,
                                            "author": "WeakAd7680"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It feels like just as many end up as Toole,Crowder, and Rogan fans these days.  Yo know you get that great conservative taste but now in a new and updated Bro can.",
                                            "score": 20,
                                            "author": "CATSCRATCHpandemic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Pathological levels of selfishness will always be with us.",
                                                    "score": 3,
                                                    "author": "verasev"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not Crowder or Rogan, that's millenials.  They're all about Tate and the like nowadays.",
                                                    "score": 2,
                                                    "author": "ScientificSkepticism",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Tats web traffic and even his top g university have been basically eliminated since his arrest.   But yea, he is a major piece of shits and is worst or at least as bad the above-mentioned assholes.",
                                                            "score": 9,
                                                            "author": "CATSCRATCHpandemic",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There are also many that probably think they're lgbt when they're not. It seems rather in vogue to be 'questioning'. Indeed, more possibilities are open to one's self-expression now, so that's another reason why they're more likely to question the default template, when perhaps they wouldn't have otherwise.\n\nAll in all, it's confusing as hell to be a kid these days, and only worse when you have parents who actively hate others because they have a certain sexuality.",
                                            "score": -3,
                                            "author": "livsjollyranchers",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "there are a whole lot more kinsey 3-7's than there are kinsey 1-2's or 8-10's.",
                                                    "score": 2,
                                                    "author": "defaultusername-17",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't even know what this means.",
                                                            "score": 0,
                                                            "author": "livsjollyranchers",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It means that sexuality is a spectrum, and like most spectrums the majority fall somewhere between two extremes.",
                                                                    "score": 3,
                                                                    "author": "spark3h",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thanks for the explanation.",
                                                                            "score": 2,
                                                                            "author": "livsjollyranchers"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "it is, but dying movements are the most violent and radical.  These people are radicalizing into a domestic terror movement with a political party, like in countries under civil war.",
                            "score": 4,
                            "author": "southpalito",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah that’s definitely part of it, but that just makes it the home stretch to finally ending things if we can get through it (which I think we definitely can, hopefully not at much of a cost)",
                                    "score": 2,
                                    "author": "HeadfulOfSugar"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yup. They know their ideas aren't popular.\n\nIt's why they don't want Gen Z to vote.",
                            "score": 6,
                            "author": "Tangocan"
                        },
                        {
                            "level": 2,
                            "comment": "In some circles, it's called an extinction burst.",
                            "score": 1,
                            "author": "bananafobe"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;“First they ignore you. Then they ridicule you. And then they attack you and want to burn you. And then they build monuments to you.\" -Nicholas Klein\n\nThey're not rising, or winning. They're flailing about because overall, they're continuously losing. This same pattern repeats in every conservative moral panic. It's happened for every racial minority, every rights movement, and now it's been going through the sexual and gender orientation groups. Happened to gay people before, and now they're getting a little caught the middle. Currently, it's trans people. Nobody cared about them for decades. Then they started getting some recognition and conservatives made jokes and mocked it with stuff like \"identifying as attack helicopters\". We're now at the \"attack you and want to burn you\" stage, and we got here specifically because the ignoring and ridiculing didn't make them go away, and didn't make people hate them more, they've just become more accepted. This is the lashing out part because they've failed. Its the hard part, the most violent part, and the most dangerous part, but the end result is conservative bigots continuing their streak of losing as they've eventually done for all of history.",
                    "score": 10,
                    "author": "canada432",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Well if conservatives didn't have others to project all their hate onto, they would have to accept that what they really hate is themselves. And we all know conservatives are too weak mentally and emotionally to come to terms with that and actually grow themselves.",
                    "score": 4,
                    "author": "DarthBluntSaber"
                },
                {
                    "level": 1,
                    "comment": "They're trying to conserve the age of Walking-Shits and  hair-dragging copulation in caves. #merikuh",
                    "score": -6,
                    "author": "AnythingClassic1024",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*hands the downvoters some ToiletPaper*",
                            "score": 0,
                            "author": "AnythingClassic1024"
                        },
                        {
                            "level": 2,
                            "comment": "#walkingshits 🚶‍♂️💩💩",
                            "score": -7,
                            "author": "ziggystarduster69"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It takes a real man to beat up a little flag.",
            "score": 38,
            "author": "ziggystarduster69",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Gosh, I wonder what the political/religious affiliation the perpetrators had…",
            "score": 12,
            "author": "Captain_CatDad"
        },
        {
            "level": 0,
            "comment": "Imagine letting romance bother you that much.",
            "score": 2,
            "author": "AwTickStick"
        },
        {
            "level": 0,
            "comment": "a lot of people liking this post... cause the like the news article or the message?",
            "score": 2,
            "author": "Zealousideal_Low8146"
        },
        {
            "level": 0,
            "comment": "People need to mind their own business.  LGBTQ+ people should have the right to exist and this is supposed to be a free country for everyone.  If yall just leave them the fuck alone then they wouldn't have to have pride.",
            "score": 22,
            "author": "Dr_Eastman"
        },
        {
            "level": 0,
            "comment": "Of course they were.\nBigots are an infestation.\nThey’re everywhere.",
            "score": 6,
            "author": "Chalkarts"
        },
        {
            "level": 0,
            "comment": "This is why pride month exists.",
            "score": 8,
            "author": "Another_Road"
        },
        {
            "level": 0,
            "comment": "Man, people are sure buying a lot of Pride flags right now.",
            "score": 8,
            "author": "theghostsofvegas",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -3,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Possible hate crime my ass. It WAS a hate crime.\n\nThese lowlifes hate anything different and respond with violence. They need to be held accountable.",
            "score": 2,
            "author": "bandit69"
        },
        {
            "level": 0,
            "comment": "Does anyone have a rundown of how the corporate sponsored pride month helps the lgbtq community? What has it changed? Are less gay people being murdered? Has life for lgbtq people improved as a result of corporate sponsorship?",
            "score": 3,
            "author": "ultradianfreq",
            "replies": [
                {
                    "level": 1,
                    "comment": "What has it changed? Well, for starters, people who used to be fearful of being mocked. derided, refused service, or beaten now feel welcome when they enter a public space that contains gay-affirming flags and expressions of tolerance. What has it changed for homophobes? Nothing, other than they have to see rainbow flags for one month out of the year. Get over it.",
                    "score": 6,
                    "author": "tierbandiger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i was essentially forced to leave my abusive home after coming out. i moved and when i went to the closest store near me for food (Target) and saw the lil pride section right when i walked in i almost cried.\n\nopen acceptance is important to a marginalized group currently under attack. do i think corporations actually cares about LGBTQ+ people? no, but it's still nice to see pride flags at the places i frequent and it makes me feel comfortable, something a lot of gay people have a hard time finding.",
                            "score": 6,
                            "author": "ananxiouscat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s certainly helping the ruling elites distract the masses from our collective screwing over.",
                    "score": 2,
                    "author": "damn_yank"
                },
                {
                    "level": 1,
                    "comment": "It's definitely helping more than you are.",
                    "score": 1,
                    "author": "GhostFish"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m curious about the rest of your comment",
                    "score": 1,
                    "author": "strangecabalist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I made an edit for clarity",
                            "score": 2,
                            "author": "ketchupmaster987"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ya why is this a thing all of the sudden? Could it be that republicans are spreading hate because they need a new target to blame?",
            "score": 1,
            "author": "cp_shopper",
            "replies": [
                {
                    "level": 1,
                    "comment": "Funny you would use the word \"target\", as the stores were part of an extensive anti-pride campaign.  Next on the list is Cracker Barrel.  IIRC, one small group pushes this agenda, one corporation at a time. \n\nThis is despite the fact that these institutions have promoted pride week/month for several years prior.",
                    "score": 0,
                    "author": "ConscientiousObserv"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imagine being mad at color cloth in the shape of a flag",
            "score": 3,
            "author": "SonsofStarlord"
        },
        {
            "level": 0,
            "comment": "That’s fine. We’ll just put more right back up. No problem.",
            "score": -1,
            "author": "WeakAd7680"
        },
        {
            "level": 0,
            "comment": "Time to start burning Bibles and letting folks know how we realllly feel about Muhammad! Eye for an eye bitches!!!",
            "score": -9,
            "author": "Correct-Walrus7438",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Muhammad\" isn't in the bible...?",
                    "score": 8,
                    "author": "Leah-theRed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Christianity is not the only biggoted cult.",
                            "score": -3,
                            "author": "Correct-Walrus7438"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "420 praise it",
                            "score": 8,
                            "author": "Vallkyrie"
                        },
                        {
                            "level": 2,
                            "comment": "I use my childhood bible for rolling papers. Super cost effective.",
                            "score": 4,
                            "author": "Correct-Walrus7438",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Looks like I already pissed off the Bible beaters so I don’t mind doubling down by agreeing with you completely.  Many have super thin pages that work quite well for that purpose. :)",
                                    "score": -2,
                                    "author": "famousevan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Many have super thin pages that work\n\npages as thin as the adherents skin XD",
                                            "score": 1,
                                            "author": "DrAstralis"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's absolutely vile, to be this radically hateful towards gays/LGBT by targeting a place like this is abhorrent.",
            "score": 1,
            "author": "bwforge"
        },
        {
            "level": 0,
            "comment": "&gt; “If anyone thinks this is going to intimidate us or weaken our resolve, they’re mistaken.”\n\nThe goal was probably just a piss someone off. I'd say mission accomplished. Hopefully they get caught.",
            "score": 1,
            "author": "Arodg25"
        },
        {
            "level": 0,
            "comment": "\nNational monuments are protected property.  The Order states the willful injury of federal property authorizes a penalty of up to 10 years imprisonment. This broadens the previous act to include statues and monuments that are not military members or military related.",
            "score": -41,
            "author": "cyborgnyc"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -22,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "it's mostly the same evangelical base that failed to cement society as anti-gay back in the 1990-2000s coming out with a new strategy",
                    "score": 10,
                    "author": "sonoma4life"
                },
                {
                    "level": 1,
                    "comment": "You're right this is an unpopular opinion.  Mostly because it's a dumb one.  Accepted medical practice is to treat gender dysphoria by transitioning because the alternative is SUICIDAL IDEATION.",
                    "score": 19,
                    "author": "PharmyC",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Check out what’s happening in the UK, Sweden, Finland, the Netherlands, and a number of other countries. The evidence has been reviewed and it has been found sorely lacking (Cass report). \n\nAnd that last sentence is textbook emotional blackmail.",
                            "score": -18,
                            "author": "damn_yank",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; And that last sentence is textbook emotional blackmail.\n\nI can't imagine how foul a mind has to be to understand that suicide and suicidal ideation are common themes in untreated gender dysphoria, yet dismiss that justification for providing treatment as \"emotional blackmail.\"\n\nJesus christ.",
                                    "score": 11,
                                    "author": "FriendlyDespot",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Ahhh, the \"independent\" Cass review\n\nConducted by someone with a load of anti-trans groups/people on their twitter follows\n\nAnd no oversight committee with experts knowledgeable in the field\n\nDefinitely straight over the plate, this one.  Definitely compelling enough to trust over the scientific consensus.",
                                    "score": 12,
                                    "author": "HolyToast"
                                },
                                {
                                    "level": 3,
                                    "comment": "You have to know how dishonest you are. There's no way that you don't. So why do you do it? Why do you pretend that the medical community hasn't come to a clear consensus on this? Why do you pretend that this is about protecting children when the process reduces child suicides and already involves informed consent from parents and doctors' approval? Why do you act like fairness in sports is the concern when the number of affected athletes is *absolutely miniscule,* but the message sent to trans youth is \"You don't belong on sports teams\"?\n\nYou have to know how dishonest you are. It's impossible not to.\n\nSo why do you choose to act this way?",
                                    "score": 4,
                                    "author": "aristidedn"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "YouTube is not a legitimate source.",
                    "score": 5,
                    "author": "DJGlennW"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Domestic terrorism 101, for dummies.",
            "score": -4,
            "author": "KingOfTheFraggles"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -37,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can disrespect your own American flag, and your own pride flag. You can't steal someone else's flag and vandalize it. That's when it becomes a crime.",
                    "score": 32,
                    "author": "meta_metonymy"
                },
                {
                    "level": 1,
                    "comment": "You can’t legally destroy someone else’s property.  These bigots are free to buy their own pride flags and do whatever they want to them.  The real people who we should be asking “who gives a fuck?” to are the bigots.  Let LGBTQ+ people live and leave us the fuck alone.  Big strong bigots destroy pride flags to try to intimidate us but it just makes them look like cowards.",
                    "score": 24,
                    "author": "ElectricBoogaloo_"
                },
                {
                    "level": 1,
                    "comment": "My man has never heard of vandalism.",
                    "score": 22,
                    "author": "6PieceNuggerMeal"
                },
                {
                    "level": 1,
                    "comment": "If you’re defacing your own property, then no fucks given unless you are in an HOA. Defacing other people’s property is a crime. No one gives a shit that they are stepping on pride flags except for their own circlejerk.",
                    "score": 13,
                    "author": "Electrifying2017"
                },
                {
                    "level": 1,
                    "comment": "&gt;If you can disrespect the American flag legally\n\nYou can when it's your flag.  If it's not, it would be vandalism...\n\n&gt;you should be able to do whatever you want to this flag\n\nYou can't do whatever you want to property that isn't yours\n\n&gt;You can't have it both ways\n\nWe can in fact have vandalism laws",
                    "score": 32,
                    "author": "HolyToast"
                },
                {
                    "level": 1,
                    "comment": "Once again, conservatives actively fail to understand how things work.",
                    "score": 15,
                    "author": "Ayzmo"
                },
                {
                    "level": 1,
                    "comment": "Well, in this instance, it’s vandalism given those flags didn’t belong to the bigots. But I give a fuck. Stonewall is THE watershed moment for gay rights in this country, the moment that started pride. It means something, and the monsters that did this knew that. \n\nBut nobody is saying you can’t disrespect the pride flag. We’re just saying in this instance it’s a really shitty thing to do.",
                    "score": 24,
                    "author": "JadedScience9411"
                },
                {
                    "level": 1,
                    "comment": "&gt;If you can disrespect the American flag legally, you should be able to do whatever you want to this flag. You can't have it both ways. Either it's freedom of speech of it's not. Not too mention the fact that most people have no allegiance to the price flag. How is this even news? Who gives a fuck?\n\nYou can't.\n\nIt's literally a law.\n\nYou know who breaks it all thr time? Conservatives who love to post photos of bald eagles giving hand jobs to trump on the flag.",
                    "score": 14,
                    "author": "Tyndael87"
                },
                {
                    "level": 1,
                    "comment": "Why do you think it's ever ok to damage someone else's property?  Are you that triggered by rainbows that you feel a need to destroy them?",
                    "score": 16,
                    "author": "Diarygirl"
                },
                {
                    "level": 1,
                    "comment": "&gt;Who gives a fuck?\n\nObviously the people who ruined the flag, who appear to have an issue with gay people not being arrested for existing. \n\nPresumably they want gays to go back to the pre-Stonewall days. \n\nStrange you're confused about that. Do you believe there's nothing significant about Stonewall?\n\nDo you have similar confusion about why people deface the Emmett Till memorial?",
                    "score": 11,
                    "author": "zaoldyeck"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So, just some broken flags? Well, like all things, most people don't care either way. Some care a little. Other care when they're effected somehow. And some people go off the deep end. My money is on 3 people heavy into the drink that just wanted to break something for a laugh.",
            "score": -23,
            "author": "WhiskySiN"
        },
        {
            "level": 0,
            "comment": "Everybody relax. This is the \"then they fight you\" phase. It's to be expected",
            "score": -55,
            "author": "autoposting_system",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao \"just relax! All they're trying to do is undo all the progress we've made and erase us from society again! Just rest on your laurels and let them tucker themselves out :)\"\n\nGotta be one of the worst takes I've ever heard.",
                    "score": 22,
                    "author": "Less-Caterpillar-864",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm a woman married to a Trans Woman. These conservatives nut bags are trying and in some cases, succeeding on taking away the rights of Trans people. Tell me again how I should just relax about the rights of my beautiful Wife being taken away?",
                    "score": 2,
                    "author": "Gretchenmeows",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "From the Twitter feed it looks like the loose kind you put on fences. Was it placed by the property owner or the public? Because if the public did it then the public can also remove them.",
            "score": -45,
            "author": "Crimefridge",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the public would just be allowed to add something.  Not take other peoples free speeech expression away.",
                    "score": 14,
                    "author": "pinetreesgreen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure it works that way. If someone puts up a yard sale sign on a public light pole there is no law (that I know of) that says another person can't clean the pole up and remove the sign. If I decorate something in public without a permit then there is nothing protecting what I put up. Its essentially trash.",
                            "score": -13,
                            "author": "johnskoolie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I looked this up and it is pretty fuzzy.  There are all sorts of local rules, for instance some places you can put up political signs in public areas, and others you can't, has to be private.  Sufficed to say you can't break another persons display.",
                                    "score": 6,
                                    "author": "pinetreesgreen",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "You may be removing relevant context though. \n\nLighting a bonfire isn't a crime. Arranging your bonfire in the shape of a cross and burning it in response to a black family moving into a house on your block is a slightly different matter.",
                                    "score": 20,
                                    "author": "bananafobe",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}