{
    "id": "79v2cg",
    "score": 126705,
    "title": "Japanese firm gives non-smokers extra six days holiday to compensate for cigarette break",
    "author": "ajstrange1",
    "date": 1509448837.0,
    "url": "https://www.reddit.com/r/news/comments/79v2cg",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I was in the Navy, and I used to take smoke breaks throughout the day. One time, I found my buddy, a non-smoker, hidden away on the chaff deck, kicked back in a lawn chair, basking in the sun. He said he took an hour a day to chill outside since all of the smokers did. I wasn’t mad. ",
            "score": 13885,
            "author": "ajlueb",
            "replies": [
                {
                    "level": 1,
                    "comment": "Back when I was 17 and started my first job, I became frustrated that most of my co-workers got extra breaks throughout the day to smoke. It essentially added up to an additional thirty minutes of down time for them.\n\nSo I walked across the street to the gas station, bought a pack of candy cigarettes, and \"smoked\" with my co-workers outside. They thought it was awesome; my manager, not so much.",
                    "score": 1156,
                    "author": "ironanchor13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; They thought it was awesome; my manager, not so much.\n\nSadly it's the same where I work. It's OK for smokers to go outside to smoke a few times per day. Someone once thought \"If they can take a few 10 minutes breaks to smoke, surely I can take one or two break per day to walk around the building.\" Well, no. You don't smoke? Stay inside and work, little slave.",
                            "score": 922,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 372,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are employers legally mandated to give smokers smoke breaks? I keep seeing this complaint come up, but if managers hate it and it kills productivity, why do companies allow it?",
                                            "score": 79,
                                            "author": "ReddThat00",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Because it's better to just give them the smoke breaks than to deal with an agitated, distracted worker who can't think of anything but the next cigarette they'll get to smoke.",
                                                    "score": 175,
                                                    "author": "Rainbow_Gamer",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hey here's an idea: why not give a 5-10 minute break every hour for everyone. It would definetly make the time they work more efficient. ",
                                                            "score": 19,
                                                            "author": "DempseyRoller",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm 100% down for this idea. In the service industry where I live, EVERYONE smokes. It's the only way you can guarantee you'll get a break aside from the statutory half hour at lunch, and that's the same reason I started smoking. I strongly encourage those under me that don't smoke to take a 5/10 minute break every hour to just relax for a bit. If that was the norm, or even encouraged, I'd probably drop smoking in a heartbeat (or at least cut down massively). ",
                                                                    "score": 13,
                                                                    "author": "tabbybun"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Like a month ago my smoker colleague asked me to go for a break with him. We went outside. Halfway through his cigarette the manager comes up to us and tells me to go back to work and says nothing to the other guy who stayed out for 5 more minutes or so to finish his smoke.",
                                    "score": 83,
                                    "author": "slimjimsmugjack",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Should have said you're on a smoke break and when they say you aren't smoking continue with \"I'm a passive smoker\".",
                                            "score": 23,
                                            "author": "Sparru"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I used to manage the late night shift at McDonald's back in college. The smokers on the night shifts were way too liberal with their breaks, even after repeated reminders that they were there to work. At one point we were backed up during the bar rush and I had nobody in the kitchen because they all decided to go for a smoke during the busiest point of the night, so I locked them out and took over the kitchen myself. They were pissed off, banging on the doors the entire time (so it was ten degrees below freezing, that's not going to kill you, I know for sure one of them had truck keys because that's where they smoke). Once the rush cleared out I handed them their stuff through the drive thru window and told them to go home and take it up with the store manager in the morning.\n\nI'd rather have no staff than unreliable staff. Smoke breaks were a strict 15 minutes twice a shift at pre-approved times after that, same as the coffee break time all the other workers got.\n\n*Edit because people are confused: this was at 2am, the lobby had been shut down since 11pm as it was a drive thru only overnight location so they couldn't just come in the front door. And I wasn't expecting this to blow up this much, so to quell the hate mail I'll just say this wasn't the first incident with my overnight employees abusing smoke breaks, and I'd received numerous complaints about fairness from the non-smoking staff. This is how I chose to handle it, nuance and situation aside, feel free to come up with some imaginary situation in which your hypothetical response is objectively better. Unfortunately I have better things to do this afternoon than defend how I handled a stressful situation over a decade ago to a bunch of wound up strangers on the internet, so I'm done here.*",
                                    "score": 617,
                                    "author": "Mechakoopa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ballsy! Very awesome. ",
                                            "score": 168,
                                            "author": "Sxilla",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What were they going to do though? I paid them for the three hours they'd worked, but clearly their nicotine addiction necessitated a medical condition that rendered them unable to reliably complete the remainder of their shift so they were relieved of duties.\n\nI've got no time for freeloaders who think their addictions entitle them to special rules at the expense of everyone else working.",
                                                    "score": 320,
                                                    "author": "Mechakoopa",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I like you.",
                                                            "score": 60,
                                                            "author": "RekBeth"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is also one of the reasons employers are going to replace the workers that they can replace with robots, AI, automated kiosks etc. \n\nTo clarify, I'm not suggesting that workers who don't smoke should have to work more and get less breaks. That's unfair treatment, and treating someone unfairly is something I would never condone. However, you have to admit that situations like this don't pop up when your \"employees\" aren't people.",
                                            "score": 38,
                                            "author": "10thPlanetRyan"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Its funny because,  for example the VA considers nicotine a drug. But other drug users or substance abuse users dont extra time to, take a shot of booze or a needle pf heroin...all i want is equality ",
                                    "score": 20,
                                    "author": "When1nRome",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 244,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "maybe nicotine patches",
                            "score": 212,
                            "author": "staysinbedallday",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 116,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No one is gonna mention how we have a submarine in this discussion?",
                                            "score": 15,
                                            "author": "dullsoundofsharpmath"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Smoking isn't allowed on subs anymore, but when it was, there were designated smoking spaces and only so many people could light up a once.\n\nOn my boat, the smoke pit was next to the diesel generator, and only two people could be smoking at a time. The line got to be ridiculous right after meal times.",
                            "score": 296,
                            "author": "nowhereian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So they got to stand in a line and wait for their turn to smoke? Holy shit, so they get to waste even more time not working?",
                                    "score": 112,
                                    "author": "WarpingLasherNoob",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sort of.\n\nOn a submarine, there are three six-hour watch sections. You wake up, eat, stand watch, eat, do some other non-watchstanding work or have free time, eat, and go to sleep every 18 hours. So 1/3 of the line was made up of people who were about to go to work, so to speak. Those people were ushered to the front of the line out of respect for the guys currently on watch who were waiting for turnover.",
                                            "score": 93,
                                            "author": "nowhereian",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How much sleep can you actually fit in during the six hours you're allowed for sleeping? Do you have to fit in showering and other things during the time you're assigned for sleeping?\n\nAre there opportunities to fit in naps during the working day? \n\nI imagine such a schedule leads to a lot of fatigue which can be quite dangerous in that kind of environment, especially if you're looking after a reactor or something. \n\n ",
                                                    "score": 22,
                                                    "author": "whiteystolemyland",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "When you get off watch, you actually have 12 hours of off-watch time. This is broken up into:\n\n\"Offgoing,\" which is where you have free time if you don't have other work to do. Some people, (electricians like me, auxiliary mechanics, etc) have lots of maintenance to do in that time. Some people (sonar technicians, other forward rates...) have little to none. So you could use this time to sleep too. \n\nand\n\n\"Oncoming\" which is where you should be sleeping. \n\nSo, depending on your job, you could sleep 12 hours out of every 18, or less than six. I actually was up for 61 hours straight once, because i was one of two people qualified to work on the oxygen generators and they needed a troubleshoot/repair. Your sleep also often gets interrupted by running drills where 100% of the crew must be awake.\n\nThere isn't so much a \"working day\" for most of the crew. It's really just an 18 hour day or \"watch rotation.\"\n\n&gt; I imagine such a schedule leads to a lot of fatigue which can be quite dangerous in that kind of environment, especially if you're looking after a reactor or something.\n\nYES YES YES YES YES YES YES \n\nYou, random internet denizen, understand better than most Admirals.",
                                                            "score": 58,
                                                            "author": "nowhereian",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a non smoker in the Marines, id hang out at the smoke pit upwind.. always got told to go back to work and stuff. Fucking hated that.\n\nTo make it worse in Police Call lines (a line of trash pickup) id have to pickup butts. God i hate smoking. Had 2/3 grandpas die of it.\n\nObligatory edit: RIP in peace my inbox.. my 2nd highest comment, and highest comment on this acct is about hating smokers, im cool with that!",
                    "score": 4452,
                    "author": "NowIcansaywhatIthink",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You had 3 grandpas? Lucky.",
                            "score": 2171,
                            "author": "Macluawn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, he just had the two, one of whom is two-thirds dead. ",
                                    "score": 2853,
                                    "author": "Muppetude",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If each Grandpa can be divided into thirds, that means there is a total of 6 Grandpa parts that can be either alive or dead. 2/3 of six parts means that 4 parts out of the total 6 Grandpa parts are dead.\n\nThis means that either 2/3 of each individual Grandpa is dead or one Grandpa is fully dead and the other one is only 1/3 dead.\n\nEither way, this guy obviously has zombie Grandpas.\n\nEDIT: Thank you Reddit for making my most up-voted comment of all time be about dividing Grandpa's into thirds and figuring out how much of your zombie Grandpas are left, on Halloween no less.",
                                            "score": 1187,
                                            "author": "SupaSlide",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe it was dividing the Grandpas into thirds that killed them instead of smoking",
                                                    "score": 486,
                                                    "author": "Alreaddy_reddit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 172,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, the grandpa meat was obviously smoked AFTER dividing them up to make some sweet grandpa bacon.",
                                                            "score": 67,
                                                            "author": "bushidopirate",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; If each Grandpa can be divided into thirds [...]\n\nJesus dude, I dont think either of them is alive after that. ",
                                                    "score": 110,
                                                    "author": "Macluawn",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Logical partitioning is non-destructive.",
                                                            "score": 55,
                                                            "author": "Mechakoopa",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The math doesnt seem to check out. \n\nIf one is dead, the other has to be ~~one-sixth~~ one-third dead for the total to be 2/3. \n\nEDIT: Got my death math wrong. ",
                                            "score": 115,
                                            "author": "Macluawn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 107,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I genuinely did have 3 guys in my life who were 'Grandpa'. There was Grandpa B (Dad's dad), Grandpa F (Mom's dad), and Grandpa Ted. Grandpa Ted and his wife, Grandma Lou, were friends of my Dad's parents. They were neighbours all my dad's life. Their son, Michael, was my dad's best friend, the best man at his wedding.  \n\n#\n\nThe year after my parents got married, Michael died in a car accident. He was never married and was an only child, and so Grandpa Ted and Grandma Lou were destined to not have grandchildren of their own.  \n\n#\n\nSo my siblings and I became their grandkids. It was years before I understood they weren't \"really\" my Grandparents, and why. They were the loveliest people and I miss them dearly. In many ways, they were the best grandparents I had.\n\n#\n\n**Edit:** Spooky halloween post-script: I was born 5 years later to the day that Michael died. Not even kidding.",
                                    "score": 156,
                                    "author": "jerryleebee",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "If you're adopted or parents are remarried you can have plenty of grandparents.",
                                    "score": 84,
                                    "author": "izocu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Brb, have to split up my grandparents. ",
                                            "score": 14,
                                            "author": "Macluawn"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Smokers can be extremely selfish because of their addiction. I often overhear them finding ways of justifying how it's okay to make everyone around them breath in their second hand smoke. The risk of lung cancer, stroke, and heart disease you accumulate over time from being around a smoker is about 25% higher than if you weren't around a smoker. Really guys, if you're smoking in a public place, you're just being a dick. Make a real effort to move it away from other people. ",
                            "score": 13,
                            "author": "kittenTakeover"
                        },
                        {
                            "level": 2,
                            "comment": "You cant just mention having 3 grandpas and not elaborate",
                            "score": 188,
                            "author": "rickjamesbich",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When I was a cook I worked with a guy who took smoke breaks multiple times a day. Everyone else in the kitchen, besides me, smoked so he just took his break when the others weren't. \n\nAfter a year of working with him, it was slow and I went outside to hang out with him while he smoked. I found him kicked back in a chair by the dumpsters just hanging on his phone. Apparently he was never a smoker, but realized if he said he was he'd get a few minutes to get a breath of fresh air and chill. \n\nAfter that, I started \"smoking\"",
                    "score": 117,
                    "author": "HotSauceCommitteeMem",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Came here to say this about the Army. We all took up smoking because just standing around was a fast track to pain. Taking 6 smoke breaks a day though? No problem!",
                    "score": 70,
                    "author": "sandsnake25"
                },
                {
                    "level": 1,
                    "comment": "The only reason I started smoking was because of the breaks in the navy. I didn't even get any satisfaction from smoking nor did I get hooked on it so I quit cold turkey pretty easily but still it's messed up you get some free time for having a drug problem.",
                    "score": 123,
                    "author": "auserhasnoname7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A drug problem with suppliers who have lobbied for years.",
                            "score": 34,
                            "author": "ButterflyAttack"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;\"One of our non-smoking staff put a message in the company suggestion box earlier in the year saying that smoking breaks were causing problems.\"\n\n&gt;Following the suggestion, the company's CEO Takao Asuka decided to give non-smoking employees extra time off to compensate, Mr Matsushima added. \n\nThat's not how I would have expected the issue to be resolved, but good on that CEO",
            "score": 21764,
            "author": "JimBroke",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm surprised a company would go this far to ensure it was treating employees equitably ",
                    "score": 6598,
                    "author": "NeverFarted",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 4944,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Satoru Iwata cut his salary in half after Nintendo's Wii U disaster to avoid laying off any employees.",
                                    "score": 1974,
                                    "author": "delorean225",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1469,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Shareholders are cancer.",
                                                    "score": 1330,
                                                    "author": "timeshifter_",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Nintendo has shareholders, as do most major Japanese companies.  The problem is the ultra-capitalist mindset prevalent in American business.",
                                                            "score": 1254,
                                                            "author": "epicazeroth",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The problem is CEOs getting millions and millions of dollars even if the company is struggling and then when the board fires them they get compensated with even more millions.",
                                                                    "score": 818,
                                                                    "author": "shapookya",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I don't so much mind the high salary executives make, though it does irk me. The thing that really gets to me are the bonuses executives make, no matter how the company is doing. The thing that really sticks out in my brain is when Sports Authority was in the process of filing a Chapter 11(?) bankruptcy and the executives were all given bonuses in the tens of millions. Like what?? \"Hey good job on running our business into the ground, here's a little something for that new 10-car garage extension you wanted to build onto your mansion.\"",
                                                                            "score": 335,
                                                                            "author": "polarpandah",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "If I do a shitty job I might get fired.  If they drive the company into the ground they have contracts that still make them rich and they'll probably get paid a nice salary to continue working through the liquidation of the company.",
                                                                                    "score": 137,
                                                                                    "author": "_AlreadyTaken_",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "at the end of the day the salaries some people make are, no matter how you argue it, insane.\n\n$16,300,000 yearly in compensation, in average, for the largest 350 US companies.\n\nto put that into perspective, if you work non-stop 45 years from 20 to 65, and make double the average salary (106,000 / year), you still only make a *fourth* of what this person made in a *year*, in your *entire working career*.\n\nno person is worth that kind of money, ever. CEO salaries (for big companies) in the US are a laughing matter at this point in time, and have no basis in reality.",
                                                                                    "score": 325,
                                                                                    "author": "scandii",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "\"If we're successful it's because of me, if we're failing it's because of you.\"",
                                                                            "score": 102,
                                                                            "author": "PolioKitty",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It isn’t just one single problem:\n\n*high pay for top execs even if they destroy company value  \n*focus on annual performance even if long term stability of company is damaged  \n*cuts in benefits and employeees even if company performance exceeds expectations because nothing like giving Wallstreet a bigger (good) surprise to make the Board excited\n\nAnd I could go on.\n\nEDIT: I know companies are in business to make money.  My point is many seem to be driven to create short term wealth while eschewing long term viability.",
                                                                            "score": 349,
                                                                            "author": "Gahvynn",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "100% this.  The main problem with our economy is everything is driven for the short term. Short term stock growth, short term politics, short term ROI on public investments, etc. ",
                                                                                    "score": 162,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "No, a board of directors focused on short-term outcomes is what is cancer.",
                                                            "score": 73,
                                                            "author": "MyOldUsernameSucked",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's not quite true.  He did that as as sign he should be held accountable for failures of his leadership.  Nintendo has legit billions upon billions in the bank and could continue operations running at a loss for like a decade straight before firing anyone ",
                                            "score": 77,
                                            "author": "xjayroox",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I wouldn't overstate that as one of the reasons for lower disparity. Most of them actually comes from enterprise institutions like wage seniority and lifetime employment, which all come from Japan's era of high speed growth. As their economy slowed down after the bubble in the 90's, disparity is increasing as some of these institutions wither away\n\nEdit: autocorrect",
                                    "score": 297,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also despite best efforts, then Yen never really went to the accepted 300 yen in the Dollar, right now it’s holding at 113 yen. Economists are screaming constantly at the “failure” of Japan to make inflation go up. I don’t profess to understand the logic of inflating a currency deliberately, but from my perspective this benchmark minimum 2% every year has cost the citizens of this country far more than the 5 year plan in Japan to inflate the currency that’s failed. Mind you Toyota, Nissan and Mitsubishi Heavy Industries are pumping harder and higher every day. ",
                                            "score": 89,
                                            "author": "Intimidator94",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;I don’t profess to understand the logic of inflating a currency deliberately\n\nJapan often falls into deflation (negative inflation) as it did last year. In a deflationary economy, you earn money in real terms just by storing cash under your mattress - there is no point buying things or investing unless you have to because everything will be cheaper next year. This is a death sentence for an economy that wants to grow and advance.  \n\nThe reason for why this is bad is pretty complicated, but among other effects you will see the increase of government and personal debt in real terms and a shrinking of the size of the economy. A worst case scenario would be a deflationary spiral, where financial institutions start to collapse due to all the bad debt that has to be written off.",
                                                    "score": 191,
                                                    "author": "58working",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The West has this too it's called noblesse oblige. It was expected under feudalism that the aristocracy would in some way act well in order to justify their position: \"as nobles, we have rights, but we have duties also; so such duties validate our rights\".\n\nThe problem is the modern rich have all the noblesse but none of the oblige. ",
                                    "score": 206,
                                    "author": "warman17",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 74,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bushido is explicitly Confucian in nature. It is based upon the concept of Filial Piety and the relationship of the ruler to the ruled. It builds upon the idea of the Junzi (gentleman or cultured gentleman) who exemplifies the ideal life to commoners to encourage them towards right behavior.\n\nThe Samurai Code is basically just Confucianism contextualized to a warrior class in Japan.",
                                                    "score": 53,
                                                    "author": "ManetherenRises",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 86,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm sick of working while those ballbags go off and have a dart. ",
                            "score": 518,
                            "author": "Shobeewan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "American firm gives nonredditers extra six days",
                                    "score": 1389,
                                    "author": "fruchtzergeis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "More like sixty days amirite",
                                            "score": 309,
                                            "author": "klonkish",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Makin me firm.",
                                                    "score": 54,
                                                    "author": "Jumbuck_Tuckerbag",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's not equal compensation. Maybe an extra month off?",
                                            "score": 47,
                                            "author": "v4vendetta77",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "be realistic \n\nsmokers smoke less than one reddits at work ",
                                            "score": 101,
                                            "author": "thel4sthotsuin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What about smokers who reddit? ",
                                                    "score": 62,
                                                    "author": "omarmctrigger",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They're basically getting paid to take breaks.  ",
                                                            "score": 135,
                                                            "author": "01Triton10",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Can confirm, currently on smoke break reading reddit, just gained 50p",
                                                                    "score": 60,
                                                                    "author": "smithmeister6996",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "At my old job I used to take snack breaks where I would just go outside and have a snack instead of a smoke, my boss was ok with it",
                                    "score": 246,
                                    "author": "WingerSupreme",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah we just have regular breaks throughout the day for the whole staff, smokers smoke and the others get some air/snacks/coffee.",
                                            "score": 40,
                                            "author": "Amlethoe",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I used to do the same thing. It was a great way to network. ",
                                            "score": 69,
                                            "author": "AFineDayForScience",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I have learned more about the people of my workplace on smoke break than 13 years working inside.",
                                                    "score": 107,
                                                    "author": "SmokiestDrip",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What slang is this?",
                                    "score": 24,
                                    "author": "Endoman13",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I took \"smoke breaks\" all the time and I never smoked. Smokers would always ask me what I was doing and I would simply reply \"taking my smoke break\".",
                                    "score": 48,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's actually pays out double in the long run, by giving a good incentive you can curb future health problems. Insuring that your employees will be in the working force longer and cutting insurance cost. It's the same reason my job will pay form my gym membership, sad that it's rare to see mutually benefit policy  happen now a days.",
                            "score": 52,
                            "author": "TranscendentalEmpire",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 132,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When I used to work in a warehouse, I fucking hated smokers. We had two 15 minute breaks throughout the day (aside from our off-the-clock lunch break), and they were strictly enforced. However, if you were a smoker, you got to take a 15 minute (or longer) break every hour, and no one would complain because all of the management were smokers, too. This not only meant that non-smokers ended up doing the majority of the work, but also that all of the smokers got favoritism because they spent literally hours a day hanging out with middle management.\n\nAlmost enough to convince a healthy young guy to take up smoking.",
                    "score": 818,
                    "author": "Tyrilean",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How did you not just stop working while they left? Go outside and scratch your ass for 15 whole they smoke.",
                            "score": 227,
                            "author": "detarrednu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because of the favoritism. Everyone else was required to keep on working. It was grunt work, so you could bitch but you could also be easily replaced by a minimum wage temp by the next day.",
                                    "score": 214,
                                    "author": "Tyrilean",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is \"you can take a break with the smokers as long as you're also standing outside with them while you do it\" not a thing anywhere else?\n",
                                            "score": 80,
                                            "author": "mrbeehive",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So buy a pack of herbals (the cigs actors use) and get some extra breaks dude.  \n\nEdit: apparently they taste bad, dont have nicotine, and sometimes have higher tar, so nevermind",
                                            "score": 95,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Or those candy cigarettes and just snack on them. ",
                                                    "score": 99,
                                                    "author": "Last5seconds",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "15 minutes every hour for a smoke break in a warehouse\n\nwhere in the fuck was this at",
                            "score": 29,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt; a 15 minute (or longer) break **every hour**\n\nwhat that fack?? Every HOUR. That's 25% of your whole day GONE. how could they ever justify such a ridiculous thing \n\n",
                            "score": 188,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 133,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, that's what I was wondering. They might get 6 extra days off work in theory, but I wonder if anyone will actually take advantage of the offer.",
                            "score": 57,
                            "author": "Words_are_Windy",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It acts as a motivator for smokers to ~~quick~~ quit smoking, when all their smokebreak time is added up in front of them like that.\n\nWhich creates healthier employees, which makes them less expensive for the company through insurance costs.",
                    "score": 196,
                    "author": "GoOtterGo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Quick smoking will save time but not health.",
                            "score": 80,
                            "author": "cutelyaware",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "One of my best friends had never smoked before. He got a job at Applebee’s and everyone in the kitchen took a smoke break every so often. If you didn’t smoke, you didn’t get that break. He started smoking then and 20 years later, he still smokes.",
            "score": 8288,
            "author": "stump1001",
            "replies": [
                {
                    "level": 1,
                    "comment": "I worked at Applebees few years back, cooks would smoke all the time. Im a non-smoker and got shit from a co-worker cus i didnt smoke and wanted to go outside for 5 mins. Fuck you man. ",
                    "score": 1044,
                    "author": "gdrumy88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I call it a fresh air break and all my coworkers that smoke are ok with it",
                            "score": 396,
                            "author": "yanggmd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As a smoker, I would have absolutely no problem with this. When smokers get mad about it, then it becomes a problem. ",
                                    "score": 254,
                                    "author": "I_THROW_U_AWAY",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Non smokers join me outside for a break quite often",
                                            "score": 26,
                                            "author": "ChuckLazer"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And they act like it's some sort of medical need for them to go smoke. That always bugged me.",
                            "score": 805,
                            "author": "Chevaboogaloo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Holy shit yeah the entitlement always really annoyed me. \n\nI somehow doubt if I was addicted to jerking off that I'd be entitled to go crack one out in the bathroom several times a shift.",
                                    "score": 621,
                                    "author": "TeaDrinkingRedditor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 335,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[Well, there is this woman](http://blogs.findlaw.com/legally_weird/2011/05/brazilian-woman-has-right-to-masturbate-at-work-court-rules.html)",
                                            "score": 20,
                                            "author": "icecreammachine",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "sometimes it's the social component as well. You miss out on conversation and bonding time when you're not participating. It's like that with my group of friends but now most of us have stopped and its the few who still smoker who are left out of conversation that's going on.",
                    "score": 2107,
                    "author": "Grand-Mooch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I join people on smoke breaks sometimes even though I don't smoke. May sound weird but like you say it's a social component and you miss out on conversation and bonding time. I'm not smoking when I join them either to clarify. ",
                            "score": 132,
                            "author": "Stickyballs96",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 109,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It seems like smoking is a lot more common in France than in North America now. It still seems like there is a general consensus among the younger generation in France that it is cool to smoke whereas over in N.A. we don't have that so much anymore. Just what I've noticed from the few times I've been to France. ",
                                    "score": 78,
                                    "author": "FirelordMatt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Anecdotally, I grew up in the the SF Bay Area my whole life and out of all my close friends (hahaha I do have friends) none of us smoke—I’m talking like a group of 10 of the boys here. In fact I have to try very hard to think of any smokers from my high school—no joke. According to the CDC in 2011 13.7% of people 18+ smoke in California. I’d say where I’m from it’s even less. Just a gross, unhealthy habit that we’ve always been taught not to get into. \n\nThe CDC also says that in the US rates of smoking range from 11.8% to 29.0%. Utah (Mormons) being the lowest followed California. States in the south and in the east have much higher rates of smoking. ",
                                            "score": 41,
                                            "author": "spandexrecks",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'd say that weed smoking took over cigarette smoking socializing. I smoke cigarettes but since I don't smoke weed at all I've \"missed\" out on a lot of socializing and bonding through getting high together. I'm pretty sure the people who would have been smoking if it was still culturally acceptable in America just simply moved onto weed instead. How many of your 10 friends blaze?",
                                                    "score": 38,
                                                    "author": "HisKoR",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Was gonna add that but didn’t feel it was too relevant. During high school all of us smoked fat and most of us through college too. Most of us stopped smoking weed now. We’re about 25 and some of the boys got jobs where they drive company vehicles etc. \n\nYea we would smoke all the time everywhere. During lunch at school, during brunch, during school. Go on hikes and blaze and what have you. ",
                                                            "score": 20,
                                                            "author": "spandexrecks",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "At shows and parties I love a smoke. I'm shy so I struggle to start conversations with strangers but I never fail to connect with someone nice over a smoke break. ",
                            "score": 624,
                            "author": "MsPlavalaguna",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "is it worth the lung cancer tho\n\nedit: [Can you get away with Social Smoking?](https://www.webmd.com/smoking-cessation/features/can-you-get-away-with-social-smoking)\n\nu/jammacus down there with even more juicy stats",
                                    "score": 1034,
                                    "author": "j0llypenguins",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm banking on robot lungs in 20 years",
                                            "score": 605,
                                            "author": "MillorTime",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 343,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "and if you're in America add another 20 for ethics and legal battles and then 20 years of debt to afford the \"affordable\" model.",
                                                            "score": 291,
                                                            "author": "Hoeftybag",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 225,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Are you Rachel from friends?",
                            "score": 49,
                            "author": "TotalFreedom420",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Anyone considering this now should just take up vaping and use 0% liquid, haha. ",
                    "score": 349,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The real LPT…",
                            "score": 87,
                            "author": "WikiWantsYourPics",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 30,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I've heard of this sort of thing happening a lot from smokers.  Work, especially in restaurants, has been the leading cause I've heard for people taking up smoking as an adult (21+).  ",
                    "score": 22,
                    "author": "the_fat_whisperer"
                },
                {
                    "level": 1,
                    "comment": "That's why I started drinking coffee when working construction.. No coffee, no break. ",
                    "score": 17,
                    "author": "LegionP",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Just go with them and take a shot of tequila per break. Problem solved!",
                    "score": 18,
                    "author": "TheLdoubleE",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Kitchen labor and office work is different.  Non-smokers take breaks all the time in offices.",
                    "score": 156,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 39,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I do breaks where I get off reddit and do some work.",
                                    "score": 43,
                                    "author": "Cyril_Clunge",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Right? Making the 15th coffee of the day.",
                            "score": 134,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But smokers ALSO take those same coffee break",
                                    "score": 145,
                                    "author": "NuclearStar",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Positive reinforcement is effective.  I wish more leaders thought like this. ",
            "score": 3320,
            "author": "urfriendosvendo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah if I thought I would get an extra week of vacation I would definitely think harder about quitting.",
                    "score": 897,
                    "author": "ElegantHippo93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Would probably make it easier too.  More days to check in with a therapist or doctor.",
                            "score": 233,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 27,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, but it is Japan and no one is going to take those vacation days.",
                    "score": 95,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OK, but then those guys get to show even more dedication to the company, by not taking 6 more days than before. Even if it's only coming out ahead on optics, they still come out ahead.",
                            "score": 16,
                            "author": "pm_me_gnus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to work at a place where literally everyone smoked except for me.\n\nMy manager let me take smoking breaks anyway  any time I felt like I just needed to step outside and relax for a moment, despite knowing that I don’t smoke.\n\nEverybody there was fine with it. I didn’t take those breaks any more often than other people would take smoking breaks, so there was no problem.",
            "score": 96,
            "author": "Beercorn1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When I used to smoke, I'd do it at 10 o'clock break. Once, the owner came out and said I should be pulling weeds, while I was out smoking. ",
            "score": 1241,
            "author": "AboutNinthAccount",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you work as a landscaper?",
                    "score": 372,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No. Professional stoner. ",
                            "score": 535,
                            "author": "KappaccinoNation",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Reminds me of this:\n\n&gt; And if you could could go ahead and get a can of psticide and take care of the roach problem we've been having that'd be great.",
                    "score": 27,
                    "author": "elfardoo"
                },
                {
                    "level": 1,
                    "comment": "Boss: You smokinbg again Sam?  Can you pull some weeds while you at it..\n\nSam: What do YOU think I am smoking?",
                    "score": 269,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“What are **you** doing here??”",
                            "score": 57,
                            "author": "UncheckedException",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Giving extra vacation time in Japan is like giving extra points in \"who's line is it anyway\".  People die at their desks- no one is taking an extra week+ vacation. ",
            "score": 2749,
            "author": "twistedlimb",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is what I came here to say. Noone takes all their vacation. They don't even go home when work is supposed to end. ",
                    "score": 1167,
                    "author": "Rida_Dain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 729,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They're not necessarily more productive. In America falling asleep at your desk is a sign of laziness. In Japan it may be considered exhaustion from all that hard work. It's more about keeping up appearances.",
                                    "score": 437,
                                    "author": "ohnjaynb",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In fact, I've seen study after study suggest that they're LESS productive, because despite spending more time there... they're always exhausted, almost always stressed, and oftentimes unhappy. It's not a good working environment, and leads to being severely less productive. ",
                                            "score": 315,
                                            "author": "Ferelar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don’t know if Hong Kong is the same as Japan, but I worked in Hong Kong one summer and was hundreds of times more productive than my local counterpart. I would spend my time working, and he would spend his “reviewing background literature.” Perpetually. And never get any work done. When my stay ended and they found a new local person to fill my position, I checked back to see how things were progressing. My supervisor explained it’s slow going over there, and my replacement isn’t nearly as efficient. Just one anecdote, of course, but that was my experience. I’m not a particularly fast worker, I think it’s just that they got bogged down focusing on side things and are afraid to take action without explicit directions. ",
                                                    "score": 87,
                                                    "author": "papereel",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 79,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I would assume you're on good terms with your supervisor if you're calling him back after you left. I don't think you should expect, \"We found someone more efficient than you.\", if you guys are having a friendly chat. Even if they did find someone better.",
                                                            "score": 47,
                                                            "author": "websurv"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's culture. You call them Ridiculous for their worth ethic, and they call you crazy for your gun control or healthcare. Every country has its crazy side. Japans' is just easy to analyze because everyone needs a job. ",
                                    "score": 500,
                                    "author": "Rida_Dain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They aren't actually working any harder, they just spread out the work over 10-12 hours instead of 7-8. Many overseas companies who set up in Japan fall into that trap and hire more staff because they think there's a shortage; they soon realise that everybody including the new staff continue to stay back late.",
                                            "score": 229,
                                            "author": "GaryLifts",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As opposed to places like Norway where they get 8-10 hours of work done in exactly 6.5 and they go home. They don't go home early, and nobody is staying late, when work time is over its just over.",
                                                    "score": 138,
                                                    "author": "Reverend_James",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They do it because if they don't their replacement will",
                                    "score": 44,
                                    "author": "nascentt",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "From a European perspective, America isn't exactly a country that can be all high and mighty about employment conditions.",
                                    "score": 170,
                                    "author": "WikiWantsYourPics",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah. It's not uncommon in the US to see workplaces where people don't take their holidays because it 'looks bad'",
                                            "score": 62,
                                            "author": "Vovicon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is what I'm least looking forward to about graduating college and getting a real job. My dad only takes like 4 of his vacation days and ends up selling the rest back to the company. Even when we go on vacation, he spends most of the time remotely working. It's crazy. ",
                                                    "score": 46,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; My dad only takes like 4 of his vacation days and ends up selling the rest back to the company. \n\n\nI wish I could sell them back. I just lose them.  The only time you can sell them back is if you're leaving the company.  (Of course, I am getting paid to post this comment, so can I really complain?)\n\n",
                                                            "score": 25,
                                                            "author": "redbeards",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 93,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can I get an extra six days of holiday because I don't take a 30-minute shit-break every day? \n",
            "score": 165,
            "author": "dbvbtm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ten minutes into mine right now",
                    "score": 96,
                    "author": "bustaflow25",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You should take 3 x 10 minute shit breaks instead. Doesn't look as suspicious as when you're away from your desk for 30 minutes straight, plus it breaks up the working day at different points.\n\nIt also allows you to gauge the reaction of your coworkers as the day goes on, so if no one seems to have noticed your first or second shit breaks, perhaps you can get away with an extra one or two.",
                    "score": 19,
                    "author": "The_Blue_Watch",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's easy to give extra days off when you're expecting your employees never take vacations.",
            "score": 248,
            "author": "Orfez",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Pretty sure the are \"Holiday days\" in japan, which mean if you actually take them you might aswell pack up your stuff when you come back cause you aint putting in enough effort. ",
            "score": 600,
            "author": "Prondox",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 40,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Get paid 30 hours a week, expected to be at the office 60 hours a week cause you should want to work that many hours to make sure the company thrives... yea pretty sure working there sucks major ass. Also people rather kill themselves then tell their familys they have been fired / let go",
                            "score": 26,
                            "author": "Prondox"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, my experience in the Japanese workforce has shown that companies are remarkably hesitant to ever fire you. The thing that I don't understand is then *why* everyone acts like there's a perpetual axe over their head. There isn't, they stress, and it's pointless. ",
                    "score": 13,
                    "author": "TheSyllogism",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They don't fire you, they shame you into quitting. Doesn't work quite as well on foreigners.",
                            "score": 30,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It would probably sail so far over my head. Eventually someone might come by and say \"HEY! Why haven't you quit, don't you notice what's going on?\"\n\nI would respond by looking confused. \"I have no idea what you just said, my Japanese isn't very good still.\"",
                                    "score": 16,
                                    "author": "chasesan",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wish we'd do that at places I've worked. Nothing made me angrier than seeing smokers get breaks all the time without anyone batting an eye, yet if I tried to take a break I'd hear \"Why are you just standing around? Get back to work!\" crap. \n\nEDIT: Since it wasn't clear you couldn't just join the smokers outside and not smoke. If you didn't actively smoke, you got no break. ",
            "score": 1121,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Somehow the smokers I've worked with manage to get six or seven breaks a day to my two. Smoke breaks \"don't count\" towards the limit and can be taken on the clock, it seems.",
                    "score": 531,
                    "author": "gorgewall",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly! Many moons ago I worked at a Circuit City and this pissed me off to no end. Smokers went out at least once and hour for 10 minutes and they'd all go at once, leaving the non-smokers on the floor. \n\nManagement smoked so they didn't care to fix it when people complained. I started protesting by taking \"sitting\" breaks in the break room and got threatened with a write up for not being on the floor. It was unreal. \n\nLuckily my current job puts a stop to that. Smokers are only allowed to smoke during break time which is 10, lunch, and 2. The way it should be. ",
                            "score": 387,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I smoke and i agree lol why should the job have to bow down to your habit. ",
                                    "score": 213,
                                    "author": "flubberFuck",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 127,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'd be much more cool with it if non-smokers were also given break leniency.",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some of the experiences of people in this thread baffle me.  I've never worked in an office where I couldn't take a break whenever I wanted to.\n\nSome people go out for smoke breaks.  I could up and go for a walk or to the coffee shop if I wanted to.",
            "score": 286,
            "author": "goatamousprice",
            "replies": [
                {
                    "level": 1,
                    "comment": "Work a job that lets you make the hours. They are great. I don't use that time to smoke. I use it for Reddit. Reddit isn't cancerous right? Right?!",
                    "score": 112,
                    "author": "Fearthebearcat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Get your affairs in order now.",
                            "score": 36,
                            "author": "Funandgeeky",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The difference is office jobs are usually salary based. Sure you can take a break whenever you want, but you also have to put in unpaid “overtime” when deadlines require it. ",
                    "score": 61,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to have a edgy, nervous and generally unpleasant assistant manager in my old retail job. One Sunday (only two of us were in) she let me know she was going for a smoke break and I, a young 17 year old had the audacity to ask her why smokers got more breaks than non-smokers, a fact she angrily and quickly refuted as being simply not true (before popping out for 15 minutes to said aforementioned 'not-a-break').",
            "score": 36,
            "author": "heywhatsuptoast"
        },
        {
            "level": 0,
            "comment": "My coworker and I got sick of the smokers getting to go out for breaks, so we would go on “second hand smoking breaks” and just go walk around outside for 15 minutes. ",
            "score": 174,
            "author": "xGiaMariex",
            "replies": [
                {
                    "level": 1,
                    "comment": "get some candy cigarettes and go and eat them",
                    "score": 51,
                    "author": "shabutaru118",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "At my job in Minneapolis, you are not allowed to smoke on the premises. You have to cross the street during your lunch to smoke. It's actually one of the best quit plans I've seen, we have very few smokers at my company.",
            "score": 115,
            "author": "Alpha-Trion",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don't smoke but I do follow the \"smokers' rota\" and make sure I take my 10 min break every 15 mins. ",
            "score": 155,
            "author": "adinho85",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 142,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Check out his account. Not even a year old and just always angry. Probably a paid troll. Or worse, an unpaid troll.\n\nEdit: With hundreds of posts in the last 24 hours...",
                    "score": 147,
                    "author": "I_SHIT_FEDORAS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey, totally unrelated but is paid troll a thing? If it is I'm more then willing to be an asshole for hire.",
                            "score": 66,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How good is your Russian?",
                                    "score": 54,
                                    "author": "Oblargag",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cyka blyat\n\nAm I hired now? ",
                                            "score": 35,
                                            "author": "KappaccinoNation"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "But do they get smoke breaks?",
                                    "score": 12,
                                    "author": "MezzanineAlt",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My father worked for an editing firm about 25 years ago and he was pissed that smokers got breaks while he didn’t. His solution was to buy candy cigarettes and go out for his “smoke break.”",
            "score": 44,
            "author": "Alvarez09",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Would decreasing the number of smokers in the company reduce the cost of healthcare insurance for the company?",
            "score": 87,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "ITT: A bunch of people browsing reddit all day at work bitching about their lazy, good-for-nothing co-workers.",
            "score": 548,
            "author": "GeneralMalaiseRB",
            "replies": [
                {
                    "level": 1,
                    "comment": "Boss makes a dollar, I make a dime, that's why I shitpost on company time.",
                    "score": 217,
                    "author": "depressoexpresso1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Whoa whoa the day has just started. I haven’t had time to waste it on reddit yet. ",
                    "score": 69,
                    "author": "Samue1adams",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "My colleagues that smoke don't get back to their desks and work their butts off. They get back to their desks and procrastinate just like everyone else.",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        }
    ]
}