{
    "id": "dezr7q",
    "score": 119969,
    "title": "Blizzard pulls Blitzchung from Hearthstone tournament over support for Hong Kong protests",
    "author": "V_IR",
    "date": 1570540313.0,
    "url": "https://www.reddit.com/r/news/comments/dezr7q",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Tried to delete my account. \nBlizzard sends a code. I enter it. Once. \nTOO MANY ATTEMPTS! ENTER A PHOTO ID TO PROCEED! \nSeriously? The company that just bent over for China wants me to send them my ID? \nUhhh....",
            "score": 1069,
            "author": "SCROTOCTUS",
            "replies": [
                {
                    "level": 1,
                    "comment": "Start talking shit about china and tag blizzard.  They'll ban you m",
                    "score": 359,
                    "author": "justjoshingu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I used to play all of Blizzard's games but then they got lovey with China.  I hate what China is doi",
                            "score": 36,
                            "author": "dat2ndRoundPickdoh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh God, Chinese snipers in the thread, get dow",
                                    "score": 41,
                                    "author": "yobakanzaki",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;send ID \n\nyeah no",
                    "score": 92,
                    "author": "monsieurpommefrites"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They even fired the 2 commentators interviewing him, holy fuck!",
            "score": 22409,
            "author": "Bigred2989-",
            "replies": [
                {
                    "level": 1,
                    "comment": "They did not hold back at all. Deleted the VoD, cancelled his prize, banned him for a year and fired both commentators. Would probably arrest everyone watching if they could.",
                    "score": 13434,
                    "author": "reset_switch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Was the tournament in Hong Kong or something?",
                            "score": 4128,
                            "author": "DetectorReddit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Taiwan I believe.",
                                    "score": 5025,
                                    "author": "thevictor390",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 4364,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This post or comment has been overwritten by an automated script from /r/PowerDeleteSuite. Protect yourself.",
                                                    "score": 3058,
                                                    "author": "pm_me_ur_big_balls",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sent off for Han ball",
                                                            "score": 462,
                                                            "author": "mccofred",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Did you mean the one real and true Republic of China and successor to pre World War II China?",
                                                    "score": 893,
                                                    "author": "constant_hawk",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "All hail Xi, Lord of the Winnie.",
                                                            "score": 178,
                                                            "author": "Transient_Anus_",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;Republic of China\n\n*The Emperor Does Not Like This.*",
                                                            "score": 403,
                                                            "author": "vonmonologue",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The Manchu Emperors can choke on their dumplings. Sincerely, the people under the awesome multicolored flag of Sun Yat Sens republic.",
                                                                    "score": 235,
                                                                    "author": "constant_hawk",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Grandmasters is the pro-league for hearthstone. Players play from their home and each winner is granted an interview. Tournament actually makes is sound not as bad as what actually happened. Blitz was banned from competitive play for 1 year and all earnings he made from season 2 in grandmasters was pulled. This was his career.",
                                    "score": 778,
                                    "author": "JJWattGotSnubbed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "His earnings. Which he had earned. Was retroactively taken back? Wtf?\n\nEdit: a word",
                                            "score": 588,
                                            "author": "Speideronreddit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yup they basically stole this man’s wages if he is a pro.  At this point Blizzard needs to be charged for theft.  But that won’t happen because technicalities and bullshit.",
                                                    "score": 721,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yo, another TCG dev company is giving him the money back at least, so there's that",
                                                            "score": 186,
                                                            "author": "helpmeobireddit",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Found the source for that, pretty decent of them, and some excellent PR for a game I hadn't heard of until this.   \n\n\n [https://twitter.com/GodsUnchained/status/1181487505180258304](https://twitter.com/GodsUnchained/status/1181487505180258304)",
                                                                    "score": 38,
                                                                    "author": "Grizzly1986",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Which one? I think they deserve support.",
                                                                    "score": 34,
                                                                    "author": "Ryareb",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "According to their statement, \"we support freedom of expression\" but we have to take action because of our rule which says \"if you do anything we deem inappropriate, we'll ban you.\" So, we won't actually support freedom of expression in this case. Checkmate.",
                                                            "score": 38,
                                                            "author": "cosmogli"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It was Asia-Pacific grandmasters. At this stage in the tournament, competitors are still playing from their homes.",
                                    "score": 339,
                                    "author": "Caimai0112"
                                },
                                {
                                    "level": 3,
                                    "comment": "Last Blizzcon DIABLO eternal was the signal that Blizzard only gives a shit about Chinese money...that's why the Blizzcon reaction didnt phase them. We're not the mark.",
                                    "score": 294,
                                    "author": "NotagoK",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "More like arrest, execute, and bill their family for the bullet like traditional CCP",
                            "score": 827,
                            "author": "imaginary_num6er",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What bullet? CCP has no idea where your family went.\n\nEdit: Thanks guys, my highest voted comment is about china, and now my visa there is getting revoked, and I'm on a list.",
                                    "score": 645,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 381,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What man? There was no man here. He never existed.",
                                                    "score": 299,
                                                    "author": "ThatGenericName2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "We do have a pile of organs here ready for transplanting though.",
                                                            "score": 375,
                                                            "author": "aswifte",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Scorched fucking earth strategy.",
                    "score": 1642,
                    "author": "DisagreeableFool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This quote comes to mind when you said scorched earth. It kind of fits in with their overreaction.\n\n&gt; First, take a big step back... and literally, FUCK YOUR OWN FACE! I don't know what kind of pan-pacific bullshit power play you're trying to pull here, but Asia, Jack, is my territory. So whatever you're thinking, you'd better think again! Otherwise I'm gonna have to head down there and I will rain down an un-Godly fucking firestorm upon you! You're gonna have to call the fucking United Nations and get a fucking binding resolution to keep me from fucking destroying you. I'm talking scorched earth, motherfucker! I will massacre you! I WILL FUCK YOU UP!",
                            "score": 1283,
                            "author": "douche-baggins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One of my all-time favourite Tom Cruise parts.",
                                    "score": 379,
                                    "author": "DrunkOnLoveAndWhisky",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My favorite Tom Cruise parts were Les Grossman's prosthetic forearms.",
                                            "score": 220,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He legit wanted to play a character with big hairy hands and wanted to dance. That was his requirements to be in Tropic Thunder.",
                                                    "score": 72,
                                                    "author": "DanoLightning",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Could you find out who that was?\"",
                                    "score": 110,
                                    "author": "KratzALot",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "the two commentators are Taiwanese . I can not understand bz that fired them. Freedom of speech is everyone’s right. If a game can not make me happy , i will delet it and i did it . 10/8 was my last day to play ow because i can’t understand what bz did to the two commentators.",
                    "score": 626,
                    "author": "AprilPLi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I totally understand what they did. They sacrificed integrity for the promise of money.",
                            "score": 768,
                            "author": "ADirtyThrowaway1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"You gotta lower your ideals of freedom if you wanna suck on the warm teat of China.\"",
                                    "score": 525,
                                    "author": "Mr_Julez",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They removed him for “damaging blizzard s image” I hope like hell that this results in a much larger backlash that damages blizzards image. \n\nMatt and Trey are always relevant, southpark is calling out anti democratic bullshit while\nThe US, NBA, etc continue to milk dick for money.",
                                            "score": 204,
                                            "author": "-Sociology-",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's no coincidence they're both Taiwanese and they were *both* banned.",
                            "score": 80,
                            "author": "SafeThrowaway8675309",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Time to cancel my sub.",
            "score": 2305,
            "author": "Beezelbubba",
            "replies": [
                {
                    "level": 1,
                    "comment": "I cancelled mine before work this morning. Can’t get behind this shit.",
                    "score": 1149,
                    "author": "HydroGlyFX",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "been subbed for 13 years and this is what ends up killing wow for me. what a time to be alive",
                    "score": 1360,
                    "author": "telungoku",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Played since '05, unsubbed today.\n\nNever thought I'd have to choose between my favourite game and my principles, but it's been a pretty easy choice.",
                            "score": 807,
                            "author": "Syr_Enigma",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are people in chat calling it out too? I played for a very long time and considered starting again, but no thanks. And no thanks on starting Starcraft again, or overwatch, or the remade wc3..... bye bye blizzard.",
                                    "score": 87,
                                    "author": "DisturbedDeeply",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I feel you, brother. But when it comes to Blizzard, the only way to get their attention is to hit them in their pockets.",
                            "score": 36,
                            "author": "buster284",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Blizzard replacement pack: \n\nDiablo-&gt; Path of Exile\n\nOverwatch-&gt; TF2\n\nHearthstone-&gt; MtG/Pokemon TGC\n\nWoW-&gt; FFXIV",
                    "score": 179,
                    "author": "SealClubbedSandwich",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Luckily Blizzard has made it easier over the years to just pull the plug on all Blizzard games and the Blizzard launcher.  They really haven't developed great games in a long time as Activision has exerted more control over the company.",
            "score": 5577,
            "author": "UncleDan2017",
            "replies": [
                {
                    "level": 1,
                    "comment": "Overwatch was cool for the first year. Then it got old very quickly. That's the last Blizzard game I will ever play.",
                    "score": 1859,
                    "author": "TDeLo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly. Overwatch was exciting for exactly one year, then it became a meme, and now it’s just sad to see. Magic is better than hearthstone, PoE is better than diablo, etc.. Blizzard has nothing to offer so let them become an irrelevant Chinese owned company making mobile battle royale games and selling remastered versions of their long dead lineup. Uninstall battle.net and make it clear why.",
                            "score": 1228,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sadly Blizzard officially died for me when they fired most of their developers. They will never get a good game out again.",
                                    "score": 390,
                                    "author": "Starlos",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 196,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why the fuck are American companies protecting a government whose values are antithetical to their own?",
            "score": 3201,
            "author": "Stolzieren__",
            "replies": [
                {
                    "level": 1,
                    "comment": "Corporations are psychopaths, their only value is money.",
                    "score": 2587,
                    "author": "Yvaelle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The worst part is they are incredibly short sighted. Maybe they have some semi-exclusive access for a few years to the Chinese Market but as soon as enough of their IP has been stolen the Chinese will have a \"private\" company just clone the product, be it hardware or software. The government then squeezes the original IP holder out and it is replaced by the Chinese copy.",
                            "score": 543,
                            "author": "August0Pin0Chet",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because there is no such thing as an \"American Company\". Corporations, especially the bigger they get, are only about making money for their shareholders and executives, period. There is no national pride/loyalty, no moral concerns, no ethical lines that can't be crossed in the name of chasing infinite growth and short-term profit. A corporation is NOT a person; they don't have a sense of morality or a conscience. They are a legal entity created to make business safer/more efficient. A company doesn't have \"values\". The people running it might, but the company doesn't. If there are no regulations against something, or if the penalties for breaking those regulations are minor enough, then anything can and will be done for that sweet sweet money.",
                    "score": 190,
                    "author": "MarcTheSpork",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3398,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You know I don't play many card games anymore because of the time investment to learning them, but I might just pick this up to do a bit to help prove a point.",
                    "score": 674,
                    "author": "SpCommander",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Never into card games, but might try that out.",
                            "score": 185,
                            "author": "I-Am-Maldoror",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Blizzard be licking Chinese boots so hard it’s gross.",
            "score": 505,
            "author": "Pec0sb1ll",
            "replies": []
        },
        {
            "level": 0,
            "comment": "BlitzChung's winnings are being covered/paid by another another gaming company that has a competitor game to HearthStone called Gods Unchained and they're give him a free admission to their $500k world championship tournament:  [https://twitter.com/GodsUnchained/status/1181487505180258304?s=20](https://twitter.com/GodsUnchained/status/1181487505180258304?s=20)   This is obviously a marketing move, but heartwarming too.",
            "score": 18211,
            "author": "x_ETHeREAL_x",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don't even care if it's marketing to be honest, clearly a Blizzard replacement is needed.",
                    "score": 7346,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Surprised it wasnt WoTC but theyve also got their hands in China",
                            "score": 1389,
                            "author": "elbenji",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "WOTC are just as compromised. Disgusting company.",
                                    "score": 778,
                                    "author": "Tsund_Jen",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My mentality is that a marketing move is still noble if theyre putting their money where their mouth is. Good on them indeed",
                            "score": 308,
                            "author": "ChanTheManCan",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Also it lessens the blow/warning China is trying to send to people that speak out on Hong Kong. By supporting these people it gives courage to those who may be afraid to protest",
                            "score": 277,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well the marketing worked, I'll try this game out just because of this.",
                    "score": 964,
                    "author": "meopelle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah same, mostly to show support.",
                            "score": 195,
                            "author": "Auuxilary",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's a smart marketing move and sure to get them some exposure being tied to this story. Good on that company.",
                    "score": 1305,
                    "author": "lefondler",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "First time I've ever heard of them and I already have positive first impressions. Wish more companies would compete to be the least shitty.",
                            "score": 253,
                            "author": "Jaredlong",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Excuse me, marketing light at best. It's a bold political statement that will prevent any working relationship with China. They are showing loud and proud that they are not run by an oppressive regime the way Blizzard is just a puppet.",
                            "score": 855,
                            "author": "CreamyRainbowFart",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Guess who is uninstalling Hearthstone and installing Gods Unchained today? This guy.",
                                    "score": 628,
                                    "author": "coffeefuckyeah",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 174,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 551,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I always wondered how a ton of older people managed to fall behind in technology as it advanced. Every time I see the word blockchain I feel like it’s the beginning of the same thing happening to me.",
                            "score": 193,
                            "author": "PM_ME_YOUR_GOOD_NEW5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've seen a video explaination. I still have no fucking clue.",
                                    "score": 62,
                                    "author": "GiffelBaby",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's a rare moment when good marketing and ethical behavior line up.",
                    "score": 166,
                    "author": "Aestus74",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 11011,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Edit: /r/blizzard  is now apparently a private subreddit\n\nIt's like watching a PR department roundhouse kick itself in the face over, and over, and over. Like a tornado of pathetic failure.",
                    "score": 4329,
                    "author": "BenderRodriguez14",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 826,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do Blizzard employees mod r/blizzard? Isn’t that against TOS?\n\nEdit: Roll20s subreddit had a lot of drama a few months back because of this.",
                                    "score": 1103,
                                    "author": "Tarnis-Phoenix",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, having the company run the subreddit kind of defeats the purpose...",
                                            "score": 946,
                                            "author": "dicerollingprogram",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Happens in a lot of company subreddits though.",
                                                    "score": 306,
                                                    "author": "ThatDerpingGuy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And admins wont do anything because it probably cause they think it would be less profitable",
                                                            "score": 98,
                                                            "author": "YuTango",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Probably isn't if you're making reddit enough money",
                                            "score": 96,
                                            "author": "Chardonk_Zuzbudan",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I browsed it an hour ago maybe more so recently",
                                    "score": 345,
                                    "author": "Nyan_Catz",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tracer is hetero in china. (not a meme)",
                    "score": 2403,
                    "author": "Elocai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm assuming so is soldier?",
                            "score": 724,
                            "author": "ManWithYourPlan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "no he was uighur, mercy removed his organs while he was watching it happen without any sedation. Then his character was replaced by some new pro china robot. (probably not)",
                                    "score": 1886,
                                    "author": "Elocai",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I like when games go for realism but spending months in an internment camp really slowed the flow of the game imo",
                                            "score": 513,
                                            "author": "ProjectAverage",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "oh bro if wanna a quicker paced game try VR China Protest Sim where u just lay on the ground with a vive on while chinese police kick the shit out of u",
                                                    "score": 190,
                                                    "author": "torinato",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 117,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In a small comic they released a couple months back it was revealed he used to have a boyfriend. Not much is known about him besides his name, Vincent.",
                                            "score": 199,
                                            "author": "ArcticShore",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So they're trying to play all sides? Progressive towards the gender...crowd, and uptight bloodless  conservative in china?",
                                                    "score": 63,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Big corporations will always make every individual decision they can to bring in as many dollars as possible\n\nThe only thing wealth caters to is more wealth.\n\nand in this great big global debate we are all starting to finally have, about wealth inequality and what amount of decency we are willing to sell for more wealth, never forget this really eye-opening piece of insight\n\n1 million seconds is 12 days, 1 billion seconds is 32 years.\n\nBlizzard could have been a household and loved name for all of its time if it has been happy to make a ton of money instead of a fuck load of money.",
                                                            "score": 41,
                                                            "author": "sheepcat87"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for the brave representation, Blizzard!",
                            "score": 235,
                            "author": "Neracca"
                        },
                        {
                            "level": 2,
                            "comment": "Wait seriously?",
                            "score": 171,
                            "author": "mldutch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep. LGBT is somewhat illegal in China. They can't marry, and they cannot be publicly depicted.",
                                    "score": 424,
                                    "author": "AlphaTangoFoxtrt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "One of the craziest things I heard about recently was about [Addicted](https://en.wikipedia.org/wiki/Addicted_(web_series)), a Chinese web series focused on a gay couple. It was huge (10 million views within a few days of its release). Then when it had a few episodes left, it was suddenly removed from all Chinese streaming services and only accessible outside of China. The two main actors became really close friends while filming, but they were banned from ever appearing together on screen again, and it even got to the point where they had to travel outside of China if they even wanted to hang out together. I couldn't believe it when I first heard about it.",
                                            "score": 112,
                                            "author": "HappiLeeErin",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Actually, the only real solution is to stop playing blizzard games. \n\nChina controls their internet so they don’t care about memes or hashtags. Blizzard doesn’t care either so long as people are still giving them money.",
                    "score": 926,
                    "author": "smoke_and_spark",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd bet Blizz would sacrifice their entire Western base just to keep their Chinese users.",
                            "score": 211,
                            "author": "Farallday",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lets find out.",
                                    "score": 178,
                                    "author": "ThomasRaith",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can’t believe it.\n\nChina is controlling Blizzard. I grew up playing their games from Warcraft I and II to Starcraft.\n\nI am very disappointed in Blizzard.\n\nBlizcon is coming up soon - I hope some people make some noise.",
                    "score": 1212,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Want to make noise? Get refunds on the tickets. \n\nDont go to the convention. \n\nIf its emptier than their Diablo mobile game demos n stuff, that would have a greater impact than giving them precisely what they want, your money, and ignoring all the vain attempts at rallying.\n\nPlus security can just escort you out and they still have your money.",
                            "score": 452,
                            "author": "Viseoh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A more realistic protest would be to have non-ticket holders go to Blizzcon and protest at the entrance. Make sure everyone in that building is aware that Blizzard sucks the teat of the CCP.",
                                    "score": 218,
                                    "author": "jmcgit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why not both?",
                                            "score": 78,
                                            "author": "MalleusHereticus",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Diablo Immortal being made for Chinese audiences and the only Warcraft 3 Reforged news in almost a year being shown exclusively in China was a pretty big indication.",
                            "score": 524,
                            "author": "Kenos300",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, when 70% of your pop is Chinese like in WoW. They know where they’re getting their cake.",
                                    "score": 91,
                                    "author": "Platinum_Mad_Max",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The movie, too. Over half came from China alone.",
                                            "score": 48,
                                            "author": "Syn7axError",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I wonder if they'll even have Q&amp;As open to the floor this year. Chances are SOMEone is going to say something about Hong Kong. I wouldn't put it past Blizz to just compile authorized questions beforehand and say \"X User asks Y question\" and go from there",
                            "score": 127,
                            "author": "Kampfgeist964",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I would expect __heavy__ moderation and screening for the Q&amp;A this year, if they even have one.",
                                    "score": 36,
                                    "author": "Sororita",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There is already some talk on other blizzard subreddits about trying to sneak in Hong Kong flags/support apparel to the opening ceremony of blizzcon",
                            "score": 105,
                            "author": "Burnedblood",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "is that sub ran by Blizz themselves? wtf?",
                    "score": 434,
                    "author": "a_longtheriverrun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Drones will do it for free.",
                            "score": 385,
                            "author": "DotaDogma",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not this one.",
                                    "score": 211,
                                    "author": "drone42",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But what about /u/drone43?",
                                            "score": 91,
                                            "author": "Granoland",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Of course that cheap bastard will, they're a poor quality knockoff.",
                                                    "score": 239,
                                                    "author": "drone42",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Edit: /r/blizzard is now apparently a private subreddit\n\nThat's both hilarious and despairing.",
                    "score": 416,
                    "author": "SpCommander",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Wait, r/blizzard is private? Since when?",
                    "score": 213,
                    "author": "Obi-Anunoby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Since today",
                            "score": 311,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s all sorts of fucked up",
                                    "score": 154,
                                    "author": "Obi-Anunoby",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They were probably being bombarded by Winnie the pooh posts and didn't want their Chinese overlords to see.",
                                            "score": 171,
                                            "author": "daven26",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow LMAO.  Making a corporate subreddit private just because you can't handle the criticism of a choice you decided to make.",
                    "score": 279,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "How can a sub like that be private.  Blizzard has control over a subreddit about them?",
                    "score": 160,
                    "author": "RelaxPrime",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unlikely - at least in the old days reddit tended to frown on large companies running their own subreddits. More likely the mod team there just didn't want to/didn't know how to deal with it. That said, mod teams of semi-official corporate subs tend to be very buddy-buddy with the company in question.",
                            "score": 172,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Someone should make r/Blizz4rd and we can spam it there",
                    "score": 115,
                    "author": "afanoftrees",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Here you go: /r/BlizzardChina",
                            "score": 261,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so fucked up. Someone stands up for human rights and decency and he gets told to fuck off because profits?\n\nI don't use any products made by Blizzard so I can't really do anything to show my disgust but fuck them as a company.",
            "score": 5146,
            "author": "HermanoDeTodos",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd thought about getting back into WoW but now I won't...completely turns me off of the company.",
                    "score": 1265,
                    "author": "mully1121",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bli$$ard needs some Tegridy",
            "score": 1604,
            "author": "Burius81",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha I just watched it. They really need it to chill out",
                    "score": 171,
                    "author": "OnlySquareCookies",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The timing with that episode is incredible! Makes it even funnier.",
                    "score": 70,
                    "author": "ghidawi",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Blizzard sucks China’s dick",
            "score": 19548,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They always have.",
                    "score": 3254,
                    "author": "dwayne_rooney",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most of the entertainment world does.",
                            "score": 1961,
                            "author": "Zhelus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Creating shareholder value by embracing oppressive regimes o7",
                                    "score": 949,
                                    "author": "Theemuts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;o7\n\nMore like \\o",
                                            "score": 535,
                                            "author": "TempusCavus",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Gotta have that growth, how are we expected to survive making only hundreds of millions off of our films?",
                                            "score": 166,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Where do you think all the grey market in-game currency comes from? Of course Blizzard would rally behind their own bank account.",
                    "score": 808,
                    "author": "missed_sla",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Sounds like it might be time for a #FuckBlizzard movement.\n\nA damn shame, but if you're going to support a heinous disregard for human rights, fuck you.\n\nLast I checked, China considers dissenters to be criminals, and Chinese prisoners are known to have their organs forcefully harvested. Sometimes while they're still alive. There is a nonzero chance that these protesters will meet that fate if China gets their way. I'd be fucking terrified too. We all would be.\n\nSource:\nhttps://www.nbcnews.com/news/world/china-forcefully-harvests-organs-detainees-tribunal-concludes-n1018646",
                    "score": 1485,
                    "author": "TokenAtheist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup. Used to be a big Blizzard fan back in the Starcraft days. They’ve been slipping over time, though.\n\nBut this? I saw the bit about Blizzard’s sole discretion in the rule they quoted. They’ve made it clear what their decision and stance is, and that stance is to actively and voluntarily punish people for supporting basic human rights.\n\nGuess you were afraid of the backlash from China, but here’s the backlash from the rest of the world: fuck you, Blizzard. I guess you’re going to need to do well in China, because you won’t be seeing any more of my money, and I’ll be encouraging others to avoid you, too.",
                            "score": 404,
                            "author": "SoySauceSyringe",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Sounds like it might be time for a #FuckBlizzard movement.\n\nBlizzcon is less than a month away.\n\nTickets have already been sold at this point.\n\n--\n\nLet's watch as the attendees will surely do something /s\n\n--\n\nedit: For the record, I wish they would.",
                            "score": 160,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean if plane tickets are bought I say go... and fucking protest the shit out of Blizzard's Anti-Hong Kong Democracy stance.",
                                    "score": 79,
                                    "author": "TurelSun",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The whole fucking deal with removing ~~hand~~ organs while alive is so very fucking repulsive considering the amount of fentanyl that country is pushing around the world. Those poor people holy shit.\n\nEdit: autoincorrect / laziness",
                            "score": 283,
                            "author": "wpzzz",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 447,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They're only 5% owned by tencent, it will be interesting to see what a company like Riot does",
                    "score": 519,
                    "author": "JasonEAltMTG",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doesn't really matter how much TenCent owns, China can kick anyone out. ArenaNet, Blizzard, Riot, whomever they want.",
                            "score": 383,
                            "author": "jag986",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True. I remember when China had banned a number of games due to toxicity, and random other crap, the companies rushed to fix the issues to get their game back on the china market. These companies make massive money from their china playerbase, so it's easy to see why they bend the knee anytime China wants.",
                                    "score": 260,
                                    "author": "Miruwest",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "profits over pride.",
                                            "score": 213,
                                            "author": "SpCommander",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dollars over dignity",
                                                    "score": 125,
                                                    "author": "Mernerak",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "\"You got to lower your ideals of freedom if you want to suck on the warm teat of China.\"",
                                                    "score": 162,
                                                    "author": "SketchiiChemist",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You're assuming that it's a function of Tencent ownership, and not them wanting continued access to Chinese markets.  I think that's a really bad assumption.",
                            "score": 535,
                            "author": "RumAndGames",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yet another American company bowing to a brutal dictatorship. Sad.",
            "score": 628,
            "author": "w4lt3r_s0bch4k",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You gotta lower your ideals of freedom if you wanna suck on the warm teat of China.",
            "score": 269,
            "author": "DigitalMystik",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Suppressing and punishing somebody for supporting Hong Kong is tantamount to condemning Hong Kong.\n\nFuck China, fuck Blizzard.\n\nIf your fucking Chinese investments mean more than basic human decency, you can get fucked as a game developer.\n\nI've defended Blizzard a lot, even after the Activision crap, but fuck this. Blizzard goes in the EA tier bin now, no more money to them ever again.",
            "score": 2148,
            "author": "Xenton",
            "replies": [
                {
                    "level": 1,
                    "comment": " [https://us.battle.net/support/en/article/2659](https://us.battle.net/support/en/article/2659)  to delete your account, you can avoid using an ID with an authenticator.",
                    "score": 436,
                    "author": "Anomaly1134",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol it's being spammed so hard it's denying both my authenticator and SMS request",
                            "score": 112,
                            "author": "I_Only_Post_NEAT",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same here, I went ahead and did the id, they aren't keeping me as a customer.",
                                    "score": 38,
                                    "author": "Crowblood",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can't for the life of me figure out why they need a photo of my government issued ID before deleting my account. Not just to delete but can't even submit a support ticket without one? It's a video game company for Christ sakes why the fuck do they need my a picture of my driver's license?",
                                            "score": 68,
                                            "author": "mplsleprechaun",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think it has to do with the past when people commonly tried to steal WoW accounts. Right now, it's probably because a lot of people won't do it to delete their accounts. There is no way both authentication systems aren't working. They're hoping to wait people out.",
                                                    "score": 48,
                                                    "author": "Crowblood",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; why the fuck do they need my a picture of my driver's license?\n\nSo they can match your information to your gaming habits, and sell that to someone else.",
                                                    "score": 33,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope everyone changes their playername to WinnieThePooh",
            "score": 5572,
            "author": "SendMePicsOfKumquats",
            "replies": [
                {
                    "level": 1,
                    "comment": "If anyone actually gives a shit, they’ll just stop playing blizzard games.",
                    "score": 3951,
                    "author": "smoke_and_spark",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just cancelled my wow subscription.",
                            "score": 1521,
                            "author": "antiward",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Does it make me a hipster if I did this years ago?",
                            "score": 852,
                            "author": "Alldemjimmies",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you mention it like this, yes.  But hipsters are actually right sometimes.",
                                    "score": 432,
                                    "author": "derbaburba",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why support them? Hit em where it hurts. Stop playing their games.",
                    "score": 158,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Time to spam all the Gold Sellers with Free HK",
            "score": 563,
            "author": "NotObviouslyARobot",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This whole thing is showing us what China's plan was all along. They will ban Blizz if they don't toe the line and they are banning the NBA for not acting fast enough. Just wait, it will get worse, and we will see just how deep China's tentacles go. (giggity)\n\nEdit: spelling",
            "score": 1504,
            "author": "Azthioth",
            "replies": [
                {
                    "level": 1,
                    "comment": "China’s plan is to extend its cultural hegemony around the globe. And their currency is — wait for it — currency.",
                    "score": 702,
                    "author": "Obi-Anunoby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm afraid currency is the currency of the realm now.",
                            "score": 177,
                            "author": "capn_morgn_freeman",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How the mighty have fallen. Blizzard used to be revered as one of the good game companies. They did groundbreaking, rigorous work in many genres and fostered great communities. Nowadays we get Diablo Immortal, WOW classic and political fuckery. I bought every Blizzard game and expansion up to Overwatch but I think I'm done. Let Activision run them into the ground, soulless pieces of shit. They don't have a monopoly; there's plenty of other games made and published by more scrupulous people.",
            "score": 833,
            "author": "TastyCroquet",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Overwatch game announcer lady \n\n“Now arriving in Internment Camp”\n\nTracer: “cheers mate!”\nGenji “Measure twice cut once!”\nTorb “For the last time I’m Swedish!”\nWidow maker: “Magnifique”\nZarya “No Pain No gain!”\nMei: “Tianemen square was a peaceful demonstration that showed how much we love democracy!”\n\n“Starting in 5..4...3..2...1”",
            "score": 751,
            "author": "ridemyscooter",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Is Blizzard a Chinese company?",
            "score": 843,
            "author": "The_Write_Stuff",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well no. But actually yes.",
                    "score": 1933,
                    "author": "Zakika",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "China is a huge market for them.  Lots of Chinese gamers out there.",
                    "score": 183,
                    "author": "UncleDan2017",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also, Chinese gamers are really into P2W and won't hesitate to drop huge amounts of money into microtransactions. It's like a whale country.",
                            "score": 205,
                            "author": "reset_switch",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No but with how much money they make in china, they might as well be",
                    "score": 154,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "is this some kind of late April fool's joke",
            "score": 1070,
            "author": "HappyHippoHerbals",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you guys not have ~~phones~~ human rights???",
                    "score": 348,
                    "author": "throzey",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yes happy October Fools",
                    "score": 284,
                    "author": "dbx99",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 900,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Welcome to the /r/ABoringDystopia",
                    "score": 290,
                    "author": "Tinfoilpain",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 522,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This has been going on for years and years. It's just recently become more public.",
                    "score": 134,
                    "author": "energydrinksforbreak",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just pulled the blizzard launcher from my computer.\n\nThere are lots of new games I have been needing to play out there.",
            "score": 654,
            "author": "meteorprime",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[Here's](https://twitter.com/InvenGlobal/status/1180954142396710912?s=19) a link to the interview that China wants to delete from the internet and Blizzard has already scrubbed.",
            "score": 61,
            "author": "Lefty_22",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 477,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Im uninstalling overwatch and never playing again....I know they got my money, but fuck blizzard\n\nedit: went through with full account deletion - bye bye blizzard. . .bastards...Lol, they are calling it a \"Data Protection Request\" is that some way of obfuscating my choice to disown blizzard to investors?",
            "score": 287,
            "author": "cosmos_jm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lower player counts are still something, however small",
                    "score": 79,
                    "author": "TheRealHelloDolly",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Email privacy@blizzard.com and request ALL of your data to be removed from their server, also mention that they won't get your business as long as they are sucking a chinese cock.",
            "score": 340,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just cancelled my WoW subscription bc this pisses me off, told them so in the comments, and about 5 minutes after I got the message saying my subscription had been cancelled I got another saying they had locked my whole battle.net account. Wasn’t going to play any of their shit anyways, but damn that was quick.",
            "score": 96,
            "author": "Addicted2Nasacort",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, they actually went way worse then EA lol. It's kind of sad that it was Blizzard that topped EA, I guess they lived long enough to become the villain.",
                    "score": 33,
                    "author": "AcuzioRain"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 62,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "South Park was right. China is controlling American entertainment. Capitalism is weak.",
            "score": 675,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Cancel your subscriptions and move onto their competitors games. This is bat shit insane.   Free Hong Kong. Revolution of our Time.",
            "score": 33,
            "author": "ArrogantExplosiveMF",
            "replies": []
        },
        {
            "level": 0,
            "comment": "GGG was smart enough to ban all political talk a few months ago for the good of the in-game chat...definitely had nothing to do with being majority owned by Tencent. \n\nSP and Comedy Central are going to end up being the only ones with any balls.\n\nEdit: [link to their Code of Conduct change](https://www.pathofexile.com/forum/view-thread/1457463) This was done in June of this year.\n\nEdit 2: Apparently made the change on the Anniversary of Tiananmen. So uh.",
            "score": 153,
            "author": "Sargediamond",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Blizzard used to be one of my favorite game companies. \n\nThis decision by Blizzard to punish those standing up for freedom and rights against China is unacceptable.  Blizzard has lost my future business.",
            "score": 86,
            "author": "Dreadsock",
            "replies": []
        },
        {
            "level": 0,
            "comment": "China will put that player in prison and make him farm game currency &amp; power level other players for real money.\n\nChina did that to gamers from Formosa when they wrecked that entire country.",
            "score": 218,
            "author": "IckySweet",
            "replies": []
        }
    ]
}