{
    "id": "h9h11e",
    "score": 171114,
    "title": "Supreme Court rules workers can't be fired for being gay or transgender",
    "author": "schwachs",
    "date": 1592230047.0,
    "url": "https://www.reddit.com/r/news/comments/h9h11e",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "We welcome differences in opinion, but we do not welcome hate and bigotry. Keep your comments and discussions civil.\n\nIf you engage in hate speech or discrimination, you will be banned.",
            "score": 1,
            "author": "hoosakiwi"
        },
        {
            "level": 0,
            "comment": "It was a 6-3 decision too.",
            "score": 12534,
            "author": "NCSUGrad2012",
            "replies": [
                {
                    "level": 1,
                    "comment": "With Gorsuch, a Trump appointee, writing the majority opinion.",
                    "score": 9676,
                    "author": "hildebrand_rarity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm surprised to see Gorsuch voting like this here. As an originalist, I'd have thought he would have interpreted the meaning of \"sex\" in Title VII more narrowly.\n\nHappy with the result, though.",
                            "score": 4214,
                            "author": "Booby_McTitties",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He is a textualist not originalist...big difference.",
                                    "score": 3101,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What is the difference?",
                                            "score": 1107,
                                            "author": "TomcatZ06",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Origianlism means the original meaning of the relevant law...a judge might look at congressional history of the law and sources outside the text itself to interpret the law.\n\nTextualism looks at the plain meaning of the law itself...a textualist won’t look at congressional history or sources outside of the text (other than a dictionary).",
                                                    "score": 3599,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thanks!  Both seem like pretty narrow ways to view the Constitution, if I'm honest.",
                                                            "score": 1070,
                                                            "author": "TomcatZ06",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "His personal beliefs aside, ~~Alito~~ *Scalia*, for example, has been consistent in saying that the Constitution contains a mechanism for re-interpreting it if needed and it's something we've utilized 27 times: passing an amendment.  His argument is that \"If the Constitution needs to be adapted for the times then adapt it, don't 're-interpret' the Constitution through Supreme Court decisions or legislation.\"  The fact that it's much, much harder to amend the Constitution than it is to get a new Supreme Court ruling is not a viable argument, according to ~~Alito~~ *Scalia*.\n\nAgain, not looking to get into a debate, just providing an example.\n\nEdit: Mixed up Alito with Scalia despite telling myself while typing to be nice since the guy is dead and can't defend himself.",
                                                                    "score": 1305,
                                                                    "author": "hallese",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The thing is, he's completely right on this too.  If we *didn't* view simply ignoring/re-interpreting the Constitution as a viable mechanism, amendments would be much more common.",
                                                                            "score": 527,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Amendments should be more common. The direction of the law in this country should be determined by the ballot, not a small council of lifetime appointees.",
                                                                                    "score": 124,
                                                                                    "author": "Far_Realm_Sage",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You have to have some kind of consistent approach, otherwise you're allowing more room for your biases to get in the way.",
                                                                    "score": 555,
                                                                    "author": "trenlow12",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That’s their job to be fair. They aren’t supposed to create policy (although they sometimes do)\n\nThey have to judge cases purely on what the law states",
                                                                    "score": 68,
                                                                    "author": "Ap2626",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Originalism is based on what the viewpoint was at the time of the writing of the law. Textualist is strictly about what the words mean on paper and not how it was intended.",
                                                    "score": 439,
                                                    "author": "problynotkevinbacon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "To use gaming terms, Rules as Intended vs Rules as Written\n\nEdit: Tabletop gaming",
                                                            "score": 491,
                                                            "author": "ObsceneGesture4u",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Or the Spirit vs the Letter of the Law",
                                                                    "score": 95,
                                                                    "author": "msuozzo",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Only one of those play Age of Empires 2.",
                                                                            "score": 19,
                                                                            "author": "throwmeintothewall"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; I'd have thought he would have interpreted the meaning of \"sex\" in Title VII more narrowly.\n\nHow so? The way he interpreted it was that a man dating a man could be fired but a woman dating a man would not, making sex the discriminating factor. That's pretty narrow.",
                                    "score": 344,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same logic applies to transpeople. If you would fire a transwoman for her male biological sex but not a ciswoman for her female biological sex then you are discriminating on the basis of sex. \n\nI’m very happy this decision was made but in hindsight it’s clear how difficult it would be to rule against these discrimination protections without being explicitly homophobic or transphobic. Not that that stopped three justices.",
                                            "score": 252,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The language in the ruling indicates that “sex” as it was understood in 1964 meant the biological distinction between male and female.  You can’t get more original than that.",
                                    "score": 183,
                                    "author": "eaglebtc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you fire a male employee for dating a man but not a female employee for dating a man then it seems pretty clear that the sex of the employee is the determining factor.",
                                            "score": 142,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The same logic was applied in Loving v Virginia in 1967. If you arrest a black male for marrying a white female (and vice-versa) but not a white male for marrying the same white female, then it seems pretty clear that the race of the male (and female) is the determining factor.",
                                                    "score": 71,
                                                    "author": "SkipDriverCalgary",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Listening to the oral argument, it was clear Gorsuch was thinking that this would constitute “sex” discrimination based on a plain-text reading of Title VII.  I’m glad he saw it through.",
            "score": 1854,
            "author": "reggie9000",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m struggling to understand what he means...is he saying that if you’re firing a man for being attracted to other men when you wouldn’t fire a woman for being attracted to men that it’s gender discrimination? And if you fire a man for dressing/presenting as a woman when you wouldn’t fire a woman for dressing/presenting as a woman, then that’s gender discrimination?",
                    "score": 907,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Basically, yes. If you would fire one person for a particular trait, but not another person, and the difference between those people that changes your decision is their sex, it's discrimination based on sex.",
                            "score": 2388,
                            "author": "ClayK",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a clear argument and I didn't think about it that way.",
                                    "score": 739,
                                    "author": "HOLLYWOOD_SIGNS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Me neither. It's so amazingly simple, in hidsight.",
                                            "score": 441,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s so straightforward it makes me scared to read the dissenting reasoning.",
                                                    "score": 207,
                                                    "author": "LX_Theo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Gorsuch's decision is \"textualist\", in that it's based on a plain-English reading of the text of the law itself. Some dissenters do so on \"originalist\" grounds, which considers the text of the law and its understood meaning at the time it was passed. So, in this example, they are rejecting Gorsuch's argument on the grounds that the 88th Congress couldn't possibly have meant \"orientation\" when they explicitly said \"sex\" (especially given that sexual orientation discrimination was the widely accepted law of the land), and the fact that our cultural understanding of and use of the word \"sex\" might have changed shouldn't *automatically, retroactively* change a law drafted in 1964.\n\nBoth are \"right\", and straightforward in their way, but can each have unintended consequences. Consider a second example:\n\nThe 2nd Amendment guarantees the right of the people to \"keep and bear arms\". At the time, this would be widely understood to encompass the armaments commonly used in war at the time: flintlock muskets and handguns, swords, maybe cannons, etc. Should that limited, original meaning constrain modern interpretation? Or should it include arms that are employed today, like machine guns or drones?\n\nTextualism lends itself to a \"left-wing\" interpretation in the first example, and a \"right-wing\" outcome in the second example. This is why it's important for people who view the world as being organized on a Left-to-Right spectrum need to be careful about kicking decisions like this to the courts - jurists have other spectrums, other philosophies, that apply to their work. Much safer, and more predictable, to pass a clear and unambiguous law in the first place, or to explicitly amend it to fix an issue later.",
                                                            "score": 183,
                                                            "author": "rhoffman12",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "To expand a little bit, those are just two theories on law and what the court's role in it is. There are quite a few more, most of them contradictory in some sense to one another, and that isn't even going into how those in the same school of thought in law can come to incredibly different conclusions on the same case.",
                                                                    "score": 30,
                                                                    "author": "LivingstoneInAfrica"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 145,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I agree. Same for housing discrimination. Probably same for the military. Any time Congress has prohibited discrimination on the basis of sex. I think that’s an even stronger protection than adding sexual orientation and gender identity to the various statutes as protected classes. There’s already a well-understood body of caselaw of when you can and can’t discriminate based on sex. With this, you don’t have to create a whole new body of law.",
                                                    "score": 94,
                                                    "author": "DAHFreedom",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Pretty cut and dry.",
                                    "score": 352,
                                    "author": "Kame-hame-hug",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As has been mentioned elsewhere in the comments, this is not a new line of thinking, and is a direct parallel to the Supreme Court ruling which saw the expansion of marriage equality to cover interracial marriage. While dissenters claimed everyone was free to marry somebody of their own race (or free to date somebody of the opposite sex/free to present the gender they were assigned at birth in our case), the SCOTUS eventually ruled that if a white person can freely marry a white person, but a black person can't freely marry a white person, that is racial discrimination.\n\nSince the court kept this to a very narrow definition of \"sex\" (biological sex) that means that if somebody who is biologically female can date men and dress as a woman and not be fired, then somebody who is biologically male needs to enjoy these same protections. The only thing that's changed from scenario A to scenario B is the sex of the individual, so it's discrimination based on sex.",
                            "score": 178,
                            "author": "Irianne",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think that’s an incredibly clean way of looking at it if that makes sense. It’s almost using the far-right’s argument against them.",
                                    "score": 90,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now if they want to keep discriminating in employment, they will have to change federal law to explicitly allow it (or not let their businesses grow over 15 employees).",
                                            "score": 29,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; **The Supreme Court held on Monday that workers cannot be fired for being gay or transgender in a major win for members of the LGBT community.** \n&gt; \n&gt; The ruling is a blockbuster development in the history of gay rights in the United States.  \n&gt; \n&gt; While workers in about half the country were protected by local laws that prohibit discrimination based on sexual orientation or gender identity, there was no federal law that explicitly barred LGBT workers from being fired on that basis. \n&gt; \n&gt; **The cases were brought by three workers who said they were fired from their jobs because they were gay or transgender.** They argued that Title VII of the Civil Rights Act, which says that employers may not discriminate based on “sex,” also applies to sexual orientation and gender identity. \n&gt; \n&gt; **The workers who brought the cases are** **Gerald Bostock**, a gay man who was fired from his job as a child welfare services coordinator in 2013 after joining a recreational gay softball league; **Donald Zarda**, who was fired from his job as a skydiving instructor after revealing his sexual orientation to a female client; and **Aimee Stephens**, a transgender funeral director who was fired after announcing her intention to present as a woman.\n\n\nThis is awesome. Thanks to those 3 for fighting for their rights and those of millions more.",
            "score": 2919,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately, Zarda and Stephens aren’t with us to celebrate this momentous occasion. Both have passed on, but their legacy will never be forgotten",
                    "score": 761,
                    "author": "maybenextyearCLE",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shame that Stephens didn't get to live another month to see what her efforts brought :(\n\nHappy that Zarda's partner gets to see him enshrined however :)",
                            "score": 331,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "How did they pass?",
                            "score": 67,
                            "author": "ollog10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Zarda died in a wing suit accident abroad (he was a sky diving instructor). It didn’t list the cause of death of the other plaintiff.",
                                    "score": 167,
                                    "author": "acwcs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Stephens died from kidney disease. https://nymag.com/intelligencer/2020/05/aimee-stephens-dies-with-trans-rights-case-in-supreme-court.html",
                                            "score": 146,
                                            "author": "hurrrrrmione"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "With everything going on in the world, this kind of progress is something I've hoped to achieve for a long time.  The fact that we, the people, are currently shaking up the government on the social, legal, and economic levels means that this generation (and future generations) might **actually** get to see America become great again.  Despite the current president, the people are making their voices heard...and it sounds like leadership is finally listening.  We're not done yet...but it's worth celebrating progress as we hit these milestones since our parents couldn't get it done.\n\nToday is a good day to be an American.",
                    "score": 429,
                    "author": "Rebal771",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is [a historic decision](https://www.supremecourt.gov/opinions/19pdf/17-1618_hfci.pdf) which will protect hundreds of thousands of LGBT employees from discrimination. The opinion was 6-3, written by Justice Gorsuch and joined by Roberts, Kagan, Sotomayor, Ginsburg and Breyer. Kavanugh, Alito, and Thomas dissented.\n\nAs of today, the Supreme Court puts being gay or transgender in the same category as being black when it comes to employment discrimination. You cannot fire or discriminate against an employee for being black and you cannot fire or discriminate against an employee for being gay or trans.\n\nHere are the opening two paragraphs. They explain everything you need to know:\n\n&gt;Sometimes small gestures can have unexpected consequences. Major initiatives practically guarantee them. In\nour time, few pieces of federal legislation rank in significance with the Civil Rights Act of 1964. There, in Title VII,\nCongress outlawed discrimination in the workplace on the\nbasis of race, color, religion, sex, or national origin. Today,\nwe must decide whether an employer can fire someone\nsimply for being homosexual or transgender. The answer\nis clear. An employer who fires an individual for being homosexual or transgender fires that person for traits or actions it would not have questioned in members of a different\nsex. Sex plays a necessary and undisguisable role in the\ndecision, exactly what Title VII forbids.\n\n&gt;Those who adopted the Civil Rights Act might not have\nanticipated their work would lead to this particular result.\nLikely, they weren’t thinking about many of the Act’s consequences that have become apparent over the years, including its prohibition against discrimination on the basis\nof motherhood or its ban on the sexual harassment of male\nemployees. But the limits of the drafters’ imagination supply no reason to ignore the law’s demands. When the express terms of a statute give us one answer and extratextual considerations suggest another, it’s no contest. Only\nthe written word is the law, and all persons are entitled to\nits benefit.",
            "score": 14578,
            "author": "throwawaynumber53",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a really cool argument - ‘if the actions taken by someone who was gay/trans were done by a person of the opposite sex, there would be no issue with it, therefore discriminating by this is a variant of sex discrimination’",
                    "score": 2672,
                    "author": "C0ncept8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's one of those rare arguments that truly changed the world. Where someone had a moment of genius and realized that if you explain discrimination against gay people that way, it's *obviously* discrimination on the basis of sex... and the argument was so good it convinced the Supreme Court and changed the world.\n\nSometimes a single person's best argument really can make a difference.",
                            "score": 2296,
                            "author": "throwawaynumber53",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Sometimes a single person's best argument really can make a difference.\n\nYou might like this story - https://www.npr.org/2017/05/05/526900818/the-bad-grade-that-changed-the-u-s-constitution",
                                    "score": 905,
                                    "author": "hereforthefeast",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not the person you responded to, but that's a fantastic story and I love it. Thank you for posting.",
                                            "score": 276,
                                            "author": "UnsinkableRubberDuck",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also that nugget at the end about Mississippi not ratifying the 13th amendment and having it appear on the law books until 2013 was shocking af yet also unsurprising :(",
                                                    "score": 170,
                                                    "author": "chefhj",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 161,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thought the exact same thing.  \"I misgraded this paper so badly that it changed history.\"",
                                                    "score": 96,
                                                    "author": "Markelle-Fultz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "We don't know if it was misgraded. It may have been poorly written and the arguments may not have been fleshed out well enough. I bet the argument he made changed between writing the paper and when he started convincing states to pass the amendment. Also, the idea of passing an amendment like that is not all that impressive. What was impressive was the actions he took and perseverance he showed. The paper can't really show those things.",
                                                            "score": 36,
                                                            "author": "impy695",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That was a really interesting read!  Thank you very much for that!",
                                            "score": 18,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That is just a fantastic argument. I'm super impressed by whoever made it, because it's just so clearly discrimination of sex.",
                                    "score": 81,
                                    "author": "Autumn1eaves",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes! And it becomes even more clear when you start applying the same logic to something else different.\n\nSay an employer doesn't think women should play sports. If the employer fires a woman for playing baseball but not a man for playing baseball, he's clearly discriminating on the basis of sex.\n\nSame here. If an employer fires a woman for sleeping with a woman but not a man for sleeping with a woman, he's clearly discriminating on the basis of sex.",
                                            "score": 111,
                                            "author": "throwawaynumber53",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ah, that clarifies things for me. Thanks, I wasn't quite wrapping my head around the Justices' reasoning. ...Despite some of the Justices saying *almost* the exact same thing.",
                            "score": 78,
                            "author": "TatchM",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The website’s getting hammered right now.  It’s been a while since a ruling generated that much interest.  \n\nThis adds something special to the last few weeks of protests, particularly the one in Los Angeles over the weekend.",
                    "score": 2909,
                    "author": "eaglebtc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also, Alito's dissent is very long and included many appendixes with images of mostly government forms.\n\nBecause no one thought of compressing the images, the .pdf file of the opinion is huge.\n\nHere's a smaller file without Alito's appendixes: https://www.scotusblog.com/wp-content/uploads/2020/06/17-1618_hfci.pdf",
                            "score": 1357,
                            "author": "Booby_McTitties",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "TL,DR of ~~the Dissenting Opinion of the Court~~ Justice Alito's Dissent:\n\n&gt;Many will applaud today’s decision because they agree on  policy grounds with the Court’s updating of Title VII.  But  the question  in  these cases  is not whether  discrimination because of sexual orientation or gender identity should be outlawed.  The  question  is  whether Congress did that in 1964.\\* It indisputably did not.\n\n\\*referring to the Civil Rights act of 1964",
                                    "score": 901,
                                    "author": "hilfigertout",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "See, I the majority lays that out pretty well.\n\nFiring a man because he finds men sexually attractive is discriminatory because you wouldn't fire a woman who found men sexually attractive.",
                                            "score": 1630,
                                            "author": "strikervulsine",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The dissent brings that up, arguing that it's not that the employee found men attractive, but that he found members of the same sex attractive. The dissent argues that these things are different and protected differently under the law. \n\nI don't agree and I think that's some legal gymnastics right there, but that's the argument.",
                                                    "score": 966,
                                                    "author": "hilfigertout",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Here is the relevant passage from the dissent (with which I fully disagree):\n\n&gt;Contrary  to  the  Court’s  contention,  discrimination  because  of sexual  orientation  or gender  identity does not  in \nand of  itself entail discrimination because of sex.  We can \nsee this because it is quite possible for an employer to discriminate on those grounds without taking the sex of an individual applicant or employee into account.  An employer\ncan have a policy that says: “We do not hire gays, lesbians,\nor transgender  individuals.”  And an employer can  implement  this  policy  without  paying  any  attention  to  or  even \nknowing the biological sex of gay, lesbian, and transgender\napplicants.\n\nEdit: To explain why I disagree, for an employer to know whether an employee is homosexual or transgender, the employer **must** know (or assume) the employee's sex. Scenario: Employer Tom is interviewing Employee Jim. Employee Jim shares that he recently bought a home with his husband Terry. Tom decides not to employ Jim because Jim is gay. The only way for Tom to know Jim is gay is to know that Jim is **Male** and has a husband. If Tom did not know or consider that Jim was male (as contested in the dissent) then him having a husband does not disqualify him under the discriminatory policy. Thus the policy **is** using sex as a deciding factor. Similarly, Susan identifies as female and applies at Tom's business. He says, sorry, I have a no transgender policy and refuses to hire her. For him to identify her as transgender, Tom must know (or assume) her biological sex. Again, he does use sex in the hiring decision and is therefore against the plain text of title VII.\n\nEdit 2: I've been getting a lot of replies saying essentially, \"Well, the employer could just put a checkbox on the application asking if the individual is homosexual or transgender and disqualify them that way without knowing their sex.\" They could, but notice that in the dissent, the author writes, \". . . an employer can  **implement**  this  policy  without  paying  any  attention  to  or  even knowing the biological sex of gay, lesbian, and transgender\napplicants.\" (Emphasis mine) How would this policy be implemented (in other words, enforced) without knowledge of sex? If Susan (the transgender woman in my example) says that she is not transgender on the form, how is the employer to respond? He can't say, \"Yes you are, you are fired for being transgender,\" because to identify her as transgender would be to assume her biological sex and presented gender differ. The employer also cannot say, \"You lied on your application, you are fired,\" because to establish such a lie would also assume her biological sex and presented gender differ. The discriminatory policy would be unenforceable and therefore un-implementable.",
                                                            "score": 531,
                                                            "author": "twiddlermtg",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wonder if anyone argued or mention bisexuality/pansexuality. Cause technically, both men and women would be able to be discriminated again for both liking the exact same thing. I could see that being used as a bad faith argument for allowing discrimination.",
                                                                    "score": 119,
                                                                    "author": "MsPenguinette",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I think both interpretations require some gymnastics and would rather congress just update VII and add sexuality.",
                                                            "score": 533,
                                                            "author": "joelaw9",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "A Supreme Court ruling that doesn't require a bit of mental and legal gymnastics seems rarer than ones that do.",
                                                                    "score": 373,
                                                                    "author": "snakebit1995",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Because we've figured out the simple shit already.\n\nRulings and laws are getting more complex because the issues and problems we're dealing with are more complex",
                                                                            "score": 398,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Exactly, a substantial amount of modern jurisprudence comes down to splitting hairs because the easy stuff is precedent, and can be dealt with fairly quickly.",
                                                                                    "score": 150,
                                                                                    "author": "ChillyBearGrylls",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That's true. And I don't intuitively see any potential abuses or extensions of implication from this decision. So I'm happy with the positive effects.",
                                                                            "score": 70,
                                                                            "author": "joelaw9",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well we wouldn't need to take cases to the Supreme Court of the text were black and white. \n\nThe Court exists to operate in these kinds of gray spaces.",
                                                                            "score": 57,
                                                                            "author": "rkrish7",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This is actually why I really wish people read and did even marginal studying on USSC opinions. When you see the absolutely marginal differences that can sway a decision from Yes to No in the context of good faith even by 2 Justices that adhere to the same judicial philosophy, I think it takes a lot of the contentiousness from out of politics.\n\nFurther, I think citizens might see how legislative inaction is ratfucking not just the business of government but the business of life. Put out the bills, vote them up or down, accept the electoral consequences.",
                                                                    "score": 79,
                                                                    "author": "Sir_Auron",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; would rather congress just update VII and add sexuality.\n\nAs long as we're wishing for things, I want a 12-inch pianist.",
                                                                    "score": 105,
                                                                    "author": "jgzman",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That’s a tiny pianist!",
                                                                            "score": 44,
                                                                            "author": "wovagrovaflame",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;The dissent brings that up, arguing that it's not that the employee found men attractive, but that he found members of the same sex attractive. The dissent argues that these things are different and protected differently under the law.\n\nThe same argument can be made about interracial couples. It's complete horseshit and it should have been dead and buried more than half a century ago.",
                                                            "score": 184,
                                                            "author": "Zeig9",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I liked this part, which seems to reply to the dissent:\n\n&gt;\"Those who adopted the Civil Rights Act might not have anticipated their work would lead to this particular result. ... But the limits of the drafters' imagination supply no reason to ignore the law's demands.\"",
                                            "score": 235,
                                            "author": "vertigo3pc",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is very consistent with [Gorsuch's philosophy](https://time.com/5670400/justice-neil-gorsuch-why-originalism-is-the-best-approach-to-the-constitution/).  It's probably why they had him write the decision.\n\nHe's a self-professed originalist, but he's really a spiritual originalist:  \n&gt; Or consider the Fourth Amendment. As originally understood, it usually required the government to get a warrant to search a home. And that meaning applies equally whether the government seeks to conduct a search the old-fashioned way by rummaging through the place or in a more modern way by using a thermal imaging device to see inside. Whether it’s the Constitution’s prohibition on torture, its protection of speech, or its restrictions on searches, the meaning remains constant even as new applications arise.\n\nWhat did the law mean when it was written?  Not what the words say, but what was its intent?  Was it to protect people from discrimination?  If that's the case, then it must be interpreted to mean the same thing despite the fact that circumstances in the world have changed around it.  This is quite the opposite of other originalists, who take them to mean what they meant the year they were written",
                                                    "score": 214,
                                                    "author": "Iohet",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 71,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think Gorsuch's explanation is a perfect retort. I'm a male. If I date a male, I can be fired. If I'm female and I date a male, I can't be fired. My \"sex\" is what changes, and thus is covered in the Civil Rights Act.",
                                            "score": 562,
                                            "author": "thetasigma_1355",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; I'm a male. If I date a male, I can be fired. If I'm female and I date a male, I can't be fired. My \"sex\" is what changes, and thus is covered in the Civil Rights Act.\n\nThis is a great explanation tbh",
                                                    "score": 52,
                                                    "author": "Archenic"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I like that they went back to basics.  \n\nAll too often, especially in Alito's descent, there's clever and obfuscating use of words to conceal intent or allow for abuse.  It doesn't matter that we call same-sex attraction a specific word, what it boils down to for discrimination is that the words are not always helpful.  \n\nThe fact that Alito argues specifically for interracial marriage, because the history of the US shows racism against blacks, rather than defending how clearly the policy itself is racist because of different treatment of the same action for different racial groups, is a surprising logical conclusion.",
                                                    "score": 101,
                                                    "author": "ex-inteller",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; TL,DR of the Dissenting Opinion of the Court:\n\nYou mean Alito's dissenting opinion (joined by Thomas)?\n\nThere was another dissent by Kavanaugh writing for himself.\n\nMore pedantically, there is no such thing as a \"Dissenting Opinion of the Court\". The majority opinion is the Opinion of the Court. Dissents are, by definition, not \"of the court\", but of the dissenting justices.",
                                            "score": 263,
                                            "author": "Booby_McTitties",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're right, thanks. I'll edit that.",
                                                    "score": 36,
                                                    "author": "hilfigertout"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Do you know what Kavanaugh's dissent was?",
                                                    "score": 28,
                                                    "author": "Pennwisedom",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That the SCotUS was not the right vehicle for this decision. He supports the decision but states that the purview belongs to Congress and it should be done properly",
                                                            "score": 72,
                                                            "author": "Roenkatana",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 79,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Another person commented that the opinion contained images that were not compressed or optimized, inflating the size of the document.  Scotusblog contains an optimized version.",
                                    "score": 108,
                                    "author": "eaglebtc",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Here's the archive.org link since the SC website is getting slammed:\n\nhttps://web.archive.org/web/20200615143325/https://www.supremecourt.gov/opinions/19pdf/17-1618_hfci.pdf",
                            "score": 22,
                            "author": "kn33"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Kavanugh, Alito, and Thomas dissented.\n\nOf course Kavanaugh dissented.  We expected this from the beginning.",
                    "score": 4746,
                    "author": "CoronaFunTime",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "On the other hand, Gorsuch wrote the majority opinion",
                            "score": 2944,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "All things considered, Gorsuch seems to be a much better justice then people feared. He rules on what he legitimately interprets the law to be, causing him often be the swing vote on many decisions, instead of just being ultra partisan",
                                    "score": 1210,
                                    "author": "-GregTheGreat-",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "From what I remember when he got the appointment, the noise around Gorsuch was more about that it should have been Obama's seat to fill. But I seem to remember the general feeling around Gorsuch himself wasn't too terrible. Conservative, maybe, but I haven't had an issue with his voting record so far (granted, I'm not particularly paying attention).",
                                            "score": 965,
                                            "author": "jankythanamothafucka",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're correct. He was plenty qualified to be a justice, it was McConnell's theft of an appointment from Obama that pissed people off.",
                                                    "score": 1019,
                                                    "author": "Rib-I",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I really wish Obama could have given McConnell a good little  \"You listen here you little shit...\" speech.",
                                                            "score": 194,
                                                            "author": "Tacoman404",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Really, he should have threatened to appoint Garland anyways to call McConnell's bluff but Obama was too civil for that.",
                                                                    "score": 241,
                                                                    "author": "Rib-I",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah Obama should of been firmer.",
                                                                            "score": 159,
                                                                            "author": "coolaznkenny",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah.  That's one of my* criticisms of Obama in that while he wanted to \"rise above\" the dirt that the Republicans were playing in, he should've rolled his sleeves up and gotten dirty once in a while.  I felt that he was too worried about the perception of the first black president playing \"questionable\" politics.  When in fact, in his last term, that's what he should've done.\n\n*EDIT: forgot a word",
                                                                                    "score": 211,
                                                                                    "author": "greenroom628",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The only *bad* thing around him was his decision against a truck driver that got fired for abandoning his load instead of freezing to death.  In that case Gorsuch still just rigidly interpreted the law, but by a shitty interpretation of it.\n\nI don't think he has been bad. And internal consistency is good.",
                                                    "score": 198,
                                                    "author": "BGFalcon85",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That was the correct decision though. The result was shitty because the law written was shitty, which was Gorsuchs entire fucking point in writing the decision he did. It’s just infuriating how that became the main attack against Gorsuch when Gorsuch actually agreed with the idea that the outcome was wrong. He just respects that it’s not the Courts job to change shitty laws.",
                                                            "score": 222,
                                                            "author": "Thedurtysanchez",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don't disagree. He decided on a poorly worded law based on a literal interpretation. Laws should not be written ambiguously.\n\nIt's not even like Gorsuch was the sole decider. He was the dissenting opinion and the majority still decided in favor of the driver.",
                                                                    "score": 56,
                                                                    "author": "BGFalcon85",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Which is the main objective of writing a dissent: making an important point to send a message to legislators. \n\nThe main attack against Gorsuch may actually be an example of his best quality lol",
                                                                            "score": 99,
                                                                            "author": "Thedurtysanchez",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Seriously, I wish people would understand this. It is not the job of the courts to decide what is right or wrong, but rather what is legal or illegal.",
                                                                                    "score": 17,
                                                                                    "author": "[deleted]"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He's conservative in his personal beliefs, but when it comes to application of the law he's a Constitutional Interpretationalist. I think his ruling in this case is confirmation of that.",
                                            "score": 326,
                                            "author": "DarthRusty",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; He's conservative in his personal beliefs, but when it comes to application of the law he's a Constitutional Interpretationalist.\n\nWhich is exactly how the supreme court is supposed to be.  Apolitical.",
                                                    "score": 114,
                                                    "author": "soundscream",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, I view it as a very good thing.",
                                                            "score": 19,
                                                            "author": "DarthRusty",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He was born in Denver and taught at Boulder for a bit. He was highly esteemed by his students in one of the most liberal cities in the US if that tells you anything about his political persuasion.",
                                            "score": 105,
                                            "author": "rijnzael",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "For what it's worth, my wife works for Columbia U (where Gorsuch went ~~to law school~~ for undergrad). Everything she's heard is that he's a pretty straight-edge person. Graduated early, was known for being an outstanding student, was well-liked by his peers. I honestly do think he's just a textualist and though he's gonna throw down some opinions that are irritating he'll also having rulings like this that catch people off-guard.",
                                    "score": 180,
                                    "author": "Rib-I",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree. Say what you will about Gorsuch, he seems to actually believe in an interpretative method and stick to it even when his personal feelings may end up differently. Whereas someone like Alito is very clearly just deciding controversial cases on the basis of his political beliefs, as he'll take completely contradictory positions when they produce results he doesn't like.",
                                            "score": 97,
                                            "author": "throwawaynumber53",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nah, he's been [already noted as taking a more liberal view](https://theweek.com/articles/816202/unexpected-alliance-sonia-sotomayor-neil-gorsuch) so long as the text of law aligns with it.  He's a direct interpreter.  He doesn't really follow conservative or liberal - just what does the law directly say.  Sadly that outlook usually aligns with conservatives but that doesn't mean his personal views are that way.",
                                    "score": 331,
                                    "author": "CoronaFunTime",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s fine if the law coincidentally aligns conservative, as long as a judge is ruling by law and not politics I’m fine with it. That means the system is working. Changing laws or changing things via law is mean to be done at the legislative side.",
                                            "score": 51,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Honestly, the most important question to ask supreme court candidates is how they interpret the constitution. A direct interpretation used to mean more conservative because, traditionally, conservative used to refer to slower changes in government. In the US, however, conservative and liberal are more linked to stances on social issues, not traditional meanings of the words, though this was not always the case. As conservatives get more radical, a direct interpretation will look more liberal based on our connotations of the word \"liberal\". 15 years ago, however, it would have looked more conservative because conservatives hadn't quite radicalized yet.",
                                            "score": 162,
                                            "author": "whichwitch9",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I always gave Gorsuch the benefit of doubt on this.\n\nKavanaugh can go fuck himself though.",
                                    "score": 2065,
                                    "author": "DJ-Corgigeddon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Kavanaugh will be a dark stain on the court for generations. A consistent vote for conservative oppression and Christian ideology.",
                                            "score": 2331,
                                            "author": "Past_Contour",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean the dude was hand picked and brought up by the GOP for this purpose. His whole life lead to this moment of him being the far right’s Supreme Court candidate.",
                                                    "score": 1208,
                                                    "author": "DJ-Corgigeddon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It really came out during the Blasey hearings. Kav came off like an angry asshole who was destined for the court. Self entitlement on full display on national tv. He’s probably the worst justice, if Thomas and Alito weren’t there.",
                                                            "score": 874,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I've always said that the hearings are what turned me against Kav. I have no idea if he did it - it was decades ago and testimony is the only evidence, so it's something of a he said/ she said. But I do know how he handled it. His boorish, entitled attitude convinced me that he wasn't fit to serve on the court even if a definitive piece of evidence came out in his favor.",
                                                                    "score": 734,
                                                                    "author": "bjankles",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That and his transparent lies about boofing, devil's triangle, etc convinced me he's a dirtbag. Just because there isn't enough evidence to put him in jail doesn't mean he passed the job interview.",
                                                                            "score": 314,
                                                                            "author": "DrDerpberg",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "That was the most mindblowing thing about it - all the Trump supporters going \"innocent till proven guilty!\" and \"you can't prove that!\" \"where's the _evidence!?_\" etc.\n\nDude...he's not on trial, it's a fucking _job interview_ for the highest court in the land. You don't need criminal court rigor to say someone bombed an interview. Maybe we should have some goddamn standards for it? But nah, librul tears and my political sports team winning &gt; bare minimum checks and balances.",
                                                                                    "score": 191,
                                                                                    "author": "i_tyrant",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Indeed.  He doesn't have the proper temperament or maturity for the position which he holds, *even if* the allegations against him were false.",
                                                                            "score": 15,
                                                                            "author": "jwilphl"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "the way he was whining and screaming and spittling everywhere was honestly horrific.",
                                                                            "score": 382,
                                                                            "author": "jessbird",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I encourage you to read his majority opinion on the Curtis Flowers v the state of Mississippi case. The guy is actually looking out for black folks in that one. May surprise you",
                                                    "score": 14,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 107,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I haven't read his dissent myself but apparently he agrees with the majority, but thinks it should be resolved by congress, not the Supreme Court",
                            "score": 264,
                            "author": "Beanz122",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I almost forgot what good news feels like.",
            "score": 10238,
            "author": "reeram",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2007,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The title literally made me give a meek 'yaaaay', like a dehydrated miner seeing a flashlight and a bottle of water.",
                            "score": 923,
                            "author": "To_Circumvent",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don’t forget your canary today, friend",
                                    "score": 200,
                                    "author": "alwaysmorecumin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Canary died months ago",
                                            "score": 102,
                                            "author": "fiernze222",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 421,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*everyone felt that*",
                            "score": 38,
                            "author": "SlendyIsBehindYou",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have mixed feelings about it because I thought you can't discriminate against gay and trans workers was already a thing. So the news for me is wait, it wasn't?",
                    "score": 328,
                    "author": "The2500",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not in every state. Now LGBT+ is a protected class like race.\n\nEDIT: only in terms of employment",
                            "score": 672,
                            "author": "BigBrownDog12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This seems exciting for precedent as well as face value. The more the Supreme Court rules that LGBT+ have equal rights, the harder it is to roll it back during a dogshit administration.",
                                    "score": 342,
                                    "author": "Deadhead7889",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Especially since it's a 6-3 ruling instead of 5-4 which shows more confidence in the courts decision.",
                                            "score": 292,
                                            "author": "huffymanj",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nope, it was interpreted that \"sex\" based discrimination did not include things like sexual orientation or gender identity.\n\nTrump appointed judge Neil Gorcuch wrote in the majority opinion\n\n\"An employer who fires an individual for being homosexual or transgender fires that person for traits or actions it would not have questioned in members of a different sex,\"\n\n\nThat's pretty freaking definitive and grants LGBT people all the protections of the civil rights act. Huge stuff",
                            "score": 143,
                            "author": "modestlaw",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4344,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "In some states that didn’t have a law against it, yeah.",
                    "score": 2778,
                    "author": "ty_kanye_vcool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And just to clarify for OP, this was essentially every \"red\" state and also many others.",
                            "score": 1473,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Including Ohio, with the exception of the city limits of Columbus. If you worked in Dublin or New Albany (outskirts suburbs that are home to the headquarters of Wendy's, Cardinal Health, and L Brands, all Fortune 500 companies) you were succeptable to firing if your superiors wanted it.\n\nFucking absurd.",
                                    "score": 563,
                                    "author": "TheHillsHavePis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pretty sure that it was similar in Michigan with Lansing and Ann arbor being one of the first cities in the US to outlaw it but it being legal everywhere else in the state",
                                            "score": 42,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "And in some red states the blue cities had laws outlawing this discrimination. At least in Florida there was no state protection, but most lgbtq employees had some protection from their municipal government. But I'm assuming this was not the case in deeper red states.",
                                    "score": 98,
                                    "author": "jared2580",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To avoid getting smashed with downvotes here I'm happy the Supreme Court ruled this way, you shouldn't be able to get fired for being gay or transgender or for anything other than your work performance really.\n\nThat said in most US states you can be fired for any reason at any time as long as it doesn't happen for being part of a protected class (edit: or some other cases like being a union organizer, whistleblower, etc). \n\nAn example: you can fire Joe because you wanted to fire him. It's illegal if you wanted to fire him for being a minority, or a certain religion or now being LGBT, but Joe has to prove that. It's very difficult to win these cases in the US.",
                    "score": 533,
                    "author": "Chemmy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is difficult to win these cases, but they lead to corporate policies which lead to less discrimination, which leads to more and more minorities being hired, which normalizes folks who used to be kept out of a profession being a part of that profession.\n\nFor instance, this ruling will really help LGBTQ teachers in some states who have been pretty openly discriminated against.  Would it be difficult for 1 gay teacher to win a lawsuit?  Sure.  But if 30 highly qualified gay teachers apply for employment in a district and all are passed over for lesser qualified applicants: That district is in trouble.  So, they'll mind their hiring practices and change will roll on in America.",
                            "score": 438,
                            "author": "DollyPartonsFarts",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That's why the three cases here were so important.  The plaintiffs were solid, long term employees who were fired for being gay or transgender.  The employer did not even try to hide it.  But your right in that they will now just try and make up some other bs to fire them for these reasons, like they do with any other protected class all the time.",
                            "score": 27,
                            "author": "diehmert",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes. You had the “freedom” and “liberty” to fire someone for sexual orientation.",
                    "score": 602,
                    "author": "MyNameIsVigil",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Out of the 3 plaintiffs in the case, only one is still alive to see justice prevail today.\n\nRIP Donald Zarda &amp; Aimee Stephens.\n\nEdit: \n\nZarda was a base jumper who died in an jumping accident and Stephens died of kidney failure.",
            "score": 1276,
            "author": "tydestra",
            "replies": [
                {
                    "level": 1,
                    "comment": "In fairness, Zarda died doing what he loved: plummeting to the ground in a wingsuit.",
                    "score": 333,
                    "author": "dart22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah base jumping is dangerous, and Ms. Stephens death was due to kidney failure, but still sad they not around to enjoy the fruit of the labor.",
                            "score": 44,
                            "author": "tydestra"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Another historic day for a historic piece of legislation. The Civil Rights Act of 1964 has probably had the most positive impact of any Act of Congress in this country's history.",
            "score": 934,
            "author": "moonyprong01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even more, Title VII of that Act has done most of the good.",
                    "score": 237,
                    "author": "Booby_McTitties",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gorsuch's example below really cuts to the heart of the Court's reasoning. Title VII prohibits firing someone on the basis of \"sex\" (but not sexual orientation).  However, Gorsuch's reasoning is that an employer who discriminates on the basis of sexual orientation necessarily discriminates on the basis of sex:\n\n&gt; Imagine an employer who has a policy of firing any employee known to be homosexual. The employer hosts an office holiday party and invites employees to bring their spouses. A model employee arrives and introduces a manager to Susan, the employee’s wife. Will that employee be fired? If the policy works as the employer intends, the answer depends entirely on whether the model employee is a man or a woman. **To be sure, that employer’s ultimate goal might be to discriminate on the basis of sexual orientation. But to achieve that purpose the employer must, along the way, intentionally treat an employee worse based in part on that individual’s sex.**\n\nThe Court sidestepped the argument over what \"sex\" means:\n&gt; Appealing to roughly contemporaneous dictionaries, the employers say that, as used here, the term “sex” in 1964 referred to “status as either male or female [as] determined by reproductive biology.” The employees counter by submitting that, even in 1964, the term bore a broader scope, capturing more than anatomy and reaching at least some norms concerning gender identity and sexual orientation. **But because nothing in our approach to these cases turns on the outcome of the parties’ debate, and because the employees concede the point for argument’s sake, we proceed on the assumption that “sex” signified what the employers suggest, referring only to biological distinctions between male and female.**",
            "score": 158,
            "author": "Nihilistic_Response",
            "replies": [
                {
                    "level": 1,
                    "comment": "This passage made me understand the ruling. Thanks for sharing!",
                    "score": 21,
                    "author": "Logicalidiot",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; **Aimee Stephens**, a transgender funeral director who was fired after announcing her intention to present as a woman. \n\nThis one was, in my opinion, the most clear cut example of how someone was fired for not conforming to traditional gender roles in society was an example of sex discrimination. \n\nShe was identifying as a woman, and I believe was going through or had gone through the transition, and because she wouldn't wear a men's suit, she was fired. \n\nI was afraid with the composition of the Court, they wouldn't see it that way, and curtail LGBTQ rights in the workplace but this is a HUGE ruling.",
            "score": 1015,
            "author": "Caffeine_Cowpies",
            "replies": [
                {
                    "level": 1,
                    "comment": "The NYT's podcast The Daily had an interesting interview with her a few months back. If you haven't listened its worth the time.  [Link](https://www.nytimes.com/2019/11/07/podcasts/the-daily/transgender-supreme-court.html)",
                    "score": 143,
                    "author": "lesser_o_2_weevils",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sad she died only shortly before the Court vindicated her.",
                            "score": 58,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I always thought this was a clear cut case. There's no way you can fire someone for presenting themself as a woman without taking into account their biological sex.",
                    "score": 66,
                    "author": "TheyreGoodDogsBrent",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "She was fired for being a 'man' who wouldn't wear men's clothes.  IANAL, but that seems pretty clear cut to me that she was fired based on her sex.  \n\nIt's also awesome how they have, to my understanding, reworked sexual orientation as it applies in law: homosexual and heterosexual are not valid(?) orientation terms.  Instead, \"attraction to X\" is the way they looked at the issue.  So if you fire a gay man, you're firing him because he's a man whose orientation is *attracted to men*, so by that criteria, you also need to fire all the straight women.  Essentially bringing the issue to \"person of sex X who holds opinion/belief Y,\" which is very protected by law.",
                    "score": 44,
                    "author": "Ph34r_n0_3V1L",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interestingly enough, Gorsuch wrote the majority opinion for this. You can probably guess who dissented otherwise.",
            "score": 1344,
            "author": "Gamegis",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was a 6-3 decision.  Was it Roberts or Kavanaugh who also broke from Alito and Thomas?",
                    "score": 320,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Roberts. Usually is him that splits on ideological issues like this.",
                            "score": 490,
                            "author": "BigFloppyMeat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because Roberts is keenly aware of how his court will be judged by history. He is not going to let social issues ruin the legacy of his court. He will continue to be pro corporations, but I doubt he will allow something like gay marriage or Roe v Wade to be overturned.\n\nAlso, this is why I wasn't too mad about Gorsuch being nominated. Him and Roberts are about as good as you can get from a Republican president.",
                                    "score": 330,
                                    "author": "chanaandeler_bong",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I was actually surprised when Trump nominated him. There’s a lot of instances where this could bite republicans in the arse (from their perspective).",
                                            "score": 72,
                                            "author": "Earl_of_Northesk",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Roberts of course.",
                            "score": 133,
                            "author": "Cylinsier"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But it was still a 6-3 decision which is big. I can't remember the last ~~major~~ landmark SCOTUS ruling that wasn't divided 5-4 right down ideological lines.",
                    "score": 643,
                    "author": "moonyprong01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hell, even Obergefell v. Hodges was 5-4.",
                            "score": 302,
                            "author": "thatoneguy889",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Roberts dissented in Obergefell but joined the majority here. If nothing else, he *really* cares about precedent, the legacy of his Court, and the judiciary as a co-equal institution of (relative) neutrality. I'm not terribly surprised to see him in the majority in this.",
                                    "score": 245,
                                    "author": "anaccount50",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This case doesn’t rely on Obergefell at all. Obergefell was decided on 14th amendment fundamental rights grounds. This case is about the meaning of title VII. So hard to say what Roberts was thinking. Presumably he was more\nConvinced that sexual orientation discrimination is sex discrimination than the argument that marriage is a fundamental right.",
                                            "score": 45,
                                            "author": "dylightful",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Roberts doesn't like broad readings of the constitution, this case was about the definition of sex discrimination in a statute.  He and Gorsuch are textualists.",
                                                    "score": 26,
                                                    "author": "leshake"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 68,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was kind of expected from Gorsuch. He's big on textualism so this was the right choice for him to make if he stayed committed to that ideal.",
                            "score": 87,
                            "author": "itsajaguar"
                        },
                        {
                            "level": 2,
                            "comment": "Roberts has gone out of his way to try and preserve the neutrality of the court. He defended Obamacare to try avoid politicizing the court. He also shot back at trump when trump criticized “Obama judges”",
                            "score": 83,
                            "author": "kilometr",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This was sort of a test for Gorsuch, to see if he was who he said he was, a textualist.  He passed. This ruling is consistent with how he says he interprets laws (by the words of the law not the intentions of who wrote them.)",
                            "score": 238,
                            "author": "entertainman",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "If you read Gorsuch’s opinion, he’s still resting on his conservative principles (which is respectful).\n\nHe immediately sets out that this case only holds up if the Civil Rights Act is 1964 was written by 1964’s Congress and signed by 1964’s President with words that happen to encompass the 2020 meaning of sex discrimination. In other words, he took an textualist’s approach and still found that the wording of the Civil Rights Act includes protections against sexual orientation and sexual identity discrimination.",
                            "score": 38,
                            "author": "IThinkThings",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Came here to celebrate, leaving here knowing more about the nuanced difference between an originalist and textualist.",
            "score": 224,
            "author": "Japanimaniac",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's been a fascinating read for me as well. Every day's a school day!",
                    "score": 35,
                    "author": "hamsterpotamia",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was the topic for my first year law school brief, I was assigned the defense, I have never hated writing anything more than I did that brief.\n\nI am so glad I was wrong and that these crucial protections are finally available. Great day in American history",
            "score": 120,
            "author": "maybenextyearCLE",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Somewhere in the white house, Pence is crying in a closet.",
            "score": 1753,
            "author": "pittiedaddy",
            "replies": [
                {
                    "level": 1,
                    "comment": "And somewhere in the deepest wilds of Kentucky, Kim Davis is pissed\n\nEdit: performed some Google over lunch. According to the USA Today article below, she had no platform.  Not that it would have helped her, God bless her little soul /s\n\nhttps://www.usatoday.com/story/news/nation-now/2018/11/12/kim-davis-may-enter-christian-ministry-after-losing-re-election/1976316002/",
                    "score": 50,
                    "author": "r0b0tr0n2084",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Don't worry, Lindsey Graham is consoling him.",
                    "score": 959,
                    "author": "rondell_jones",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lady G is secretly excited by this news.",
                            "score": 290,
                            "author": "impulsekash",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 507,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Will this ruling nullify all of the above?",
                    "score": 36,
                    "author": "ScoobyDont06",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It'll have to go to SCOTUS to be affirmed by this case.",
                            "score": 61,
                            "author": "Dreadedvegas",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "To my knowledge, unfortunately no",
                            "score": 47,
                            "author": "BurrStreetX",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "haha I'm so used to bad news lately that I have no idea how to process this new ruling that gives me the right to not be fired simply for existing",
            "score": 96,
            "author": "purpletopo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Holy crap this happened in America NOW?! Good thing though!!",
            "score": 20,
            "author": "gregg_egg",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Absolutely incredible this happened during Pride month.  It's heartening news during these tumultuous times.  Happy Pride everyone.",
            "score": 75,
            "author": "Iorelei",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most landmark decisions happen during Pride Month, because they are usually released at the end of the Court's year (June).",
                    "score": 47,
                    "author": "Booby_McTitties",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What people making the \"but you could still be fired and they'll just say it's for another reason\" argument don't seem to understand is that LGBTQ+ is now protected under Title VII just like race, sex, and national origin. If you're fired and you believe it was because of your sexual orientation or transgender status, you can bring a claim saying your rights were violated under Title VII. That is **huge**. No, it doesn't mean you'll win your lawsuit. No, it doesn't mean you'll be able to prove it if you're lacking any evidence. But the legal protection for the LGBTQ+ community is huge. This decision is a very big deal.\n\nIf you're interested in this, I suggest waiting a few hours and looking for analysis of the opinion. There are usually some blogs and other analysts who will answer these \"real life\" questions.",
            "score": 88,
            "author": "findingastyle",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m so happy this is finally precedent. About a year ago I was fired from teaching in my small hometown in the Midwest. At the end of the school day on 9/11 I was pulled away from my classroom and promptly suspended for social media misuse. They said that they had discussed that my social media was in violation and decided to terminate my position at the school. The only time I was talked to was about my pride photos. Finally people who are or will ever be fired for unjust actions related to their sexuality will be justifiably safe. A year too late for me but not to later for others.",
            "score": 39,
            "author": "Rossiletop",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Take note everyone that supports LGBTQIA+ rights:\n\nTrump tried to get SCOTUS to rule the other way, allowing people to be fired for being gay or transgender. Remember this when he says he supports the community!",
            "score": 1101,
            "author": "KuhjaKnight",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not being snarky, I'm actually curious, are there many Trump supporters in the lgbtqia+ community?",
                    "score": 267,
                    "author": "everyoneiknowistrash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Milo Yiannopoulos is a supporter. We should see what he has to say on Twitter.\n\n[https://twitter.com/nero](https://twitter.com/nero)",
                            "score": 706,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This never, ever gets old",
                                    "score": 328,
                                    "author": "sariisa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Care to explain?",
                                            "score": 29,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He was banned for being a hateful piece of shit. He, namely, defends paedophilia.",
                                                    "score": 109,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Caitlyn Jenner was notoriously pro-Trump back in 2016.",
                            "score": 30,
                            "author": "SpyderEyez",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I don’t know how big of a group it is, but there are some. There is [Gays for Trump - Wiki](https://en.m.wikipedia.org/wiki/Gays_for_Trump) [Gays for Trump - Website](https://gaysfortrump.org/mobile/).\n\nI am not sure how anyone in the LGBTQIA+ community, or supporters therefore, could support Trump.",
                            "score": 102,
                            "author": "KuhjaKnight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 49,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just two days after [the Trump administration announced guidelines that would encourage the discrimination of LGBT people in healthcare](https://www.newyorker.com/news/our-columnists/the-trump-administrations-hateful-message-on-health-care-for-transgender-americans).",
            "score": 321,
            "author": "LordofNarwhals",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know, it feels like whiplash.",
                    "score": 64,
                    "author": "Grueaux",
                    "replies": []
                }
            ]
        }
    ]
}