{
    "id": "kd8bdc",
    "score": 115232,
    "title": "President-elect Joe Biden clears 270-vote threshold in Electoral College count, formalizing his victory",
    "author": "douglasmacarthur",
    "date": 1607985257.0,
    "url": "https://www.reddit.com/r/news/comments/kd8bdc",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Remember when Trump said he'd concede if the college voted for Biden? Guess what hasn't happened? And probably won't",
            "score": 9787,
            "author": "pocket-snails",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember the current president saying that he'd \"leave the White House\" if the college voted for Biden. Did he ever actually say that he'd concede?",
                    "score": 1577,
                    "author": "TheGoodOldCoder",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No. Same interview he said it would be difficult for him to concede, but that he would leave if Biden is confirmed after electoral college vote. Now he’s moved the goalpost to Jan 6th I’m sure.",
                            "score": 826,
                            "author": "aaspammer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm seeing people skip the Jan 6th goalpost and are just going right to Jan 20. It's over on Jan 20.\n\nI am curious to see how many republicans vote to not confirm the election results. That's gonna be fun. And, it's after the Georgia senate elections, so they won't be influenced by that.",
                                    "score": 286,
                                    "author": "DerekB52",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Refreshing trump tweets every 5 minutes now. All he's talked about most of the day is more fraud and then a few about Barr. My money is on that he goes radio silent until after midnight when he goes on another late night, adderall fueled twitter rampage.\n\nEdit: yo, \"every 5 minutes\" was hyperbole meant to be shorthand sarcasm, not literal. \n\nBut on a more serious note, to those wondering why I would care. He's still the President right now, and he is *constantly* attacking democracy, threatening to dismantle parts of the government, and still causing as much damage as he can. In addition, his supporters are rioting and attacking people across the country and there is a runoff election beginning that can influence control of the senate. This isn't \"finished\" in the sense that it means people can stop paying attention, responding with action, and speaking up where appropriate. (just don't literally refresh every 5 minutes over something and make sure to do things mentally or physically to stay healthy).",
                    "score": 2546,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well it's not like [the head of the White House security office, Crede Bailey, had a part of his lower right leg and the big toe of his left foot amputated because of COVID-19.](https://www.businessinsider.com/head-of-white-house-security-office-coronavirus-amputation-medical-bills-2020-12)\n\nI'm glad trump is focusing on the news that really matters, after all losing his temp job is obviously way more important than his coworker losing part of their leg.",
                            "score": 1091,
                            "author": "angrylawyer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Friends of Bailey's have raised over $35,000 through a GoFundMe campaign to help pay for his rehabilitation and \"staggering\" healthcare costs.\n\nHoly shit",
                                    "score": 827,
                                    "author": "grab_the_auto_5",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So even the head of the White House Security Office doesn't get good healthcare?\n\nThat's terrible, it creates a serious opportunity for bribery.",
                                            "score": 817,
                                            "author": "Tack122",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Excuse me, bribery is a very loaded word. We prefer to use the term lobbying.",
                                                    "score": 549,
                                                    "author": "sausagesizzle",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 120,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 191,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah. Maybe Trump classified him as an independent contractor to avoid benefits, lol.",
                                                    "score": 195,
                                                    "author": "K-Zoro",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wouldn't be surprised at all to learn he actually did that. The cruelty is the point.",
                                                            "score": 63,
                                                            "author": "northernpace"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": ":( keeps these dickfaces safe... Still doesn't have adequate healthcare.",
                                            "score": 61,
                                            "author": "grants_your_wishes"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "At least if he is on Twitter he isn't attempting to govern. The last four years were him making no real attempt, and it was bad enough.",
                            "score": 140,
                            "author": "metametapraxis",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "B-b-b-but-but Hawaii's electors haven't voted yet!",
                    "score": 207,
                    "author": "thismantis_dontpray",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You mean KENYA!?",
                            "score": 430,
                            "author": "colefly",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The whole birther thing really revealed to me just how *awful* people can be. Barack Obama got the presidential equivalent of \"driving while black\".\n\nNever let those cunts forget that they questioned a man's rights because he was a black guy with a funny name.",
                                    "score": 36,
                                    "author": "galactic_punt",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 75,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Trump is still waiting for Biden to concede",
                    "score": 278,
                    "author": "No___ImRight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sure he’s going to. Like, any minute. Annnyyyy minute now.",
                            "score": 103,
                            "author": "Wishyouamerry",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Trump tweeted a reference to the Biden Administration a few days ago, which I think is as close as we're going to get to a concession.",
                    "score": 110,
                    "author": "jeanneeebeanneee",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trump was right, I am finally starting to get tired of winning!",
            "score": 6783,
            "author": "-GregTheGreat-",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not because it constantly reminds Trump that he’s a fucking loser. Always has been, always will be. He’s so narcissistic that losing will hurt his ego more then going to jail.",
                    "score": 1983,
                    "author": "Bikinigirlout",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My favorite story of tr*mp losing is his desperate attempts to get an NFL team. It proves that he's never been one of the actual rich kids and he specifically lost in this instance because of exactly who he is at his core. Took down an entire league with him.",
                            "score": 283,
                            "author": "The_R4ke",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Augusta National also refused his request. We also shot down his hotel/condo tower and of course he lost the count 3 times here. Fat Cheeto loves losing in Georgia.",
                                    "score": 97,
                                    "author": "Im_a_new_guy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I know people want him put in jail, but this pretty much already is jail for him. \n\nTrump is a psychotic narcissist that is losing his power and privileges, and soon probably watching his family and empire burn in the wake before he finally dies. I can be satisfied knowing he'll be a miserable twat for his remaining years muttering \"but..I..won\" on his deathbed.\n\n**Not to say he doesn't deserve to lose his freedom for all the horrible things he's done all the same. If there is justice the whole administration will be wearing state property in due time.",
                            "score": 652,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Still would really like to see him in prison.",
                                    "score": 474,
                                    "author": "John__Wick",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can't move forward as a country if we don't punish criminals of the highest order. It will only encourage more lizard people like him to crawl out of the mud to run for office knowing that there's no consequences for blatant and overt corruption and abuse of power, among other crimes.\n\nJust waiting for the inevitable rise in domestic terrorism and Trump 2 in 2024.",
                                            "score": 304,
                                            "author": "VyRe40",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I mean I’m literally tired of winning.\n\nWe can’t keep up with the fake “evidence” and conspiracy theories that the r/conservative creates every fucking day. How much more and how much longer do we need to debunk them and just when will these losers shut up and get a reality check?",
                    "score": 458,
                    "author": "Pam-pa-ram",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They’ll be muttering this nonsense to their grandkids on the rare occasions they’re allowed to see them.",
                            "score": 275,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gramps is laying on his deathbed and the rest of the family leaves the room, leaving just Billy standing there awkwardly in the corner. Gramps painfully raises a hand and motions Billy closer. Billy hesitates, then reluctantly moves closer. \n\nGramps mumbles something Billy is unable to hear. \"What's that grandpa?\"\n\nIn a final push of strength, Gramps raises his head off of the pillow, puts his lips to Billy's ear gasps in a final death rattle:\n\n\"But her emails...\"",
                                    "score": 178,
                                    "author": "NebulaNinja",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 11016,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not gonna work. Need both the House and Senate to refuse to count. Besides, Romney and Sasse and Murkowski aren't gonna go along.",
                    "score": 3044,
                    "author": "Lukeh41",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course it's not going to work. Neither was Texas's dumbass \"lawsuit.\"\n\nThe point isn't to have it work, it's to go home and show Trump's demented base how loyal you are. It's a personality cult. Trump's showered praise on Brooks, which puts him in a favorable position in the cult.",
                            "score": 3208,
                            "author": "ExternalUserError",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have personally pissed off Mo Brooks, I can confirm he is a piece of shit.\n\nEdit: \n\nOk I didn't think anyone would read this far down and it's frankly a far more boring story than you'd hope.\n\nHe was visiting my University and doing a town hall. This was more than a decade ago. At the time I was a student, a constituent, and I worked for the university.\n\nI set up his mic and everything. He was very pleasant before the meeting. Smiley and as smarmy as you might expect.\n\nSo things are going fine with his town hall, and I told my boss that I was going to ask a question.\n\nI explained what it was like to be a student paying tuition that seemed to be skyrocketing, and I asked him what he felt could be done to address this before it became even more of a problem. (\"I'm working a full time job and it doesn't touch all of my expenses... Etc\")\n\nHe gave me a sour face then told a story about how when he was in law school he worked the whole summer to pay for his tuition!\n\nHis assistant returned the mic and he gave me the stink eye one last time before he left.\n\nDude's a shit bird. I got similarly patronizing responses when I mailed him and Jeff sessions about net neutrality.\n\nEdit 2: now that I'm thinking about it, it could have been less than a decade. But somewhere around 10 years.",
                                    "score": 1520,
                                    "author": "MyAntiAlterEgo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would LOVE to piss off Mo Brooks in person. As a father of a childhood cancer survivor and Alabama resident (yes, blue dot in a red state kinda thing), I lost my shit went he said in an interview with Tapper that people who live “good lives” don’t get sick and shouldn’t have to pay for health insurance to subsidize those with preexisting conditions.",
                                            "score": 672,
                                            "author": "needcoffeepronto",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He actually said that? Cripes, what an asshole",
                                                    "score": 303,
                                                    "author": "Lukeh41",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "https://www.al.com/news/2017/05/rep_mo_brooks_people_who_live.html\n\nYep, human garbage confirmed.",
                                                            "score": 246,
                                                            "author": "needcoffeepronto",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Jesus, how the fuck does he rationalize people getting sick/hurt or having pre-existing conditions? That it only happens to *bad* people?",
                                                                    "score": 148,
                                                                    "author": "Vyzantinist",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Is he saying... the handicap are bad? That's like a big 180 from how society would like to see its vulnerable members treated. Fuck his word play.",
                                                                            "score": 83,
                                                                            "author": "LezBeeHonest",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's part of the Nazi ideology. The \"pure\" Aryan breeds were supposedly superior, so they didn't get sick. Therefore if someone gets sick, they cannot be part of the group and they are ostracized.\n\nAlso, he receives money from the healthcare sector ([source](https://www.opensecrets.org/members-of-congress/mo-brooks/summary?cid=N00030910&amp;cycle=2018&amp;type=I)) so of course he's representing their interests instead of his constituents'.",
                                                                            "score": 71,
                                                                            "author": "Helkafen1",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 109,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The point is also that this is a fantastically successful grift.  He's raising ridiculous amounts of money with this scam.",
                                    "score": 110,
                                    "author": "Foliagegleaner",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 862,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be fair to them, he should have fought that shit.  Gore had a legitimate claim.  \n\nAs much as Trump makes people feel nostalgic for W, he really fucked this country up in a bad way.  Thanks to W there are now American soldiers fighting and dying in wars that started before they were even born.  Entire countries are crippled and filled with people who have never known anything besides war, death, and misery.  And through all of that, we haven't fixed anything, we haven't stabilized anything.  All we have done is spend money, throw away lives, destroy countries, and create more people who hate the US.",
                            "score": 1177,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And even if the wars had been inevitable, the climate action that Gore would've brought to the US, and consequently, to the rest of the world, would've been massive in our fight against climate change. We wouldn't even be contemplating right now whether or not we're passed the point of no return--we'd have some definite plan for cutting and capturing emissions and the public would be far more aware of how big of a threat it is.",
                                    "score": 501,
                                    "author": "Noisetorm_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We might have still wound up in Afghanistan, but there's close to a 0% chance that Gore would have invaded Iraq.  That one was all W and Cheney.",
                                            "score": 337,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We definitely would have invaded afghanistan. Pretty much everyone wanted to invade to at least show we're doing something. Iraq is a much different story.",
                                                    "score": 93,
                                                    "author": "DrKarorkian",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "TBF challengers to the results in Congress are not new. We had a few Democrats do it in 2016, and elections before that. What would be dangerous is if the challenges were sustained by both the House and Senate and they had to vote on them. They’d still likely fail, but the amount of anger that would stir up would be really bad.",
                    "score": 108,
                    "author": "GaryBettmanIsMyHomie",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It has been a real rollercoaster as others have pointed out.  On Nov 4th, we thought Biden had won.  Then by the end of that week we thought Biden had won.  And then the following week we knew Biden had won.  And then the following week we knew Biden had won.  And then the following week we knew Biden had won.  And then the beginning of the following week we knew Biden had won.  And then when all of the many lawsuits were all tossed, we knew Biden had won.  And then on Black Friday after Thanksgiving we knew Biden had won.  And then when the Supreme Court rejected the Texas suit we knew Biden had won.  And now on December 14th, finally we know that Biden has won.\n\nSo many twists and turns. ;)\n\nEdit: spelling\n\nFurther edit: Thanks for the gold, etc.! :)",
            "score": 1904,
            "author": "KJ6BWB",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's like a Nascar race. You can only be entertained by turning left so much before it gets boring.",
                    "score": 419,
                    "author": "boonjo01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Get ready to turn, but not yet!](https://youtu.be/bG2OcW_Hwkg)",
                            "score": 25,
                            "author": "YouCanFucough"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A real monorail ride.",
                    "score": 67,
                    "author": "RedSix66",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "RIP \"Joe Biden isn't technically President-Elect\" you had a good five weeks.",
            "score": 6936,
            "author": "douglasmacarthur",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Media doesn't decide the president-elect, the electoral college does\"",
                    "score": 620,
                    "author": "Nachofriendguy864",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yet I have definitely seen footage of Pence \"introducing\" Trump as President-Elect the night of the election 2016. Such hypocrites.",
                            "score": 302,
                            "author": "FootloosePie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I tried explaining this to my Trump supporting dad, how nothing was done differently this year and the median is just reporting the votes, not deciding a president and Hillary conceded and Trump accepted within the couple of days after election night.\n\nHe said well you were posting on fb and celebrating Biden’s win once it was announced. And I was like I’m not the only saying it doesn’t count! They really just don’t get it",
                                    "score": 66,
                                    "author": "LetshearitforNY",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Time to break out the good old “you lost get over it” and “fuck your feelings” That the same crowd like to use four years ago on Hillary supporters\n\nFunny how it’s not funny to them now",
                    "score": 3276,
                    "author": "Bikinigirlout",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 159,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "My favorite is \"God chose him to lead America. Who are you to doubt the divine plan?\"",
                            "score": 167,
                            "author": "majungo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's spectacular stupidity. I guess God also choose Clinton and Obama, both twice ;)",
                                    "score": 138,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Classic modern Christian dichotomy.  Thing I agree with happened? God’s grace.  Thing I didn’t like happened? Devil’s influence.",
                                            "score": 164,
                                            "author": "stealthdawg",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'd rather ignore them. Don't want them to feel like bigger victims than they already think they are.",
                            "score": 476,
                            "author": "inksmudgedhands",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Time for them to don foreskin hats!\n\nThank you for the award kind stranger :-)",
                            "score": 495,
                            "author": "eric_ts",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you mean \"Don's foreskin hats\"?",
                                    "score": 179,
                                    "author": "stupidpunname54",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "“Just you wait! Trump is going to win and you’re going to be crying in January! The election is not over yet!!!”",
                            "score": 143,
                            "author": "DynamicOffisu",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wonder what the next cope-method will be? The lawsuits didn’t work, the state legislatures didn’t appoint Republican electors, and now there wasn’t faithless electors. How will they now choose to hide from the reality that Biden won?",
                    "score": 475,
                    "author": "-GregTheGreat-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Check r/Conservative they’re just in delusion mode.",
                            "score": 457,
                            "author": "TostitoNipples",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They got a lot to deal with. This and Trump just fired Bill Barr or he resigned.",
                                    "score": 295,
                                    "author": "yuppers_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well the top comment on the Barr article is “fucker was an enemy agent all along” soooooo take that for what you will.",
                                            "score": 312,
                                            "author": "goldybear",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Trump hired an enemy agent? Fake news.",
                                                    "score": 117,
                                                    "author": "iksbob",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh shit, seriously?\n\n\nI missed the Barr part.",
                                            "score": 81,
                                            "author": "TTMcBumbersnazzle",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 100,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He tweeted it 3 minutes after the electoral college voted, couldn't handle not having the spotlight.",
                                                            "score": 141,
                                                            "author": "theclansman22",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My favorite. “Alternative electoral college will deliver the win”. \n\n&gt;\tIgnore the lying media. Alternate slates of electors have been sent for Trump by the LEGISLATURES. He has 270. Downvote me 500 times now, your potato will never be president.",
                                    "score": 70,
                                    "author": "anon1984",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Just you wait, Biden will never stack up against the Bizarro College!\"",
                                            "score": 30,
                                            "author": "Blast64"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The [thread about this topic](https://www.reddit.com/r/Conservative/comments/kd8d6t/california_gives_biden_the_official_electoral_us/) over there is surprisingly upbeat.  I suspect there's a lot of people like me who aren't subscribers but stopped over there for a bit this afternoon.\n\nEdit: Aaaand now it's been locked down by the mods and only people with conservative flairs can comment, because of course...",
                                    "score": 163,
                                    "author": "Zolo49",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I just read how China has infiltrated our country at every level and we are in a new Cold War. Also, “like in firefly” China will now beat us in the space race so everyone will now speak English with Chinese slurs ... whatever the fuck that means or has to do with anything",
                                    "score": 105,
                                    "author": "justhere4daSpursnGOT",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Imagine never going outside, just watching battlestar galactica and firefly all day and thinking that's reality.  I'm sure there is some heavy fallout time put in as well.  I enjoy all those properties myself, but you know I don't think it's reality.",
                                            "score": 78,
                                            "author": "BronchialChunk",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What's the difference between r/conspiracy and r/Conservative? r/conspiracy occasionally makes sense",
                                    "score": 82,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Holy shit you're not kidding.\n\nMy personal favorite so far.\n\nhttps://www.reddit.com/r/Conservative/comments/kd7emr/pennsylvania_georgia_nevada_and_arizona/gfuwbqt",
                                    "score": 55,
                                    "author": "easyroscoe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "r/Conservative is a cesspool of a sub, but damn the comment below is great:\n\n&gt;Yet if I speak against Trump, I am branded Non-Conservative.\n\nAnd this guy is 10000% right, Trumpanzees have been pulling this delusional comeback for fucking **years.**",
                                            "score": 189,
                                            "author": "MrBonelessPizza24",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Despite being the ultimate tough guys conservatives sure do whine a lot",
                                                    "score": 69,
                                                    "author": "world_of_cakes",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They will say the Senate will refuse to count the vote, I imagine.\n\nThe Constitution and federal law from the 1870s makes the procedure for this very clear, and the state legislatures and judiciary havent played ball in giving this BS legitimacy, so that won't happen. But that will be the new cope.",
                            "score": 90,
                            "author": "douglasmacarthur",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "The next thing is that they think gathering people in the state Capitol and having them act as electors for Trump counts as sending alternate electoral votes to Congress that Pence will unilaterally declare to be the actual electors. \n\nThis is wrong for numerous reasons, the biggest being that electoral votes do have legal criteria that these random gatherings in the Capitol don't meet.  The criteria could be tested, but it would at least take the endorsement of state legislatures, which these so-called alternate slates don't have.",
                            "score": 62,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, there was talk about Republican legislatures appointing alternate electors and sending those to Congress (which still wouldn't have worked), but these morons aren't even that. They're literally just random crazies LARPing as electors.",
                                    "score": 58,
                                    "author": "poet3322",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There's a [video of them](https://youtu.be/KX9k2bwYI9Y) trying to get into the capital building in Michigan, all claiming they need to get in because they're the GOP electors.  \nThe state trooper at the door wasn't having any of it.  \nHe was like, \"Yeah, no, all 16 electors are already inside\".",
                                            "score": 101,
                                            "author": "DavidRandom",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh, the irony of these people decrying electoral fraud while they're literally fraudulently trying to claim that they're the electors.",
                                                    "score": 66,
                                                    "author": "jim653",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The comments on this video scare the shit ouy of me. People with little idea of what is actually going are getting whipped into a fervor.",
                                                    "score": 28,
                                                    "author": "RKKP2015"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nah. The next thing is going to be how republicans don't have to accept the electors results come Jan 6th. Watch. They just won't stop trying their coup attempts.",
                    "score": 40,
                    "author": "mces97",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 69,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Now we get to slide into \"Everything is falling apart and it's Biden's fault\" while the senate never passes anything or lets him even have a cabinet",
                    "score": 116,
                    "author": "override367",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For someone who won the election, Trump hasn’t even shared who he plans to have in cabinet positions for his next term\n\nI mean now that the AG has been fired...he needs a new one!  Just saying to run a govt you kind of need some folks to help you",
                            "score": 69,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ha, jokes on you. Trump has 15-20 more lawsuits and another $215 million in donations to collect before we hear the end of the poo-choo from this turd train.",
            "score": 3056,
            "author": "Jagwires",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1229,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's not spending it. He's collecting it, according to the law he only has to spend 25% of what he gets, he can keep the rest. And he's going to be keeping quite a lot of his supporters money.",
                            "score": 455,
                            "author": "Teppis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Truly the ultimate grifter",
                                    "score": 204,
                                    "author": "TheAtomicClock",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The one thing he’s excelled at",
                                            "score": 66,
                                            "author": "KillingItOnReddit",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 607,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I worry he’s not confused at all. His PAC is collecting enough money from his deluded supporters, that they can afford to keep raising these lawsuits. If his PAC wasn’t raising money there would be no way he would waste a single cent of his own money on this frivolous bullshit. This is all one last con to squeeze as much money out of his loyal rubes before the bell rings.",
                            "score": 157,
                            "author": "Harryballsjr",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 133,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Hey, if his supporters wanna keep throwing their money away on a useless man, who are we to stop them?",
                    "score": 87,
                    "author": "eatapenny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Didn't a story come out about how his supporters tried to cancel their recurring donations but couldn't?",
                            "score": 89,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh pls god source",
                                    "score": 43,
                                    "author": "DocJawbone",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't believe I need to wait until January to see Biden win again.",
            "score": 16622,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Surely there will be more opportunities before then.",
                    "score": 4304,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I assume the \"alternative electors\" still have their day to be laughed out of court.",
                            "score": 2136,
                            "author": "cancerousiguana",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Alternative what now??",
                                    "score": 844,
                                    "author": "VidE27",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[Stephen Miller Proposes Wacky Plan Involving ‘Alternate State Electors’ to Ensure Trump is Re-Elected](https://www.mediaite.com/tv/stephen-miller-proposes-wacky-plan-involving-alternate-state-electors-to-ensure-trump-is-re-elected/)",
                                            "score": 1473,
                                            "author": "quangtran",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hmm. They might need an alternate congress that will accept those results of their alternate president-elect, I assume representing the individual alternate states. \n\nIt’s starting to sound a lot like secession with extra steps.",
                                                    "score": 2708,
                                                    "author": "TheBatemanFlex",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They are living in an alternate reality, so it all checks out.",
                                                            "score": 1189,
                                                            "author": "TigerMcPherson",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Alternative facts don't care about alternative feelings, it would seem.",
                                                                    "score": 469,
                                                                    "author": "Mediocratic_Oath",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It’s called the Alt Right.",
                                                                            "score": 266,
                                                                            "author": "mrajoiner",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It is actually illegal to secede from the union, ever since the last civil war.",
                                                            "score": 254,
                                                            "author": "LuciferandSonsPLLC",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "More importantly, after the Civil War a case wound up in the US Supreme Court, Texas v. White, and it was found that the Confederacy never existed, that their declarations of secession were null, and that they remained US states without ever having left at all. There is no path for secession of any state, never was, so any state leaders declaring secession would actually be committing treason and their states would still be in the union, irrevocably.",
                                                                    "score": 466,
                                                                    "author": "noncongruent",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "There was a punishment for the attempt though; stripped of Congressional representation and demotion from State to Military District, placed under a military administration until formal readmittance into the Union as a state years later.\n\nEDIT: To add on, readmission required forming a new state government, passing a new State Constitution that fit Federal standards, and ratifying the Thirteenth and Fourteenth Amendments.",
                                                                            "score": 195,
                                                                            "author": "LuxLoser",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Ah, Reconstruction. The shining moment in history where we tried doing the right thing for a few minutes.",
                                                                                    "score": 186,
                                                                                    "author": "DankNastyAssMaster",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Which is what makes my home state of West Virginia the most illegal state in the union, since you can't legally take land from an existing state to create a new one, and yet here we are.",
                                                                            "score": 75,
                                                                            "author": "wvboltslinger40k",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "To be fair, about half the continental US was formed from Virginia's territory claims.",
                                                                                    "score": 37,
                                                                                    "author": "Alchemyst19",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "This reminds me of the time some Cardinals broke away from the pope, and elected their own pope and formed a new Papal court in France, right after the new pope just moved the court from France back to Rome. This schism eventually lead to three different popes at once, only for two of them to resign to elect a new Roman Pope who denounce the French Pope so hard he faded from relevancy.",
                                                            "score": 63,
                                                            "author": "Beidah",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Trump the Antipresident",
                                                                    "score": 26,
                                                                    "author": "a_wild_redditor",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "*Boss, I don't mean to complain, but me and the guys have been thinking this seems like a lot of work, can't we just battle or get along?*",
                                                            "score": 66,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "My fantasy dictator team is looking fierce this year. If only Kim was better at making nukes, I’d sweep the season. Good thing I’ve got Trump Jr. coming off the bench. And Erik is a solid ~~water boy~~ bench.\n\nEdit: had to make Erik’s position a bit more believable.",
                                                    "score": 174,
                                                    "author": "SmokeAbeer",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Fucking Putin was on bye this week or else I would have won on points per assasination attempts alone.",
                                                            "score": 65,
                                                            "author": "LukeAnders0n",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Why are you even playing Kim? I thought he was on IR?",
                                                            "score": 34,
                                                            "author": "CruisinForABrewsin",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The crazies on r/conservatives posted something like this as if it means that Trump has won. It’s like an alternate reality over there",
                                                    "score": 129,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Supporting Trump pretty much requires living in an alternate reality. We saw it day freaking one of his presidency with the whole \"alternative facts\" lunacy, and his supporters subsequently whining about how unfair it is for the media to report facts that make Trump look bad.",
                                                            "score": 151,
                                                            "author": "Darrenwho137",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "God, the fucking inauguration crowd size and weather. That's a lifetime ago.\n\nI remember thinking I was going to try and give him a chance despite all of the abhorrent shit he had already said.  And then day fucking one he argued with undeniable photo and video evidence.  And it wasn't even something important.  Just stupid bullshit right from the beginning...and it never stopped.",
                                                                    "score": 69,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They posted a story about how a bunch of GOP electors showed up and cast votes for Trump. They don't count because they aren't certified, and it's basically like saying fuck you to their state's citizens. But the idiots on r/conservative are acting like it will actually do something.",
                                                            "score": 88,
                                                            "author": "powerlesshero111",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I have to say, I did not see ‘electoral college cosplayers’ coming. 2020 really keeps you on your toes.",
                                                                    "score": 91,
                                                                    "author": "LillyPip",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So uh, basically, round up a few of your craziest trumpets, slap a \"HELLO MY NAME IS: _ ELECTOR__\" sticker on their jacket, and then send them to the voting locations for the Electoral College.  I guess the idea is they bang on the door screeching \"nO bUt wE aM tHe ReAl LeCtOr FoR sUpEr CeArEaL lEt uS iN wE vOtE nOw !!!11\" until security escorts them off the property.\n\nOne of the republican officials supporting this clusterfail has already been sanctioned and kicked off his committee.  It's such a poorly executed coup attempt other republicans, for the first time, are now having to explore this strange confusing new feeling their therapists will later explain is called *shame*.",
                                            "score": 245,
                                            "author": "InnerObesity",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; So uh, basically, round up a few of your craziest trumpets, slap a \"HELLO MY NAME IS: _ ELECTOR__\" sticker on their jacket\n\nLike Trump's \"poll watchers\" that were a) not poll watchers; and b) only there to intimidate registered voters. It's like they think words don't mean anything.",
                                                    "score": 152,
                                                    "author": "HereForAnArgument",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;It's like they think words don't mean anything.\n\nThey remind me of \"sovereign citizen\" types who seem to believe words are magic, and if you say the correct legal-sounding mumbo-jumbo then you are correct and you win. It's the same way people just slap the word \"logical\" onto any random bullshit and assume it will make it true and unassailable.",
                                                            "score": 74,
                                                            "author": "Mediocratic_Oath",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He'll have won more than any other president. Thanks to donny he'll be the most winningest president.",
                    "score": 593,
                    "author": "The_R4ke",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But I’m tired of winning.",
                            "score": 213,
                            "author": "mydogeatspoops",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To be fair, we were warned.",
                                    "score": 200,
                                    "author": "Overall_Society",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think you've stumbled across Donny 4-D chess' strategy! According to the 22nd amendment, a person can only be elected twice! Biden has been elected like 54 times already!",
                            "score": 161,
                            "author": "glowskull10",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How many slaps in the faces can trump supporters take?",
                    "score": 328,
                    "author": "Pam-pa-ram",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Endless amounts apparently.",
                            "score": 149,
                            "author": "Acadia-Intelligent",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This is not a slap in the face for them. They're conspiring with their leader as we speak.\n\nThese people intend to take matters into their own hands. They're a dangerous cult of loons. A clear immediate danger to the public.",
                            "score": 328,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This was always the danger of strictly allying an entire party with a fundamentalist religion who believe some are \"chosen\" and the rest are under the influence of evil.  Republicans would have been out of business 40+ years ago if it weren't for the Southern Strategy. It is what repulsed me OUT of the party 30 years ago, and sure enough, the fear based, paranoia stricken, \"other\" bashing extreme cult mentality has lied itself into a dangerous frenzy of anti-reality.  Treason in the name of nationalism.",
                                    "score": 162,
                                    "author": "ultramanjones",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think the term you're looking for is *authoritarianism*. That's what's applicable here if we're discussing 45.\n\nThe crusade to \"restore religious liberties\" is just one of the many aspects of our society he's gaslighted in order to achieve fame he never should have gotten in the first place. He's the equivalent of a dictator. The system our country has in place should have never let him get away with even this much.\n\n*The fact that this entire charade came down to his own appointees rejecting his moronic lawsuit at the highest court possible is appalling in of itself.*",
                                            "score": 36,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now Republicans will be saying “he’s not President-elect until Congress confirms the electoral college results”. Like, damn, how many times do we have to teach you this lesson old man.",
            "score": 2343,
            "author": "deslusionary",
            "replies": [
                {
                    "level": 1,
                    "comment": "Then after that, it's going to be: \"He's not President until he takes the oath of office.\"",
                    "score": 394,
                    "author": "OneX32",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then after that, its going to be \"He's not President until he has won reelection in 2024, since this election was stolen\".",
                            "score": 507,
                            "author": "locusness",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Kind of like how they think Trump deserves a third term because he was impeached so his first term doesn't count. That was what, January? Seems so long ago and Republicans have moved the goalposts so much you can't even find them anymore.",
                                    "score": 137,
                                    "author": "sixkyej",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"He's not president until he says 'I'm sorry'!\"",
                            "score": 109,
                            "author": "martialar",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Each time is just another loss for Trump. I’m happy for it to keep going.",
                    "score": 472,
                    "author": "MrMytie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same because he just looks like a loser and is a loser",
                            "score": 129,
                            "author": "Bikinigirlout",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love how twitter conservatives and Parlertards are calling the electors traitors, and voting for Biden is apparently treason punishable by death. According to them, the Electors from GA, PA, MI, WI, AZ, and NV are all faithless electors, lmao.",
                    "score": 150,
                    "author": "Afflicted_One",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They've been moving the goalposts so much over the last month and a half that they're not even on the field",
                    "score": 87,
                    "author": "eatapenny",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Right wing twitter is still claiming trump is going to win it’s just insanity at this point",
            "score": 1597,
            "author": "Steelcity1995",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hopped over to r/donaldtrump and they are completely out of touch with reality. They’re hyping over “Arizona Turns Red,” (allegedly, as the REAL electors showed their true colors) in one thread, and half the posts have the most obnoxious 🛑 in them for STOP THE STEAL. It’s ridiculous. These people genuinely have no clue how stupid they look.",
                    "score": 276,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jesus, those people are in a completely different reality.",
                            "score": 172,
                            "author": "zip_000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It is really mind boggling. For a second you almost lose yourself - what if they are right and I am the one that has been deceived, after all?\n\nBut then again, a dash of media literacy can solve this issue. I understand and know the goals of those who produce the media I consume, and I like to think of myself as capable enough to understand the biases of each and construct a reality appropriately. Whereas the fuckin - www.trumplover.com or whatever doesn’t even have an editorial board.",
                                    "score": 156,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 78,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Apparently, GOP people writing Trump’s name on a piece of paper counts as an “alternate electoral vote” even though it won’t count since it won’t be sealed by the officials.\n\nYeah, that’s what they’re going with.\n\nThey have beyond fucking lost it.",
                    "score": 766,
                    "author": "altruSP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They have to keep on digging deeper into the crazy to convince themselves that Trump can still win.",
                            "score": 178,
                            "author": "adderallanalyst",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bet I can get them to give me money if I told them it would “help” him win.\n\nProbably not, but at this point I’d believe it if I could.",
                                    "score": 52,
                                    "author": "altruSP",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People with actual functioning brains do not pay attention to right-wing Twitter, unless it's to use it for laughs or psychological studies.",
                    "score": 187,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "My relatives listen to Hannity. They repeated his ravings about affidavits, fraud, and more. Somehow only this election is when the voting system is broken, never before. Idk if they've declared the Supreme Court to be deep state yet.",
                    "score": 58,
                    "author": "Red-Droid-Blue-Droid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Correction: ONLY this election, and ONLY states where Trump lost, and ONLY specifically the Presidential votes. Everything else is Gucci.",
                            "score": 70,
                            "author": "SirTeffy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“You LOST! Good DAY sir!” \n\n~Willy Wonka",
            "score": 1048,
            "author": "Tedstor",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't like this metaphor.... Because Charlie still ended up winning.",
                    "score": 293,
                    "author": "No___ImRight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only because he gave back the Everlasting Gobstopper. Trump would never do that. He's a combination of Augustus Gloop and Veruca Salt.",
                            "score": 281,
                            "author": "Lukeh41",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Trump is a combination of all four of the bad kids.\n\n- Veruca Salt - Spoiled and entitled\n- Augustus Gloop - An obese glutton\n- Violet Beauregard - obsessed with winning and thinking they're the best\n- Mike TV - Obsessed with media",
                                    "score": 284,
                                    "author": "PhantomDeuce",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oompa loompa doompety doo\n\nI've got a perfect puzzle for you\n\nOompa loompa doompety dee\n\nIf you are wise you'll listen to me\n\nWhat do you get when you refuse to concede\n\nSpouting endless bullshit on your twitter feed\n\nWhat are you at, getting terribly fat\n\nWhat do you think will come of that\n\n\nI don't like the look of it",
                                            "score": 143,
                                            "author": "Georgeisthecoolest",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What's the gobstopper in this metaphor? 4 years of our lives?",
                                    "score": 40,
                                    "author": "No___ImRight",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"You lose!\"*",
                    "score": 29,
                    "author": "Warriordance"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sidney Powell saying it's far from over. Trump still has \"Emergency Powers\". What a loon",
            "score": 358,
            "author": "Lukeh41",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nothing says \"party of small government and freedom\" like invoking emergency powers to contest an election.",
                    "score": 162,
                    "author": "DrDerpberg",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Did she spell that correctly?",
                    "score": 96,
                    "author": "LuckyBdx4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 58,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Jar Jar Binks would like to move, dellow felegates, to grant Emergency Powers to the Supreme Chancellor.\n\nThat time on election night, when Trump claimed to have won and called for \"the voting to stop\", it felt like the \"So this is how democracy dies, with thunderous applause\" scene. How many prequel memes can we fit into this bad boy?",
                    "score": 49,
                    "author": "Dexcuracy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 128,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not a single faithless elector. Get fucked Trump.",
            "score": 148,
            "author": "Cakesmite",
            "replies": [
                {
                    "level": 1,
                    "comment": "These Republicans who thought faithless electors would save them are morons. The electors voting were handpicked by the party that wins the popular vote in each state...",
                    "score": 32,
                    "author": "VerySuperGenius",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 635,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "No kidding, they have to take control from the turtle.",
                    "score": 299,
                    "author": "Bubbaganewsh",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Re-re-re-re-re-Confirmed",
            "score": 372,
            "author": "vorxaw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ccccombo breaker!",
                    "score": 100,
                    "author": "williane",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aaand Bill Barr resigned. Can we move on from this shit show now please.",
            "score": 371,
            "author": "Jano_something",
            "replies": [
                {
                    "level": 1,
                    "comment": "wait WHAT",
                    "score": 92,
                    "author": "GoTeamScotch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 87,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 28,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats to Joe Biden on winning the 2020 election for the 700th time!",
            "score": 481,
            "author": "Show-Me-Your-Moves",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Did that wall ever get built?      \n\nDid the email lady ever get locked up?        \n\nDid coal make a big comeback?          \n\nDid little kim get rid of his nukes?",
            "score": 75,
            "author": "inagartenofeden",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 37,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I fully expect there to be some truly heinous voter fraud next election. Every single accusation the GOP have thrown out in the past decade has been projection.",
            "score": 36,
            "author": "AchillesPrime"
        },
        {
            "level": 0,
            "comment": "I have dozens of those \"Remind Me\" comments under all those stupid trump supporters who told me I'd be crying when the electoral college voted. Just finished replying to all of them. Now I'm just waiting for February to reply to all the other idiots who claimed Trump would get another term and fuck my feelings. Really looking forward to that one. \n\nLove how Trump scammed all these dummies out of $200,000,000+ and only spent $8 mil on Election fraud. Got all these losers thinking an affidavit from a trump supporter claiming the Election was unfair and blurry video of people doing non illegal things was somehow Election fraud. Trump literally convinced these idiots millions of dead people voted and that people were voting multiple times on mail in ballots. I mean you can't expect more from republicans but still. Either way, one biden is president I'm just going to ignore all the trump supporters. I'm sure they'll be doing the same old \"right wing terrorism\" thing they've been doing and making America worse but at least I won't see their stupid views trending online anymore.",
            "score": 240,
            "author": "iamlarrypotter",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 355,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Joe Biden won. Get over it and fuck your feelings.",
            "score": 393,
            "author": "Zamaamiro",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Maybe the real electors were the friends we made along the way...\n\nIt’s been a wild ride everyone",
            "score": 140,
            "author": "Estepheban",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I will never forget how republicans tried to overthrow democracy. I will NEVER vote republican.",
            "score": 285,
            "author": "CreativelySeeking",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Waiting to see Trump's newest way of somehow still staying president",
            "score": 147,
            "author": "brandondase",
            "replies": [
                {
                    "level": 1,
                    "comment": "He had his own unofficial electors cast votes lol",
                    "score": 112,
                    "author": "Steelcity1995",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 66,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trump really milked his base for over 200 million dollars post-loss just to to see him get massacred in court. What an absolute clear as day scam. Idiots.",
            "score": 77,
            "author": "EveryonesSoAnnoying",
            "replies": []
        }
    ]
}