{
    "id": "t51gp3",
    "score": 133365,
    "title": "$1 million bounty on Putin offered by Russian businessman",
    "author": "L82Work",
    "date": 1646231757.0,
    "url": "https://www.reddit.com/r/news/comments/t51gp3",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "r/News still has rules against calling for or celebrating the death of anyone regardless of the nature of this article. Please take care. \n\n//////\n\nhttps://www.reddit.com/r/news/wiki/rules\n\n4) Comments celebrating or advocating the death of another individual will be removed.",
            "score": 1,
            "author": "NewsModTeam",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This explains why Putin sits so far away from his advisors",
            "score": 12905,
            "author": "maralagosinkhole",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's because he's so afraid of Covid. The guy is two years shy of the average life expectancy of Russian males and if you can't tell from looking at how much he's \"thickened\" over the years, he's been pumping steroids to maintain his \"sex symbol\" image and he's obsessed with masculinity, and he's deathly afraid Covid will undo all of that.\n\nIf you see ANYONE shake his hand, they spent 48 hours alone in a room getting swabbed a whole bunch.",
                    "score": 1451,
                    "author": "sheepsleepdeep",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t know if other steroids do this but I assumed he’s on prednisone because his face is so damn puffy",
                            "score": 704,
                            "author": "leahhhhh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah people though it was botox at first but prednisone moonface is pretty distinctive, very even/marshmallowy and extends to the scalp/head where botox does not, of course.\n\nThat being said, why not both? He may be sick but he is undoubtedly vain.",
                                    "score": 568,
                                    "author": "rebb_hosar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Could be both, I don’t think we’ll ever know. Some intelligence says he’s not in his right mind, other intelligence says he’s just angry and lashing out.",
                                            "score": 197,
                                            "author": "leahhhhh",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Which high doses of prednisone could also contribute to. I’ve got inflammation problems and nothing’s ever made me feel more out-of-my-mind enraged for absolutely no reason than prednisone, lol.",
                                                    "score": 352,
                                                    "author": "RPGaiden",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah. That one cost a marriage. Such a shitty side effect. I didn’t think a person could do prednisone for as long as Putin and still have functioning organs?",
                                                            "score": 121,
                                                            "author": "Sadsh",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "My mother in law has been on prednisone for about 30 years. Her body has not taken it well, and she’s only in her early 50’s.",
                                                                    "score": 84,
                                                                    "author": "Mr_Diesel13",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "My husband's Uncle passed last summer after about 3 decades on prednisone. They had originally given him days to live. And he lived to have 5 grandkids.",
                                                                            "score": 59,
                                                                            "author": "GemAdele",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Prednisone would also explain his erratic and unhinged behavior",
                                    "score": 227,
                                    "author": "dopechez",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Certainly his moodiness. It made me suicidal.",
                                            "score": 133,
                                            "author": "leahhhhh",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Think he has ‘roid rage?",
                            "score": 63,
                            "author": "Environmental_Cake97",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "sex symbol?",
                            "score": 93,
                            "author": "Lucy194",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You've never seen the videos of shirtless Putin riding horseback? Dude is obsessed with projecting masculinity and power. He views himself as a Russian sex symbol.",
                                    "score": 376,
                                    "author": "sheepsleepdeep",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There is nothing less sexy than war crimes",
                                            "score": 164,
                                            "author": "DeificClusterfuck",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 5510,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Putin wishes he was half of Napoleon",
                            "score": 1736,
                            "author": "PrinceOfCrime",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tbf to Napoleon, he was short by today's standards but was actually average height for his time - every just called him small because of English propaganda saying he was",
                                    "score": 1586,
                                    "author": "arcanum7123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also because he was often portrayed with the Imperial Guard - who had a minimum 6 ft height requirement if I recall correctly and who wore headdress that was another 2.5 ft. They were frightening because they were huge, were all veterans and they didn't fail - up until Waterloo that is.",
                                            "score": 984,
                                            "author": "wrgrant",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is the correct answer. He was actually taller than average for the time. It’s simply because the Old Guard and all of his generals were massive that by comparison he looked like a runt. It probably didn’t help that towards the end of his career he got decently round compared to his half-starved guard, but I digress.",
                                                    "score": 581,
                                                    "author": "TacoMedic",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In addition British and French Feet weren't standardized.  The French inch was a little larger than the English inch, so his height in French inches was 5'2\" while in the units we use today (and were used in England then) he was 5'7\" or so.  So the number added to the impression (haha, he's only 5'2\").",
                                                            "score": 236,
                                                            "author": "Huttj509",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "\"Yeah, technically I am only 3 inch. But I am French, so it is actually bigger.\"",
                                                                    "score": 58,
                                                                    "author": "rozen30",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Napoleon was 5’7” The average height of the world today is 5’ 7.5” . \n\nHe was average height then and now.\n\nEdit: lol. I don’t have a complex and am 6’ myself. Step off.",
                                            "score": 449,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "He wishes he was 2'9\"?",
                                    "score": 182,
                                    "author": "crescent_blossom",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think this is more than the money. This is the first time any of Russia’s money makers have targeted Putin instead of the other way around. It shows the fear of him or his retribution is waning. That’s more valuable to the effort than any simple million",
            "score": 3657,
            "author": "Steppyjim",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean the guy putting the bounty is the same guy Putin forced all his assets to seized so they have beef but no bread now",
                    "score": 862,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 467,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tax the rich indeed",
                                    "score": 64,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It works, it really benefits whoever receives the money",
                                            "score": 42,
                                            "author": "TantalusComputes2"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Google says the dude's still worth $300 million as of today.  Not doing too badly.",
                            "score": 230,
                            "author": "farahad",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "$1,000,001 bounty offered on Russian business man by Putin",
            "score": 14762,
            "author": "dalnot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah, Price is Right strategy. I like it.",
                    "score": 4804,
                    "author": "Funderwoodsxbox",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Help control the dictator population, have your autocrat spayed or neutered.",
                            "score": 3359,
                            "author": "Callinon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Assassinate dont procrastinate",
                                    "score": 316,
                                    "author": "ReynoldsHouseOfShred",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Permission to steal and put on a shirt?",
                                    "score": 377,
                                    "author": "ShootDminorET",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Go for it",
                                            "score": 150,
                                            "author": "Callinon",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m for beheaded not neutered",
                                    "score": 49,
                                    "author": "Draft_Tight",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 287,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Price is Dwight.\n\nEdit: holy crap my first awards! Thanks, strangers!",
                            "score": 124,
                            "author": "Ozymantyx",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Will it be paid in Schrute Bucks?",
                            "score": 103,
                            "author": "chillywilly16",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Liverpool is offended by this post",
                    "score": 88,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "**He called out Putin for the apartment bombings 😳**\n\nFor those who don't know, when Putin first became prime minister he organized a false flag that killed over 300 Russians to justify military action against Chechnya by blaming chechen terrorists. Three apartment buildings were blown up killing hundreds, but soon after a fourth bomb was discovered by a block's residents, the bomb squad verified the explosive was chemically identical to the other three explosions, and residents and the police were congratulated for foiling an attempt... **Until 3 days later**, when the people who planted the bomb were discovered and arrested and **found out to be Russian secret service agents**, after which all talk about the foiled attempt became a sudden discussion about \"the successful training exercise\". There were no explosives in the basement, *just bags of flour... (that field-tested positive for military grade explosive)*\n\nThere's so much evidence tying Putin to the attack, you can drive straight line to him from the FSB agents that planted it, but in Russia it's forbidden to discuss and the people who lived in the apartment building refuse to talk about it in fear that \"they might actually blow us up next time.\"",
            "score": 9859,
            "author": "sheepsleepdeep",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; With Yeltsin and his family facing possible criminal prosecution, however, a plan was put into motion to put in place a successor who would guarantee that Yeltsin and his family would be safe from prosecution and the criminal division of property in the country would not be subject to reexamination. For \"Operation Successor\" to succeed, however, it was necessary to have a massive provocation. In my view, this provocation was the bombing in September 1999 of the apartment building bombings in Moscow, Buinaksk, and Volgodonsk. In the aftermath of these attacks, which claimed 300 lives, a new war was launched against Chechnya. Putin, the newly appointed prime minister who was put in charge of that war, achieved overnight popularity. Yeltsin resigned early. Putin was elected president and his first act was to guarantee Yeltsin immunity from prosecution.\n\n[Wikipedia](https://en.wikipedia.org/wiki/Russian_apartment_bombings)",
                    "score": 1500,
                    "author": "RUN_MDB",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Christ life in russia is like the maffia",
                            "score": 805,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's been a wild ride ever since the fall of the tsars. Mr Bones' Wild Ride never ends. I don't think the Russians have *ever* known a life without oppression and tyranny. It's really sad.",
                                    "score": 546,
                                    "author": "Therandomfox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And the tsars pogroms weren't exactly a fun time, either.\n\nI've tried before to pick a time when the Russian government was least awful to its people, and I think you have to pick a soviet era.  Maaaaaybe the 20s, maaaaaybe Khrushchev, but probably Glastnost/Parastroika.",
                                            "score": 309,
                                            "author": "FF3",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Only a handful of the tsars were fine (I wouldn't say good).  Seems the majority of the tsars were rat bastards.\n\nhttps://theculturetrip.com/europe/russia/articles/the-good-the-great-and-the-terrible-tsars-and-tsaritsas-of-imperial-russia/",
                                                    "score": 138,
                                                    "author": "Grogosh",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The persistence of serfdom until 1861 is in and of itself a pretty damning indictment I think.  (Keeping in mind of course, that the US only abolished slavery in 1862.)",
                                                            "score": 155,
                                                            "author": "FF3",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You're closer than you know.  Russia hosts a major chunk of global organized crime, in fact.",
                                    "score": 22,
                                    "author": "theothersteve7",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Honestly Russia is referred to as a mafia state because of how it's run. Everyone in power is transactional in their dealings (\"I can do this for you, but what can you do for me?\"). The current power structure is similar to that of a crime organization, where the head guy has a bunch of yes men around him to back them up, and they're enriched by the head guy because of this. But they have to keep being yes men because if they aren't, he could take everything they have in an instant. The police are aused like hit squads, and they even use false flag tactics and messaging that mirrors organized crime almost to a T.",
                                    "score": 18,
                                    "author": "beermit",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Geez. What's insane is how effective Putin's copy-paste strategies are. They're nearly identical for Chechnya, Georgia, and Ukraine. Edit: *and Transnistria, Moldova*\n\nFund separatists who want to align with Russia, generate a \"reason\" to stop \"genocide\", invade, pull region back into Russian arms.\n\nThat's literally what happened in Chechnya looking for independence. Separatists trying to until a major faction \"defected\" to Russia in the 2nd Chechen war.\n\nIt's what happened in Georgia after it declared independence from the USSR. Russia backed separatists until they \"justified\" invasion in 2008 and now two \"breakaway\" regions of Abkhazia and South Ossetia are only recognized as independent countries by Russia and its allies.\n\n\nAnd we all know about Donbass, Luhansk, Crimea and Ukraine.",
                    "score": 554,
                    "author": "freshgeardude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They also do a big campaign of giving everyone dual citizenship with Russian passports. So they can “go in to protect the Russians there”",
                            "score": 194,
                            "author": "Franklin_le_Tanklin",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "If it ain't broke, don't fix it.",
                            "score": 21,
                            "author": "Diels_Alder"
                        },
                        {
                            "level": 2,
                            "comment": "You should make a short YouTube video showing the pattern. People are fascinated right now with this.",
                            "score": 12,
                            "author": "AncientInsults",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This american life just replayed and updated their podcast on this. \n\nhttps://www.thisamericanlife.org/763/the-other-mr-president",
                    "score": 661,
                    "author": "Oclarki",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was just listening on my drive home about an hour ago. Crazy to think they estimate his approval rating to be about 60-65%. I wonder what will come of that in the coming months.",
                            "score": 18,
                            "author": "generaltso78",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"Yeah, just ignore those other three bombs that went off that killed hundreds of people, and that had an identical chemical signature. THIS one, this fourth 'bomb', it was just a test.\"",
                    "score": 186,
                    "author": "Steve_78_OH",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're simply peacekeeping bombs.",
                            "score": 57,
                            "author": "e_j_white",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The apartment building was going to join NATO.",
                                    "score": 52,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's a special military operation to denazify floors 5 thru 8",
                                            "score": 24,
                                            "author": "Top-Fox-3171"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Gennadiy Seleznyov also made an announcement that an apartment building in Volgodonsk was bombed, but it was after a Moscow building was bombed. The Volgodonsk bombing took place 3 days later.\n\nIncident in Russian Parliament\n\nhttps://military-history.fandom.com/wiki/Russian_apartment_bombings",
                    "score": 18,
                    "author": "rythmicbread"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 133,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "That guy has some balls to say all that.",
            "score": 18154,
            "author": "abluetruedream",
            "replies": [
                {
                    "level": 1,
                    "comment": "Putin has already had this guy kidnapped n the past and all his assets in Russia seized. He has better reasons than most to want to see him dead.",
                    "score": 12861,
                    "author": "tetoffens",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And he's still only offering the bounty for Putin's *arrest*. I honestly don't know if I could do that in his shoes.",
                            "score": 4846,
                            "author": "EngineersAnon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Arrest is legal to solicit.",
                                    "score": 3861,
                                    "author": "KickMeElmo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 4374,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's it! Step aside, Comrades. This fucker's havin' hisself an accident.",
                                                    "score": 204,
                                                    "author": "TeopEvol",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He shot himself three times in the back of the head and shoved a fistful of cyanide up his ass while throwing himself down three flights of stairs. Clearly a suicide. Tragic stuff.",
                                                            "score": 50,
                                                            "author": "Tobias_Atwood",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 788,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 573,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 267,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 83,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Days.  Ides of March is coming in 13 of them.",
                                                                    "score": 103,
                                                                    "author": "Hip_HipPopAnonymous",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Hope this will age well",
                                                            "score": 60,
                                                            "author": "DAANFEMA",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I start to think that Russia is in an \"I will *make* it legal\" situation regarding Putin's assassination...",
                                            "score": 613,
                                            "author": "EngineersAnon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh definitely, but I don't believe this guy is in Russia.",
                                                    "score": 251,
                                                    "author": "KickMeElmo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Putin has long arms",
                                                            "score": 145,
                                                            "author": "peekdasneaks",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And more than 2",
                                                                    "score": 87,
                                                                    "author": "YourmomgoestocolIege",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Like that elden ring dude",
                                                                            "score": 95,
                                                                            "author": "THIS_ACC_IS_FOR_FUN",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Or those guys in webs",
                                                                                    "score": 37,
                                                                                    "author": "Boxing_joshing111",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"A $1,000,000 bounty for the arrest of Russian President Vladimir Putin...\"\n\nFor THE ARREST. An outright assassination would be more likely to transpire than his arrest. That is ridiculously unlikely.",
                            "score": 115,
                            "author": "shillyshally",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Usually the ending for most dictators.",
                                    "score": 14,
                                    "author": "Captobvious75",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Historically it would seem that many russian rulers were assassinated by other russian nobles. Threatening their money was a poor move for Putin.",
                    "score": 1493,
                    "author": "vanishplusxzone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Remember the last Czar...",
                            "score": 307,
                            "author": "steveblackimages",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not an expert but I think the last Tsar was the only one really killed by normies. \n\nAs cool as it would be to see a new underclass uprising in Russia I doubt that's what is going to clean up this particular problem.",
                                    "score": 359,
                                    "author": "vanishplusxzone",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He doesn't live in Russia.",
                    "score": 114,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 195,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Million sounds pretty low balling it. Ofc freely you’d be welcomed, worldwide.",
            "score": 8259,
            "author": "MuddyfeetFlowers",
            "replies": [
                {
                    "level": 1,
                    "comment": "With how the ruble is falling, a million USD is becoming a lot more for Russians lol",
                    "score": 3983,
                    "author": "karsh36",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I saw that banks in russia are literally out of US dollars too or are not dispensing them anymore. videos showing there’s no money at all in atms and it was filled with people rushing to get money out!!!",
                            "score": 1306,
                            "author": "404user",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's not surprising at all. On a good day no banks could possibly keep up with a mass withdrawal, let alone of a mass withdrawal of foreign currency. I don't know the ratio but I'm pretty confident that most money is exclusively tracked digitally.",
                                    "score": 585,
                                    "author": "freakers",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If everyone in the USA wanted to pull 50% of their money out in one day, the banks physically couldn't do it, as there isn't enough physical cash to do that nation wide.  It's an interesting situation.",
                                            "score": 403,
                                            "author": "midnightsmith",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "More importantly: most of your money has become assets.\n\nSure there’s the problem of physical money and digital money, but the bank is also simply giving our money away in the form of loans.\n\nIf a bank has $100 mil in accounts, but loaned out $50 mil for home/auto/student loans, they’re going to have a serious problem when everyone is asking for their cash.",
                                                    "score": 271,
                                                    "author": "SharkAttackOmNom",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's just how fractional reserve banking works.  You really don't want to live in a world where banks have to keep all your money in a vault.  It's not a pretty picture.",
                                                            "score": 272,
                                                            "author": "mastapsi",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The \"Gringotts\" banking system",
                                                                    "score": 176,
                                                                    "author": "RagnarokNCC",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What's wrong with it? I have no agenda, I'm curious.",
                                                                    "score": 44,
                                                                    "author": "ScruffyTJanitor",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It means that banks can't lend liquid deposits.  \n\nRight now, banks can lend out 90% of their liquid deposits.  This works because people generally keep their money in banks and maintain some balance.  Since not everyone needs all their money at the same time, the bank just needs to keep enough on hand to satisfy day to day business.  Also, since the bank actually gets value out of holding regular deposits, banking is relatively cheap (generally free for retail banking).\n\nIf you eliminate fractional reserve banking, banks can only lend secured deposits, that is deposits that can't be withdrawn until the term is up, like CDs   That leads to a drastic drop in liquidity.  The only way for banks to lend money is to lock up the money in a security that prevents withdrawal.  That would greatly increase the cost of lending.  Basically really high interest rates.  Additionally, banks get no value out of holding liquid deposits for retail customers, so the general consumer would have to pay for banking.",
                                                                            "score": 146,
                                                                            "author": "mastapsi",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Thanks for this! I was also generally curious so this is a nice explanation.",
                                                                                    "score": 29,
                                                                                    "author": "ADumbSmartPerson",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "107,267,000.00 rubles as of 1030 3/2/22",
                            "score": 244,
                            "author": "Morgrid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The arerage salary in russia is [52K rubles a month](https://www.statista.com/statistics/1010660/russia-average-monthly-nominal-wage/) (as of 2020)    \n   \n1 million USD is roughly 171 years of salary",
                                    "score": 410,
                                    "author": "Oprlt94",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hmmm that would put the equivalent of 7 figures in my pocket and of course would get me thinking...\n\n\nBut I would have no fucking idea how to even begin to plot something like that\n\n\nEdit: I'm a moron who meant 8 figures and clearly wouldn't be capable of handling the planning necessary",
                                            "score": 152,
                                            "author": "julius_sphincter",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; that would put the equivalent of 7 figures in my pocket\n\n$1million *is* 7 figures",
                                                    "score": 63,
                                                    "author": "Chug-Man",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "First, call Leon",
                                                    "score": 50,
                                                    "author": "diffcalculus",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Ask police for directions",
                                                    "score": 13,
                                                    "author": "mildly_amusing_goat",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "For comparison, median US individual annual income is $31k, so $1M USD is 32 years of salary here \n\n\nThis bounty is the equivalent of $5.3 million for the average American",
                                            "score": 55,
                                            "author": "SuperSMT",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not even $500 a month currently. Damn.",
                                            "score": 57,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Pretty much what this Statista site charges for a yearly subscription.",
                                                    "score": 17,
                                                    "author": "yeknom02"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think if I was that rich I would try to have most of my wealth not based in Russia",
                            "score": 27,
                            "author": "mithridateseupator",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think the average yearly salary in Russia was like $9k USD, now it's like $2500 USD. That's about 400 years of average Russian salary.\n\nI know a general or whatever probably makes a lot more. But a million dollars is a lot, especially now.\n\nEdit: Seems like a Russian military officer was making about 50k USD before the war. So that's about 72 years pay for them now.",
                    "score": 239,
                    "author": "SuperBrentendo64",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m genuinely curious about what the quality of life is like for most people in Russia. I honestly have no idea. What’s the cost of living like compared to that salary? What’s the education/housing/healthcare situation?  I’d love to know more about how the average Russian lives.",
                            "score": 100,
                            "author": "Comprehensive-Sea-63",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A lot of people live in their Soviet-era apartments that were provided to them by the State way back when.    Many fell into disrepair by the 1980's and 1990's, but with increasing salaries with the 2000s increase in oil prices, many have been able to refurbish their apartments, build homes out in the country, live relatively nice middle-class lives.   My family has multiple apartments that they've lived in for decades and one that they purchased following the USSR collapse and I feel safe and comfortable when I visit them.   Hot water, electricity, gas, all reliable.  We also have dachas out in the country and my uncle has slowly but surely built a REALLY nice house on his property, it looks like it's worth a ton of money but he just spent a lot of time and effort to gradually build it up over 30 years and it's a great place to visit.\n\nThis is just my experience as an émigré to the USA and I understand many other Russians aren't as fortunate as my family and live in what are essentially hovels that haven't been improved since the 1970's.  Different people live differently.   From my perspective, though, I've always loved visiting Russia: it was always a glimpse into what my life may have been like if I stayed.   I know my uncles and aunts worked very hard for what they've earned, it wasn't given to them, they had to grind away for years through some very turbulent times, this week/past few years included.",
                                    "score": 292,
                                    "author": "SovietSunrise",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you so much for that insight!",
                                            "score": 66,
                                            "author": "Comprehensive-Sea-63",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're welcome.   I spoke with my grandmother yesterday and the biggest takeaway was that we didn't know when we would see each other again.   She's 82, my grandpa's 84.   I hope it will be okay.   I'll be trying to call them a little more often; I usually call them once a month or every other month and I am definitely going to step it up now.   I should've stepped it up a long while ago.   Last time I visited was 2018.   Fucking CoViD is \"nearly over\" and then this happens.   I would have loved to visit sometime soon &amp; now I will have to wait quite a long while.",
                                                    "score": 121,
                                                    "author": "SovietSunrise",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m sorry. That must be really hard for your family to go from the pandemic to a war. I hope your grandparents are well and that you see them again soon.",
                                                            "score": 56,
                                                            "author": "Comprehensive-Sea-63"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I hope your family is doing ok through all this. And I hope their country gets some reasonable leadership quickly.",
                                            "score": 36,
                                            "author": "TwoBirdsEnter",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As a citizen of Russian i want to believe that your words came true really quick. We scared, we have not any possibilities to change something and we don't want this fucking war! I have a relative's in Kharkov, it's horrible to understand that your own compatriots can kill your relatives! The are a million russians who have some relatives in Ukrainian, who now hate us. \nI feel worse than the Germans in 39",
                                                    "score": 62,
                                                    "author": "ButovoSoldiers",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, the Germans weren't related to those they invaded.   Russians are related to Ukrainians, though.    My 23andme says I'm 16% Ukrainian!",
                                                            "score": 22,
                                                            "author": "SovietSunrise",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It sends a message. Although 1M seems low for a world leader",
                    "score": 120,
                    "author": "F4DedProphet42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m upset, one million on my head is disrespect.\n\n\\-\tPutin, probably",
                            "score": 200,
                            "author": "juniorspank",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And proceeds to put a bounty on that guy and history's weirdest pissing contest starts?",
                                    "score": 33,
                                    "author": "kookiemaster"
                                },
                                {
                                    "level": 3,
                                    "comment": "Plot twist, Putin adds an extra anonymous bounty on his own head of 10 million to boost his own ego.",
                                    "score": 65,
                                    "author": "Illfury",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Like how Caesar got kidnapped and told the kidnappers to ask for more in ransom.",
                                            "score": 29,
                                            "author": "gsfgf",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Putin threatens to nuke anyone who puts a bounty on him lower than 10 million USD\"",
                                    "score": 13,
                                    "author": "KingjorritIV"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 218,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 167,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 157,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 168,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 39,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 65,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We could instead raise funds to buy him flowers.",
                                    "score": 35,
                                    "author": "WaterIsGolden",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or lots of sunflower seeds",
                                            "score": 48,
                                            "author": "whatsthelatestnow",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sunflowers specifically",
                                            "score": 28,
                                            "author": "Bjorn2bwilde24",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 26,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A million usd in Russia is enough to retire your entire average Russian household of 3 to live comfortably and possibly even more well off of for at least 3 whole generations assuming you retain that 3 person household and a generation is created roughly every 25-30 years and the average life expectancy (and not generously) is 80...\n\nThat is a fucking giant bounty by Russian General populace standards...",
                            "score": 64,
                            "author": "xXTylonXx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You must have a exaggerated definition of living comfortably then. Definitely more than enough for a family of 3, but not for 3 generations",
                                    "score": 13,
                                    "author": "bighand1",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[dr_evil.gif]",
                    "score": 13,
                    "author": "yhwhx",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Beware the Ides of March.",
            "score": 2925,
            "author": "fattymcassface",
            "replies": [
                {
                    "level": 1,
                    "comment": "Had this very thought yesterday, if Putin destroys their economy the oligarchs will eventually turn on him.",
                    "score": 1273,
                    "author": "dbla08",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And one of them will take his place, problem solved!!",
                            "score": 513,
                            "author": "DicknosePrickGoblin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Aye but most of the oligarchs only care about money and aren't soviet era fossils obsessed with reclaiming their previous glory.",
                                    "score": 669,
                                    "author": "---TheFierceDeity---",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But if one of them takes his place don’t they basically have a never-ending source of ill-gotten money?",
                                            "score": 140,
                                            "author": "BEST_RAPPER_ALIVE",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think they would end up failing cause no oligarch could possibly pull off Putins \"im a strong man, ill lead us to glory\" facade, so the general populace will always be mad",
                                                    "score": 180,
                                                    "author": "---TheFierceDeity---",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not really.  The idea that the oligarchs are the secret power in Russia is an out of date concept that dates from the Yeltsin years, as well as the Western perspective that money grants power.  Putin cowed them with a campaign of seizures, prosecutions and outright murder, based on his assertion that power derives from the willingness and ability to use force.  These days, it's the military and security chiefs that form Putin's constituency.  The oligarchs aren't a worry for him, it's his subordinate and allied warlords.  If people start rioting in the streets and he can't get a police or army unit to crack their skulls, that's when he'll be in trouble.  A gangster soccer team owner isn't going to make him lose sleep.",
                                    "score": 93,
                                    "author": "sw04ca",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fear and violence is a path to power... but people face scary things everyday in exchange for money. If you order people to do something with threats, but someone else bribes them not to, who will they listen to? If they prop you up out of fear, their only reward is more fear. At some point the scales tip.",
                                            "score": 26,
                                            "author": "xeromage"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Hopefully somebody that cares more about getting rich than invading neighbouring countries",
                                    "score": 65,
                                    "author": "Aceofspades25",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm sure most of them have heard the saying Pigs get fat, hogs get slaughtered.",
                                            "score": 34,
                                            "author": "smurfsundermybed",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, the problem with putin is that he doesn’t care about money enough.",
                                    "score": 52,
                                    "author": "spacegamer2000",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because he already has ALL the Russian money. He wants Ukraine’s now.",
                                            "score": 78,
                                            "author": "Im_a_seaturtle",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It is interesting that the recent sanctions while very serious come after many years of Russian economic decline going back at least until 2008.  Ruble to USD dropped to .028 in 2009, .014 in 2015 (Crimea invasion), and .0094 today.  While the sanctions are great Putin has been angering governments and financial institutions around the world since at least 2014.  The graph over time clearly indicates Putin's leadership has done nothing but hurt the Russian economy.  It makes me wonder if these sanctions really matter that much to the regime since it's happened before and they adapt. (Note while the graph fluctuates the Ruble exchange rate has never even come close to returning to the pre 2008 value of .035).",
                            "score": 34,
                            "author": "ZealousidealIncome",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I wonder how russias economy will fair if India nor China choke them off",
                            "score": 21,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seems like they're already doing very poorly. having to keep their stock markets closed to prevent sell-offs and passing decrees making it illegal to sell large quantities will make their assets intolerable to most institutions.",
                                    "score": 51,
                                    "author": "dbla08",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yea I agree. I just hope it’s enough to cause a revolt",
                                            "score": 13,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Et tu Blyat?",
                    "score": 253,
                    "author": "Enlightened-Beaver",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was thinking \"Et tu, Boris\" but yours is funnier.",
                            "score": 69,
                            "author": "_duncan_idaho_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yours is better. Makes more sense.",
                                    "score": 12,
                                    "author": "Poeticyst",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sic semper tyrannis.",
                    "score": 28,
                    "author": "_TheDoctorPotter",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt;Beware the Ides of March.\n\nIf he gets murdered on the 15th, this will absolutely convince me one of the following:  \n\n\n 1- We live in a simulation or weird on-the-nose comedy drama\n\n2 - We truly did  completely fuck up the timeline in 2012 when CERN created a black hole\n\n3 - I'm in a complete hallucination and none of this is real, and presently locked away in a mental ward.",
                    "score": 438,
                    "author": "AssholeRemark",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you arent lucky enough for it to be #3.\n\nSteins;Gate puts money on it being #2\n\npersonally its #1. we are some species version of SIMs, our physics are just the limitations of their programming power much like SIMs are to us.",
                            "score": 167,
                            "author": "terenn_nash",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 520,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even 1 billion world be a huge return on investment, considering the military, humanitarian, and infrastructure aid Ukraine has and will incur.",
                    "score": 162,
                    "author": "thentil"
                },
                {
                    "level": 1,
                    "comment": "Let's start a gofundme!",
                    "score": 98,
                    "author": "ikes",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "One million? Isn't that vending machine money to an oligarch?",
            "score": 480,
            "author": "Claque-2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Last week it was... Now it's worth 106M Ruble at time of writing this. Probably worth even more in a few days.",
                    "score": 231,
                    "author": "UmbraGhost",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Putin is not making many friends these days.\n\nAnd, yes, Russians probably hate him more than anyone else except Ukrainians right now.",
            "score": 639,
            "author": "Speculawyer",
            "replies": [
                {
                    "level": 1,
                    "comment": "It depends on the Russian. He has lots of ride or dies. People are also getting really different messaging there about what’s going on, and don’t know who to blame. All they know for sure is that they’re scared and suffering. Source: I have extended in-laws in Russia",
                    "score": 212,
                    "author": "leahhhhh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, they are being lied to every day on state run media in Russia. And people that protest get arrested.\n\nPutin does indeed have very high ratings in Russia...but it is ignorant manipulated support.  And some folks are going to be learning fast as prices skyrocket and dead sons return to Russia.",
                            "score": 103,
                            "author": "Speculawyer",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1290,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I saw someone mention above that it is legal to solicit arrest. I wonder if someone kills him, will the guy still pay the million?",
                    "score": 190,
                    "author": "Stoo_Pedassol",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "After the arrest, he shot himself twice in the back of his head and then jumped off the building. It counts!",
                            "score": 223,
                            "author": "9fingfing",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And then \"oops\" oh no what happened those security people lost track of him for like 30 seconds and he fucking died that's so crazy oh well",
                    "score": 53,
                    "author": "IneaBlake",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 235,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Can I contribute more?",
            "score": 311,
            "author": "Pingaring",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can throw in a $15 gift card to Subway, too.",
                    "score": 303,
                    "author": "_iron_starKiller",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have a red Robin gift card I got for Christmas 5 years ago. Bottomless fries",
                            "score": 94,
                            "author": "richasalannister",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The discipline to resist bottomless fries for half a decade is astonishing.",
                                    "score": 60,
                                    "author": "Funderwoodsxbox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's probably that he ordered those fries five years ago and they still haven't come. Red Robin service always seems slow as fuck.",
                                            "score": 27,
                                            "author": "_duncan_idaho_",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wonder how lenient gofundme would be for a crowd funded assassination reward...",
                    "score": 38,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Twitter seemed to ignore the terms of service when Trump threatened to nuke North Korea, so maybe there’s a loophole for apocalyptic global politics.",
                            "score": 18,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A crypto bounty where anyone can contribute would reach crazy amounts I bet. Of course, actually paying it to the person or family of the person could be tough.",
            "score": 287,
            "author": "SilverCamaroZ28",
            "replies": [
                {
                    "level": 1,
                    "comment": "This sounds like it could be a black mirror episode. Imagine if this happens and it starts a whole trend of untraceable decentralized crypto bounties on all sorts of public figures. Every politician and CEO would have crowdsourced bounties. Countries would secretly contribute to bounties of the heads of state of their rival countries. You'd also end up with professional bounty hunters who travel the world taking out high profile targets\n\nSoon ordinary people will start using it too. People would put a small bounty on their ex after a breakup. You may secretly contribute $5 to someone's bounty after they're rude to you. If you're a minority in a racist white town all your racist neighbors upset about you moving in will secretly drive your bounty up. Anytime a \"Karen\" goes viral on social media their bounty increases by a million\n\nOfficially, these bounties will be illegal and there will be a lot of public opposition to them. In private, plenty of people will secretly use them, even those that are vocal for their abolishment",
                    "score": 239,
                    "author": "normVectorsNotHate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Black Mirror should hire you.",
                            "score": 56,
                            "author": "thebirdisdead",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Make this a go fund me and I’ll throw in",
            "score": 178,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Looking forward to seeing Putin in cuffs, in the back seat of Dog the Bounty Hunter's Lada Niva.",
            "score": 27,
            "author": "xizrtilhh",
            "replies": []
        },
        {
            "level": 0,
            "comment": "For someone as powerful as Putin is proving to be, doesn’t $1 million just feel insulting? Seems like Dr. Evil came up with this price tag.",
            "score": 24,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I cant help but think that there are a lot more individuals wanting him assassinated at this point, but they are not \"advertising\" it like this. I think this guy just likes the attention.",
            "score": 19,
            "author": "Sauerteig",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Putin is worth more to Russia dead than alive. $1MM USD? That's probably more than what their whole GDP will be worth a few weeks from now.",
            "score": 443,
            "author": "SubjectiveHat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I already posted another comment with some loose math. As of the 30% tank on the ruble over the last 7 days, 1 million USD is still enough to comfortably retire a modest Russian family comfortably for the next 3 generations. The WHOLE family. Like from birth.",
                    "score": 205,
                    "author": "xXTylonXx",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "$1m?  For Putin?  the man has billionaires on retainer...  no-one's gonna hit a target that can outbid their client by a margin of over a thousand times.",
            "score": 18,
            "author": "omnipotentmonkey",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I would be surprised if someone else wasn’t looking for someone to do the same. The easiest way out of this is a new Russian leader",
            "score": 14,
            "author": "Hot_Cook9926",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Personally, I think a lot could be achieved if Pornhub were to convert to a 100% gay Putin deepfake site until Russian forces left Ukraine.",
            "score": 213,
            "author": "whentheworldquiets",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd make it work",
                    "score": 66,
                    "author": "springheeljak89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where is Gorbachov when you need him?",
            "score": 31,
            "author": "Ghost_of_Cain",
            "replies": []
        },
        {
            "level": 0,
            "comment": "this is a good news, let him be paranoid",
            "score": 34,
            "author": "iantot123",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So, when does the comedy adaptation of this story come to theatres? Kind of like Rat Race, but everyone's trying to kill Putin. You could call it Smear Vladimir or Lootin' Putin or something like that",
            "score": 63,
            "author": "Agile-Fruit128",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ruski Business",
                    "score": 30,
                    "author": "meltymcface"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For those who aren't going to read the article, its for his arrest, not his death.\n\nEdit: people saying \"but the poster\", give me a break",
            "score": 112,
            "author": "[deleted]",
            "replies": []
        }
    ]
}