{
    "id": "xxdi75",
    "score": 155520,
    "title": "Biden to pardon all prior federal offenses of simple marijuana possession",
    "author": "nikzyk",
    "date": 1665083463.0,
    "url": "https://www.reddit.com/r/news/comments/xxdi75",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This is supported by nearly 70% of the population. A no brainer. Hopefully they can push it over the finish line. It’s good for the job market, good for gdp, good for tax revenue, good for individuals.\n\n\nEdit: source for my “nearly 70%” claim\n\nhttps://news.gallup.com/poll/356939/support-legal-marijuana-holds-record-high.aspx\n\nEdit 2:  people are confused about the pardons. They aren’t letting people out of federal prisons for weed possession, because people aren’t in prison for weed possession. Peoples records are being cleared of something we are starting to consider not a crime.  Removing it from their record can be super beneficial for them, especially when applying for jobs and nearly anything else where you have to declare criminal history.\nAnd as I mentioned in another comment, The process to legalization is: 1. Pardon people convicted. 2. Reclassification from the Justice Department 3. Legalization.\nWe very well may only get the first two now but it sets the stage for #3 in the future.\n\nEdit 3: Text from the article people are commenting on without reading.\n\n“In the coming days, the office will implement a formal process to provide pardoned individuals with a certificate of pardon, she added.\n\nThe proclamation also formally restored to these individuals all the political, civil, and other rights that were denied to them as felons.\n\n“There are thousands of people who were convicted for marijuana possession who may be denied employment, housing, or educational opportunities as a result,” Biden said. “My pardon will remove this burden on them.””",
            "score": 10823,
            "author": "Losalou52",
            "replies": [
                {
                    "level": 1,
                    "comment": "mfers better not \"both sides\" this going into midterms",
                    "score": 3238,
                    "author": "probablyuntrue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Republicans we’re close to doing it anyway, since it’s so favorable. I’m sure they were just two weeks from revealing their plan to do something similar.”",
                            "score": 1210,
                            "author": "ClassicT4",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Trump was going to legalize.\n\nSeriously. That's what those motherfuckers said. I know people who voted for him because they swore he was going to legalize. I told those people that trump wouldn't dream of doing that and they said I was crazy.",
                                    "score": 324,
                                    "author": "kneel_yung",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They think the guy who made *Jeff Sessions* his Attorney General was going to legalize pot?? Hahahahahahahahaa!!!",
                                            "score": 224,
                                            "author": "itslikewoow",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also appointing Sean Spicer as his press secretary - everyone seems to have forgotten about him swearing to crack down on marijuana on grounds that it is to blame for the uptick in opioid addiciton because....uhm....magic, I guess?",
                                                    "score": 59,
                                                    "author": "Bulmas_Panties",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "this shit makes me so mad. it's well documented what actually caused the opioid epidemic.",
                                                            "score": 25,
                                                            "author": "zasinzoop",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Rap music and comic books",
                                                                    "score": 37,
                                                                    "author": "staykinky",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Don’t forget gta",
                                                                            "score": 18,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meanwhile in Britain, it was reported this week that Tory Police Commissioners want to make cannabis a Class A drug, bringing it in line with cocaine and heroin.\n\nWhat a shitpit we have become.",
            "score": 4326,
            "author": "TheBritWithNoWit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Imagine looking at all the US problems and saying \"yeah I want all those\" and speed-running towards them.",
                    "score": 2352,
                    "author": "bripod",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Naruto-running to reach peak stupid with the least amount of air resistance",
                            "score": 319,
                            "author": "Original_Redman",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Real Talk: How is anybody considering voting Tory anymore? They’ve been in charge over a decade and the UK is markedly worse off than they were beforehand. They deserve a massive drubbing next general electIon.",
                    "score": 83,
                    "author": "ZincLloyd",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It's impressive how wrong she is about everything.",
                    "score": 327,
                    "author": "LandBeforeTimeOnVHS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Within a week, she came within *hours* of collapsing the economy handing out tax breaks to the rich. I'm still struggling to figure out why a lot of people still trust conservatives more with handling the economy.",
                            "score": 240,
                            "author": "itslikewoow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As an American I know nothing specifically about the UK....I assume that it is the same way it is here - they talk about it a great deal and so people conflate the party and the premise.\n\nI think of it like a partner who is really jealous, always accuses you of cheating and is in fact doing the very thing that they are constantly projecting onto you.",
                                    "score": 30,
                                    "author": "bluehands"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Next you’ll abolish the NHS to mirror our nightmare system where an ambulance ride will bankrupt you",
                    "score": 451,
                    "author": "phillyprince9397",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A truly terrifying prospect that's all too possible under our current idiot in charge. \n\nThe NHS isn't perfect but it's still wonderful.",
                            "score": 136,
                            "author": "TheBritWithNoWit",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lmao I can’t wait for hundreds of years down the road when people are WTFing over illegal pot",
                    "score": 28,
                    "author": "nobaseball1919",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That’s an absolutely ludicrous decision in 2022",
                    "score": 15,
                    "author": "Bitemarkz",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 28523,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the big one. It'll finally allow the industry to grow like normal businesses. No more cash-only purchases, no more bans on getting loans.",
                    "score": 12999,
                    "author": "Realtrain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And it will force states that haven't fully adopted it (ahem, Pennsylvania) to finally shit or get off the pot.",
                            "score": 5514,
                            "author": "themeatbridge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Get on* the pot",
                                    "score": 5167,
                                    "author": "gunnie56",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "gettin high and mighty…mostly high!",
                                            "score": 696,
                                            "author": "Ohhhnothing",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It wasn't that long ago that in PA you couldn't buy alcohol on Sunday. and never in a grocery store.",
                                    "score": 823,
                                    "author": "bejammin075",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Aren't they called blue laws or something? I remember growing up in rural PA and everything being closed Sunday. Also if you wanted beer you had to go to a distributor. Super weird but I guess the quakers/religious types had a huge early influence on PA state law.",
                                            "score": 167,
                                            "author": "fusionliberty796",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As a Wisconsinite I'm pretty sure my state would riot with those laws.",
                                                    "score": 22,
                                                    "author": "Embarrassed-Ad2051",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is why I think we are farther away than closer to legal in PA.",
                                            "score": 213,
                                            "author": "Igotshiptodotoday",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Gee, wonder who’s holding things up in PA?  Could it be our gerrymandered state senate majority?  You know, the ones who are too busy writing bills to outlaw our Lt Governor’s cannabis flag from flying in the Capitol to consider any logical weed reform.",
                                    "score": 453,
                                    "author": "PinsAndBeetles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "it will take federal legalization (without \"state's rights\" to be excluded) to make it legal in wisconsin, too. tavern league (lobby group for bars, taverns, nightclubs, etc) is overpowered.",
                                            "score": 134,
                                            "author": "averyfinename",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The big thing is also medical research funding..there's a lot of potential there. But right now it's considered more dangerous than cocaine, and thus to have no medical value... Amazingly.",
                            "score": 1072,
                            "author": "solojones1138",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Forgot what school it is but there is only one college that can legally study it",
                                    "score": 209,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "University of Mississippi is one which is pretty hilarious considering….",
                                            "score": 359,
                                            "author": "mascaraforever",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My father graduated from ole miss and joked about this many times. Proof it was never about research and just about money.",
                                                    "score": 163,
                                                    "author": "NeonWarcry",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "or entirely planned\n\n\"if they study it they'll have better arguments to legalize it, and if we don't let them study it they'll be onto our plans\"\n\n\"what if we only let one of the worst institutions study it so we always have a token to point to when this is brought up, but little or no progress will actually come from it\"",
                                                    "score": 143,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Will it reduce the risk of police stealing all of a dispensary's money under \"civil asset forfiture\"? \n\nhttps://www.marijuanamoment.net/feds-agree-to-return-1-million-in-marijuana-dispensary-cash-seized-from-armored-car-transports/",
                            "score": 667,
                            "author": "macgyvertape",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It would make a whole world of difference for that and just the money handling aspect of it all.\n\nInterstate commerce for the win.",
                                    "score": 387,
                                    "author": "PopcornInMyTeeth",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This is a symptom of forcing dispensaries to be all-cash. The sheriffs involved only had the opportunity to ~~steal~~ seize this cash because dispensaries were banned from accepting cards. For most retail, cards cover like 85% of all transactions. Meaning the few remaining cash transactions can be deposited with normal bank runs like any other store.\n\nSo yeah, should pretty much fix this issue. At least for dispensaries, anyway.",
                                    "score": 240,
                                    "author": "ryecurious",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No more charging owner / operators nearly 70% of one's gross.  That's what 280e did to cannabis operators and continues to do.  \n\n\"They're making millions it's okay.\"  70% of your gross.  You can't even deduct usual business expenses (like payroll / payroll taxes) because it's cannabis and a schedule 1 drug.  Same fees and penalties if you were dealing cocaine.",
                            "score": 179,
                            "author": "donorcycle",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I still think it's crazy that LSD is at the same level as Heroin",
                    "score": 818,
                    "author": "Leonidas49",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In Kansas, marijuana concentrates carry the same punishment a heroin.",
                            "score": 309,
                            "author": "Cloberella",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 111,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Psilocybin is even crazier to me",
                            "score": 390,
                            "author": "PM_ME_GAY_STUF",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, it's absolutely backwards how the scheduling system works. Nonaddictive drugs with no known lethal dosage are in the same category as heroin, but alcohol and tobacco are readily available in stores.",
                                    "score": 310,
                                    "author": "humansubjects",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Since the CSA was passed in 1970-71ish it isn't much of a surprise there wasn't much scientific basis behind some of the scheduling of certain substances. Notably LSD, Cannabis, and Psilocybin were all heavily involved with the hippy counter culture which Nixon hated with a burning passion. I would wager if they could, they would have outlawed alcohol in high amounts due to Alcohol's failed prohibition in the 1920s. As for tobacco in 1971, well that's a story in itself with how big tobacco was paying doctors to publicly say they were manufacturing \"healthy cigarettes\" and the immense lobbying efforts by them.",
                                            "score": 115,
                                            "author": "Special_Function"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If these actually happens this will bring our incarceration rates waaaay down.",
                    "score": 597,
                    "author": "PieMastaSam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How many simple Marijuana possession incarcerations are federal, though? Would this move the needle much?",
                            "score": 357,
                            "author": "teflong",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd hazard a guess as to not that many...but the fact that it's going as far as Merrick Garland to reconsider its scheduling is a massive boulder teetering on the edge of a slope.",
                                    "score": 181,
                                    "author": "OilyResidue3",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Rescheduling is the bigger thing I think but it will depend on what scheduled it gets dropped to.",
                                    "score": 267,
                                    "author": "PieMastaSam",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Perfect, just in time for midterms.\n\nNo more malarky, jack",
                    "score": 333,
                    "author": "DeMayon",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "God, I'm both scared and excited to see how conservatives pearl clutch and spin this objectively good news into a bad one",
                    "score": 1641,
                    "author": "jkbpttrsn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "America’s biggest quack says pot causes school shootings. \n\n\n\nhttps://americanindependent.com/mehmet-oz-gun-violence-recreational-marijuana-covid-school-closures/",
                            "score": 486,
                            "author": "SuggestAPhotoProject",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I cannot wait to see this clown get absolutely demolished come election time. Im not even in PA and im very excited to see fetterman in office.",
                                    "score": 330,
                                    "author": "tokes_4_DE",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly it’s sad that Oz is polling at anything over 10%",
                                            "score": 201,
                                            "author": "AlphaSquad1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Seriously shocking. Fetterman looks and acts like the \"macho\" man republicans all say they love, and then they turn around and support a elite 1% rich snob like oz who wouldnt piss on them if they were on fire. The cognative dissonance is astounding at times. Fetterman should win, but the fact that oz is remaining within 10% of him is just wild.",
                                                    "score": 194,
                                                    "author": "tokes_4_DE",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean they voted for Trump.\n\n\nA fat, spoiled little asshole who never worked a day in his life who grew up in a fancy penthouse in New York City and has gold toilets.",
                                                            "score": 135,
                                                            "author": "LMFN",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It's so frustrating to watch PA Republicans bully Fetterman for wearing sweatshirts. \n\n1. If you're a working-class Republican, wouldn't you embrace Fetterman's laid-back vibe?\n2. Who are you to judge? Oz is an elitist 1% snob who would immediately forget about you as a politician. \n3. It's not like Brunello Cucinelli is producing hunting gear.",
                                                            "score": 110,
                                                            "author": "freethepuffles",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They criticize Fetterman for not making money.\nHe has been in civil service, actually working for Pennsylvania, but if you don’t get a big paycheck it’s not a “real job”.  Volunteer? - Freeloader!\n\nWho cares, vote for the person who is familiar with the lives of everyday citizens of the actual State in question.",
                                                            "score": 18,
                                                            "author": "rckrusekontrol"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The guy is all but anti-vax. Idk if he would say it outloud. But he did say that vaccine mandates caused more deaths from covid. I can’t believe he can practice medicine!!!\n\nbetween not being from PA &amp; the gop’s xenophobia - hopefully this hack will lose with disgrace.",
                                                            "score": 17,
                                                            "author": "Adorable_Raccoon"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There’s going to be a divided a lot of young conservatives smoke the devil’s lettuce. It’s going to be fun to watch.",
                            "score": 780,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lots of my southern ex-classmates were vocal about voting for anyone who legalizes weed. I'll be interested in seeing how they respond to this move from Biden.",
                                    "score": 647,
                                    "author": "Leonidas49",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Considering how carefully groomed media is these days (thanks, social media), it probably will barely be a blip on their radar",
                                            "score": 159,
                                            "author": "piberryboy",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They will change their values immediately.",
                                            "score": 609,
                                            "author": "Fortherebellion72",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Or in my experience, just keep quiet and let the christian conservatives yell the loudest.",
                                                    "score": 349,
                                                    "author": "Leonidas49",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "“Biden lets criminals out of jail to vote for him in midterms “",
                            "score": 561,
                            "author": "GroknikTheGreat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Top comment on a the conservative sub is “this is just buying votes”.",
                                    "score": 413,
                                    "author": "_AnecdotalEvidence_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good policy buys votes.",
                                            "score": 801,
                                            "author": "Simon_Jester88",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "**Exactly**. If any politician is reading this, *please* buy my fucking vote.\n\nWhat’s the alternative? Oh this politician does everything that I dislike, so I’m going to vote for him instead of the candidate that aligns with my ideology?",
                                                    "score": 175,
                                                    "author": "PolicyWonka",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh no, doing what people want so they'll vote for them? That's the entire point of making campaign promises lmao",
                                            "score": 383,
                                            "author": "jump-back-like-33",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How DARE they give the people what they want! That’s illegal!",
                                                    "score": 130,
                                                    "author": "Honor_Bound",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“He’s only doing this to get votes!” \n\nNo shit welcome to politics",
            "score": 4479,
            "author": "SeaTwertle",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah those accusations are always a hoot. \n\nLike okay? And I am going to reward the guy who catered to what I want with votes and hope he does more stuff like this. I'm not going to get mad and not vote for them because of some pointless need to question his motives if he is going to do what I want him to do.",
                    "score": 1455,
                    "author": "Malaix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe if any Republican had a platform they'd get voted too. Instead it's all just hateful shit slinging, seeing what will stick. They literally have no policies they're running on.",
                            "score": 373,
                            "author": "coachz1212",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "they definitely have policies, they just do everything they can to prevent people from knowing about them because they are all very unpopular. then there are thew super secret fascist policies",
                                    "score": 69,
                                    "author": "Coyotesamigo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We could maybe market it as being the first politician smart enough to figure out that representing the people is what they're there for.",
                            "score": 16,
                            "author": "TjW0569"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And the alternative is... oh right, doing the opposite of what the people want.",
                    "score": 538,
                    "author": "xieta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What a crazy concept. Doing the things people actually want will get you more votes!",
                            "score": 131,
                            "author": "Remarkable-Ad-2476"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Literally the entire point of a representative democracy is the politician votes for what the people they represent would vote for.",
                    "score": 278,
                    "author": "Spam4119",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "As though doing the will of the constituents over his own beliefs is a bad thing, right? That's the kind of representation I want.",
                    "score": 224,
                    "author": "whaaatanasshole",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "How dare he *checks notes* do what the people want!",
                    "score": 195,
                    "author": "_____---_-_-_-",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Lol when people say this I'm like\n\n\"Ok and it's working\"",
                    "score": 22,
                    "author": "TheCoolCellPhoneGuy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Actual holy shit moment lol. Fantastic news though, I'm glad Biden is doing this.",
            "score": 9731,
            "author": "Insomonomics",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s weird that there’s actual change for the good lol it’s been bad news for the past 6 years",
                    "score": 3611,
                    "author": "Raqi0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "this and the student loan forgiveness…holy shit am I becoming team Biden?",
                            "score": 3220,
                            "author": "cfsed_98",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "August was the beginning of the Dark Brandon arc. Gotta say, I'm a big fan",
                                    "score": 2358,
                                    "author": "low_me_steelers",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's evolved beyond Dark Brandon and is now Dank Brandon",
                                            "score": 1947,
                                            "author": "TheCrookedKnight",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 163,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Last three months he’s kinda been killin it",
                                    "score": 792,
                                    "author": "Throwupmyhands",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think he was saving all of his good shit for September/October so Democrats look better going into the mid term election.\n\nIt would be politically stupid to do it any other way, but it's annoying waiting 2 years for the president to actually do something decent.",
                                            "score": 756,
                                            "author": "Breepop",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If the reporting is accurate, it sounded like it really took that long to convince him on the student loans. But if that is true, I'm glad he was willing to have an open mind about it. Nowadays if you change your mind for any reason at any time, it's seen as a weakness.",
                                                    "score": 463,
                                                    "author": "trail-g62Bim",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think part of it is also the behind-the-scenes research part of figuring out exactly how much can be done with Executive actions without running into Republicans immediately taking things to the currently incredibly biased Supreme Court to complain about Constitutionality.",
                                                            "score": 45,
                                                            "author": "Oriden"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "While it's the greatest strength",
                                                            "score": 23,
                                                            "author": "illelogical"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You didn’t read through his build back better act very thoroughly. Biden’s been trying to do tremendous work since he stepped into office. Unfortunately our other branches of government often step in our democratic leaders way.",
                                                    "score": 264,
                                                    "author": "misterDAHN",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm going to say it: He's actually been killing it since issuing those 12 executive orders on day 1 of his presidency. Keep in mind he had a world of Trump trash to clean up before he could really start laying down his policies in earnest. That said, Biden has done more for the LGBT community than any president in history, he's reunited families Trump separated (still in progress), he *humanely* dealt with the overcrowding at the texas border facilities that Trump left him, he taught the world a masterclass in how to deal with Russia which essentially neutered a global superpower and enemy nation without a drop of American blood, he handled the covid vaccine rollout like a boss, got everyone free test kits pretty much as needed... the list is a lot longer than I want to type right now. \n\nBiden's been remarkably effective and progressive since taking office.\n\nI actually think when he told those wall street guys, \"nothing will fundamentally change,\" Biden bamboozled them.",
                                            "score": 476,
                                            "author": "Kahzgul",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; I actually think when he told those wall street guys, \"nothing will fundamentally change,\" Biden bamboozled them.\n\nThe context of that quote is missing. He was telling them that he was going to raise their taxes and that they could afford to pay more without it fundamentally changing their lives. It was basically “you can pay more taxes and in your life nothing will fundamentally change.”",
                                                    "score": 149,
                                                    "author": "socialistrob",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I take personal pleasure in using my medical marijuana (legal in my state) rather than opioids for chronic pain. Fuck you, Sackler family.\n\nEdit: this comment blew up, so I wanted to add please vote on this issue. Head over to [the Cannabis Voter Project](https://www.cannabisvoter.info) to see where your lawmakers stand and register to vote.",
            "score": 5970,
            "author": "Beautiful_Fly1672",
            "replies": [
                {
                    "level": 1,
                    "comment": "Imagine all the lives that’ll be saved from people *not* OD’ing on their (or someone else’s) pain meds!",
                    "score": 901,
                    "author": "NemesisErinys",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Holy, I just finished dopesick they portrayed really well how shit the sackler family really is. Btw it’s a must watch! Super Dope mini series (pun intended)",
                    "score": 262,
                    "author": "Gibbydoesit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And if you don't like it, just double the dose and watch it again.",
                            "score": 35,
                            "author": "veriix",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is huge! Hopefully, federal legalization is next",
            "score": 4197,
            "author": "Kamden3",
            "replies": [
                {
                    "level": 1,
                    "comment": "And protections against employment. It makes sense to not allow people under the influence at work but should not matter if people do it in their own free time.",
                    "score": 271,
                    "author": "decomposition_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "California is doing this.",
                            "score": 40,
                            "author": "TrueGlich",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow. Wow. Incredible. \n\nGovernors need to follow his example. End the war on weed.",
            "score": 2960,
            "author": "Dirtybrd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here in WA we have a similar initiative \n\nhttps://www.governor.wa.gov/marijuanajustice",
                    "score": 589,
                    "author": "Doctor_YOOOU",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If they hadn't dropped the charges (got a good lawyer), this woulda been me.\n\nJust praying that it's dropped from the scheduled list finally. Stupid law still prevents federal employees from being able to partake (even if we're not on the job!). \n\nThanks for the link tho.",
                            "score": 262,
                            "author": "KaijLongs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep.  My clearance can be revoked for something legal in my state.",
                                    "score": 59,
                                    "author": "Val_Hallen",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Hell, I'm not a fed employee but regulations mean I can't use and keep my job. And I live in CO",
                                    "score": 32,
                                    "author": "The69BodyProblem",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Being in MA where legalization was passed in 2016 and has been sloooooow af. It's weird that some states are still so hardcore with prohibition. Biggest issue with legal is the crazy high prices and tax that keep the black market going. I could only imagine if beer had a 20% tax on top of it!",
                    "score": 76,
                    "author": "snoogins355",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "End the War on Drugs. Not just on weed. Consumers of hard drugs have no place in jail, what they need is help in getting back to society.",
                    "score": 246,
                    "author": "amar00k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's definitely still progress to be made, but we can and absolutely should celebrate this victory. Imagine how many people are going to feel an immediate impact to better their lives.",
                            "score": 23,
                            "author": "Suyefuji"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Abolishing the statute of limitations for child sexual abuse recently and now this.  With all the ridiculousness in politics recently,  it's almost eerie hearing about government action here in the US that actually attempts to improve upon the lives of the people that live here.",
            "score": 1054,
            "author": "MrSwidgen",
            "replies": [
                {
                    "level": 1,
                    "comment": "The statute of limitations was a bit different because it was an actual bill that passed the legislative branch vs Biden making an executive order. Honestly it's a bit astonishing to me that abolishing the statute of limitations passed the Senate in it's current state...\n\nEither way, fuck yeah Dark Brandon!",
                    "score": 224,
                    "author": "Suyefuji",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The fact that there was ever a statute of limitations for child sexual abuse is extremely concerning. Who the heck was that law protecting.",
                    "score": 124,
                    "author": "tyrandan2",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rescheduling is the buried story line here.  Huge fucking news",
            "score": 257,
            "author": "Noncoldbeef",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dark Brandon now transforming into his next form: Dank Brandon",
            "score": 15868,
            "author": "vita_di_tyra",
            "replies": [
                {
                    "level": 1,
                    "comment": "Puff puff pass that legislation",
                    "score": 6145,
                    "author": "PopcornInMyTeeth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The new Green Deal",
                            "score": 2344,
                            "author": "thesippycup",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Trillion Trees Act II",
                                    "score": 333,
                                    "author": "Matt3989",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Pass the legi to the left hand side...",
                            "score": 208,
                            "author": "Friend_Of_Mr_Cairo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "hopefully soon - Grow Biden",
                    "score": 589,
                    "author": "FearAndLawyering",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then Roe Biden",
                            "score": 179,
                            "author": "jvrcb17",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A vote for blue is a vote for green",
                    "score": 1861,
                    "author": "Squid_Contestant_69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Teal The Election",
                            "score": 971,
                            "author": "istirling01",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A joint operation",
                                    "score": 353,
                                    "author": "__M-E-O-W__",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Perfectly blunt",
                                            "score": 110,
                                            "author": "joe_broke",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We getting more trees thanks to that huge climate bill too!",
                            "score": 97,
                            "author": "YoYoMoMa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "/r/trees loving it",
                                    "score": 54,
                                    "author": "Squid_Contestant_69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "/r/trees and /r/marijuanaentusiasts only share one thing and that is a love of Diamond Joe.",
                                            "score": 68,
                                            "author": "YoYoMoMa",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;The pardons apply only to federal offenders convicted of “simple marijuana possession” as well as those charged in the District of Columbia, but Biden called on governors across the country to follow suit.\n\nAn important sentence. FYI. \n\n*(This comment is not meant as a criticism of Biden, but rather to point out that this was the most Biden could do given the limits of his powers as president.)*",
            "score": 48,
            "author": "Poincare_Confection",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Bidens approval rating is about to get high",
            "score": 204,
            "author": "jlarz56",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is insanely huge news.  This should have happened a long time ago.\n\nWell done, Dark Brandon.  Well done.",
            "score": 1863,
            "author": "mdavis360",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dank Brandon",
                    "score": 459,
                    "author": "Domestic_Kraken",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "People say it's pandering before an election. Welcome to politics. I don't care if it's pandering, as long as it's getting done. Republicans never wanted it and now that Brandon is delivering, they're offended.",
            "score": 700,
            "author": "Jayken",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? The whole point of democratic politics is to vote for people who do stuff you want them to do. Also known as ‘pandering.’ \n\nPander harder daddy!",
                    "score": 280,
                    "author": "Grobenhaufer-mikkel",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Pandering by giving the people what they want is one of the better kinds of pandering",
                    "score": 107,
                    "author": "TheRedGerund",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah, it’s also “delivering on a campaign promise”",
                    "score": 67,
                    "author": "BruceBanning"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fox News: 'BIDEN LETTING DRUG USERS OFF THE HOOK!'",
            "score": 1588,
            "author": "MrGuttFeeling",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lolol the headline is “reefer madness”",
                    "score": 872,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Excuse me, it's:      \n#REEFER MADNESS\n***UP IN SMOKE*:Biden pardoning all prior federal offenses of simple pot possession in *blunt* move**",
                            "score": 407,
                            "author": "404_GravitasNotFound",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "omg, i thought you were joking but nope",
                            "score": 217,
                            "author": "respondstolongpauses",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Republicans in PA are already slamming Fetterman for wanting to do the same thing with those convicted at the state level.\n\n\nSo I truly wouldn't put it past Fox to actually say this.",
                    "score": 123,
                    "author": "gankindustries"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dark Brandon: The Rise of Legal Weed\n\nAt first I thought my vote for President Biden was simply my alternative to another four years of Trump wiping his ass with the Constitution. It is nice having a President who actually wants to use his powers for the good of the country. Go Brandon!",
            "score": 1363,
            "author": "thegeekforever",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let's go Brandon! I like that slogan now. He should run on it.",
                    "score": 174,
                    "author": "Locuralacura",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Someone needs to market a strain of weed with the “I did that” sticker image right on the front of the container.",
                            "score": 154,
                            "author": "SameOldiesSong",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And name it Dank Brandon.",
                                    "score": 70,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's like a rolling start. Sure, it took a while to get things in motion, but when he acts, he acts in a big way. Infrastructure bill, loan forgiveness and now weed pardons.",
                    "score": 280,
                    "author": "shadowgattler",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah! Even here in this thread there are comments about how it took too long, etc., but he can only move as fast as the political machine allows. To those people I say, good things come to those who wait. In the meantime, my next mighty hit will be dedicated to the President who is NOT under numerous State and Federal criminal investigations. Go Dank Brandon!",
                            "score": 119,
                            "author": "thegeekforever",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nobody fucks with a Biden.",
                    "score": 123,
                    "author": "DontGetNEBigIdeas",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Dank Brandon being spoken into existence.",
                    "score": 130,
                    "author": "Brodellsky",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn. Trump could've done that but he didn't.\n\nBiden's approval about to skyrocket.",
            "score": 2097,
            "author": "Ben_Jahmin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like that alone would have secured another term for him.",
                    "score": 896,
                    "author": "Impulse3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Trump had the easiest route to re-election handed to him with the pandemic. All he had to do was acknowledge it was a bad thing and say \"You don't want to change administration during a pandemic. Keep me around so we don't have to transition and risk this getting out of hand.\"\n\nBoom. Would have been a guaranteed re-election. He shot himself in the foot so bad with his insane screaming and conspiracy theories and science denialism. We got very lucky that he was that narcissistic.",
                            "score": 152,
                            "author": "N8CCRG",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup. Really all he had to do was shut the fuck up and let the experts talk but he couldn’t help himself.",
                                    "score": 50,
                                    "author": "Impulse3",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just telling people to wear masks would have won him a 2nd term.",
                            "score": 1027,
                            "author": "KovyJackson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Covid was a golden goose for Trump if he had just said wear a mask and wash your hands and get vaccinated. It would have been a landslide election too and he'd have gone to the grave bragging about how huge the margin was. \n\nHell he could have just said \"were going to trust our experts, follow their recommendations\" and never talked about it otherwise and if it went wrong thrown all the blame on them and it still would have won him the election.",
                                    "score": 721,
                                    "author": "jakk88",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why he didn't sell MAGA masks is beyond me. Would've made a killing, kept his supporters alive and won re-election.",
                                            "score": 534,
                                            "author": "trail-g62Bim",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"Protect yourselves from covid and from the snooping government face id lizard people\"\n\nHe wouldn't have even needed to divert from his platform",
                                                    "score": 131,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Instead, he made a different kind of killing",
                                                    "score": 160,
                                                    "author": "Redpsyclone"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I've thought the same thing. But then again, if Trump was able and willing to do that, then he wouldn't be Trump.",
                                            "score": 55,
                                            "author": "v_a_n_d_e_l_a_y"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He could have even sold MAGA masks. How much of a shit businessman can you be?",
                                            "score": 101,
                                            "author": "Isord",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "💯 \n\nfucking moron could have won in a landslide by being normal’ish and dropped the bag so damn hard",
                                            "score": 56,
                                            "author": "SanDiegoGME",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Biden is on a roll wow",
            "score": 961,
            "author": "PoopDisection",
            "replies": [
                {
                    "level": 1,
                    "comment": "And now he can roll as well",
                    "score": 318,
                    "author": "ChilledDarkness",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "maybe people will actually acknowledge Biden for this one",
            "score": 1091,
            "author": "Kiss_My_Ass_Cheeks",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 296,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Biden out here actually passing progressive legislation in shit. Never in my wildest dreams would I expect that",
                            "score": 111,
                            "author": "lemonpepperlarry",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“The pardons will clear about 6,500 people who were convicted on federal charges of simple possession of marijuana from 1992 to 2021 and thousands more who were convicted of possession in the District of Columbia, officials said”\n\nBeing pardoned 30 years later…. still, a good step",
            "score": 348,
            "author": "kiko64",
            "replies": []
        },
        {
            "level": 0,
            "comment": "*Please please please* legalize it on a federal level. Don't just make it a schedule 4 or some shit. Us folks who take drug tests for federal jobs are sooo tired of not being able to partake, and/or using cleanses/clean pee.",
            "score": 269,
            "author": "KaijLongs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Our national infosec is compromised because our brightest IT minds cannot get federal jobs for this one stupid reason.",
                    "score": 133,
                    "author": "Sporkfoot",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok, a step in the right direction.  Thank you for that Biden!\n\nLove the fact that he is having the schedule 1 classification reviewed by the HoS, HS, and AG. \n\nEnd the insanity, and make it legal already.  Lots of money to be made, I honestly don’t know anyone that is against it (cannabis users and non-cannabis users as well as different political affiliations).\n\nPS - Sorry UK folks given your country is trying to go the opposite direction.  I’m not even sure your government represents you anymore tbh..",
            "score": 143,
            "author": "JustCryptastic",
            "replies": [
                {
                    "level": 1,
                    "comment": "My sister won't talk to me because I smoke weed.  And I'm talking one hit before bed nightly.  She only knows because I told her.",
                    "score": 16,
                    "author": "itsyourgrandma"
                }
            ]
        },
        {
            "level": 0,
            "comment": "45: I'LL PARDON JANUARY 6TH INSURRECTION DOMESTIC TERRORISTS CAUSE I CAN!!!\n\n46: How about we pardon federal sentences on marijuana possession?\n\nThe difference couldn't be more stark",
            "score": 414,
            "author": "burros_n_churros",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, now. Let's be fair. Trump *also* pardoned people like Steve Bannon after he was charged with scamming Trump supporters.",
                    "score": 125,
                    "author": "notkenneth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Trump also pardoned my former employer, Kyle Kimoto, who scammed tens of millions of dollars from poor people.\n\nhttps://www.reviewjournal.com/news/politics-and-government/las-vegas-mans-prison-sentence-commuted-by-trump-2261273/#:~:text=Kimoto%20was%20convicted%20in%20Illinois,didn't%20get%20credit%20cards.",
                            "score": 51,
                            "author": "gointothiscloset",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "45 also pardoned convicted war criminals who tortured and murdered civilians.\n\nIncluding one soldier who was ordered to release a civilian and drive him home. Instead he took him to the desert where he was stripped naked, interrogated and shot dead.",
                    "score": 27,
                    "author": "UtopiaDystopia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Biden has had a really good past 10 months.",
            "score": 168,
            "author": "bigcracker",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm not implying Biden isn't sane, but I can't recall him being this aggressive in politics before.  Seems a great move before the midterms that I did not see coming.",
            "score": 206,
            "author": "cgmcnama",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think he's finally starting to realize what's at stake and that the republican party is a lost cause right now. He's been trying to get them to work with him for years and a few weeks ago there was some news that he had finally realized that they were completely unwilling to work with him on anything. Even for widely supported bipartisan issues, they won't back him because they don't want to give him any wins.",
                    "score": 212,
                    "author": "techmaster242",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Possibly.  I mean the early Dem midterm polling was pretty dire and it seems the \"Dark Brandon\" memes are reflecting his base likes what he is doing.  Dems still have *huge* hurdles for the midterms but recently things are looking up (minus gas prices which are going up again)",
                            "score": 64,
                            "author": "cgmcnama",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Russia and OPEC collabing to raise prices right before midterms to be able to push suppressive propaganda",
                                    "score": 61,
                                    "author": "Mobile_Crates",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, it reeks of political meddling. \n\nRussia and OPEC want the GOP back in power and are willing to risk market share to frackers to make the Dems look bad.\n\nFuck them. Vote Blue.",
                                            "score": 35,
                                            "author": "klartraume",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Biden doing good lately imo. Media's giving him a bad wrap. He's been doing good for people of both sides.",
            "score": 18,
            "author": "wispering_slpr"
        },
        {
            "level": 0,
            "comment": "This is a significant accomplishment for President Biden and can be appreciated by people across party lines",
            "score": 17,
            "author": "hydroninja",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Long overdue.  I finally can feel my vote for Biden was worth more then just getting rid of old Carrot Cock.",
            "score": 238,
            "author": "Orphanpuncher0",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just feel bad for the people in the red states that will not be pardoned.",
            "score": 592,
            "author": "riddlemyfiddle11",
            "replies": [
                {
                    "level": 1,
                    "comment": "If they were only charged on for federal crimes, then this will parden them. But you're right, most people have been convicted on the state level, and even some blue states where it's now legal have been hesitant to pardon prior offenders.",
                    "score": 495,
                    "author": "Realtrain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; and even some blue states where it's now legal have been hesitant to pardon prior offenders.\n\nOne hopes that this would be a clear signal for those governors to follow suit.",
                            "score": 225,
                            "author": "Taysir385",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Him explictly calling on all governors to follow suit, which he did, is also a pretty clear signal for those governors to follow suit.",
                                    "score": 359,
                                    "author": "TheVitulus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "... I should have read the fuckin article.",
                                            "score": 229,
                                            "author": "Taysir385",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Throw it on my tombstone ^",
                                                    "score": 63,
                                                    "author": "Pretendyoureatree",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "for all the shit people are talking about him, I keep reading thing after thing after thing he's doing that helps non-billionaire class people.",
            "score": 147,
            "author": "Shibbystix",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m starting to think the shit talkers have a vested interest in talking shit.",
                    "score": 80,
                    "author": "MFbiFL",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Biden has had a truly incredible 6 months after a pretty disappointing first 1.5 years.",
            "score": 2279,
            "author": "Gamegis",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was charging his ult",
                    "score": 758,
                    "author": "ghostboy2x",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Biden: LET'S BREAK IT DOWN",
                            "score": 129,
                            "author": "Thirdatarian",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He got infrastructure (after a decade+ of debate in Congress) and a huge stimulus bill done within his first year. The stimulus bill dealt with much to do with remaining COVID issues as well as tested a program that led to a halving of the childhood poverty rate due to the monthly IRS checks for those with children.",
                    "score": 455,
                    "author": "insertwittynamethere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;tested a program that led to a halving of the childhood poverty rate due ti the monthly IRS checks for those with children\n\nI'd like to point out that it was a very effective way to reduce child poverty and had no negative impact on the broader economy. 98% of Democrats supported it, but *every single* Republican Senator opposed it, so it failed to get expanded beyond just a covid relief measure. Remember that at the polls this November.\n\nhttps://fivethirtyeight.com/features/congress-found-an-easy-way-to-fix-child-poverty-then-it-walked-away/",
                            "score": 265,
                            "author": "itslikewoow",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One of the most consequential presidencies of the modern age with a 50/50 Senate. \n\nI was not a Biden fan during the primaries but his 2022 has very, very much impressed me.",
                    "score": 1338,
                    "author": "AstreiaTales",
                    "replies": []
                }
            ]
        }
    ]
}