{
    "id": "10rclue",
    "score": 11,
    "title": "Thoughts on city of Sunrise Monopoly, with water Out west ?",
    "author": "Normal-Lock-9301",
    "date": 1675301013.0,
    "url": "https://www.reddit.com/r/Broward/comments/10rclue",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Fort Lauderdale supplies water to Oakland Park, Wilton Manors, Lazy Lake, Port Everglades, and parts of Davie and Tamarac.\n\nIt's not uncommon for cities to buy water from other municipalities.",
            "score": 3,
            "author": "kaptainkaos",
            "replies": [
                {
                    "level": 1,
                    "comment": "And many of the cities near the coast have salt water intrusion, so they must buy water from inland cities, or the county.",
                    "score": 1,
                    "author": "2lovesFL"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you don't like it, you can always dig a well.",
            "score": 0,
            "author": "SaltLifeFtLaud",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao relax,  I’m a sunrise resident, I was just curious as to what other Broward County residents thought",
                    "score": 3,
                    "author": "Normal-Lock-9301"
                },
                {
                    "level": 1,
                    "comment": "Well said\n\nI live in north Broward and we get our water from North Springs since they own the water and the city owns the land\n\nGuess it pays to own the water but like saltlife said, u can always dig a well and get your own water",
                    "score": 1,
                    "author": "crownhimking",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Coral Springs alone has _four_ different water management [districts](https://www.coralsprings.gov/Government/Departments/Public-Works/Water-Districts).",
                            "score": 1,
                            "author": "trbleclef",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your probably right, my area gets it from North Springs.\n\nI didn't find out to I bought property and I was blown away, I never knew water could be owned by a non govt or non individual",
                                    "score": 1,
                                    "author": "crownhimking"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Has anyone dug a well? How can I find information on the process? I’ve seen a map of the county water table but not much on how to go about it. I was looking to add a manual pump to provide a small amount of water for some thirsty fruit trees. Thanks.",
                    "score": 1,
                    "author": "TheAlamoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These people don't have constructive thoughts lmao",
                            "score": 1,
                            "author": "electricgopher42"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow this is interesting. I never realized this was a thing. Messed up.",
            "score": -2,
            "author": "shannonshanoff"
        }
    ]
}