{
    "id": "12kzieg",
    "score": 9,
    "title": "Truck carrying trailer full of cars is hit by train in Florida",
    "author": "GubmintTroll",
    "date": 1681412170.0,
    "url": "https://www.reddit.com/r/Broward/comments/12kzieg",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Why didn't anyone tell Brightline that this was a car carrier stuck on the tracks?",
            "score": 3,
            "author": "TheProfessorO",
            "replies": [
                {
                    "level": 1,
                    "comment": "Too busy recording videos",
                    "score": 5,
                    "author": "GubmintTroll"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Brightline again!!!!!",
            "score": 2,
            "author": "tekmill"
        },
        {
            "level": 0,
            "comment": "At some point human beings have to be accountable for their actions, including those that cause their loss of life.\n\nIn many (most) cases the Florida East Coast (FEC) rail line is older than the municipalities it passes through, and their land is a state easement. They have right over the roads and have been here longer.\n\n**It's us crowding their land, and they are being nice giving permission to the various municipalities to cross roads over it. In case it isn't clear, they don't have too.**\n\nNot even FDOT could force them to in many cases. Only those roadways classified as part of the federal highway system could assert a right to cross, and then FEC could give them air rights and make them (so us, the taxpayers) eat the cost of constructing bridges over their rails if they really wanted to play hard. Neither Ronny nor the State Legislature can usurp their right. It's **that** old and baked into Florida law.",
            "score": 2,
            "author": "architecture13"
        }
    ]
}