{
    "id": "138lmtq",
    "score": 6,
    "title": "Best Vegan/Vegan friendly food recommendations in Broward.",
    "author": "st33z93",
    "date": 1683293020.0,
    "url": "https://www.reddit.com/r/Broward/comments/138lmtq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just moved to Hollywood and I’m trying to find ask the best vegan friendly options to eat nearby. I’m not against fast food recommendations such as Pollo Tropical. I’d just like to know where I could go if I wanted something vegan and didn’t want to cook. I’m aware of C4, Planta Queen, Vennucci Bros. Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "I’m a little more west, but on University there is burgerhive great reviews 100% plant based everything. Also royal India on griffin has some great veggie options.",
            "score": 5,
            "author": "rbuchwald"
        },
        {
            "level": 0,
            "comment": "SoBe Vegan in Ft.Lauderdale is slammin. Also, most Jamaican spots have vegan options - the Rastas call it ital. Rhymes with vital lol",
            "score": 4,
            "author": "suckaduckunion"
        },
        {
            "level": 0,
            "comment": "The Rabbit Hole in Pompano is all vegan has suuuuper yummy food. The 'smoke in the woods' bbq platter is my fave.",
            "score": 3,
            "author": "beemariee"
        },
        {
            "level": 0,
            "comment": "Hummus House in Fort Lauderdale has great vegan food and a nice spot by the water to eat outdoors.",
            "score": 5,
            "author": "sharingmyimages",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree, hummus house is delicious and only a couple of items on their menu aren’t VF. Their shawarma wrap is divine 👌",
                    "score": 1,
                    "author": "Pegylated",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree and am overdue for some of their great food.",
                            "score": 1,
                            "author": "sharingmyimages"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Playa Bowls in Davie",
            "score": 3,
            "author": "Irrelaphant"
        },
        {
            "level": 0,
            "comment": "Sara's on Stirling just east of 441. Great vegetarian kosher spot. Been around forever.",
            "score": 3,
            "author": "onourownhc"
        },
        {
            "level": 0,
            "comment": "el jefe has some good options",
            "score": 3,
            "author": "aurkellie"
        },
        {
            "level": 0,
            "comment": "Plant Pizza hands down.",
            "score": 3,
            "author": "sleep_water_sugar"
        },
        {
            "level": 0,
            "comment": "Rabbit Hole in Pompano!! Also, 10x Vegan in pompano",
            "score": 3,
            "author": "Doublebaconandcheese"
        },
        {
            "level": 0,
            "comment": "Mini pita on 84. I’m a meat eater and I order their koshari, (spelling) every time. You may need to call and ask if they have any left.",
            "score": 3,
            "author": "Sword_In_A_Puddle"
        },
        {
            "level": 0,
            "comment": "Rootz Soul Cafe, Vegan On The Go, Planta Queen on Las Olas, but that one is fancier. I second 10x Vegan. Stephanie's Vegan Bakery is great too. Thai Meal has extensive vegan and vegetarian options",
            "score": 3,
            "author": "PRJoe07"
        },
        {
            "level": 0,
            "comment": "Parlour, vegetarian delights, vegan delights.",
            "score": 2,
            "author": "akcawn"
        },
        {
            "level": 0,
            "comment": "Is green bar still open?",
            "score": 2,
            "author": "beandip111",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m so bummed I just saw they were closed! I’m curious why?",
                    "score": 2,
                    "author": "queenofhearts946",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh man that sucks. Their coconut burger was amazing.",
                            "score": 2,
                            "author": "beandip111"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you all so much for some of these suggestions, please keep them coming. Parlour is a great suggestion, as I’ve been there plenty of times. I didn’t think to look at Jamaican places so that’s great to know.",
            "score": 2,
            "author": "st33z93"
        },
        {
            "level": 0,
            "comment": "You can check out GLO Kitchen (Good Life Organic) in Davie, I think it's right next to the Burger Hive someone else mentioned.",
            "score": 2,
            "author": "CaitCatDeux"
        },
        {
            "level": 0,
            "comment": "C4 eats in downtown Hollywood. Best vegan soul food and fried chicken I’ve ever had. And you get to support a black owned business.",
            "score": 1,
            "author": "asome2012"
        }
    ]
}