{
    "id": "jxxjzm",
    "score": 15,
    "title": "Moving to Broward (Sunrise, FL)",
    "author": "aggrometer",
    "date": 1605906511.0,
    "url": "https://www.reddit.com/r/Broward/comments/jxxjzm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Recently i accepted a position at a company in Sunrise, FL which i believe is a city of broward county. I wont start until August of 2021 but i was wondering if anyone could give me recommendations on places to live and things to do! Im a college student and I currently live in dallas texas. Theres tons of things to do in dallas and surrounding areas but what can i expect to do in and around Sunrise, FL? I would also appreciate any recommendations on places to live for young people starting their career. My plan rn is to rent an airbnb for a month while i get used to the area. Tell me what you like to do! And give me any advice you think i should know! Thanks in advance :)\n\nEdit: i can afford around $1700 a month for rent. As for things i like to do i love being outdoors, night life is fun but i prefer a bar with friends over raging at a club!",
    "comments": [
        {
            "level": 0,
            "comment": "So South Florida is considered a metro area in itself. That includes the three counties of Miami-Dade, Broward, and Palm Beach. In those three counties, you have about 10 million people. So basically anything you would have in Dallas you will have in South Florida. I think Broward has 30+ cities in the county. So you will have an 8-mile drive and go through 6 different cities. The good things are the diversity, the food, the weather, and if you are young there is a lot to do. The bad things are congestion/traffic, some areas are high crime, and the expense. Sunrise is probably the middle of the road. If you are east of Federal (a main road going north to south in Broward) you are going to pay A LOT more. But it will be all fancy shops and palm trees and beach bodies. You will see Ferraris, and Lamborghinis and McClarens so often you will stop noticing them. Also, this is a tourist destination so AirBnBs might be pretty expensive too.",
            "score": 13,
            "author": "dh1971"
        },
        {
            "level": 0,
            "comment": "Depends a lot on your rental/buying price range and what you like to do. Fort Lauderdale will be your main source for things to do. \n\nLiving in Plantation would be very central for you. Close to sunrise and a quick highway access to FTL/Miami/Boca, again depending on what you like to do.\n\nSunrise itself is where the Florida Panthers play hockey and has some great concerts, other than that it’s just a place where people live.",
            "score": 7,
            "author": "BaysidePanthers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Ideally my price range would be around $1700. I can afford more but i want to live well within my means as i start off so i can pay off college student loans faster",
                    "score": 1,
                    "author": "aggrometer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "apartment prices have been falling lately so you can rent easily for that much anywhere outside of Las Olas in Ft. Lauderdale. You can probably find a house to rent, but don't quote me on that.  Or were you looking to buy?",
                            "score": 6,
                            "author": "NotYetGroot"
                        },
                        {
                            "level": 2,
                            "comment": "If you are very social and like going out a lot and eating at nice restaurants, look into Flagler village apartments. This would be like 30 minutes from Sunrise though.\n\nIf you value being close to work, Plantation is probably your best bet. Not really a go-to area there for young people though, so just find a place that fits your needs.",
                            "score": 2,
                            "author": "BaysidePanthers"
                        },
                        {
                            "level": 2,
                            "comment": "It’s pretty homogenous is this area. Your choice won’t have meaning. Just find a nice place in sunrise or similar",
                            "score": 1,
                            "author": "DazzlerPlus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot depends on the type of person you are.\n\nIf you like to go out during the week, live on the east side.\n\nIf you stay in during the week and go out on the weekends, then get a place close to where you work.\n\nSunrise is pretty suburban. Plenty of places to eat or shop, but not really much on the entertainment front. Most of the neighborhoods are quiet. More of a family vibe.\n\nIt's more lively on the east side of the county. More traffic and crime but no worse than any big city.",
            "score": 5,
            "author": "ralanprod"
        },
        {
            "level": 0,
            "comment": "Davie or Plantation would be your best bet. Davie has a small low key night life and Nova where there are a lot of grad students (people your age) and is close enough to sunrise. Plantation is closer but less of a night life but they are building a city walk that might be opening or close to it by the time you're here. Both are about equal distance to downtown FtL which is where the beaches and typical night life are",
            "score": 2,
            "author": "bluntfart420"
        },
        {
            "level": 0,
            "comment": "Based on how close to work and water quality reports, I'd highly recommend Davie. Sunrise/plantation water is just below the gov limit for toxicity.\n\nThat and I'd like to throw in, with that kind of budget you can buy, just be aware of the maintenance fee's if it's a community. No sense in giving your hard earned money to a corporation in exchange for rent.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Being younger you may want to live somewhere further East like Fort Lauderdale or Oakland Park if you want easy access to night life. It’ll be more expensive and you may have a 20-30 minute commute, but it’ll be easy for you to meet people.",
            "score": 1,
            "author": "bcos20",
            "replies": [
                {
                    "level": 1,
                    "comment": "Look to the area north of Broward Blvd. and East of U.S. 1.   It is the spot many young people are moving into.  Do not go for too cheap of rent as the neighborhood is changing towards young people and if the price is too good then it probably would not be a young person's place.  Being you mention working in Sunrise the corridor between Broward and Sunrise should suit you well.  Highly recommend seeing in person before renting.  Like many urban areas the neighborhoods change quick based on a few blocks.  Welcome to paradise.",
                    "score": 1,
                    "author": "PlantationCane"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you mind if I ask which company? I'm guessing it's Magic Leap, Motorola, or Amex.",
            "score": 1,
            "author": "yabrennan"
        },
        {
            "level": 0,
            "comment": "I live in Sunrise for over a decade and i can say the further west you go the safer it is. Dont get me wrong i stay on the east side close to lauderhill  its chill but sometimes things pop off over in lauderhill and spill over sometimes were the ones doing the popping lol. Seriously though anything west of university may fit u, an even further west of pine island is nice an cozy. An as for fun just drive to where u wanna go.",
            "score": 1,
            "author": "danielakasmart"
        },
        {
            "level": 0,
            "comment": "Markham Park bike trails\n\nTreetops Park\n\nGold Marquess Fine Chinese Cuisine \n\nQuiet Waters Park Ski Rixen/Wakeboarding\n\nTo name a few...",
            "score": 1,
            "author": "connoriroc"
        },
        {
            "level": 0,
            "comment": "Check out **[Haulover Beach](https://www.hauloverbeach.org/)**",
            "score": 1,
            "author": "snooshoe"
        },
        {
            "level": 0,
            "comment": "Sunrise is a good family town with decent schools, some good restaurants and a few watering holes but I think you'd like it better on the east side. I lived within stumbling distsnce of downtown Fort Lauderdale for years and I loved it.",
            "score": 1,
            "author": "gaslightindustries"
        },
        {
            "level": 0,
            "comment": "Try to find a place in Broward where the sewage pipes are not rupturing. In case you haven't heard for years Broward elected officials used the money earmarked for infrastructure projects. Fast forward to 2020 and all of Broward including the Sunrise area sewage flows through the street on a regular basis. At last count, there have been 20+ breaks just in 2020. All the fish and the canals and a lot in the ocean wash up, due to the massive amount of pollution. And then as with all the Covid restrictions here, you may want to rethink the move. But if you still decide to come here, I wish you the best and hope you enjoy as well.",
            "score": -2,
            "author": "va2fl954",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second this. Never again will I live in a county ran by democrats. This place is going to hell rather quickly. If it weren't for the opportunity zone, Ft lauderdale would've been more of a dump than it is today.",
                    "score": -1,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}