{
    "id": "kwzf6n",
    "score": 15,
    "title": "Looking for the best boxing gyms in broward",
    "author": "jaystaylv",
    "date": 1610602751.0,
    "url": "https://www.reddit.com/r/Broward/comments/kwzf6n",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve been trying to look for the best boxing gyms around Broward county, preferably—but not\nmandatorily—around Weston or Davie. I’ve tried Flaco’s and The Gym Boxing and Fitness but had issues with both gyms continuously charging my card after telling them to terminate it.\n\nI’m looking more towards a 1 on 1 personal trainer with credentials as opposed to a boxing cardio workout.",
    "comments": [
        {
            "level": 0,
            "comment": "You want a work out or how to fight?\n\n\nhttps://www.caninoskarateandboxingstudio.com/ - best in the business",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just visited them today and signed up for lessons on Monday. So grateful man thanks!",
                    "score": 1,
                    "author": "jaystaylv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Glad I could help! I trained there for many years when I was younger. I need to start up again.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was a member of Dave's Boxing for a while. I think he rebranded to Elite Boxing sometime after I left Broward. But he's the real deal, he's super committed, everyone in his gym is super friendly to both pros and amateurs alike. Whether you want to do it just for fitness or get in the ring, it's was a good experience. I was a powerlifter who wanted some cardio and fun and even though I was the worst boxer in the gym everyone treated me great.",
            "score": 1,
            "author": "Inri137"
        }
    ]
}