{
    "id": "le1dks",
    "score": 30,
    "title": "Hang in there if you are trying to buy a house in Broward (Market is 🔥)",
    "author": "klking08",
    "date": 1612630132.0,
    "url": "https://www.reddit.com/r/Broward/comments/le1dks",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, just a quick post here if you are trying to buy a house in Broward now. I am a local realtor and the market is super competitive. \n\nIt seems as if every house that comes on the market, there are 50 other buyers interested as well. Don't be too hard on the Realtor...it is just the market we are in now. Every buyer is going through the same thing - sending many offers, only to have them rejected. Stick with it and move fast on properties that you like. Know your \"must have\" criteria different from \"optional\" criteria, so you can be decisive.\n\nMy advice if you are planning to by a home in Broward anytime soon is to give yourself a longer time period for the search process and understand the market we are in so your expectations are in line.\n\nGood Luck!",
    "comments": [
        {
            "level": 0,
            "comment": "And finally Parklands overpriced homes are going down!",
            "score": 11,
            "author": "Monica3581",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not sure why I'd want to move to a huge house in BFE with nothing to do though",
                    "score": 10,
                    "author": "trbleclef",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree...and they have zero lot lines. So you’re paying for an overpriced home with your neighbors right there and no privacy. No close shopping or restaurants either. They all have to drive into Coral Springs for anything",
                            "score": 8,
                            "author": "Monica3581"
                        },
                        {
                            "level": 2,
                            "comment": "Keeping up with the Dumb Jones, IMO.",
                            "score": 3,
                            "author": "gramsaran"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah.. went 20k over asking with a va loan in Davie but couldn’t beat a cash buyer who waived appraisal &amp; inspection. Leaving the area.",
            "score": 13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It’s crazy. Every house is sold as soon as it hits the market.",
            "score": 5,
            "author": "TheAlamoo"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "People in condos want more space because of quarantine and people in high tax states such as NY moving here because of wfh and the 2017 tax law",
                    "score": 8,
                    "author": "MasterOfPanic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep. Selling my condo in Broward because of the pandemic.",
                            "score": 4,
                            "author": "TheAlamoo"
                        },
                        {
                            "level": 2,
                            "comment": "I wonder if this means condos in a year or two will see a quicker price increase due the pandemic being in the rear-view",
                            "score": 2,
                            "author": "Mishura"
                        },
                        {
                            "level": 2,
                            "comment": "Yep. Absolutely . This is a great point",
                            "score": 1,
                            "author": "klking08"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep you are right. Individual investors and these large hedge funds have been buying property at scale. When I first got into real estate here 5-6 years ago, I was doing the whole \"flipping\" thing. After we sourced the property and  fixed it up, one of our regular buyers was a hedge fund...and they would overpay in some instances. I think it is also compounded now because many buyers were not able to buy last year and they are also in the market.",
                    "score": 3,
                    "author": "klking08",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think a major factor is that local upsizing is becoming more difficult, which puts pressure on inventory, which puts pressure on pricing.  If someone cannot find a new house to buy, then they cant sell.",
                            "score": 2,
                            "author": "FullStackManiac"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Invitation Homes and American Homes\n\nWow, i had no idea about these companies. I'm going to look into this.",
                    "score": 2,
                    "author": "Gen2Teg"
                },
                {
                    "level": 1,
                    "comment": "In a few years there will be plenty of foreclosures.",
                    "score": 0,
                    "author": "werenotwerthy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Competitive to say the least.  Offers in cash over asking price on nearly every house that seems to come on market.  I couldn't even get in the door to look at a property after it had been listed 2 days prior, as they had already accepted an offer.\n  \nCondos/Townhomes aren't as crazy, but its rough.   I'm in the market now, and patience really is going to have to be the key.\n  \nHere's my question(s) for ya:  Since prices are going for above appraisal, it seems it makes even coming with an offer backed by a mortgage will be difficult (lender wont approve if its too much above appraisal).   Are we due for a correction anytime soon?   How much?   If you're not in a rush, is it better to wait, or get in now?   \"When\" do we expect interest rates to go back up?  Are we expecting any kind of \"uptick/surge\" in inventory anytime soon?\n  \nI'm looking to move before the new school year (so august), so I'm wondering if this is a hopeless endeavor for a regular buyer, and I just need to wait a year, or if things will change in the near(ish) future?\n\nEdit: Realtor I'm working with expects prices to continue to increase over the next 6 months (5% ish), and that interest rates will probably go up at that point.  Beyond that, not expecting any kind of large correction like 2009, but there may be a dip, just not one big enough to wait for.",
            "score": 2,
            "author": "Mishura",
            "replies": [
                {
                    "level": 1,
                    "comment": "In regards to the offers backed by a mortgage. I am seeing sellers asking for buyers to put up additional cash to make up the difference between appraisal and asking price. I am actually working a deal now where the buyer had to do this. So if you don't have that extra cash lying around, it is going to be tough.\n\nI agree with your realtors assessment....I don't think we will see a slowdown right now because I feel many people who wanted to buy last year had to put it off because of the pandemic and they are now just getting back into the market. \n\nI think the earlier you can start the better. Encourage your realtor to send back up offers and follow up, as a lot of these deals fall through and the sellers get desperate.",
                    "score": 2,
                    "author": "klking08",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is pretty much me.   I'm having to \"lower\" my purchase point so I have extra to put down.  And ended up waiting a year due to the pandemic (no point in moving for schools when they weren't open).\n  \nI haven't been doing back ups because so few properties have appealed to me.  And the ones I've wanted to get in on were all \"cash\" offers.   I can't compete with that.  I imagine as we get closer to the new school year, I'll be the one who is \"desperate\".  \n\nBut thanks for the feedback.   At least I know what I'm in for.",
                            "score": 3,
                            "author": "Mishura"
                        },
                        {
                            "level": 2,
                            "comment": "I just watched two properties that I was interested in sell in less than 48 hours and less than 24 hours on the market (over the weekend).  I mean, how can I even?  I can't get a showing that fast.  Are people buying site unseen?",
                            "score": 1,
                            "author": "Mishura",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have heard of a handful of houses sold in Palm Beach/Broward without being shown (photos only).",
                                    "score": 1,
                                    "author": "3R1C"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This has been the market in Arlington VA for years now. When I moved up here, it took me a whole year and 13 lost homes to buy a kind of meh house for 740, lol. With 20k over asking and all contingencies waived with a twenty day closing timeline. I hope it doesn’t get like this down there. I’d like to move back.",
                    "score": 1,
                    "author": "qfrostine_esq"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d suggest you attach an introductory letter to your offers explaining why you would like to buy the home. Hopefully you have a compelling story that may encourage the seller to consider you over the “cash” offer.",
            "score": 2,
            "author": "nycnola"
        },
        {
            "level": 0,
            "comment": "Last October put my place for sale in Tamarac in 3 days I had 15 offers",
            "score": 2,
            "author": "asshat13",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe you my friend. It is a jungle out here.",
                    "score": 2,
                    "author": "klking08"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi Realtor.  Do you think this is the same state wide or just Broward county? Also a Friend wants to buy a condo on the West Coast of Florida but he’s literally open to anywhere from Everglades city  to Pensacola. Should we talk to realtors in each county up the coast? Or are there realtors that would help us search the entire area?  Parameters: under $250k, decent gulf/bay view, efficiency to two bedroom.",
            "score": 1,
            "author": "baskaat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work Dade/ Broward and there is a supply issue in both counties - not enough inventory. I would try to reach out to an agent in the general area of where you are looking.",
                    "score": 2,
                    "author": "klking08"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As  a software engineer and remote worker for foreseeable future, We settle for Royal Palm Beach area. \nWe wanted 2 story, single family home with min 3 bed and good schools nearby.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Bubble about to pop.",
            "score": 1,
            "author": "thegreenman_sofla"
        },
        {
            "level": 0,
            "comment": "My biggest issue has been immoral Real estate agents using me as a backup plan. Baiting me along and lying to me and then selling the house. Already happened to me several times. The last time i went to see a house i wanted to buy i found out the next day it was already under contract long before i went to see it. I was told i would be a backup and he actually called me back after then contract expired and i went and got approved by the bank in 2 days and 15 minutes later he tells my agent the house is sold.",
            "score": 1,
            "author": "Artful_Dodger_1832"
        },
        {
            "level": 0,
            "comment": "SPAM",
            "score": -1,
            "author": "silkeberli"
        }
    ]
}