{
    "id": "ox03kg",
    "score": 4,
    "title": "Broward school teachers! What do you think of your pay in regards to how much work you do?",
    "author": "nutraware79",
    "date": 1627984082.0,
    "url": "https://www.reddit.com/r/Broward/comments/ox03kg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Im joining the district soon, and im not aware of the load of work teachers do . Are teachers paid well?\n\nThank you!",
    "comments": [
        {
            "level": 0,
            "comment": "I have been getting paid on average of $27.21/hour as a flexible substitute. I am working on finishing certification and I believe that the $47,500 base is fair.\n\nWorkload seems to vary but grade level imo",
            "score": 6,
            "author": "HalfEazy"
        },
        {
            "level": 0,
            "comment": "I’m a passionate 10th year teacher. Started in Broward, moved to Duval, then to Austin, TX, then to Orange County and now back to Broward. I love south Florida kids, I love the vibe of the area and I love my job. But Jesus Christ I don’t get paid enough to afford $1800 for a one bedroom somewhere i won’t get stabbed. I am, however, able to make a solid 12k I’m supplemental income by doing clinic work in my field during the fall and summer",
            "score": 4,
            "author": "the_sylince",
            "replies": [
                {
                    "level": 1,
                    "comment": "Loved your comment. What clinic field ? Im in Nutrition.",
                    "score": 2,
                    "author": "nutraware79",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I should mention that in the “clinic” capacity, I mean purely as a professional in ANY field; I’m a band director so it’s all music related 🙃. I get supplements from working band camps and doing band-related independent contractor work as a “clinician”",
                            "score": 3,
                            "author": "the_sylince"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My advice, as a previous BCPS parent, is to run. Florida does not treat their teachers right, BCPS school board has maybe 2 decent reps on it, there is massive corruption, bribery, extortion, and illicit affairs every where you turn. \n\nThe pay is crap, there is very little actually provided to teachers in the way of supplies-PTAs end up funding what they can and teachers pay the rest out of pocket. Most schools don't even supply printer ink anymore, we parents buy it. \n\nJust, run.",
            "score": 5,
            "author": "SnooEagles6283",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nationally, Florida ranks 40th in teacher pay. However, the coat of living in South Florida is one of the highest. Another study stated a person needs to make around $30/hour to afford a one bedroom apartment in South Florida. So, the current starting salary for teachers in Broward cannot afford a one bedroom apartment. Teachers in Virginia make, on average, 30% more pay and have a comparable cost of living. \n\nTl;dr: Just, run.",
                    "score": 5,
                    "author": "Losaj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "so basically run from Florida in general, if $30/hr is not enough... minimum wage is $8.65.",
                            "score": 5,
                            "author": "VerySlump"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "While it's unfortunate, WHERE are teachers paid well? I can't imagine you became a teacher for $$",
            "score": 1,
            "author": "Recruiter_954",
            "replies": [
                {
                    "level": 1,
                    "comment": "Every teacher should care about the money. It’s a job. If you don’t care about the money, you are letting your fellow teachers and your students down",
                    "score": 7,
                    "author": "DazzlerPlus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course, we have to pay our bills and live. My point though is that when someone decides to become a teacher, they know in comparison to many, many other professions, they won't be making as much.",
                            "score": 4,
                            "author": "Recruiter_954",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But they still need to work to maximize it. Our first duty is to improve the system and conditions, then we can concern ourselves with our individual practice.\n\nMartyrs who 'do it for the kids' are most unfit.",
                                    "score": 4,
                                    "author": "DazzlerPlus"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "DC, Maryland, Virginia, Pennsylvania, Vermont...",
                    "score": 4,
                    "author": "Losaj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My ex-wife is a teacher in Md, but her county requires a Masters degree and what she get's paid, I wouldn't consider being \"paid well\". Especially considering where she lives. \n\nIs that the same in DC, VA, PA and VT that they require a masters?",
                            "score": 3,
                            "author": "Recruiter_954",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most states require a Master's degree or a bachelor's of education for elementary. Most prefer a content bachelor's and require an additional 15 credits in educational classes.\n\nEdit: I agree the pay isn't \"well\" but it's significantly higher than other areas for teaching.",
                                    "score": 2,
                                    "author": "Losaj",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Understood. Those are also HCOL areas...at least in DC, VA and MD. Especially in the DC metro area.",
                                            "score": 2,
                                            "author": "Recruiter_954",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They are, but they are also comparable to South Florida (where teachers make significantly less).",
                                                    "score": 1,
                                                    "author": "Losaj"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Over $32 an hour is not so bad",
                    "score": 1,
                    "author": "HalfEazy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "$32/hour ISN'T bad, but you only make that 9 months a year. If you extend the pay to the full year, teachers (who require a master's degree) only make $27/hour.",
                            "score": 3,
                            "author": "Losaj",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just worked a month and a half over summer at $41/hour. $32/hour is a good rate no matter how you spin it",
                                    "score": 3,
                                    "author": "HalfEazy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thats what Broward teachers make? That number is surprising. Are they paid that through the summer as well? Or is calculating like below not the right formula?\n\n$32 Hourly x 40/week @ 52 weeks = $66.5k annually.",
                            "score": 0,
                            "author": "Recruiter_954",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's not the right formula. $47,500 is for 192, might be 196, work days in the year.\n\nThey have the option to extend their checks through the entire year",
                                    "score": 1,
                                    "author": "HalfEazy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Understood, thank you. I know everyone's situation is different, but that just seems like robbery.",
                                            "score": 2,
                                            "author": "Recruiter_954",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What seems like robbery?",
                                                    "score": 1,
                                                    "author": "HalfEazy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "$47.5k/ year for teachers.",
                                                            "score": 3,
                                                            "author": "Recruiter_954",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I agree, but it's up to the individual. I just worked a summer school program for 6 weeks and averaged over $41/hour.\n\nMade an extra $4,000.\n\nAll I need to do now is establish a tutoring program during the year and I could prob break $60,000.\n\n$47,500 is for 196 work days, that leaves a few months of no work",
                                                                    "score": 2,
                                                                    "author": "HalfEazy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "How’d you become a sub?",
                                                                            "score": 1,
                                                                            "author": "VerySlump"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The real plum of the job is having summers off",
            "score": 1,
            "author": "jf7fsu"
        }
    ]
}