{
    "id": "s1x33x",
    "score": 2,
    "title": "Food subscription service?",
    "author": "Fossi1",
    "date": 1641961179.0,
    "url": "https://www.reddit.com/r/Broward/comments/s1x33x",
    "media_urls": [],
    "other_urls": [],
    "postText": "I live in an efficiency with no kitchen, just a fridge and microwave. I usually buy food on Uber eats and pick it up, but all the prices are rising. Wondering if anyone knows of any food subscription service? I live in Davie. Preferably not like the ones you store in a fridge and microwave. When i lived in miami there was a food sub service which would deliver lunches and it ended up being like 5$ per lunch.",
    "comments": [
        {
            "level": 0,
            "comment": "Find yourself a Broil King CSR-3TB hot plate, its a legit stove top replacement. Cheaper, cast iron topped hotplates work too, but they take a lot longer to heat up. \n\nWalmart has a set of stainless steel cookware (that will last forever) for less than $25. https://www.walmart.com/ip/Mainstays-Stainless-Steel-10-Piece-Kitchen-Set/50660024\n\nGo around to different Goodwills for plates, bowls and flatware. \n\nSeconding /u/sendcreampies on getting a crock pot. That's another thing you can pick up at goodwill. I'd also recommend an electric kettle for ramen and a rice cooker.",
            "score": 5,
            "author": "glitter_frenge"
        },
        {
            "level": 0,
            "comment": "Get an air fryer",
            "score": 3,
            "author": "VerySlump"
        },
        {
            "level": 0,
            "comment": "Get a mini fridge and live off of Soylent. \n\nGet a microwave and eat ramen. After the third day you’ll be over it and you’ll forget that you were ever hungry. \n\nGet a hot plate or crock pot and make enough stew to feed half the neighborhood.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Try : https://instagram.com/powerupmealss?utm_medium=copy_link",
            "score": 0,
            "author": "fuha_storage1"
        }
    ]
}