{
    "id": "tgf7lq",
    "score": 43,
    "title": "Home of Republican who crafted Florida’s ‘Don’t Say Gay’ bill is destroyed by tornado",
    "author": "OrangeVapor",
    "date": 1647537398.0,
    "url": "https://www.reddit.com/r/Broward/comments/tgf7lq",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "No worries, he'll pull himself up by his bootstraps.",
            "score": 6,
            "author": "boththingsandideas"
        },
        {
            "level": 0,
            "comment": "His house took damage, wasn't destroyed. If you read the article, you'd know this is sensationalized garbage.",
            "score": 5,
            "author": "SaltLifeFtLaud",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like most of the media \"news\" out there.",
                    "score": 1,
                    "author": "Relative_Web_2763"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He made God mad 😅",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Good. Why should he feel safe or comfortable?",
            "score": 7,
            "author": "AWildMattAppeared"
        },
        {
            "level": 0,
            "comment": "Let me guess. He doesn’t live in Broward?",
            "score": 2,
            "author": "tekmill"
        },
        {
            "level": 0,
            "comment": "God has spoken",
            "score": 2,
            "author": "Glytterain"
        },
        {
            "level": 0,
            "comment": "Good.",
            "score": 1,
            "author": "oddlyaware"
        },
        {
            "level": 0,
            "comment": "Huh, turns out being a prayer warrior does work afterall.",
            "score": 2,
            "author": "B_Hound"
        },
        {
            "level": 0,
            "comment": "Disgusting comments. Every single one of you that says good is a piece of shit.",
            "score": -10,
            "author": "Shnitzel418",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fantastic",
                    "score": 7,
                    "author": "westville_kzn"
                },
                {
                    "level": 1,
                    "comment": "Love it",
                    "score": 3,
                    "author": "SoySenorChevere"
                },
                {
                    "level": 1,
                    "comment": "So what do say to God for sending this tornado to this douche bag’s house? I mean the comments are just words. Are you butt hurt?",
                    "score": 1,
                    "author": "Recruiter_954",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Saying good to a tornado wrecking a town and a family’s home is twisted evil shit. \n\nI’m not butthurt. It seems those wishing death and destruction are. Like I said: all pieces of shit. \n\nFuck y’all and your downvotes. I couldn’t care less. There ain’t that many of you twisted assholes anyway. \n\nOh. And let’s go Brandon.",
                            "score": -1,
                            "author": "Shnitzel418",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay loser!!!!! And that Brandon stuff? You people can't even make an insult right. And the best part, all the loser, racist, republicans think its great. No wonder that orange clown \"loves the poorly educated\". Ya'll make that idiot feel smart!!",
                                    "score": 2,
                                    "author": "Recruiter_954",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Muahhahahaaa. Suck it.",
                                            "score": -1,
                                            "author": "Shnitzel418",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What a clown lover you are! And btw, you never answered my question about your feelings for God sending that tornado that douche bag's house? C'mon...ya'll \"Christians\" are the antithesis of WWJCD? Sucha  joke...and here you are making yourself out to be an even bigger joke.",
                                                    "score": 1,
                                                    "author": "Recruiter_954",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m not a Christian. \nI’ll wait while you find another religion to display your narrow-minded leftist bigotry at.",
                                                            "score": -1,
                                                            "author": "Shnitzel418",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So you're a liar too and you come from the 1950's. You see, we have advanced way beyond you...loser. I bet you follow all that conspiracy shit, worship tucker carlson and jerk off to desantis... Bigotry...funny coming out of someone like you. It's almost like when you losers try to use science in a discussion, HYSTERICAL!",
                                                                    "score": 1,
                                                                    "author": "Recruiter_954",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Who is we?  The 12 people who downvoted me and your bff? \n\nTucker Carlson is the highest rated prime time news show on TV for many years now. Oddly enough, I barely watch him. Now DeSantis on the other hand, I respect and will vote for again. \n\nFor the delicious topping I’ll also have you know that Trump won. And will win again, too. \n\nLet’s see that TDS.",
                                                                            "score": 3,
                                                                            "author": "Shnitzel418",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I see…so now we know. “Trump won”…wow, the reality really has left you. Surprised you weren’t in DC on 1/6/21 and the fact that you pulled your semi over to talk to me while stuck in DC traffic is flattering. Now fuck off loser, don’t you have some lies to spread?",
                                                                                    "score": 0,
                                                                                    "author": "Recruiter_954",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fake news with koolaid for the masses.",
            "score": 0,
            "author": "skipperscruise"
        }
    ]
}