{
    "id": "uxreq0",
    "score": 0,
    "title": "DINO Anika Omphroy is running vs. Sheila Cherfilus-McCormick and Dale Holness in the 8/23/22 primary",
    "author": "snooshoe",
    "date": 1653513557.0,
    "url": "https://www.reddit.com/r/Broward/comments/uxreq0",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "“Omphroy said in a 2021 interview she was representing the views of her district, which is conservative, and she described as having “tons of churches.”\n“What is wrong with working across the aisle about issues you really believe in?” she asked. “President Biden talks about it all the time. We have to work across the aisle. We have to talk to people across the aisle. You want me to just go in there and be a puppet of somebody else? I got elected to office to represent my district, not to be a mimic of every other Democrat or every other Republican.””\n\nSeems like you D’s can learn something from this woman.",
            "score": 0,
            "author": "Shnitzel418",
            "replies": [
                {
                    "level": 1,
                    "comment": " This is Alcee Hastings' district.  Absolutely not \"conservative\" at all.  Omphroy is delusional.   \n   \n&gt; *Democrats in Tallahassee have viewed Omphroy warily, after she started building a record that included voting with Republicans on controversial measures, such as a 2020 bill to require parental consent for minors to have abortions.*",
                    "score": 0,
                    "author": "snooshoe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This district belongs to the voters. Not to any one person. \n\nWe want common sense people who represent the people. Not woke policies. \n\nBest of luck at the polls this year! ;)",
                            "score": -1,
                            "author": "Shnitzel418"
                        }
                    ]
                }
            ]
        }
    ]
}