{
    "id": "y9a8ug",
    "score": 39,
    "title": "After Parkland shooting, Rubio vowed to support law raising minimum age to buy assault-style rifle. Now he opposes it.",
    "author": "TurretLauncher",
    "date": 1666300617.0,
    "url": "https://www.reddit.com/r/Broward/comments/y9a8ug",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Who would have guessed that Marco Rubio would be a lying ass hypocrite?",
            "score": 13,
            "author": "HaekelHex"
        },
        {
            "level": 0,
            "comment": "Is anyone actually surprised by this? Bait and switch is classic Rubio.",
            "score": 3,
            "author": "beffaffy"
        },
        {
            "level": 0,
            "comment": "Same paywall as when I tried looking anything up to vote about, so I just filled in the bubbles and mailed it in.\n\nWe'll see if it's counted, not that it matters either way.",
            "score": -3,
            "author": "SaltLifeFtLaud",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would recommend considering subscribing to Sun Sentinel as they have lots of great local coverage. \nYou can [register for ballot trax](https://www.browardvotes.gov/Voter-Information/BallotTrax) to follow and verify that your ballot is counted.\nYour vote counts. The census, redistricting, laws being passed around voting and all of the discussion around voting is because your vote matters. You aren't the only voter and your preferred candidate may not be elected.",
                    "score": 1,
                    "author": "ryanvgates",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "On principle, the very least a local paper should do, is have the voting info not behind a paywall because not only those who can afford a subscription should have access to it. \nI received an email my ballot was received, maybe next time I'll get be more informed on ballot issues and judges. I found Gary Farmer's Twitter account, he's anything but impartial. I wouldn't want to stand before him for anything, not to be judged or behind him in line at the grocery store.",
                            "score": 1,
                            "author": "SaltLifeFtLaud"
                        }
                    ]
                }
            ]
        }
    ]
}