{
    "id": "11847gt",
    "score": 144,
    "title": "To the kid who blasts videos in silent section of library as a “prank”, if brain cells were for sale, i would buy atleast 2 for you, cause you clearly lack any.",
    "author": "Real_Bird_Person",
    "date": 1676988338.0,
    "url": "https://www.reddit.com/r/Concordia/comments/11847gt",
    "media_urls": [],
    "other_urls": [],
    "postText": "- link of his YT vid in comment -\nYour pranks are not funny at all. Pulling a shitty prank that is far from funny in silent section of the fucking library. Why cant you do it in another place?\nYou’re a cunt who value internet points more than other peoples time. For some students it take more than an hour to get to library. Its not cool. Be mindful of others.",
    "comments": [
        {
            "level": 0,
            "comment": "I swear, If I see him, I will report to Security.",
            "score": 47,
            "author": "Major_In_Coolness99",
            "replies": [
                {
                    "level": 1,
                    "comment": "At this point, I'd be surprised if people haven't already",
                    "score": 7,
                    "author": "Maixell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This guy is actual cancer.",
            "score": 34,
            "author": "biglacunaire"
        },
        {
            "level": 0,
            "comment": "the comments on his videos kinda piss me off.\nit’s a cult of people egging him on with their “matrix” and whatnot. one commenter said to leave the quiet section of the library alone, to which another commenter replied along the lines of “it’s full of tampons and someone has to rattle their cages”",
            "score": 32,
            "author": "_MasterMagi_"
        },
        {
            "level": 0,
            "comment": "Concordia Campus Security phone number: 514-848-3717, ext. 2  \n\n\nConcordia Campus Security email: security@concordia.ca",
            "score": 23,
            "author": "JohnGamestopJr",
            "replies": [
                {
                    "level": 1,
                    "comment": "pretty sure any of the [library admin staff](https://library.concordia.ca/about/staff/administration.php) would be happy to hear about this. they can also be reached through [their contact form](https://library.concordia.ca/help/questions/email.php).",
                    "score": 3,
                    "author": "thetalkingaccount"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Throw hands at this mf",
            "score": 19,
            "author": "THEBOAW1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jajajaj",
                    "score": 2,
                    "author": "Pollo_picante"
                },
                {
                    "level": 1,
                    "comment": "Ngl you prob will get your ass handed to you, but the effort is what counts",
                    "score": -1,
                    "author": "Chance_Pressure_2595"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Andrew Tate fans are basically lobotomites so they can’t really understand basic decency. You need to  call security and ban them for life.",
            "score": 35,
            "author": "Barggen3107",
            "replies": [
                {
                    "level": 1,
                    "comment": "As an andrew tate fan, we do not claim this clown",
                    "score": -13,
                    "author": "Ghostfacekillerz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are still yet a clown.",
                            "score": 1,
                            "author": "AboveGaryLeeIsFake"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This doesn't seem like a prank. It doesn't seem the guy is even trying to be funny. I think he is just spreading his message and thinking he's so cool or something.",
            "score": 10,
            "author": "Maixell"
        },
        {
            "level": 0,
            "comment": "The guy’s TikTok is sort of sad. It’s mainly him interviewing bikini chicks, trying to convince his viewers (and himself) that he has game.\n\nI sorta doubt he’s even a student; probably just a troll who realizes how pisspoor Concordia security is.",
            "score": 11,
            "author": "Chutzpah2"
        },
        {
            "level": 0,
            "comment": "Don't link his videos; you're giving him the views he wants.\n\nJust report him to the school with his stupid youtube channel and that's it",
            "score": 9,
            "author": "this-is-fine---"
        },
        {
            "level": 0,
            "comment": "His videos are nothing but acting obnoxious and taking advantage of the niceness of the general public. No one wants to confront/argue where they come to study. We pay 9000 god damned dollars per semester to be here this is just disrespectful.",
            "score": 7,
            "author": "SpookyIndian",
            "replies": [
                {
                    "level": 1,
                    "comment": "I haven't been to the library in a while, but this kinda ish makes me so angry, I really wish I were there. He wants to get a reaction out of people, so I REALLY want to just walk up to him, close his laptop shut and walk away with it. Can't keep posting videos if he gets humiliated.",
                    "score": 1,
                    "author": "whothisthough"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My boy really saw plainpotatoess and thought, yes, that is a role model",
            "score": 5,
            "author": "oktygn"
        },
        {
            "level": 0,
            "comment": "wtf, it's not a prank? It's just playing volume super loud and disturbing people. Where's the prank?",
            "score": 3,
            "author": "Dont_Hurt_Me_Mommy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Facts, but still, look at the likes and the views, people are really bored, there’s higher quality stuff",
                    "score": 2,
                    "author": "Pollo_picante"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the only person who thinks in this reddit. I really think you should get in there and look for this person to make justice. Please help Concordia",
                    "score": 6,
                    "author": "Pollo_picante"
                },
                {
                    "level": 1,
                    "comment": "10000% I'm dreaming of just going up to him, slamming his laptop shut and walking away with it. I'm too small to fight but it's the second best thing one could do to deal with this idiot.",
                    "score": 4,
                    "author": "whothisthough"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"its just a prank bro\" , will be the last lines of sum of those youtubers who havenot understood those 'prank video' are staged ...",
            "score": 3,
            "author": "PhilosopherOk9582"
        },
        {
            "level": 0,
            "comment": "If you ever find yourself in a situation where someone is disturbing the environment, stand up and do something about it. Don't wait for others like the non-existent security or complaining on Reddit. Take matters into your own hand ...",
            "score": 20,
            "author": "Brodszkovich",
            "replies": [
                {
                    "level": 1,
                    "comment": "If someone is disturbing my peace, i certainly do. Those who know me, knows this about me.\nThis kid in particular is because of his videos i saw.",
                    "score": 17,
                    "author": "Real_Bird_Person",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good to know that you'd take the action because a lot of people here are too chronically online and would immediately deflect and complain about others telling them to stand up for themselves lmao",
                            "score": 9,
                            "author": "Brodszkovich",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I guarantee turning that twat into a human punching ball would immediately result in legal action sadly...",
                                    "score": 2,
                                    "author": "Overall_Addendum_612"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But if you watch this kids videos several people do stand up and say something. He doesn’t give a fuck.",
                    "score": 11,
                    "author": "igorek_brrro"
                },
                {
                    "level": 1,
                    "comment": "found you",
                    "score": 3,
                    "author": "ribbitfrog290",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmaooo",
                            "score": 2,
                            "author": "Marethryu12"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s probably one of the biggest lessons university taught me.",
                    "score": 2,
                    "author": "Proud_Information_95"
                }
            ]
        },
        {
            "level": 0,
            "comment": "he's not allowed to bring his sparkling wo-er in the library either",
            "score": 4,
            "author": "Tuggerfub"
        },
        {
            "level": 0,
            "comment": "Someone posted about this yesterday, i guess he’s at it daily… im currently in the library and thankfully no sightings.",
            "score": 2,
            "author": "vinaigrettesalad666"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dawg the dudes annoying but he's harmless, it's never that deep.",
                    "score": 1,
                    "author": "bob_man47",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;This is the only person who thinks in this reddit. I really think you should get in there and look for this person to make justice. Please help Concordia\n\nI think the students studying in the library for midterms wouldn't think that this person is being harmless",
                            "score": 0,
                            "author": "AlternativeGoat2724",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The guy above u was talking about punching the dude. It's an annoying prank, but not annoying enough to put ur hands on someone. Unless the dude is throwing books on u or some shit, then for sure kick his ass. But else just go report him or confront him.",
                                    "score": 3,
                                    "author": "bob_man47"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh, is it the guy who made tiktoks where he plays music super loud in the webster library and then films people for their reactions?",
            "score": 1,
            "author": "norimin"
        },
        {
            "level": 0,
            "comment": "It's mind blowing to think that we live in a world where some people have legitimate reasons (views/likes/etc) to show that the world would be a better place without them.",
            "score": 1,
            "author": "DanMcSharp"
        },
        {
            "level": 0,
            "comment": "Vandalism is not a prank. Sound vandalism also counts. Concentration is hard enough as it it, especially for individuals with learning difficulties.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Man the videos comment sections is so fucking sad",
            "score": 1,
            "author": "Spuigles"
        },
        {
            "level": 0,
            "comment": "Dm link pls i wanna see",
            "score": -2,
            "author": "Maximum-Stranger6975"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -16,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -31,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "dont give him promo",
                    "score": 20,
                    "author": "Whowhatwhereidk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok thanks",
                            "score": 1,
                            "author": "Real_Bird_Person"
                        }
                    ]
                }
            ]
        }
    ]
}