{
    "id": "13u3fzu",
    "score": 0,
    "title": "Requirements for Software Engineering?",
    "author": "ANONHANDSOME",
    "date": 1685288545.0,
    "url": "https://www.reddit.com/r/Concordia/comments/13u3fzu",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have my sec 5 high math, physics, and chemistry. I\\`m in a 3 year programming program  in a famous english cegep, where I have an R score of 26. What else do I need to work on to get into software engineering? Many thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Get you’re R score up, you at least need to be at 28",
            "score": 8,
            "author": "The_Bloomkvist"
        },
        {
            "level": 0,
            "comment": "Google software engineering Concordia, click the first link and go to admission criteria.",
            "score": 3,
            "author": "bob_man47"
        },
        {
            "level": 0,
            "comment": "Rip Reddit",
            "score": 5,
            "author": "HugelyOvercooked",
            "replies": [
                {
                    "level": 1,
                    "comment": "Vanier, I just didnt want to dox myself haha",
                    "score": 3,
                    "author": "ANONHANDSOME"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d recommended at least doing cal 1, 2 and linear as it allows you to take almost any course you need for your degree, except the EE course they make you take. If you can take a physics course or two after those three math courses, that could be good too. I’m also in a three year comp sci program and heard ppl with about your r score get accepted even without the math courses. I thought the competition was fierce for SOEN but ig it’s not.",
            "score": 1,
            "author": "Apart-Plankton9951"
        },
        {
            "level": 0,
            "comment": "you could get into another program and then switch, or bring your R score up",
            "score": 1,
            "author": "Green_Ad_2805"
        },
        {
            "level": 0,
            "comment": "I think you need cal 1,2 and linear, also you need electricity and magnetism, plus mechanics, plus general chemistry this is the criteria for all gina cody programs. If not, you can apply to ETS they don't require cegep math and physics.",
            "score": 1,
            "author": "New_Bat_9086",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actually, yes they do require it. Any engineering program that has the accreditation for engineers have the same prerequisites. That student needs math, chemistry and physics.",
                    "score": 2,
                    "author": "Status-Rhubarb1221"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re almost graduating, simply register for a certificate or if you can, pick computer science (doesn’t need physics or chemistry). Then, if you want too, you can transfer but honestly not worth it. Cs &gt; soen. Less years in school and same job, no permit to pay each year and better salary (no scale to respect for your salary) so it can go up quickly. However, you absolutely need cal 1,2 and linear algebra for computer science.",
            "score": 0,
            "author": "Status-Rhubarb1221"
        }
    ]
}