{
    "id": "13v4b5z",
    "score": 4,
    "title": "Failed standing Assessment",
    "author": "toes-1234",
    "date": 1685389066.0,
    "url": "https://www.reddit.com/r/Concordia/comments/13v4b5z",
    "media_urls": [],
    "other_urls": [],
    "postText": "So winter 2023 was my first term and I got bad marks which are C.D.F and my gpa was 1.4. I registered for summer and I’m retaking my failed course and after registration by a 3 weeks I received an email of failed standing assument so I’ll be suspended for a year. But I’m retaking the failed course with 3 other so If I raised my gpa above 2 will the assessment will be cancelled ? Plz Answer ASAP",
    "comments": [
        {
            "level": 0,
            "comment": "Sorry to be the bearer of bad news but no even if you repeat the courses your assessment stays the same. This summer term will be assessed at the end of next summer. You might have to apply for readmission. I'm in the same position as you, it's my first semester in concordia and I messed up my courses and I am now in failed standing. Honestly I find it kinda unfair for us to be judged in the same way fall students are judged since we dont even get a chance to fix our mistake.",
            "score": 5,
            "author": "Reshinigami"
        },
        {
            "level": 0,
            "comment": "There shouldn’t be an assessment for you, you mentioned you only took 3 courses and was your first semester the assessment requires at least 12 credits to be done. Contact your advisor and ask about it it’s strange.",
            "score": 1,
            "author": "Bigballedyute",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry I forget mention that one of the courses is 6 credits",
                    "score": 1,
                    "author": "toes-1234"
                }
            ]
        },
        {
            "level": 0,
            "comment": "even if you were in failed standing you have a chance to reapply and explain. It’s all in the email.",
            "score": 1,
            "author": "itsporkmc",
            "replies": [
                {
                    "level": 1,
                    "comment": "What if i failed again after the readmission ? No hope ?",
                    "score": 1,
                    "author": "Bamboukian1"
                }
            ]
        }
    ]
}