{
    "id": "13y1mwz",
    "score": 3,
    "title": "Computer science DEC to bachelor's",
    "author": "AdamMoh",
    "date": 1685675836.0,
    "url": "https://www.reddit.com/r/Concordia/comments/13y1mwz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm pursuing a 3 year comp sci dec currently and we don't have calculus 1&amp;2 and I didn't even take math last year of highschool. Would I have to do these classes if I get admitted to the computer science program?",
    "comments": [
        {
            "level": 0,
            "comment": "If you get admitted in CS, the faculty will outline the math courses that you need to complete at the university.",
            "score": 2,
            "author": "haycio",
            "replies": [
                {
                    "level": 1,
                    "comment": "so it's safe to assume that I'll have to do the (prerequisites) highschool math then calculus 1&amp;2?",
                    "score": 5,
                    "author": "AdamMoh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Rip Reddit",
                            "score": 5,
                            "author": "HugelyOvercooked"
                        },
                        {
                            "level": 2,
                            "comment": "Yup",
                            "score": 1,
                            "author": "Goodlove23"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rip Reddit",
            "score": 2,
            "author": "HugelyOvercooked"
        },
        {
            "level": 0,
            "comment": "I did a three year dec and cal 1/2 and linear algebra. Our cegep had an agreement with Concordia that you can join the CS or SOEN program without the math courses but you would need to complete them at Concordia (and science courses too if your going to SOEN). \n\nYou should ask your cegep about this, or Concordia if they have this agreement with your cegep. \n\nI would recommend doing them in cegep, for three reasons. They are easier in cegep. It is less expensive. Most comp sci classes require cal 1 and/or linear algebra as a prerequisite. Sometimes cal 2 but it is less common I believe.",
            "score": 1,
            "author": "Apart-Plankton9951",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second doing them in cegep^^",
                    "score": 1,
                    "author": "ripmrblouin"
                },
                {
                    "level": 1,
                    "comment": "thanks a lot, I'll check with my cegep",
                    "score": 1,
                    "author": "AdamMoh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I see some comments that have mentioned this before but believe me when I tell you to do your math courses in CEGEP. The difficulty is much lower. Even if it potentially adds an extra semester to your DEC, do not fret, it's going to be worth it. \n\n*yes you can do them in university otherwise during your pogram*",
            "score": 1,
            "author": "ahavasakura"
        }
    ]
}