{
    "id": "142qmkf",
    "score": 1,
    "title": "3.7 GPA requirement",
    "author": "Emerson787",
    "date": 1686079498.0,
    "url": "https://www.reddit.com/r/Concordia/comments/142qmkf",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi,\n\nI'm on the ECP path towards the Aero Engineering program in september 2024, which requires a GPA of 3.7. As I wouldn't be getting my 2nd term GPA grades before the application deadline on March 1st, I have been advised to take the following madatory core courses : Math 204,205, CHEM 205, PHYS 204 during the fall semester of 2023.\n\nRealistically, is it doable to take such a heavy load and still manage to get 3.7 GPA? Have any of you done that or something similar, if so do you have any advice?\n\nThanks,",
    "comments": [
        {
            "level": 0,
            "comment": "Totally doable, it wont be easy but you can do it if you put in the work. Since you know the courses you want to take well in advance, you can totally start learning math 204, 205 on your own and have a massive head start.\n\nWith a bit of Googling you can find all sorts of relevant YouTube courses, textbooks, course outlines (useful to know good exercises to do in the book) and all kinds of stuff.\n\nThat being said, this course load is probably only manageable if you are not working, don't go out much and got to all your classes",
            "score": 2,
            "author": "Gryphontech",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for the advice! I was going to consider doing 2 courses in the fall and 2 in the winter term.\n\nBut knowing that \\*it's possible\\* is motivating.\n\nFor the math classes, I guess I'm just going to binge Professor Leonard's videos.\n\nBut what about Physics and Chemistry? Do you have recommendations?\n\nAgain, thank you",
                    "score": 1,
                    "author": "Emerson787",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Something to consider is that if you have been out of school for a while before doing the ecp (for me it was 9 years) you probably won't have super efficient study habit so it may take longer the normal for you to learn stuff. But if you find good habits that work for you, you should be okay.\n\nI personally find physics kind of intuitive (that's why I'm in mech eng) so I don't have to spend that much time studying for it and still ends up with As. As for chem, last time I took a Chem class was 10 years ago, but with enough work you will make it work.\n\nObviously 4 classes is going to be harder then 2 and 2 but it also saves you 6 months of you life so it's totally worth it (in my opinion).",
                            "score": 2,
                            "author": "Gryphontech"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's doable, my only advice is to start everything the moment it's thrown at you. New topic, don't waste time to start studying, when the assignments are out, start them on the day they're posted. Sounds extreme, but it's a good habit to have, and you'll always know you aren't falling behind. A good early semester can mean the world even in a packed semester.",
            "score": 2,
            "author": "Narcolepsy911"
        }
    ]
}