{
    "id": "146edwo",
    "score": 0,
    "title": "Materials for DRAW 200 and PTNG 200",
    "author": "sal-ro",
    "date": 1686439565.0,
    "url": "https://www.reddit.com/r/Concordia/comments/146edwo",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey!\n\nI was accepted to Concordia in the Painting and Drawing program and would like to know what materials I would need to buy for each course and maybe the price range/places I could find them. Are there fees as well? I’m trying to budget myself this coming semester and don’t want any surprises when I start.",
    "comments": [
        {
            "level": 0,
            "comment": "you’ll surely receive a material list on the first day, but if i had to guess, here are some things that we might use in drawing:\n(you can get these things at deserres!)\nlarge sketching paper (brown paper, light, this should cost you like $5 maximum and it’ll last a while)\ncharcoal for sketching (medium size, around $5-7)\nsketching pencils (nothing too fancy, just a few thicknesses is enough)\na larger sized sketchbook (choosing one can be personal, so look around and see what you like)\n\nfor painting, im honestly not too sure. i don’t know how many supplies will be provided and which ones you’ll need to buy, so i have no recommendations there.\n\nfeel free to message me if u wanna discuss stuff or have questions!",
            "score": 2,
            "author": "sloombers"
        },
        {
            "level": 0,
            "comment": "FFAR 250-No Supplies needed\n\nDraw 200- Generally speaking look around before buying from Deserres for things. They tend to be more expensive. \nMy prof at the time posted a list of various stores on the island, and online that were more affordable. I don’t know if I still have access to the list but if I find it I will come back. \nSupplies: (Vague list of recollection, because can’t find actual list rn, also will come back if I do find it)\n-Mixed media Sketchbook (min. Maybe 11x14?)\n-Newsprint paper\n-I can’t remember the paper weight, but most people in my class ended up having to buy a large roll of paper and cut it to size for projects that were like 42x32 min requirements \n-HB pencils varying from 6H-6B\n-Charcoal (Hard/Soft)\n-Conte Crayons\n-Rubber Eraser -Gunn Eraser -Scissors \n-Pencil Sharpener -Ruler \n-Ink -Paint brush\n-white chalk\n\nResponse to above comment:\n-I didn’t use brown paper in the course at any point unless they are talking about newsprint which is a greyish brown\n-charcoal was almost never used for sketching\n-sketching pencil thickness doesn’t matter, it’s the hardness/softness that does (size is preference to individual)\n-sketchbook size, there’s a minimum requirement, if you don’t get at least the minimum your grades will suffer, wait to find the minimum needed because you don’t want something less, and don’t want something wildly huger. You have drawings you need to do weekly, smaller paper means less time spent typically and a complete drawing will get you a better grade than a larger not complete one\n-for painting, nothing is provided except solvent, and shared easels that stay in the course room",
            "score": 2,
            "author": "Flounder2510",
            "replies": [
                {
                    "level": 1,
                    "comment": "Painting 200: I still had access to the list cause I just finished that class so this is what I was given word for word\n\nList of Materials: \n·         Paint: acrylic or oil: 2 of each primary, red/yellow/blue (one warm &amp; one cool), Black &amp; White\n·         Palette: wood, glass, plastic\n·         Rags: make sure you have plenty!!!\n·         Brushes: two rounds, two filbert, two flats-at least one as thick as your thumb, one as thick as your middle finger, one as thick as your baby finger.\n·         Acrylic Gesso, for priming canvas\n·         Palette knife, for mixing colour and scraping paint\n·         Primed cardboard, collect a handful of recycled cardboard to have on hand for making paint sketches.\n·         Small jars, for water and solvents\n·         Supports: canvas, wood panels, Masonite, etc.\n·         Nails, for hanging your work\n(N.B. we will be working in oil only for painting the figure.\n·         Black/white*/earth colours (i.e. yellow and red ochres, umber and sienna)\n·         Mineral spirit is what we use in class. There is dispenser for cleaning brushes and jars across from VA 317.\n·         Brushes for oil i.e. natural hair bristle: round and filbert ( big rather than small)\n·         Mediums: we will talk about those later but for now, just solvent and paint will do very well.\n·         Rags, rags, rags……as important as brushes!!\n*White: Titanium white is bright and opaque, good for covering and repainting a colour while Zinc white is more translucent and good for mixing with colour.\nBlack: Ivory black is dark and neither warm nor cool.",
                    "score": 2,
                    "author": "Flounder2510",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unless it’s basic stuff needed, drawing 200 ex- pencil sharpener, ruler, scissors, \nPainting 200- rags, small jars, nails, pallets essentially things you won’t have a preference for, sure buy it before hand. But overall wait for the course to start. You are going to need a lot of the list until the second half of the year, and each project is different requirements etc, wait for each project, figure out what you want to do, and buy as you go. Don’t waste money on supplies you never end up touching.",
                            "score": 2,
                            "author": "Flounder2510",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Make sure to rent a locker, it’s $42? for the year, and the sooner you do, the better locker you get location wise. Also just really makes life easier. \nThere is also a storage sale they have at the beginning of the year where they sell the stuff student left behind or abandoned the year before for cheap. I know for painting it was Canvases of various sizes, I can’t remember the drawing stuff.",
                                    "score": 2,
                                    "author": "Flounder2510",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The fees depend and change with the course/studio you are doing. $25-$50 maybe, I can’t remember if I actually paid a fee for either of those courses specifically",
                                            "score": 2,
                                            "author": "Flounder2510",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also if you don’t go to the stretcher sale, or need to buy canvas for painting in a pinch $$ wise, dollarama has canvases, I used them many times for class. My prof wasn’t a big fan at time but eh. There was also atleast one project in the course the canvas had to be minimum 4ftx3ft and that cost $$",
                                                    "score": 2,
                                                    "author": "Flounder2510",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hey, omg. Thank you so much for your response...\n\nI will wait for the course outline and materials list so I won't rush to buy them, but I am definitely not looking forward in investing a bunch of money on painting supplies I don't care to use. I'm a simple man that can use the bare minimum while painting. All I really want to use are canvas boards, some brushes, and one palette knife for fixing.\n\nAs for DRAW 200, I really hope they allow small sketchbooks. It's going to be a pain in the ass carrying large sketchpads on public transport and I live very far, so I guess I'll ask the whichever teacher I have if I can bring something smaller.",
                                                            "score": 1,
                                                            "author": "sal-ro",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "just a heads up, my observation is that in first year you will be forced to work in ways you don't already. they will introduce you different techniques to grow your repertoire of skills to draw on later... so don't go into this with the mindset that \"this is what i do\" or \"this is how i work\".... the point of school is to broaden your horizons.\n\n(in other words, you will be forced to buy supplies for things you'll never do again, it's just how it is, try to sell them later and get to know CUCCR...\n\nalso, you'll get used to carrying awkward and heavy things on the metro\n\nedited to add the UQAM co-op is the cheapest place to buy supplies",
                                                                    "score": 1,
                                                                    "author": "poubelle",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm well aware of that, but I'm just saying that I'm gonna try to get by with as little as possible with the teacher's consent of course. I should explain to them that I live very far.",
                                                                            "score": 1,
                                                                            "author": "sal-ro"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}