{
    "id": "1497oq8",
    "score": 5,
    "title": "Math 204: Poor Midterm Grade",
    "author": "avidrunner84",
    "date": 1686748711.0,
    "url": "https://www.reddit.com/r/Concordia/comments/1497oq8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I received my midterm grade back today, and it was a lot lower than I thought: 42%\n\nI have received 98% on all WebWork submissions but with the final coming up I am a bit concerned if this will look bad on my transcript to fail a course.  My GPA is 3.15 and I need an average of 3 to get into the BCompSci degree program. From what I have been told they are looking for B+ average with all math courses.  I don't feel ready for the final coming up soon, do you think it would be better to drop the course and re-take it in summer session 2? Or even if I fail Math 204 for the first time and re-take it, it does not close doors to BCompSci entry?",
    "comments": [
        {
            "level": 0,
            "comment": "What was the midterm average? I have eaten shit on midterms plenty of times (my lowest grade was like 20% in dynamics) but thanks to hard work, assignments/projects, tutorials and YouTube videos ended up with mostly A- and A (dynamics I got an A+ somehow). \n\nKeep at it, go to the math help centre and DO THE WORK!!! you got this, trust the process and as usual all hail the curve gods",
            "score": 3,
            "author": "Gryphontech",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure about the average, but I don't think any of the earlier MATH courses are graded on curves unfortunately.  At least, MATH 203,204,205..\n\nThanks for the words of encouragement!  I will definately keep at it.  YouTube and Mathematics Discord are life savers...",
                    "score": 1,
                    "author": "avidrunner84",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My 204 grade got curved but that was summer 2021 during Covid, so I’m not sure if there was a special accommodation that semester. My understanding has been that 204 is curved while 203/205 are not.",
                            "score": 1,
                            "author": "dongsfordigits"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dropping the course will not make you do better. Studying will make you do better. Learning and practicing your mistakes will make you do better. You just got your grade back, perfect, now request to see your midterm and go over the mistakes with your professor (or by yourself, whatever suits you) and you will LEARN everything you didn’t know and be more prepared for the final.",
            "score": 3,
            "author": "Azmera1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah if I go with the grading scheme it will be:\n10% assignments\n10% midterm\n80% final\n\nSo it’s still very doable to pass the course if I do well enough on the final. I just hope I can pass and also get a minimum 3.0 GPA in the course. Not sure how flexible BCompSci entrance is on this if one math course is a pass but not quite a B-.\n\nWill cross that bridge down the road if it gets there. For now I will just have to try to get the highest grade possible.",
                    "score": 1,
                    "author": "avidrunner84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not sure about the impact of getting into CompSci, but I know if you retake math 204, regardless of it you failed it previously, it will overwrite you last grade. So if you get a B now and get a B+ later your GPA will only take into account your B+.",
            "score": 1,
            "author": "EatBaconDaily",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah OK, we will see if Concordia asks me to retake any MATH to get into BCompSci... I still have MATH 205 and Intro to Programming in Fall.",
                    "score": 1,
                    "author": "avidrunner84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can do both: sign up for Summer 2 MATH 204 but grind for the finals in the course you're currently working on. Unless they changed the way things work, there should be a high risk high reward grading scheme that heavily skews towards the final, so either you get a chance to save your grade and avoid paying and retaking the course, or you secure a spot for yourself (and you can drop the course before paying unless they take way too much time finalizing the grades for Summer 1, but that would be on them, not you).",
            "score": 1,
            "author": "EyebagHoarder",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I may do this.. If they take too long to grade and it goes past the drop out deadline do you know if Concordia still offers refunds?",
                    "score": 1,
                    "author": "avidrunner84",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a deadline for refunds every semester, but even if they take too long to release the grades you can still make it a win scenario for yourself by using Summer 2 as a GPA booster by getting an even better grade for 204 and overwriting Summer 1 💪",
                            "score": 1,
                            "author": "EyebagHoarder",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So Concordia will allow students to fail a course, retake it the next term, and potentially get a GPA 4.0 for the same course? No other consequences other than having F on transcript for the first attempt? Or am I missing something there… Your GPA will forever be brought down by that first fail?",
                                    "score": 1,
                                    "author": "avidrunner84"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Try to solve as much as past final as possible. In the exam, there’s always shortcut that if you can find out. You can solve the problems quick. I got 50 in the midterm for math 204. But in the final, I completed all the problems in half of the time and received 100/100 (I got an A+)",
            "score": 1,
            "author": "CTNSB",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think that a part of the issue is that we were all surprised upon coming to class that there was a lecture for the first half of the class. We were expecting to only do the midterm, and I think for many, including myself, we were writing in haste up until the very end, only having 70 minutes to complete it. Not as an excuse for poor grade but I think the class average would have improved with more time to do the midterm.\n\nI will try to study as much as possible these next few weeks and find shortcut methods to solving. 100/100 for the final is amazing. These summer session courses are very intense.",
                    "score": 1,
                    "author": "avidrunner84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes if you got below 50 that’s a sign, 1. You haven’t done the webworks on on your own 2. Consider dropping the class because there are no curves",
            "score": 1,
            "author": "xspicexx",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have decided I may as well try as hard as possible to still pass, if I work really hard these next few weeks I may still have a chance. Also, if worse comes to worse it sounds like I can make up for it next semester if I retake the course. It would be on the transcript forever as an F but from what I understand the GPA will account for the higher grade of any of the same courses taken, is that correct?",
                    "score": 1,
                    "author": "avidrunner84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s all good bro! Based on my experience, they’ll definitely count this midterm as 10% of your final grade (same as ur assignments). So now, you have one last chance, you must try your best for the final since it will count for 80% of your final grade. You can do it! Good luck!",
            "score": 1,
            "author": "Sufficient-Act-7902"
        }
    ]
}