{
    "id": "11ph4zc",
    "score": 1265,
    "title": "[Dark Souls: Remastered] Ratatouille 2",
    "author": "HeyaSorry",
    "date": 1678634691.0,
    "url": "https://www.reddit.com/r/GamePhysics/comments/11ph4zc",
    "media_urls": [
        "https://v.redd.it/53uk5py7tbna1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Put down your dad’s sword and find one that fits you.",
            "score": 154,
            "author": "Skagganauk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who is Hoarah Loux's daddy?",
                    "score": 29,
                    "author": "HeyaSorry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'll take giant dad for 600",
                            "score": 9,
                            "author": "acuddlyheadcrab"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I honestly just assumed giant two-headed rats were in DS's wheelhouse and didn't get it at first lol",
            "score": 46,
            "author": "PubicAnimeNummerJuan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait, is this a glitch or a real enemy? I can't tell.",
                    "score": 7,
                    "author": "Omegamanthethird",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This was a glitch. After I killed the first rat the second one lunged at me, clipping its body through the dead rat and getting it stuck on its back",
                            "score": 10,
                            "author": "HeyaSorry"
                        },
                        {
                            "level": 2,
                            "comment": "Just a piggyback ride.",
                            "score": 4,
                            "author": "DimitriV"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's what I thought when I first saw it!",
                    "score": 6,
                    "author": "HeyaSorry"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Godrat The Grafted.",
            "score": 125,
            "author": "Tumoxa"
        },
        {
            "level": 0,
            "comment": "This area caused me so much grief",
            "score": 74,
            "author": "whal3man",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is my first playthrough. Those rats are ridiculous lol",
                    "score": 51,
                    "author": "HeyaSorry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Heavy attack or roll attack of the Zweihander should be vertical / a stabbing motion, try using that in narrow passages. It's too easy to die because your weapon hit the wall.",
                            "score": 18,
                            "author": "Acewasalwaysanoption"
                        },
                        {
                            "level": 2,
                            "comment": "Get yourself a weapon you can use in tight hallways",
                            "score": 58,
                            "author": "holaprobando123",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The scimitars heavy attack is two quick vertical slashes and it's great especially with crowds.",
                                    "score": 14,
                                    "author": "herrcollin"
                                },
                                {
                                    "level": 3,
                                    "comment": "The heavy of the zwei does a pretty good job in a hallway imo",
                                    "score": 7,
                                    "author": "Overlorde159"
                                },
                                {
                                    "level": 3,
                                    "comment": "Or learn how to utilise the entire moveset of your weapon to fit the conditions",
                                    "score": 12,
                                    "author": "S1lent-Majority"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nice, dude. The first playthrough was definitely something special. Have fun.",
                            "score": 7,
                            "author": "toilet_guy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm hooked, I played for most of the day lol. I just found Sif and called it a night after dying a bunch",
                                    "score": 5,
                                    "author": "HeyaSorry"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Echoing what everyone else has said, the Zwei is phenomenal for some fights (the heavy attack flattens most enemies), but in that area it's just too slow. Especially if you're not immediately one-shotting everything. \n\nThere's definitely a few fights before the tower bell that are really gonna be a problem with the Zwei",
                            "score": 4,
                            "author": "Stargazeer"
                        },
                        {
                            "level": 2,
                            "comment": "Good place for farming humanity those rats. Just keep respawing at the bonnie at the bottom of the stairs near there. 1 in 15 or 20 rats should give you some humanity.",
                            "score": 3,
                            "author": "en0rt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is where I gave up on that game",
                    "score": 2,
                    "author": "EtherealSpirit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I made it longer but still gave up. I see the appeal of the incredible artistry of the world but I don’t understand how people put up with all of the bullshit hurdles the game throws at you. No thanks.",
                            "score": 4,
                            "author": "NomaiTraveler",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It took me a while, and those early Undead Burg gank zones were so frustrating. \n\nAs for dealing with the difficulty.\nEventually something kinda clicked? \nNot in the sense of \"I'm really good now\". But more that it instilled a level of doggedness and perservence in me. Games like DS, Hades and Hollow Knight all benefit from it. That satisfaction of finally winning.\n\nHonestly, I can't recommend DS1 as a first Soulsborne. Elden Ring is just so much better, as the culmination of everything they've learnt over the DS trilogy, that it's absolutely what I would recommend over it",
                                    "score": 13,
                                    "author": "Stargazeer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I bounced off DS1 maybe five times before beating it. I would get a tiny bit further each time and then give up. Once I beat the two gargoyles on top of the curch it just snowballed from there.",
                                            "score": 3,
                                            "author": "HuskerBusker"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No thanks, I’m not looking to be convinced to just keep throwing myself at the obnoxious difficulty until it “clicks.” I’d rather play something more fun.",
                                            "score": -2,
                                            "author": "NomaiTraveler",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dude if it's not for you it's not for you. Doesn't make the game bad. \n\nI'm just saying that there gets a point where you stop caring about dying, take each death and learn from it, and end up some massive satisfaction for getting through. It's not unique to Soulsborne games either. Many roguelikes work of the similar compulsion. Hades was one of the games that really helped me get past the frustration feeling. \n\nAlso not one of those Soulsborne players who thinks they're the ONLY good games. My GOTYs in recent years have varied from Elden Ring to Hades to Psychonauts 2 to Outer Wilds (which I assume you're a fan of).\n\nThere's just a particular itch that Soulsborne games scratch, and jank aside (which is a major issue with Dark Souls 1) the Soulsborne games have some of the most satisfying 3D combat I've ever played.",
                                                    "score": 10,
                                                    "author": "Stargazeer",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah I know that dark souls isn’t for me, that’s why I’m not looking to be convinced. The outer wilds is my favorite game of all time but I don’t write long comments trying to convince people who didn’t like it that they are wrong",
                                                            "score": -4,
                                                            "author": "NomaiTraveler"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "masochism, self hatred which turns into massive satisfaction",
                                    "score": 4,
                                    "author": "whal3man"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ratatwouille",
            "score": 9,
            "author": "SheaMcD"
        },
        {
            "level": 0,
            "comment": "That's the giant rat who makes all of the rules.",
            "score": 5,
            "author": "CHIMAllOverThePlace"
        },
        {
            "level": 0,
            "comment": "Rodents of unusual size?  I don't believe they exist.",
            "score": 3,
            "author": "DimitriV"
        },
        {
            "level": 0,
            "comment": "I hate those rats so much.",
            "score": 3,
            "author": "SmoothOctopus"
        },
        {
            "level": 0,
            "comment": "God I remember dying on this part a bunch getting knocked off the narrow ledge! But right after is Solaire, I think. Praise the Sun!",
            "score": 3,
            "author": "Suckarat"
        },
        {
            "level": 0,
            "comment": "Update: since this morning I've killed the moonlight butterfly and died many times to Sif. I haven't bested Sif yet but one day I'll tell my kids the story of walking eleven miles each day to and from her boss room, uphill both ways and all that.",
            "score": 3,
            "author": "HeyaSorry",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's really the bane of DS1. You gotta walk forever, DS3 is a bit more forgiving, like the Nameless King being literally right next to the bonfire and the Dancer is a straight run, but for DS1 you gotta run through two whole ass areas filled with human enemies, go down stairs and across a bridge, just to get stepped on by a big wolf. Keep me updated.",
                    "score": 3,
                    "author": "DVDN27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Elden Ring spoiled the hell out of me with stakes of Marika and fast travel from a map. I am loving DS1 though",
                            "score": 3,
                            "author": "HeyaSorry"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you even dark souls? You don’t abide by the rule of the narrow doorway. Shame shame shame",
            "score": 5,
            "author": "VerSchnitzel",
            "replies": [
                {
                    "level": 1,
                    "comment": "You mean the wall-weapon collision? That is actually a legit strat some people use.",
                    "score": 6,
                    "author": "acuddlyheadcrab"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Outstanding",
            "score": 2,
            "author": "S1lent-Majority"
        },
        {
            "level": 0,
            "comment": "Go my beautiful steed! Go, chase the infidel!",
            "score": 2,
            "author": "Nuclear_Human"
        },
        {
            "level": 0,
            "comment": "This is why i went with the winged spear. Can use your shield up while you attack.",
            "score": 2,
            "author": "Thallest"
        },
        {
            "level": 0,
            "comment": "Rata2ille",
            "score": 2,
            "author": "Inch-Worm"
        },
        {
            "level": 0,
            "comment": "This doesn't happen to everyone when they encounter these ratatouilles? /S",
            "score": 2,
            "author": "DeltaOmegaX"
        },
        {
            "level": 0,
            "comment": "Gotta get that humanity!",
            "score": 2,
            "author": "oRedDeadDano"
        },
        {
            "level": 0,
            "comment": "Is this Rat Movie 3?",
            "score": 2,
            "author": "Chasemc215"
        },
        {
            "level": 0,
            "comment": "huh, I dont remember the original dark souls looking like a ps2 game",
            "score": 4,
            "author": "ballmot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Anz this is the remaster!",
                    "score": 4,
                    "author": "TocTheElder"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello /u/HeyaSorry Thanks for posting here on r/GamePhysics! Just reminding you to check the rules if you haven't already. If your post doesn't respect the rules it will be removed. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamePhysics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Better boss fight than Bed of Chaos",
            "score": 1,
            "author": "Nieruz"
        },
        {
            "level": 0,
            "comment": "Wow these are the Dark Souls people keep raving about? Looks like absolute shit.",
            "score": 0,
            "author": "[deleted]"
        }
    ]
}