{
    "id": "11snszz",
    "score": 461,
    "title": "[Construction Simulator] Used Outplayed",
    "author": "Whateveradude123",
    "date": 1678953990.0,
    "url": "https://www.reddit.com/r/GamePhysics/comments/11snszz",
    "media_urls": [
        "https://v.redd.it/xu0cmk8i62oa1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I think you slightly over-inflated the tires",
            "score": 33,
            "author": "JoshingCoot737"
        },
        {
            "level": 0,
            "comment": "Game said “You can’t park here, or here, or here, this spot is ok”.",
            "score": 19,
            "author": "glitchexalted"
        },
        {
            "level": 0,
            "comment": "oh yeah...ultra-realistic physics",
            "score": 6,
            "author": "ale18w10"
        },
        {
            "level": 0,
            "comment": "I just bought this game a couple weeks ago and it's horribly broken. I got my trailer stuck 50' in the air.",
            "score": 4,
            "author": "NativeMasshole",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was about to ask if this game is any good.. :D",
                    "score": 2,
                    "author": "rtz13th",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's still a good and enjoyable game. It can be buggy at times just like any other game.",
                            "score": 1,
                            "author": "Whateveradude123"
                        },
                        {
                            "level": 2,
                            "comment": "Agree with OP. It's fun, but I got the PS4 port and it crashes about once every 30 minutes. The driving physics with trailers and articulating trucks can be pretty wonky too, leading to situations like that one up above.",
                            "score": 1,
                            "author": "NativeMasshole",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I cannot endorse any gaming platform other than the computer. I solely engage in gaming activities on the computer and I apologize that you are facing difficulties with a malfunctioning game on the console. My personal experience indicates that I have not encountered any game-related issues such as lagging or crashing, and have always experienced seamless gameplay with accurate physics. Despite having spent a considerable amount of time, approximately 20-30 hours, on the game, I have only encountered my first glitch. I hope that you too are able to resolve any issues and enjoy the game to the fullest extent possible. o7",
                                    "score": 2,
                                    "author": "Whateveradude123"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was ready to give you a 10/10 multiple times until you actually landed",
            "score": 2,
            "author": "NoahC513"
        },
        {
            "level": 0,
            "comment": "When bob the builder asks: Can we fix it? and I respond with no",
            "score": 2,
            "author": "A10GoBrrrt"
        },
        {
            "level": 0,
            "comment": "Sick stunt brother. When we getting that montage?",
            "score": 2,
            "author": "N9520"
        },
        {
            "level": 0,
            "comment": "Hello /u/Whateveradude123 Thanks for posting here on r/GamePhysics! Just reminding you to check the rules if you haven't already. If your post doesn't respect the rules it will be removed. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamePhysics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Damn I hate when this happens. Why I always have dramamine in my truck.",
            "score": 1,
            "author": "clineaus"
        },
        {
            "level": 0,
            "comment": "This is why it's important to get your HGV license before operating one.",
            "score": 1,
            "author": "Active-Part-9717"
        }
    ]
}