{
    "id": "11xp58x",
    "score": 123,
    "title": "[Cyberpunk] do not make him wait...",
    "author": "JoshsPizzaria",
    "date": 1679422229.0,
    "url": "https://www.reddit.com/r/GamePhysics/comments/11xp58x",
    "media_urls": [
        "https://v.redd.it/0gyyx8eyu4pa1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "surprised to not see this game here more often. Not rare to do this, but this one was just funny i think.",
            "score": 15,
            "author": "JoshsPizzaria",
            "replies": [
                {
                    "level": 1,
                    "comment": "Got the game a few days ago and cars are completely broken lmao",
                    "score": 7,
                    "author": "Spiritfeed___",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, they tend to bug out. ive only recently acquired the game as well and immediately modded some things like better driving physics and some quality of life stuff",
                            "score": 5,
                            "author": "JoshsPizzaria"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cyberpunk was made by inexperienced amateurs. Almost everyone hates Cyberpunk now",
                    "score": -2,
                    "author": "Lymbasy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Why are you downvoting me?. Im right!”",
                            "score": 3,
                            "author": "amishdoinkie"
                        },
                        {
                            "level": 2,
                            "comment": "Lol, someone woke up on the underside of their bed this morning. \n\nIf its so easy make a better one yourself. But i guess you are just an IGN senior editor, which is proof that you have absolutely no knowledge about just how hard coding is. \n\nBesides, you are also shoveling bs with this comment, in good ol' IGN fashion, because Cyberpunk is very much loved nowadays. Which is weird that you didnt know that since you made a POST ABOUT IT YOURSELF a month ago.",
                            "score": 1,
                            "author": "JoshsPizzaria"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That was fucking sick.",
            "score": 5,
            "author": "SirCheeseEater",
            "replies": [
                {
                    "level": 1,
                    "comment": "too bad it actually DID get a bit rarer now, especially with engine mods",
                    "score": 1,
                    "author": "JoshsPizzaria"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello /u/JoshsPizzaria Thanks for posting here on r/GamePhysics! Just reminding you to check the rules if you haven't already. If your post doesn't respect the rules it will be removed. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamePhysics) if you have any questions or concerns.*",
            "score": 2,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "ever seen a bike autonomously climb a ladder, go down a flight of stairs, then phase through a wall and finish with a backflip before?",
            "score": 1,
            "author": "JoshsPizzaria"
        }
    ]
}