{
    "id": "122r4rv",
    "score": 910,
    "title": "[Skyrim] - Worst place to save, in retrospect",
    "author": "vandavender",
    "date": 1679847216.0,
    "url": "https://www.reddit.com/r/GamePhysics/comments/122r4rv",
    "media_urls": [
        "https://v.redd.it/b6g67n2my3qa1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "“I’ve come to bargain”",
            "score": 185,
            "author": "Janne-K",
            "replies": [
                {
                    "level": 1,
                    "comment": "“DORMOMU!” *death* “I’VE COME” *death* “TO BARGAIN” *death*",
                    "score": 8,
                    "author": "Ok_Pension_6795"
                },
                {
                    "level": 1,
                    "comment": "\"RRAARRGGHH\"\n\n\\*sound of whistling as club cleaves the very air molecules as it brings its whole weight upon your fragile mortal being\\*\n\n\"GRAK!\"\n\n\\*the club hits the dragonborn with full force, the swing's strength causing the dragonborn to fly into the snow and bounce back out into the sky\\* \n\n\\*the dragonborn's final moments is hearing the wind whistle in his ear as he flies back down and his fading and cloudy vision taking a final glance at the snow-capped mountain tops\\* \n\n\\*the dragonborn is suddenly back on the ground, ready to relive that moment again and again as the club starts hurtling towards him\\*",
                    "score": 5,
                    "author": "ThatDudeWithCheese",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://imgur.com/D7s7eIZ.gif",
                            "score": 3,
                            "author": "TurtleNutSupreme"
                        },
                        {
                            "level": 2,
                            "comment": "I'm not trying to judge here but, why?",
                            "score": 2,
                            "author": "prettyflythaiguy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "you can open the console during the fade in animation to give yourself some extra time, the game starts playing while the screen is still black. you can also disable the fade in or shorten it but it's kinda ugly without it.",
            "score": 37,
            "author": "Chamandah-on-Reddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or just enable god mode and get your ass out of there",
                    "score": 8,
                    "author": "Village_People_Cop"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only thing u can do at this point is pause the game and spam potions.\n\nOr u can be a noob and revert to an older autosave",
            "score": 88,
            "author": "DingleberryChery",
            "replies": [
                {
                    "level": 1,
                    "comment": "Regen, damage resist, any heavier armor you have, anything that adds health points, a healing potion for good luck then try to block and back away with your remaining milliseconds.          \n          \nIt works 100% of the time, once in a blue moon        \n         \nEdit: It may be worth mentioning as well that depending on the length of your death window, spells like wards and stoneflesh may also be worth considering.",
                    "score": 57,
                    "author": "GameDestiny2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When you are a hero with the legendary power of The Quicksave, all you need is the slightest possibility of success.",
                            "score": 22,
                            "author": "KindlyContribution54",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Natsuki Subaru be like",
                                    "score": 11,
                                    "author": "Coppeh"
                                },
                                {
                                    "level": 3,
                                    "comment": "Cant tell you how many times.",
                                    "score": 3,
                                    "author": "MaleficentMulberry42"
                                },
                                {
                                    "level": 3,
                                    "comment": "KSP PLAYERS LIKE MYSELF: quicksave every timeryou go up my .00000000000000000000000000001 meters",
                                    "score": 2,
                                    "author": "Pleasant_Meal_2030"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"work 100% of the time 60% of the time\"",
                            "score": 2,
                            "author": "deadrogueguy"
                        },
                        {
                            "level": 2,
                            "comment": "20% of the times, works all the time.",
                            "score": 2,
                            "author": "ZaphodB_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There is a 3rd option..... lower the difficulty temporarily",
                    "score": 7,
                    "author": "Four_Skyn_Tim"
                },
                {
                    "level": 1,
                    "comment": "Can also use Shout whirlwind sprint in a safe(r) direction.",
                    "score": 5,
                    "author": "Dav3le3"
                },
                {
                    "level": 1,
                    "comment": "Or if on PC - quickly open the console and type tgm",
                    "score": 3,
                    "author": "Dragten"
                },
                {
                    "level": 1,
                    "comment": "Or quickly change your shout to whirlwind Sprint and try to use it immediately",
                    "score": 1,
                    "author": "callofdoritos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ice Giant Space Program is a go. Let's see that replay!",
            "score": 16,
            "author": "SoldatPixel"
        },
        {
            "level": 0,
            "comment": "If you are on pc you can open the console and just kill him with a command",
            "score": 15,
            "author": "ArcaneSword"
        },
        {
            "level": 0,
            "comment": "as soon as you spawn, hit \\` and type ''TGM''",
            "score": 13,
            "author": "Kasgaan",
            "replies": [
                {
                    "level": 1,
                    "comment": "What does that do?",
                    "score": 5,
                    "author": "lesbiansexparty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Toggle God Mode",
                            "score": 13,
                            "author": "Plies-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ah yes. The quick save issue.\n\n\nhttps://youtu.be/l7RCUCEM6XY",
            "score": 5,
            "author": "Bromm18"
        },
        {
            "level": 0,
            "comment": "omg this is very traumatic for me. ive had this happen to me as well and i had to go to a many hours older save from earlier. i feel your pain deep in my soul",
            "score": 4,
            "author": "CaptainBillyum"
        },
        {
            "level": 0,
            "comment": "Can try escape as fast as can when the game loads or you are suck in a loop hole",
            "score": 2,
            "author": "Blastingwario19"
        },
        {
            "level": 0,
            "comment": "r/FUCKYOUINPARTICULAR",
            "score": 2,
            "author": "djluminol"
        },
        {
            "level": 0,
            "comment": "Exact thing happened to me except I was trying to get away from a dragon priest as I was way too under level and didn't have that good of equipment at the time and I was about to die. Guess when the game decided to auto save right as a fire ball was way too close to me to dodge it or even open my inventory and drink a health potion and my last save was maybe around 2-3 hours from the auto save. So I just quit the game and went to play another game.",
            "score": 2,
            "author": "gamesdoes360"
        },
        {
            "level": 0,
            "comment": "\\~ tgm",
            "score": 1,
            "author": "ElonHisenberg"
        },
        {
            "level": 0,
            "comment": "Not sure about Skyrim, but in Morrowind there was an exploit: save just before hitting the ground, then reload that save. Upon reload the \"momentum\" is lost, and the player lands smoothly without dying.\n\nAs we know, these are perfectly balanced, glitch free games.",
            "score": 1,
            "author": "SweetNerevarine"
        },
        {
            "level": 0,
            "comment": "Become ethereal",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, exactly. So easy that it's crazy it wasn't thought of",
                    "score": 1,
                    "author": "TheValtivar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "gotta be quick on the \\~ button :P. use the tgm command if you do wanna salvage this save. Toggles god mode. if you dont wanna cheat just run away and toggle it off.",
            "score": 1,
            "author": "kodaxmax"
        },
        {
            "level": 0,
            "comment": "Classic tgm scenario",
            "score": 1,
            "author": "Sgt_Nuclear"
        },
        {
            "level": 0,
            "comment": "I remember doing the same thing in Fallout 3, just before one of the super mutant behemoths. Probably got nuked 3904823094804 times before just lucking the fuck out and getting the hell out of there. \\*Got out by sprinting the other way, and saving every time i respawned.",
            "score": 1,
            "author": "comeplague"
        },
        {
            "level": 0,
            "comment": "When a game does this to me, I uninstall the game...",
            "score": 1,
            "author": "Farren246"
        },
        {
            "level": 0,
            "comment": "You can lower difficulty and that might make you survive the hit.",
            "score": 1,
            "author": "Biochemhistory"
        },
        {
            "level": 0,
            "comment": "Oh man I have had my fair share of soft-locking myself with Skyrim saves LUL.",
            "score": 1,
            "author": "everett7262"
        },
        {
            "level": 0,
            "comment": "I would try a quick Fus to destabilize the giant and run away as far as possible",
            "score": 1,
            "author": "wcrow1"
        },
        {
            "level": 0,
            "comment": "How has nobody recommended Become Ethereal, it's honestly the best option here",
            "score": 1,
            "author": "TheValtivar"
        },
        {
            "level": 0,
            "comment": "This is amusing but I got a better story. Early days of Skyrim one of my friends went through Nordic ruins early on. He ended up caught in a death loop of wall trap swinging and killing him over and over. The trap had already been activated when save occured. He had no potions to heal, healing magic, or any shouts. All you saw was him getting ragdolled into the wall over and over.",
            "score": 1,
            "author": "NoDragonfruit6125"
        },
        {
            "level": 0,
            "comment": "See, at least you can get outta this without much effort, try an equilibrium deathloop milliseconds away from death and when you load you are still casting it without holding any button down.",
            "score": 1,
            "author": "terminallyGamzee"
        },
        {
            "level": 0,
            "comment": "Hello /u/vandavender Thanks for posting here on r/GamePhysics! Just reminding you to check the rules if you haven't already. If your post doesn't respect the rules it will be removed. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamePhysics) if you have any questions or concerns.*",
            "score": 0,
            "author": "AutoModerator"
        }
    ]
}