{
    "id": "qv8lch",
    "score": 68337,
    "title": "[GTA III Definitive Edition] If you wiggle your car it gets bigger and bigger",
    "author": "stack413",
    "date": 1637071757.0,
    "url": "https://www.reddit.com/r/GamePhysics/comments/qv8lch",
    "media_urls": [
        "https://v.redd.it/a2cx7j4dsyz71"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This is a golden age for this subreddit.",
            "score": 8545,
            "author": "SamWhite",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately...",
                    "score": 2010,
                    "author": "pktwd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you don't like the \"trilogy\" you can always just play the original games . Oh wait.",
                            "score": 1392,
                            "author": "SeriousDude",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well Im just going to pir...\n\n&gt; You have been DMCA's by Take Two. Please remain where you are . A paddy wagon is on the way",
                                    "score": 688,
                                    "author": "Sommern",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do they send the paddy wagon when your wanted level is at two stars or three stars?",
                                            "score": 83,
                                            "author": "Minion_of_Cthulhu",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's 4 stars iirc. SWAT teams with MACs show up with armored cars and rappel out of helicopters. Just like in that South Park episode",
                                                    "score": 41,
                                                    "author": "Sommern",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "LPT:  Don't pirate from your home modem.  They can pester your ISP into dropping you.  Use your cellular provider's 5G personal hotspot data instead.  Rockstar/HBO/whoever can only track to your cell tower, thus not being able to have a specific ISP modem to send shitty bullshit DMCA notices.",
                                            "score": 244,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; They can pester your ISP into dropping you\n\nNot sure if this is an American thing or something, but at least here in the UK you'll get endless automated emails and nothing will happen, ever.",
                                                    "score": 108,
                                                    "author": "Sorlex",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "American here, but everytime i pirated something they would shut off my internet, i would then have to open a browser and agree that i wouldn't do it again. This happened about 10 times, after my last warning they sent me a letter in the mail actually stating that if i did it one more time that they would drop me as a customer and i would be banned from using their service. Haven't done it since.",
                                                            "score": 76,
                                                            "author": "TiggoBitss",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ive never bothered with VPN where i live in norway. At some point im pretty sure my ISP had their own hub on DC++ (peer-to-peer sharing software). I must've downloaded quite a few TB of data over the last 15ish years since we got fiber. Never ever received as much as an email from my ISP.",
                                                                    "score": 51,
                                                                    "author": "Kognit0",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Same from Spain. I lost count after several reinstalls of how many data I've shared by P2P over the years, counting from when I had just 3up/0.5dn Mbps copper connection which was not so long ago.",
                                                                            "score": 14,
                                                                            "author": "pomodois"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Sometime around 2009 I got banned from the internet for 6 months from my ISP for pirating a \"third strike\" and the culprit was Life of Brian lmao. I had to open an accountin a room mates name. Luckily the tech that came to reinstall was really cool and lied to the people over the phone that I had bought the modem from someone else and release the blacklist. I didnt tell him about it at first and he came back from the call like the fuck did you do? lol.",
                                                                    "score": 31,
                                                                    "author": "PM_ME_UR_LIPZ",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 3,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What the fuck lmao",
                                                                    "score": 3,
                                                                    "author": "kigurumibiblestudies"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I promise you. They won't say \"Oh I won't take your money\". Especially as bad as cable has tanked.",
                                                                    "score": 17,
                                                                    "author": "OnlyDownvoteStreamer",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "My provider, Cox Communications, ended up blacklisting me after too many DMCA takedown notices.  I can assure you that they will say \"I won't take your money.\"\n\nHowever - and this is important - I ended up returning to Cox once I moved homes within the same city, since their system wasn't savvy enough to associate me anything more than my address.\n\nTrust when I say that the eight months I spent with CenturyLink was punishment enough.",
                                                                            "score": 17,
                                                                            "author": "Chastain86"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yes they will, Cox lost a billion dollar lawsuit for being too lenient on pirates.",
                                                                            "score": 20,
                                                                            "author": "Dangerous-Ad-170"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 13,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Same with Canada. Where is illegal to pirate, but also illegal for your ISP to give your personal info to anyone.",
                                                            "score": 9,
                                                            "author": "zaphod_beeble_bro",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "*Yarr, don't be doin' raiding while flyin' yer personal colors. Borrow some other scurvy dog's flag so the fuzz can't find ye.*",
                                                    "score": 301,
                                                    "author": "Shamrock5",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 123,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Use public WiFi. Received loud and clear",
                                                                    "score": 45,
                                                                    "author": "Conrad_noble",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Time to download - 3 days, 22 hours, 46 minutes\n\n(non-resumable link)",
                                                                            "score": 39,
                                                                            "author": "iGaveYouOneJob",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "But piracy for personal consumption isn't subject to a criminal investigation, it's a civil matter. \n\nA judge won't grant a subpoena to a company for cell phone records with which to prosecute an individual, as it's not a felony. Unless they can prove intent to distribute.\n\n*I think*, I mean I'm no lawyer, but I **was** watching Matlock in a bar last night. The sound wasn't on but I got the gist of it.",
                                                                    "score": 25,
                                                                    "author": "utopiav1",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It turned out the guy wasn't Matlock at all, didn't even look like him",
                                                                            "score": 12,
                                                                            "author": "djakob-unchained",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh my God, we need a pirate bot",
                                                            "score": 28,
                                                            "author": "Bruised_Penguin",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It already exists, but it's kinda hit or miss on delivery - same with the Shakespeare bot.",
                                                                    "score": 8,
                                                                    "author": "GiornaGuirne"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Or just use a VPN",
                                                    "score": 60,
                                                    "author": "ReallyBigRocks",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Or just use real-debrid to download torrents on your behalf.  It also caches torrents for a few days so if anyone else has downloaded the torrent recently it just gives you the direct download link instantly.",
                                                            "score": 37,
                                                            "author": "HighOwl2",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Real debrid is the best thing for piracy. I think I'm paying $5 for my account. The best thing next to cached torrents is that it has pass codes and accounts to all the popular file sharing sites ppl upload obscure shit to, like dreamcast cdr releases. So you just feed it premium links and it has those instantly available for download also\n\nI've used seed boxes and real debrid. I'll don't see a reason to ever need a VPN\n\nThe cached torrents thing is goat though. I use it with a pirated copy of IDM, so basically I add a torrent magnet link and if it's a popular torrent I can immediately download it at my isps max download speed. Much faster than me torrenting  with qbittorent by itself",
                                                                    "score": 12,
                                                                    "author": "Supahmarioworld",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Where did you go to learn more about this. Anything specific I should search or any subreddits you know that might have more info? \n\nI always wanna do this but I never know where to go for info.",
                                                                            "score": 2,
                                                                            "author": "ircmaster",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Years of piracy. The real debrid/IDM combo is what I've been using lately, but every 5 or so years the piracy tools and programs will be all different\n\nBasically you just Google fastest and best ways to torrent, and possibly throw reddit at the end of the Google search lmao\n\nAre you asking for something specific? r/roms and r/piracy for new sources of weird programs\n\nRarbg and 1337x for torrent magnet links. Buy a real debrid subscription and have at it! If your speeds aren't enough, you'll have to buy idm or download a cracked copy with your anti-virus being told to ignore the crack files.",
                                                                                    "score": 9,
                                                                                    "author": "Supahmarioworld",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I think I've heard about this before but doesn't it cost money?",
                                                                    "score": 4,
                                                                    "author": "WhyIHateTheInternet",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah about $15 every 6 months.  You can also link kodi plugins like Seren to your real-debrid account as well allowing you to essentially have Netflix with all of the content available via torrent trackers and the convenience of real-debrids caching.\n\nVPNs cost more and are slower than just masking your torrent traffic through real-debrid.  The only thing I'm trying to hide from my ISP is pirated content.",
                                                                            "score": 5,
                                                                            "author": "HighOwl2",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "€16 for like 8 months. It's ridiculously worth it.",
                                                                            "score": 8,
                                                                            "author": "hl3reconfirmed",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "That's reasonable considering what you can get out of it.",
                                                                                    "score": 7,
                                                                                    "author": "WhyIHateTheInternet"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah tethering to your phone is stupid if you've got a VPN option.  It's cheap as fuck, I pay like $3 a month or something.  Works on the phone as well.\n\n\"This content is not available in your country\".  Okay, 3 clicks later, I live in Latvia now.  That was a good use of all of our time and resources there.",
                                                            "score": 11,
                                                            "author": "randomwordsmona"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Spoof rockstar offices IP when torrenting their games.",
                                                            "score": 4,
                                                            "author": "autismchild",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Why the hell would you waste a couple of GB's worth of your 5G data when VPN's exist",
                                                    "score": 19,
                                                    "author": "Ghos3t",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The paddy wagon will never get here if it operates according the Trilogy physics.",
                                            "score": 5,
                                            "author": "disgruntled_pie",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Still got San Andreas on disk so not impossible, just gotta pop by my local electronics store and buy an external DVD reader to USB.",
                                    "score": 15,
                                    "author": "rAppN",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 15,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You didn't already have the trilogy on Steam?\n\nMay not be \"remastered\", but I know these games work lol",
                                    "score": 6,
                                    "author": "throw_yo_mama",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Some little adjustments here and there to make it sure they run okay in modern systems, but yeah, I have them on Steam and I acutally prefer them over the remasters. 🤷",
                                            "score": 5,
                                            "author": "Absay"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I dont know yo, I’m loving these glitches. I’ve almost cried from laughter from a lot of them.",
                            "score": 17,
                            "author": "I_need_proof",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dont get me wrong, they are funny as fuck, but not 60 bucks for a bugfest mobile-to-console port funny, having said that, i wish they would instead hire the original modders, so many mods taken down ):",
                                    "score": 19,
                                    "author": "CptAngelo",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You might even call it the Definitive Age.",
                    "score": 57,
                    "author": "HeyCarpy"
                },
                {
                    "level": 1,
                    "comment": "Oh baby we’re just getting started. Until the gaming industry experiences a literal government crackdown on employee rights among a vast sea of other things, CEO’s and board members will continue to pump and dump low effort games in the most anti-consumer ways possible. Sorry not low effort the devs who make them probably aged 20+ years laboring over it, just rushed out \n\nThis one’s pretty funny tho",
                    "score": 141,
                    "author": "MrMasterMann",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is really the peak. We are in the good times now!",
                    "score": 37,
                    "author": "middlemaniac"
                },
                {
                    "level": 1,
                    "comment": "It will never end.\n\nIt looks like somebody build an AI upscaling engine and they put the GTA games in it and pressed the \"Free money\" button.",
                    "score": 18,
                    "author": "i_have_chosen_a_name",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's actually quie close to what actually happened lmao",
                            "score": 12,
                            "author": "Matalya1",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "like what would be the reason for this to ever happen",
            "score": 4319,
            "author": "International_Air566",
            "replies": [
                {
                    "level": 1,
                    "comment": "If I had to take a wild guess I'd say it could be a rounding error with calculating the position of the parts of the car.  It's maybe miscalculating the wheels to be farther apart than they're supposed to be, which because cars deform, causes it to stretch the car.",
                    "score": 3500,
                    "author": "redstern",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fractions of a penny!",
                            "score": 1193,
                            "author": "cspruce89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like Superman 3?",
                                    "score": 335,
                                    "author": "AgropromResearch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was thinking Office Space.",
                                            "score": 275,
                                            "author": "llamas_theory",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is such a rare whiff\n\nYou got the reference\n\nBut you missed the reference within the reference\n\nAmazing",
                                                    "score": 478,
                                                    "author": "teslasmash",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Damnit. I swore I'd never be one of those guys. Yet here I am!",
                                                            "score": 136,
                                                            "author": "llamas_theory",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I am guilty as well…. Fuck.  I guess I need to watch that movie again.  Good idea anyway as my wife has never seen it.",
                                                                    "score": 31,
                                                                    "author": "HighPriestofShiloh",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Your wife's never seen Superman 3?",
                                                                            "score": 31,
                                                                            "author": "analogkid01",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I was thinking Office Space.",
                                                                                    "score": 32,
                                                                                    "author": "gopher1409",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That really was incredible. Like spotting a unicorn.",
                                                            "score": 15,
                                                            "author": "cortlong",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Are you not schooled in the ancient art of Salami Slicing Tactics?\n\nhttps://en.wikipedia.org/wiki/Salami_slicing_tactics#Financial_frauds",
                                                            "score": 7,
                                                            "author": "Empyrealist"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Lol, that's literally the next line in Office Space.",
                                                    "score": 36,
                                                    "author": "joeyheartbear"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm always forgetting some mundane details....",
                                    "score": 44,
                                    "author": "snoopunit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mundane detail???!!!",
                                            "score": 28,
                                            "author": "eumenides_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "OHH, WELL THIS IS NOT A MUNDANE DETAIL, MICHAEL!",
                                                    "score": 25,
                                                    "author": "HotChickenshit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "HEY PETER MAN CHECK OUT CHANNEL 9!  CHECK OUT THIS CHICK",
                                                            "score": 18,
                                                            "author": "JBthrizzle",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don’t want you fuckin’ up my life, too",
                                                                    "score": 12,
                                                                    "author": "CornholioRex",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’s realistic and happens a in real life. It’s just that no one is crazy enough to wiggle on the road to become huge.",
                            "score": 334,
                            "author": "Jwave1992",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A lot of construction vehicles are made like this.",
                                    "score": 173,
                                    "author": "KKlear",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People don't seem to realize that limos are made by braking and then accelerating in rapid succession.",
                                            "score": 210,
                                            "author": "Yeazelicious",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lamarkism is an important stepping stone of modern day vehicle evolution",
                                                    "score": 54,
                                                    "author": "Jauncin"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I tried it once and did it wrong and ended up shorting my car by 6 feet.  not much room in it now but parallel parking is a lot easier.",
                                                    "score": 29,
                                                    "author": "bretttwarwick"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If you clip your back tires into a boundary line and accelerate, the collision detection will stretch your car into a limousine before exploding.",
                                                    "score": 11,
                                                    "author": "DinoRaawr"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Have to make sure you don't do it in the wrong order though. If you accelerate and then brake, you'll make the car shorter.",
                                                    "score": 6,
                                                    "author": "abanihd",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Most 747’s began life as a Cessna.",
                                            "score": 13,
                                            "author": "moby323"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's why when Formula 1 drivers are trying to keep their tires hot, they have to go through the Minimizer S29 to counteract this.",
                                    "score": 8,
                                    "author": "Zoomalude"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is like how the One is created in the matrix but instead of a human simulation God, it's a wide car",
                            "score": 29,
                            "author": "psych0ranger",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 27,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"are you telling me I can drive a wide car?\"\n\n\n\"no. I'm saying that when you steer left and right really fasr a lot, you won't have to.\"",
                                            "score": 26,
                                            "author": "psych0ranger",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "“Do not try to stretch the car, that is impossible… there is no car”",
                                                    "score": 12,
                                                    "author": "The_Luckiest",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"I hate this place. This sandbox. This open world. San Andreas. Whatever you want to call it. I can't stand it any longer. It's the cars - if there is such a thing. I feel squeezed by them, I can feel the passenger doors and driver's side doors on my shoulders and I fear that every time I steer left and right really fast that I've somehow been narrowed by them...\"",
                                                            "score": 17,
                                                            "author": "psych0ranger",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lmfao that cracks me up. So good",
                                                                    "score": 9,
                                                                    "author": "The_Luckiest"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's possibly accumulating errors in the root transform for the entity. And/or there's some path that converts a matrix to position / rotation / scale and then back again millions of times.",
                            "score": 25,
                            "author": "shea241"
                        },
                        {
                            "level": 2,
                            "comment": "Obviously I don't know the specifics of these games but when I saw it my first thought was that the model stretches as part of the turning animation and then doesn't get reset, sort of like those screenshots showing how Overwatch character models stretch and deform to make animations look better.",
                            "score": 54,
                            "author": "Vandrel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That seems far more likely than a rounding error.",
                                    "score": 24,
                                    "author": "p-morais",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Indeed, I doubt rounding/floating point error would cause this, as it's (usually) an incredibly tiny amount, and usually a model isn't directly affected by the rendering pipeline. In decent engines it's a copy of the model, where they then perform calculations on that might cause small errors.",
                                            "score": 19,
                                            "author": "AnIndecisiveOrange"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "catastrophic loss of significance",
                            "score": 7,
                            "author": "masterwit",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 43,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thats a cute way to look at it\n\nmore likely they just outsourced it to poorly paid devs to save money and got back exactly what youd expect",
                                    "score": 56,
                                    "author": "possum_drugs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 10,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'd also like to throw in a reminder that they're working with code around two decades old, made back when games were essentially just an aggregation of voodoo curses and insanely smart C programming.",
                                                    "score": 14,
                                                    "author": "domwx",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They have to be using a cartesian plane, and the function for calculating wheel location after so many degrees of turn is definitely rounding up at a certain decimal",
                            "score": 6,
                            "author": "HurdenBurden"
                        },
                        {
                            "level": 2,
                            "comment": "Something similar happens in Mario 64 as well where one of the platforms keeps raising thanks to a rounding error which is used in tool assisted speedrunning\n\nhttps://m.youtube.com/watch?v=FQOFpDdg5rQ&amp;t=20s",
                            "score": 6,
                            "author": "zxzyzd"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I saw a response on twitter from a videogame developer about this. Apparently the 3D model distorts a little when you turn your car, so it feels better, and more like the whole car is turning. The bug here is that this distortion should reset once you stop turning, but is not.\n\nApparently is a bug that appeared on the original version too.",
                    "score": 429,
                    "author": "Artis34",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is the correct answer.\n\nTo elaborate further, I believe it's called the \"ghost car\" glitch, or something similar; in essence, it only happens with, specifically, this car, and some other, similar ones which are from specific missions.\n\n...Still no less fucky, but you can't just hop into a random car and do this in either the OG, or the \"remastered\" trilogy.",
                            "score": 132,
                            "author": "SweetNapalm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good to know, because I definitely don't remember this and I fucked around with all of the common glitches when the games were new.",
                                    "score": 27,
                                    "author": "TheOneTonWanton",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I just grabbed a few cars in GTA 3 DE and tried this and was unsuccessful.",
                                            "score": 5,
                                            "author": "the_lenin"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Interesting how most people probably automatically assume the glitch was introduced in the remaster and that it happens if you just hop into any random car.\n\nThat's what I assumed as well, even though the clip/tweet didn't explicitly *lie*. I have no issue with the video, I mean, it's funny.\n\nThere is probably a lesson about media consumption somewhere in there.",
                                    "score": 35,
                                    "author": "JohannesWurst",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah...\n\nI mean, I'm indifferent about it all; sure, they could have fixed the glitch. Sure, it's probably just oversight, instead of \"purposefully\" leaving it in, for posterity.\n\n...But, this has been posted like a dozen times, to so many different subreddits over just the past two days, that at least some people are catching on and spreading the correct information?\n\nIt's just tiring. But! Yes, the glitch is pretty hilarious regardless.",
                                            "score": 9,
                                            "author": "SweetNapalm"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’s such a weird choice to scale the car mesh up instead of just moving or zooming the camera while turning.",
                            "score": 64,
                            "author": "schimmelA",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That would bring a lot of problems that by the time GTA 3 came, they couldn't figure out. Rule of thumb is that developers always try to keep things as simple as possible",
                                    "score": 79,
                                    "author": "Artis34",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 15,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "the car is made out of rising dough",
                    "score": 40,
                    "author": "YannislittlePEEPEE",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I dunno, maybe a developer snuck a fetish in?",
                    "score": 211,
                    "author": "stack413",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh my",
                            "score": 55,
                            "author": "International_Air566"
                        },
                        {
                            "level": 2,
                            "comment": "[BIGGER](https://youtu.be/VtJUHGjVm0E)",
                            "score": 34,
                            "author": "TalkingRaccoon"
                        },
                        {
                            "level": 2,
                            "comment": "Like this?  https://www.youtube.com/watch?v=3NlJuqprE-E",
                            "score": 8,
                            "author": "Unacceptable_Lemons",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 78,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it's definitely something related to the rotation (transform) math\n\nThat shit can get tricky",
                            "score": 22,
                            "author": "smallbirrd",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It a bug that comes with the cheat that changes traction of the car. It was in the original game.\n\nthe cheat code is CORNERSLIKEMAD",
                    "score": 39,
                    "author": "ReddishCat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh really? never heard of this glitch happening to be honest",
                            "score": 8,
                            "author": "International_Air566",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Probably because most people cheated money, guns and other stuff. Never heard about these cheats and tbh I don't even know what exactly they do.",
                                    "score": 7,
                                    "author": "Wobbelblob"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s a bug that existed in the original game too. I don’t remember  exactly how it works but it isn’t just wiggling. There are several other steps",
                    "score": 4,
                    "author": "Real_Lingonberry9270",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wiiiiide",
            "score": 1175,
            "author": "TreyisMusic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Looooon looooong caaaaaaaaaar.",
                    "score": 500,
                    "author": "dognus88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am obliged to post [the reference link](https://www.youtube.com/watch?v=6-1Ue0FFrHY) for all to see.",
                            "score": 195,
                            "author": "hardgeeklife",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And I am obliged to watch the whole thing again.",
                                    "score": 100,
                                    "author": "DogzOnFire",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Surely it’s too long to watch it all again…",
                                            "score": 24,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ahah, yes, very good.",
                                                    "score": 12,
                                                    "author": "DogzOnFire"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Also [please enjoy at your leisure](https://www.youtube.com/watch?v=4mJZbaz2YQI)",
                                    "score": 32,
                                    "author": "DogzOnFire",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "absolute classic",
                                            "score": 9,
                                            "author": "effa94"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Well. That was an interesting video. Japan never ceases to amaze me.",
                                    "score": 20,
                                    "author": "Cleveland_Guardians"
                                },
                                {
                                    "level": 3,
                                    "comment": "Lmao thanks for the laugh! xD",
                                    "score": 9,
                                    "author": "farboo99"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Fuck Chi-Chan",
                            "score": 11,
                            "author": "Mikavilio"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "#W I D T H",
                    "score": 19,
                    "author": "aqualad783",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This cars a grower not a shower",
                    "score": 20,
                    "author": "Rockonfoo",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It's like the wide Putin meme",
                    "score": 8,
                    "author": "Popo_Capone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn I didn’t realise just how big it got til it looped back around.",
            "score": 1051,
            "author": "UnchartedQuasar",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's what she said",
                    "score": 204,
                    "author": "phome83",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Look at the King Almighty over here, with his reddit video player working first try lol .",
                    "score": 36,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's like a Junji Ito story. \n\n**THE WIGGLE CAR**",
            "score": 446,
            "author": "PhenomeNarc",
            "replies": [
                {
                    "level": 1,
                    "comment": "This Car Was Made For Me!",
                    "score": 99,
                    "author": "hardgeeklife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Proceeds to DORIFTO into certain death to suffer eternal unimaginable anguish",
                            "score": 14,
                            "author": "JonHenryOfZimbabwe",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Vrrroom! Vrrroom! Vrrroom!",
                            "score": 6,
                            "author": "Scarbane"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And to this day, we may never know how the car got so wide.",
                    "score": 9,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Duuuuuuuurrrrrrrr beep beep",
                    "score": 20,
                    "author": "FragMeNot"
                },
                {
                    "level": 1,
                    "comment": "His stories are… something else really",
                    "score": 7,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Those wheels are hilarious lol",
            "score": 161,
            "author": "count_nuggula",
            "replies": [
                {
                    "level": 1,
                    "comment": "seriously! i snorted when i saw them",
                    "score": 17,
                    "author": "unakitinoneko"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Source: https://mobile.twitter.com/DarkwingDust69/status/1459929293023236096",
            "score": 340,
            "author": "stack413",
            "replies": [
                {
                    "level": 1,
                    "comment": "The important reply. \n\n\nhttps://twitter.com/Sharkle_Bunwich/status/1460474037352685571?s=20\n\n\"Okay so there seems to be a lot of misconception about this glitch. It's not due to the remaster being bad.\n\nThe glitch is from the original GTA 3. It requires many steps to trigger it. The same glitch is possible in the Definitive Edition.\"",
                    "score": 1001,
                    "author": "nret",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for the clarification",
                            "score": 173,
                            "author": "GetYourMotherPlease"
                        },
                        {
                            "level": 2,
                            "comment": "\"If it ain't broke, break it. If it is broken, leave as is.\" - Rockstars",
                            "score": 313,
                            "author": "AddlerMartin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The amount of engine work this probably requires to fix not to mention looking at code written by people not even at rockstar anymore makes it not even worth it tbh.",
                                    "score": 68,
                                    "author": "ahk76gg",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In any case it's not like they did a good job on the remaster anyway.",
                                            "score": 35,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Honestly I prefer glitches like this to remain. Kinda fun to play with.\n\nAfter watching the video to recreate it, it isn't something that would just randomly happen. You have to take several very specific steps to trigger it.",
                                    "score": 15,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "But they made it better!  They applied a graphics overlay and that made it worthy of a $60 price tag!",
                            "score": 44,
                            "author": "Elzerythen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The pricing is absolutely bonkers but the classic GTA games portable on Switch? Fuck yeah my guy. I personally am not interested but I can definitely see why people are though.",
                                    "score": 8,
                                    "author": "SalemWolf"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;\"Okay so there seems to be a lot of misconception about this glitch. It's not due to the remaster being bad.\n&gt;\n&gt;The glitch is from the original GTA 3. It requires many steps to trigger it. The same glitch is possible in the Definitive Edition.\"\n&gt;\n\nG*Mers: I'm going to ignore that.",
                            "score": 84,
                            "author": "Rat_faced_knacker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No that comment just missed the point, whether the glitch originated in the original or the remaster is irrelevant to the criticism",
                                    "score": 19,
                                    "author": "Great_Zarquon",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This should be pinned at top tbh",
                            "score": 4,
                            "author": "kwentongskyblue"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is one of the side effects of the Ghost Car glitch and is present in the original. Not a DE bug:\n\nhttps://youtu.be/vEPLn4RoQBM",
            "score": 245,
            "author": "LeeMoriya",
            "replies": [
                {
                    "level": 1,
                    "comment": "Freaking A+ for that music",
                    "score": 43,
                    "author": "HardOff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "do u know the song name? lol",
                            "score": 7,
                            "author": "Baby_venomm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Song is apparently called \"Blooba Doop Scooba\" from a game called AVGM",
                                    "score": 11,
                                    "author": "Deathmonkey7",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They took the iMac approach.",
            "score": 101,
            "author": "sketchyjake",
            "replies": [
                {
                    "level": 1,
                    "comment": "Take away features and then reintroduce them 4 years later?",
                    "score": 39,
                    "author": "UsedJuggernaut",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "$60 game xD hahahahhahahaha",
            "score": 795,
            "author": "Friki1",
            "replies": [
                {
                    "level": 1,
                    "comment": "They should have just gone to the modders. When I had these on PC, 15+ years ago, i had added all kinds of great cars/texture packs and it ran fine.  They legit handed this off to some rando company to who completely half assed this.",
                    "score": 246,
                    "author": "ThaddeusJP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not just any random company. They gave this to the same people who botched the mobile port some 10 years ago and replaced all OG versions with it. \n\nThey knew what they were doing 100%.",
                            "score": 35,
                            "author": "drake90001",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Never do anything half-assed, because that leaves half an ass showing, and that's illegal in some states.",
                            "score": 64,
                            "author": "RedDwarfian"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How you keep yourself from buying this masterpiece after watching this clip? Just fair pricing",
                    "score": 22,
                    "author": "rafalsq",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Not gonna lie, all these clips are having the opposite of the intended affect and almost make me want to buy this just to see what absurd glitches i can find.",
                    "score": 12,
                    "author": "EvenOne6567",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "wait are you saying that it is not how a normal car should behave?",
            "score": 114,
            "author": "gadlele",
            "replies": [
                {
                    "level": 1,
                    "comment": "I guess I'm calling my mechanic tomorrow morning then",
                    "score": 34,
                    "author": "Culionensis",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I feel like an idiot driving that tiny Peugeot around for 5 years knowing this.",
                    "score": 15,
                    "author": "h00dman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Man don't joke around with this, I wiggled twice in my opel Agila today and now it won't fit my garage.",
                            "score": 4,
                            "author": "littlefrank"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want this to be pushed to the limits!",
            "score": 15,
            "author": "StockmanBaxter",
            "replies": []
        },
        {
            "level": 0,
            "comment": "# G  I  G  A  K  U  B  I  C  A",
            "score": 47,
            "author": "Nico777",
            "replies": [
                {
                    "level": 1,
                    "comment": "“We designed our car physics with input from a real F1 racer in order to achieve pure, adrenaline-pumping realism! Many thanks to Robert Kubica!”",
                    "score": 13,
                    "author": "shadeshadows"
                },
                {
                    "level": 1,
                    "comment": "Eeeeeeeeeeeee",
                    "score": 5,
                    "author": "shark_byt3"
                },
                {
                    "level": 1,
                    "comment": "He's got so much rear end",
                    "score": 5,
                    "author": "Phormitago"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the hardest I've laughed at a game for a while",
            "score": 13,
            "author": "TrevastyPlague",
            "replies": []
        },
        {
            "level": 0,
            "comment": "BMW m8 in IMSA energy",
            "score": 22,
            "author": "Wheream_I",
            "replies": [
                {
                    "level": 1,
                    "comment": "[GIGA M8] (https://youtu.be/mSuQr_Iy06E)",
                    "score": 9,
                    "author": "Type_Rex",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.youtube.com/watch?v=VQ7lKPSUc2g",
            "score": 31,
            "author": "magnus3s",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bwipo does it better.",
                    "score": 6,
                    "author": "My_Socks_Are_Blue"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That reminds me of Canyonerooooo",
            "score": 6,
            "author": "Tummynator",
            "replies": [
                {
                    "level": 1,
                    "comment": "12 yards long, 2 lanes wide, 65 tons of American Pride!",
                    "score": 7,
                    "author": "Disgruntle",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can someone add the fuckin wide Russian music?",
            "score": 6,
            "author": "verkterp",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Lmao wtf",
            "score": 24,
            "author": "EliasHobeika"
        },
        {
            "level": 0,
            "comment": "[I made this because I felt that it needed to happen.](https://imgur.com/gallery/suhZtMg)",
            "score": 23,
            "author": "_IDontLikeThings_",
            "replies": [
                {
                    "level": 1,
                    "comment": "That was exactly what it came to my mind",
                    "score": 5,
                    "author": "Schbk77"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you do it for a week please?",
            "score": 6,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "just like my dick",
            "score": 6,
            "author": "pr8zgod",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Is that what wide Putin drives?",
            "score": 5,
            "author": "MetriArja"
        },
        {
            "level": 0,
            "comment": "It's a Pontiac commercial\nhttps://youtu.be/RO6U_KawAdg",
            "score": 3,
            "author": "treatyoftortillas"
        },
        {
            "level": 0,
            "comment": "Definitive af.",
            "score": 5,
            "author": "BigDaddyStonksalot"
        },
        {
            "level": 0,
            "comment": "omg the game really looks like this? Like if you told me this was from the original version I wouldn't have questioned it for a moment.",
            "score": 5,
            "author": "Chefnut",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hands down, funniest fucking bug I’ve ever seen",
            "score": 3,
            "author": "TwoWolfMoon"
        },
        {
            "level": 0,
            "comment": "This is one of the funniest things I’ve ever seen here.",
            "score": 8,
            "author": "lordGwillen"
        },
        {
            "level": 0,
            "comment": "Obviously the vehicle is too heavy for its shape.",
            "score": 3,
            "author": "Tjstictches"
        },
        {
            "level": 0,
            "comment": "a true masterpiece",
            "score": 3,
            "author": "ivanoski-007"
        }
    ]
}