{
    "id": "11346t9",
    "score": 1,
    "title": "Avis sur les cours TIN503-04, GTI619 et MAT265",
    "author": "Otherwise-Revenue-44",
    "date": 1676483932.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/11346t9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Bonjour, j'aimerais avoir votre avis sur les cours suivant : TIN503-04, GTI619 et MAT265.\n\nQuelles sont leur niveau de difficulté. Nombre d'heure par semaine à donner à chaque cours, le style de travaux à remettre, etc.\n\nDe plus, auriez vous une façon super facile d'obtenir 2 crédits pour que je puisse être considéré temps plein ? Jusqu'à  preuve du contraire, je ne peux pas rajouter de cours sans faire un burn out (les horaires sont absolument immondes avec 4 cours). \n\nMerci !",
    "comments": [
        {
            "level": 0,
            "comment": "J'ai bien aimé MAT265. certains disent qu'il peut être difficile mais t'as juste a faire des exercices et tu vas pas avoir de problème. Dans mon cas c'était 2 devoirs de 15% et deux examens de 35%. Pas de niaisage avec des quiz ou des devoirs de 5% qui prennent 2 semaines a faire. Assez léger comme cours selon moi si tu est à ton affaire.",
            "score": 6,
            "author": "Cute_Extent4688",
            "replies": [
                {
                    "level": 1,
                    "comment": "This!",
                    "score": 1,
                    "author": "WilliamBumbre123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tin le cours le plus difficile de mon bac fait attention. Il a l’air facile mais c le contraire",
            "score": 0,
            "author": "No-Hospital6806",
            "replies": [
                {
                    "level": 1,
                    "comment": "Estu srx ?ahah",
                    "score": 1,
                    "author": "Most_Fix_3878"
                }
            ]
        },
        {
            "level": 0,
            "comment": "MAT265: comprends les recettes, suis les recettes, ça va bien aller. J’avais un prof qui passait littéralement 100% du cours à faire des exercices au tableau et je trouve que c’est le meilleur moyen d’enseigner ce cours.\n\nTIN503: il y a deux formats de ce cours, j’étais dans celui de 2 projets, 3 quiz, devoir, final. Je ne me souviens pas de l’autre. Tu choisis tes sujets de projet, et c’est tous des affaires de l’actualité d’aujourd’hui (IA, pipelines, bitcoin, 3e lien, etc). Tant que tu as un prof qui traite ça comme un cours de tronc commun et non comme un cours de concentration, c’est un cours qui est long, mais intéressant et pas trop stressant. Également, les examens sont pas mal de difficulté « étais-tu réveillé ?».",
            "score": 1,
            "author": "jon131517",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hassan?",
                    "score": 2,
                    "author": "Cute_Extent4688",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oui! Je lui trouvais parfois bête dans ses réponses aux questions, mais sa méthode aidait à bien maîtriser les démarches.",
                            "score": 2,
                            "author": "jon131517",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "C'est le GOAT des profs de math! Pas de remplissage, pas de PPT, tout au tableau... tellement facile à comprendre avec lui!",
                                    "score": 2,
                                    "author": "Cute_Extent4688"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Que veux-tu dire par \"étais-tu réveillé\" ?",
                    "score": 1,
                    "author": "Otherwise-Revenue-44",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Genre si tu étais présent et tu ne dormais pas, tu ne devrais pas avoir de problème!",
                            "score": 2,
                            "author": "jon131517"
                        }
                    ]
                }
            ]
        }
    ]
}