{
    "id": "11b3i7o",
    "score": 3,
    "title": "meilleur endroit pour prendre une photo \"de communication\" avec l'ETS ?",
    "author": "Relevant_Ingenuity85",
    "date": 1677276264.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/11b3i7o",
    "media_urls": [],
    "other_urls": [],
    "postText": "Allo, je suis étudiant de France et mon école me demande une photo de moi à l'ETS pour leur papier de communication, je me demandais si vous connaissez des endroits sympa pour faire ce genre de prises, je pensais devant l'entrée principal mais peut-être que le carrefour gâche un peu...",
    "comments": [
        {
            "level": 0,
            "comment": "cafétéria à 12:30",
            "score": 20,
            "author": "SignificanceHuge9509",
            "replies": [
                {
                    "level": 1,
                    "comment": "Je seconde",
                    "score": 1,
                    "author": "IntrepidRazzmatazz78"
                }
            ]
        },
        {
            "level": 0,
            "comment": "La hall du Pavillon D avec les prototypes des clubs.",
            "score": 10,
            "author": "anonconu123"
        },
        {
            "level": 0,
            "comment": "A coter du Centech, si tu a quelqu'un d'autre avec toi, tu pourrais prendre un portrait avec la façade de l'ETS en background.  En prenant assez d'espace, et avec un léger contre plonger, tu peut cacher le boulevard complètement. Sa prend un peut de travail, et d'essai erreur, mais je suis pas mal sur que tu pourrais avoir de bon résultats.  \n\n\nSinon, je suis fan du pavillon D aussi avec les clubs. Dans la maison des étudiant, il y a pas mal de spot a coter des fenêtres, ou dans les marches qui sont pas mal non plus. Sa feras des photos avec beaucoup de lumière mais sa crie moins \"ETS\" par contre.",
            "score": 6,
            "author": "ToJ85"
        },
        {
            "level": 0,
            "comment": "Le pavillon D avec les clubs, le pavillon E avec l'amphithéâtre... Y'a pas mal d'endroits sympas ;)",
            "score": 1,
            "author": "Hellinger_"
        }
    ]
}