{
    "id": "12h9z0e",
    "score": 7,
    "title": "exam final INF111",
    "author": "zazasouza",
    "date": 1681109274.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/12h9z0e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys;\n\nPour ceux qui lont fait les sessions precedentes, saviez vous a quoi on doit sàttendre pour lèxamen final d\\`INF111 ?\n\nMerci et joyeuse fete de paque !",
    "comments": [
        {
            "level": 0,
            "comment": "On l'avait à l'ordi, mais cette année j'ai entendu que l'examen se fait sur papier.\n\nDonc ça va vraiment pas être la même chose.\n\nOn avait des représentations sur notre examen et il fallait employer nos connaissances en OOP et Java Swing pour reproduire le mieux possible la représentations en image sur la feuille de l'examen et aussi s'assurer que c'est fonctionnel.\n\npar exemple, mettre un carré dans le coin supérieur droit à l'intérieur d'un rectangle vide et quand on lance le programme, le carré parcours les côtés du rectangle pour s'arrêter à sa position initiale.\n\nÇa m'étonnerait qu'un examen papier puisse vous imposer ce genre de questions.",
            "score": 5,
            "author": "Angharradh",
            "replies": [
                {
                    "level": 1,
                    "comment": "J'me rappelle plus trop ce qui avait à l'examen, mais quand je l'ai fait en 2018, c'était papier.",
                    "score": 2,
                    "author": "Vince_Magik"
                },
                {
                    "level": 1,
                    "comment": "c'est vrai que sur papier, ca sera different.Merci pour la reponse.",
                    "score": 1,
                    "author": "zazasouza"
                }
            ]
        },
        {
            "level": 0,
            "comment": "La session dernière c’etait sur papier. La première partie c’etait des QCM, la seconde c’etait sur les files / listes chainées, il fallait les implementer. Il y avait également une partie sur les interfaces et la dernière partie ( la plus grosse ) était sur tout ce qui touche la partie GUI du cours. \n\nBonne chance",
            "score": 3,
            "author": "damso5090",
            "replies": [
                {
                    "level": 1,
                    "comment": "yea je confirme c’était bien ça",
                    "score": 1,
                    "author": "familyman160"
                },
                {
                    "level": 1,
                    "comment": "Merci pour la reponse .\n\n \\- pour le QCM cètait des questions liees a la comprehension de certains conceptes ou ces des bouts de codes et faudrait trouve la bonne reponse ?\n\n\\- pour les tris et fouilles on vous a impose un type de tri ou fouille a faire ou c'est a l'etudiant d'en implemente un au choix ?",
                    "score": 1,
                    "author": "zazasouza",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pour le QCM c’etait vraiment sur la comprehension de certains concepts et genre il y avait des descriptions et fallait que tu dises si c’etait du polymorphisme, une interface, un objet etc.\n\n Concernant les tris / fouilles il me semble qu’il y en avait pas. Faut juste les comprendre ( je parle ici de leur particularité ) thats it!",
                            "score": 2,
                            "author": "damso5090",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thanks !",
                                    "score": 1,
                                    "author": "zazasouza"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Linked list , java Gui , héritage et un exercice  à choix multiple  sur composition aggregation …",
            "score": 2,
            "author": "zakizas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Merci pour la reponse !",
                    "score": 2,
                    "author": "zazasouza"
                }
            ]
        }
    ]
}