{
    "id": "12oixdv",
    "score": 1,
    "title": "Besoins de conseils",
    "author": "Emmaillive",
    "date": 1681667748.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/12oixdv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Salut a tous !\n\nJ'ai été accepté en double diplôme en maitrise (technologie de la santé) avec projet. J'aimerais savoir si c'est trop ambitieux de prendre dès mon premier trimestre 4 cours ou si ça se fait ? \n\nVoici mes choix : GTS814, GTS815, MGL835 et j'aimerais rajouter GES800 mais j'ai peur que ca soit trop \\^\\^'\n\nPS : j'arrive en A23\n\nMerci pour votre réponse",
    "comments": [
        {
            "level": 0,
            "comment": "J'ai honnêtement aucune idée de la réponse, étant en informatique et encore moins en maîtrise.\nPar contre, de ce que j'ai entendu, les cours de maîtrise sont encore pire côté travail.\nPar contre, rien ne t'empêche de tester une première session avec 3 cours et de changer le nombre de cours à 4 pour ta prochaine session. Personne n'est pareille et même si 3 cours c'est trop pour certains, 4 ne l'est pas pour d'autres.",
            "score": 4,
            "author": "tigie11",
            "replies": [
                {
                    "level": 1,
                    "comment": "Merci de la réponse !",
                    "score": 1,
                    "author": "Emmaillive"
                }
            ]
        },
        {
            "level": 0,
            "comment": "C'est trop.  \nN'oublie pas qu'à la première session, tu dois normalement prendre ATE800, comme tous ceux qui commencent une maîtrise (à moins d'un conflit exceptionnel d'horaire).  \n\nPour une maîtrise avec projet, tu as environ 10 cours à prendre + ATE800 + un projet à faire. 10 cours pour une maîtrise de 2 ans, soit 6 sessions, tu n'as pas besoin de tout compacter dès le début. \n\nDis-toi qu'un cours de maîtrise peut-être soit : \n\n* La même difficulté qu'un cours du bac.\n* Être 2 à 3 fois la difficulté qu'un cours du bac.\n* Être 5x la difficulté qu'un cours du bac.\n\nIci je parle de ma propre expérience.\n\n--\n\nLe plus important lorsque tu commenceras ta maîtrise : \n\n1) Trouve toi un prof et un projet si ce n'est pas déjà fait, ça peut prendre plus de temps que prévu. \n\n2) Juste apprendre comment «ça marche» une maîtrise ça peut prendre un peu de temps.\n\n3) Prend du temps pour connaître ton prof et le projet.\n\n--\n\nBonne chance !",
            "score": 3,
            "author": "ZeeKhar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok merci ! Je ne vais donc pas opté pour 4 cours. Merci",
                    "score": 1,
                    "author": "Emmaillive"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Je regarde pour une maitrise aussi et on m'a toujours recommandé de prendre seulement 3 cours de maitrise. Pour être à temps plein, il semblerait que c'est 9 crédits qu'il faut à la maitrise.   \n\n\nAu pire essaye toi et tu abandonneras un cours si tu vois que c'est trop intense.",
            "score": 1,
            "author": "TheLink404",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok merci! J'ai noté",
                    "score": 1,
                    "author": "Emmaillive"
                }
            ]
        }
    ]
}