{
    "id": "134nhcw",
    "score": 4,
    "title": "Moyenne cumulative",
    "author": "zozobandit590",
    "date": 1682950111.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/134nhcw",
    "media_urls": [],
    "other_urls": [],
    "postText": "La session passée j'ai eu un E dans un cours et cette session j'ai réussi le cours avec un A.\n\nLa coordonnatrice m'avait que la côte de mon échec sera écraser pour la nouvelle note, mais dans ma moyenne le E est encore pris en compte. \n\nEst-ce que je dois attendre ou écrit un courriel à la coordonnatrice ?",
    "comments": [
        {
            "level": 0,
            "comment": "Attends quelques jours ca va se placer",
            "score": 6,
            "author": "jujuj97"
        },
        {
            "level": 0,
            "comment": "J'imagine que L veut dire que le cours a été réussi.\n\nPis jveux pas \"talkshit\", mais passer de E à un A montre bien à quel point le choix du prof est primordial à la réussite.",
            "score": 7,
            "author": "zozobandit590",
            "replies": [
                {
                    "level": 1,
                    "comment": "ou à quel point tu te pognais le cul",
                    "score": 11,
                    "author": "Banzai262",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mdrrr tu es franc de collier.",
                            "score": 2,
                            "author": "2pi_N"
                        },
                        {
                            "level": 2,
                            "comment": "C'est pas très fair de ta part de supposer de l'effort des autres sachant que les profs transmettent l'information tous différemment et que des facteurs externes peuvent influencer la note des élèves",
                            "score": 3,
                            "author": "zozobandit590",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "j’suis ben d’accord, mais passer d’un E à un A, c’est clairement pas juste le prof",
                                    "score": 12,
                                    "author": "Banzai262",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Je te l'accord",
                                            "score": 1,
                                            "author": "zozobandit590"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok merci, je vais attendre un peu.\nAvec le E ma moyenne est à 1,90 et je risque la tutelle, ça me stress un peu",
            "score": 1,
            "author": "zozobandit590",
            "replies": [
                {
                    "level": 1,
                    "comment": "T'as rien à t'inquiéter, c'est normal que le changement soit pas fait tout de suite. Le système se mettra à jour et ta cote sera réajustée puis ton E sera remplacée par un L.",
                    "score": 2,
                    "author": "kristian199037"
                },
                {
                    "level": 1,
                    "comment": "La tutelle est appliqué seulement à la fin de la session été pour les programmes de 1er cycle.  Stress pas avec ta note ton E va être remplacé par la note L et ta moyenne va monter 👍",
                    "score": 2,
                    "author": "junksampler"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Si la note est entrée aujourd'hui, elle sera mise a jour cette nuit. :)",
            "score": 1,
            "author": "djuju"
        }
    ]
}