{
    "id": "13fitp9",
    "score": 2,
    "title": "Résidences ets",
    "author": "Impressive-Elk-7655",
    "date": 1683891984.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/13fitp9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Salut,\nJe suis un étudiant français et j'aimerais savoir dans le cas où j'ai une place, j'ai rempli liste d'attente si les résidences pour 2 ou 4 sont biens ? Les avantages et inconvénients ? Et si les inconvénients sont surmontables par rapport aux avantages ?\nEst-ce que les obligations sont vraiment contraignantes ? Genre d'invitation :  personne après minuit ou 2h \nOn peut rompre le bail sauf si on paye 1 mois et demi de loyer etc etc\nEt j'ai mis une autre question dans les commentaires \n\nMerci beaucoup",
    "comments": [
        {
            "level": 0,
            "comment": "Les résidences sont super à mon avis. Le trucs des invitations est pas vérifié du tout (à moins j'imagine que si tu faisait un gros party de 50 personnes jusqu'à 6h du matin). \n\nPour la rupture de bail c'est assez normal à ce que je sache. Si tu as un stage tu peux simplement les aviser et quitter, pas besoins d'aviser d'avance. Et je crois que si tu rompt le bail 2 mois avant de quitter tu ne payeras rien d'extra aussi.",
            "score": 5,
            "author": "Kronostatic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Super merci beaucoup !!!",
                    "score": 1,
                    "author": "Impressive-Elk-7655"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Avantage : c’est facile d’y rentrer une fois l’attente, les paperasseries sont faciles comparativement au privé et t’as un handy man si jamais tu casses de quoi, loyer abordable pour la zone, distance de 2min à l’école, bon emplacement pour sortir en ville, bonne isolation entre les appartements \n\nDésavantage : assez insalubre par endroits dans les espaces commun mais c’est une résidence étudiante donc bon normal, tu choisis pas tes colocs au début mais tu peux toujours bouger de chambre plus tard, mauvaise isolation entre les chambres",
            "score": 1,
            "author": "Jikso67",
            "replies": [
                {
                    "level": 1,
                    "comment": "D'acc merci beaucoup ! \nEt tu aurais une réponse à mon autre question dans les commentaires pour savoir si on est dans les résidences 1-2-3-4 et tout ? Ou personne ne sait trio ?",
                    "score": 1,
                    "author": "Impressive-Elk-7655"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Inconvénient: tu peux avoir des colocataires supportables qui laissent les espaces communs sales et ne prennent aucune responsabilité pour en prendre soin\nHonnêtement ça peut devenir tellement chiant parfois.",
            "score": 1,
            "author": "HawkPrimary8084"
        },
        {
            "level": 0,
            "comment": "J'avais une autre question, j'ai parlé à qqun qui avait reçu un oui dans mail : \n.....\nBonjour,\n\nSuite à votre demande de location pour un appartement partagé de deux à quatre chambres dans les résidences de l’ÉTS, pour la session d’automne 2023, nous vous informons que nous avons une place de disponible pour vous à compter du 1er septembre 2023.\n \n\nSi vous êtes intéressé, veuillez effectuer un dépôt de 654$ pour confirmer votre demande (non remboursable, qui sera appliqué à votre premier mois de loyer).\n\n......\nMais comment savoir dans ce cas si c'est un appart de 2 ou 4 personnes et dans quel bloc c'est ? Pcq c'est pas précisé dans le mail et à la limite de ce que j'ai un peu lu, on peut faire par rapport au loyer (donc ça paraît être un truc de 2) mais ensuite bloc 1-2-3-4 on peut pas savoir ?\n\nMerci !",
            "score": 0,
            "author": "Impressive-Elk-7655"
        }
    ]
}