{
    "id": "13q7h8s",
    "score": 0,
    "title": "PHYTEST",
    "author": "Fougere_320",
    "date": 1684892523.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/13q7h8s",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello\n\nJe m'étais inscris en GOL pour la session A23 et j'ai fais les deux test (science et math). J'ai réussis math, mais j'ai coulé science car on moi et mon ami on a fait un peu n'importe quoi. Néanmoins, par la suite, on a décidé de changer de programme pour aller en MEC (oui même si on a coulé le test, on est pas vraiment inquiet à ce niveau), sauf que dans notre horaire, on nous redemande de faire PHYTEST...\n\nEst-ce qu'il y a différent test de science selon le programme choisis ou pas ? Car MATEST nous est pas redemandé.",
    "comments": [
        {
            "level": 0,
            "comment": "Tu avoues avoir triché au test et l'avoir fait à deux? 🤔",
            "score": 4,
            "author": "AnonymousLama",
            "replies": [
                {
                    "level": 1,
                    "comment": "Malheureusement, je ne suis pas le premier ni le dernier à profiter du fait d’être à distance pour faire un test de placement. Faut pas se voiler la face là dessus…",
                    "score": -5,
                    "author": "Fougere_320",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ça commence bien une carrière d'ingénieur.",
                            "score": 6,
                            "author": "AnonymousLama",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "T’as clairement, au travers de tous tes années d’étude, profite a un moment ou un autre d’internet, de l’aide d’un ami ou autre pour réussir un test, un devoir (qui compte) ou pire. Pourtant, tu vas devenir ingénieur aussi.\n\nDire l’inverse c’est de mentir à soit même, joue pas au saint alors que tu ne l’es sûrement pas plus.",
                                    "score": -7,
                                    "author": "Fougere_320"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}