{
    "id": "13qkrgy",
    "score": 1,
    "title": "ELE216 et ELE200 en meme temps",
    "author": "caid053",
    "date": 1684932604.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/13qkrgy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Je suis quand même trash en prog et je sais que ELE216 va être un de mes pires cauchemars surtout sachant que j’ai refait INF147. Est ce que le fait de prendre ELE216 avec ELE200 c’est une bonne idée? ELE200 est à double seuil aussi et vu que c’est presque toujours Vahé Nerguizan qui le donne et on m’a dit qu’il est extrêmement sévère dans sa correction. Je sais pas si c’est safe de prendre ces 2 cours en même temps cette automne. \n\nPs: je vais prendre 3 cours maximum anyway",
    "comments": [
        {
            "level": 0,
            "comment": "ELE200 est pas trop pire si le chargé de TP est bon.",
            "score": 3,
            "author": "Lactancia"
        },
        {
            "level": 0,
            "comment": "ele200 j'ai trouvé un peux tough, aussi pcq vahé va vite en général. si tu dis que tu es pas bon en prog, peut etre focus sur ele216 et garde ele200 pour une autre session? moi j'ai fait les deux en meme temps mais c'est pcq je suis correct en prog. par contre, ele200 me stressait",
            "score": 3,
            "author": "beru-sama"
        },
        {
            "level": 0,
            "comment": "J'ai pas un gros intérêt pour la prog et je suis nul mais j'ai réussi à faire les deux cours simultanément en ayant Vahé en ELE200 (Il a retiré le double seuil de 55% sinon la moitier du groupe ne passait pas)\n\nTu vas faire beaucoup de debug autant dans ton projet de ELE200 que tes laboratoires de ELE216, mais avec trois cours à l'horaire ça se fait bien !",
            "score": 1,
            "author": "wawawiwaaaaa",
            "replies": [
                {
                    "level": 1,
                    "comment": " Pour le double seuil.Est ce qu’il l’a fait spécifiquement pour ta classe ou est ce qu’il a l’habitude de faire ça en générale?",
                    "score": 1,
                    "author": "caid053",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "C'était la première fois qu'il mettait un double seuil en théorie. (C'était un échec apparemment)\nJe ne sais pas comment il va s'y prendre pour les prochaines sessions, il fait souvent des petits changements comme ça.\nPar exemple une session il faisait faire des oraux comme petits examens individuels mais moi c'était des mini-quiz de 15 min\nIl essaie de s'adapter et essaie d'éviter que les gens passent seulement grâce au projet",
                            "score": 2,
                            "author": "wawawiwaaaaa"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Je suis vrm pas sharp en prog et j'ai pris 200, 216 et 413 en même temps (+ 22h de work) et j'ai réussi les 3.... ma pire session et mes notes sont à chier mais si tu veux vraiment le faire je pense que tes good",
            "score": 1,
            "author": "bigchillin18",
            "replies": [
                {
                    "level": 1,
                    "comment": "* j'avais en Rafaf en 200 tho... might be a game changer lol",
                    "score": 2,
                    "author": "bigchillin18"
                }
            ]
        }
    ]
}