{
    "id": "13v2sem",
    "score": 2,
    "title": "Initiation ou événement(s) ?",
    "author": "PommeVerte99",
    "date": 1685385405.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/13v2sem",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello peuple!\n\nOn se posait cette question mes amis et moi sans nécessairement trouver la réponse. Le terme initiation n'est peut-être plus approprié, mais est-ce que c'est toujours d'actualité ce genre d'événement pour les nouveaux étudiants ? Si oui, est-ce qu'il y'en a un en mécanique et quand connait-on la date (si y'en a un bien sur) ?\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "ETS et initiation ne sont pas des termes qui vont ensemble! tu n'auras pas des initiations comme dans les autres unis c'est sur",
            "score": 22,
            "author": "Affectionate-Glass10"
        },
        {
            "level": 0,
            "comment": "Non",
            "score": 4,
            "author": "AnonymousLama"
        },
        {
            "level": 0,
            "comment": "Il y auras des activités de la rentrée, d'intégration par programme et pour la communauté étudiante global.",
            "score": 3,
            "author": "Jenlyfish",
            "replies": [
                {
                    "level": 1,
                    "comment": "Intéressant alors, surtout l'aspect intégration par programme ! J'espère que ça permet de faire connaissance avec le plus de monde possible",
                    "score": 1,
                    "author": "PommeVerte99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "J’ai entendu dire qu’ils en planifient une pour l’automne mais d’habitude c’est pas quelque chose de super gros.",
            "score": 2,
            "author": "RichRamen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Je commence en automne, donc je verrais bien ce que c'est. Je m'attends pas à un gros party, mais plus un moyen de rencontrer du monde un peu mettons..",
                    "score": 2,
                    "author": "PommeVerte99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "si tu cherches des activités sociales je te conseille de checker les jeux de génie de l'éts, il y a des événements organisés toute l'année et ils sont d'habitude ouverts à tous! Ça se peut qu'ils organisent aussi quelque chose pour la rentrée d'automne\n\nvoilà le groupe facebook des jeux éts:\nhttps://www.facebook.com/groups/jdgets/?ref=share&amp;mibextid=NSMWBT",
            "score": 2,
            "author": "Hypstersaurus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good, merci ! Je vais regarder ça ! :)",
                    "score": 1,
                    "author": "PommeVerte99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ils sont des intégrations à l’ETS. Et en été, il n’y en a pas (ou pas beaucoup en tout cas).",
            "score": 0,
            "author": "anonconu123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Downvoted pour la vérité? Shocked pikachu",
                    "score": 1,
                    "author": "anonconu123"
                },
                {
                    "level": 1,
                    "comment": "Ha oui j’ai pas eu la mienne en automne",
                    "score": 1,
                    "author": "Existing_Minute_2067"
                },
                {
                    "level": 1,
                    "comment": "En espérant que l'automne soit mieux à ce niveau, je commence en septembre.",
                    "score": 1,
                    "author": "PommeVerte99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jai fait mon initiation back in 2017 pis c'était assez plate comme événement. Il pleuvait, c'était mal organisé et les gens étaient assez froid, si t'étais pas déjà dans un club. On a fini par se regrouper une gang d'amis de cegep et on a eu du fun ailleurs, mais les \"initiations\" c'est rien de spectaculaire! Vous ratez pas grand chose.",
            "score": 1,
            "author": "Disastrous_Ad_266"
        },
        {
            "level": 0,
            "comment": "Rumeurs dit qu’il y a beaucoup “d’événements” pour la rentrée d’automne! 😉 *may or may not be partie de l’organisation*",
            "score": 1,
            "author": "NHL_001"
        }
    ]
}