{
    "id": "141o73r",
    "score": 2,
    "title": "+1000$ pour un cours comme GIA410",
    "author": "iMaSkAsS",
    "date": 1685991023.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/141o73r",
    "media_urls": [],
    "other_urls": [],
    "postText": "Pire cours du Bac. Plate et mal expliqué. C’est comme partir à la guerre sans munition.\nPour ce prix là, j’aimerais avoir un cours de qualité.",
    "comments": [
        {
            "level": 0,
            "comment": "Skill issue",
            "score": 17,
            "author": "closerrocket23",
            "replies": [
                {
                    "level": 1,
                    "comment": "Je suis pas un génie I guess.",
                    "score": 0,
                    "author": "iMaSkAsS"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pourquoi +1000$ ? Probablement que tu as été mal chanceux avec ton prof parce que personnellement j’ai trouvé que c’était un des cours les plus importants du cheminement en génie puisque ça nous donne les bases à propos du monde de l’économie qui affecte littéralement tout ce qu’on fait que ce soit dans le monde du génie ou dans la vie de tous les jours.",
            "score": 14,
            "author": "nicolol65",
            "replies": [
                {
                    "level": 1,
                    "comment": "Le prix du cours/crédits en tant qu’étranger. Oui je pense la prof est qualifiée mais elle explique comme si on était des banquiers. Personnellement, je pense que  y’a énormément de logiciels pour faire ce qui est enseigné dans le cours. Ou alors un comptable ou autres. Intéressant à comprendre mais ça vaut pas le prix ni le temps perdu.",
                    "score": -8,
                    "author": "iMaSkAsS"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Accroche ta tuque. Si Gia c'est ruff, attends de voir la suite..",
            "score": 3,
            "author": "IntrepidRazzmatazz78",
            "replies": [
                {
                    "level": 1,
                    "comment": "Je dis pas que c’est dur, juste que c’est très mal expliqué et pas du tout intéressant à écouter. Je parle surtout du format du cours.",
                    "score": 1,
                    "author": "iMaSkAsS"
                }
            ]
        },
        {
            "level": 0,
            "comment": "C'est un des cours que j'ai le plus aimé du bac..",
            "score": 5,
            "author": "fella7ena",
            "replies": [
                {
                    "level": 1,
                    "comment": "Psychopathe",
                    "score": 6,
                    "author": "iMaSkAsS"
                }
            ]
        },
        {
            "level": 0,
            "comment": "J’ai eu Maxime Boucher Rochon, vraiment bon enseignant, c’était plutôt intéressant avec lui.",
            "score": 3,
            "author": "GimliQC"
        },
        {
            "level": 0,
            "comment": "T'as pas vu gti350, le cours le plus inutile du bac en log.",
            "score": 4,
            "author": "mrrara44"
        },
        {
            "level": 0,
            "comment": "+1000$? Vous parlez de quoi?",
            "score": 1,
            "author": "LeoC_II",
            "replies": [
                {
                    "level": 1,
                    "comment": "Le prix du cours/crédits en tant qu’étranger.",
                    "score": 4,
                    "author": "iMaSkAsS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah shite c'est rough comme coût",
                            "score": 2,
                            "author": "LeoC_II",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bah c’est le prix d’ami pour les étudiant français, pour les autres étrangers C’est plutôt 3000$ pour un cours de 3 crédits https://www.etsmtl.ca/calculateur",
                                    "score": 3,
                                    "author": "junksampler",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "On est tous des bonnes vaches à lait oui.",
                                            "score": 1,
                                            "author": "iMaSkAsS"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "J'ai fait GPE450 et c'était la même genre de Poutine qu'on nous servait! Le prof était gentil, mais c'était de la grosse logique de base aussi ... \n\nAprès si tu parle juste de cours inutile, Log100 pour quelqu'un qui sort d'un dec technique en pure programmation, cest pas hyper utile non plus",
            "score": 1,
            "author": "MilkyTommy",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; J'ai fait GPE450 et c'était la même genre de Poutine qu'on nous servait! Le prof était gentil, mais c'était de la grosse logique de base aussi ...\n\nReal talk. Je prends GPE cette session et je sais même pas quoi étudier pour l'intra. Il n'y a rien de spécifique, tout est juste du gros bon sens. Ce genre de cours là devrait pas exister.",
                    "score": 1,
                    "author": "Engineer--",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Véreux les jeunes…",
                            "score": 1,
                            "author": "closerrocket23"
                        },
                        {
                            "level": 2,
                            "comment": "J'imagine que lire les livres et bien comprendre les concepts... Honnêtement j'ai tout fait ce qu'il avait demandé pour l'intra et j'ai eu la moyenne, puis j'ai rien fait pour le finale et j'ai eu 10% au dessus de la moyenne donc bon ...\n\nY a pas de piège, c'est souvent des mises en situation et faut trouver les erreurs commis par le gestionnaire et expliquer comment il aurai pu mieux faire, développer sur les X choses importantes pour être un bon gestionnaire, la différence entre Boss et leader, etc.",
                            "score": 1,
                            "author": "MilkyTommy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "J’ai vu le prof et le boomer que c’était. Et j’ai vite changer de cours. \nAvec ces livres à 60$ et son égo surdimensionnés c’est un bon gros redflag ce cours là",
                    "score": 0,
                    "author": "Jikso67"
                }
            ]
        }
    ]
}