{
    "id": "142zzls",
    "score": 2,
    "title": "OIQ et frais CPO",
    "author": "OkValuable1",
    "date": 1686102703.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/142zzls",
    "media_urls": [],
    "other_urls": [],
    "postText": "Je suis CPI depuis quelques années ( payés par l'employeur ) et j'aimerais terminer ça bientôt. En regardant la grille tarifaire, ça dit :\n\nÉvaluation des compétences- moins de 12 mois d'expérience 0,00 $\n\nÉvaluation des compétences-12 mois et plus d'expérience hors Québec 0,00 $\n\nÉvaluation des compétences-12 mois et plus d'expérience au Québec 630,00 $\n\nJ'ai fait un peu le saut en voyant le 630$. Est-ce que tout le monde paie ça ou il y a moyen de passer plusieurs experiences de moins de 12 mois pour avoir le total de 24mois et payer 0$?\n\nAvec tout les bloc de formation, l'examen et l'évaluation des compétences, ça te monte un beau bill ça",
    "comments": [
        {
            "level": 0,
            "comment": "De mémoire, je crois que tu peux soumettre plusieurs expériences totalisant 24 mois et ainsi te sauver des frais de 630,00$. Par contre, tu peux toujours contacter l'OIQ pour avoir l'heure juste. Et je ne sais pas quel genre de deal que tu as avec ton employeur, mais mon employeur moi me payait tout. Tu n'as rien à perdre de demander. Sinon, je sais que tu peux le mettre sur tes impôts.",
            "score": 1,
            "author": "Burnizer88"
        },
        {
            "level": 0,
            "comment": "Petite précision, tu ne peux mettre que les frais de cotisation d'une ordre professionnel dans tes impôts, pas de frais d'adhésion. https://www.canada.ca/fr/agence-revenu/services/impot/particuliers/sujets/tout-votre-declaration-revenus/declaration-revenus/remplir-declaration-revenus/deductions-credits-depenses/ligne-21200-cotisations-annuelles-syndicales-professionnelles-semblables.html",
            "score": 1,
            "author": "AnimatorChance3353"
        }
    ]
}