{
    "id": "qq9apr",
    "score": 90,
    "title": "Charge de travail",
    "author": "xXxCr1nG3xXx",
    "date": 1636480630.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/qq9apr",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Quand quelqu'un (pas en ingé) voit ton horaire et te dit \"hey t'es dispo t'as pas de cours aujourd'hui\".",
            "score": 29,
            "author": "Evirua"
        },
        {
            "level": 0,
            "comment": "com110",
            "score": 21,
            "author": "Deathmore80"
        },
        {
            "level": 0,
            "comment": "Meme [checks out](https://www.etsmtl.ca/docs/etudes/premier-cycle/documents/reglements-etudes-1er-cycle):\n\n&gt;2.26 Crédit  \n&gt;  \n&gt;L’unité qui permet d’attribuer une valeur numérique à la charge de travail requise d’un étudiant pour atteindre les objectifs particuliers des cours ou des activités pédagogiques. **Le crédit correspond**, selon l’estimation de l’École, **à quarante-cinq (45) heures** d’apprentissage ou de travail (cours, laboratoires, travaux pratiques, travaux personnels, etc.), y compris l’évaluation.",
            "score": 3,
            "author": "fuhrmanator",
            "replies": [
                {
                    "level": 1,
                    "comment": "Je pense qu'ils vont devoir revoir leurs estimations...",
                    "score": 6,
                    "author": "jon131517"
                }
            ]
        },
        {
            "level": 0,
            "comment": "au moins c'est pas comme au cegep avec des projets de 10h qui vaut 2%",
            "score": 4,
            "author": "No_CardiologistMrs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ça c'est les pires en effet",
                    "score": 1,
                    "author": "xXxCr1nG3xXx"
                },
                {
                    "level": 1,
                    "comment": "Mmmmh ça me rappelle les labs de méca du bac, obligé de grinder pendant 10h pour 3-4% de la note et pour au final ne jamais avoir au dessus de 95-96%",
                    "score": 1,
                    "author": "Eritog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "si tu passe tes heures de tp pour etudier les exams, tu va realiser que c plus worth ton temps, pcq les exams valent plus, mon plan au bac etait toujours de speedrun les tp pour avoir kk chose comme 60-75% et juste study, et jai fini avec un gpa comme 3.8",
            "score": 1,
            "author": "Ryusei_Jp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Très mauvais conseil, je trouve. Les Tp et les laboratoires aident a mettre en pratique la matière donc évacuez les labs pour juste étudier pour l'examen, je me demande ce que tu retiens a la fin du cours ? oui tu as 3.8 mais la comprehension doit suivre.\n\nPS : je finis le bac cette session et j'ai plus de 3.8 comme GPA et surtout pas eu besoin de speedrun les tps ou les labos pour ca. Les labos ou les examens sont fait pour etre bien fait.",
                    "score": 1,
                    "author": "AngelPPersie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "bof, ca depend comment tu value ton temps, jprefere mettre 10h pour etudier un exam (30%) vs un tp qui vaut juste 10%, c sur si tu as le temps, tu peux tout faire bien lol c mm pas une question",
                            "score": 1,
                            "author": "Ryusei_Jp"
                        }
                    ]
                }
            ]
        }
    ]
}