{
    "id": "rck7g5",
    "score": 73,
    "title": "PSA: Attention avec l'histoire du laptop",
    "author": "aLx450",
    "date": 1639064298.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/rck7g5",
    "media_urls": [],
    "other_urls": [],
    "postText": "Salut!\n\nJ'ai regardé les specs \"recommandées\" par l'école pour les laptops obligatoires en 2022 et je m'en serais voulu de pas donner un peu de perspective, surtout pour les noveaux en LOG. Je termine mon BAC cette session et je vous promets que vous n'êtes même pas proche d'avoir besoin de ce qu'ils demandent pour compléter la totalité de vos cours haut la main.\n\nJ'ai monté mon PC il y a 7 ans, bientôt 8, avec les specs suivantes:\n\ni7 4790k (4e génération), 16 Gb de RAM DDR3 (!!!), GeForce GTX 970\n\nMon laptop \"d'école\" est un Lenovo 2007 (oui, t'as bien lu) avec une upgrade SSD et RAM a 8 Gb.\n\nJe n'ai eu absolument AUCUN problème avec ces specs. Bon, ok, j'ai dû utiliser Unity dans 2 cours et c'était un peu long à launch, mais tu feras pas de jeu AAA à l'ETS, stress pas.\n\nMaintenant, un peu de perspective concernant l'école et ses soit-disant \"cours à la fine pointe de la technologie\".\n\nIls sont encore sur Java 8 (oui, t'as bien lu). Certains labs nécessitent une version de librairie JDBC tellement vieille qu'elle n'est même plus dans les archives d'Oracle. Les slides de plusieurs cours, comme GTI611, LOG660 ou GTI619 datent de, tenez-vous bien, 2011. Certains services internes de l'école stockent les mots de passe en clair. Je pourrais continuer longtemps\n\nL'histoire du laptop de gamer à 2000$, c'est un immense scam. Don't do it, c'est overkill et aucunement nécessaire. Bonne rentrée, have fun!",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;Certains services internes de l'école stockent les mots de passe en clair.          \n\nJ'aimerais en savoir plus. La sécurité des données = very important",
            "score": 15,
            "author": "djuju",
            "replies": [
                {
                    "level": 1,
                    "comment": "Il y a 4 ans, le bureau du registraire a été capable de m'imprimer le mot de passe de mon compte ETS en clair. Depuis, je n'ai donc aucune confiance en quelque sécurité des données à l'ÉTS.",
                    "score": 8,
                    "author": "entarko",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Il y avait la possibilité de générer un mot de passe temporaire lorsqu'on était \"lockout\" ou que l'étudiant avait perdu son mot de passe. L'étudiant devait s'identifier au comptoir du bureau du registraire pour obtenir un mot de passe temporaire. En ce moment, tous les accès sont liés au Single Sign-On (SSO) et c'est complètement impossible de voir le mot de passe. Sans me dévoiler, la sécurité des données est hyper importante pour l'ÉTS et pour moi. Si j'attrape des failles, je m'assure que ça soit régler rapidement. Si tu as un doute ou une inquiétude, merci de m'en faire part et je communiquerai avec les gens concernés.",
                            "score": 3,
                            "author": "djuju",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Je ne parlais pas d'un mot de passe temporaire qu'ils génèrent mais bien de celui que j'avais choisi. Lors de ma première inscription, j'avais reçu un mail me donnant mon premier mot de passe de l'ETS que j'ai donc immédiatement changé. Puis quand je suis allé au bureau du registraire pour compléter mon inscription à l'ÉTS, il mont imprimé une feuille décrivant l'accès au compte pour des nouveaux étudiants avec, entre autre, le mot de passe que j'avais choisi au lieu du premier mot de passe temporaire.\n\nUtilisant des mots de passe différents partout, ce n'est pas grave mais bon, ça inspirait pas la confiance ; j'espère que ça a été changé depuis.",
                                    "score": 1,
                                    "author": "entarko",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Before my time surement. Je ne peux pas commenter sur ça.    \n Maintenant, c'est impossible. Personne ne voit les mots de passe. 100% SSO encrypted.",
                                            "score": 2,
                                            "author": "djuju"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Je ne connais pas les détails, mais c'est peut-être pas directement la faute de l'ÉTS. \"L'ÉTS est une constituante du réseau de l'[Université du Québec](https://www.uquebec.ca/reseau/fr/reseau-de-luq/les-etablissements)\". Elle dépend(ait) énormément de l'infrastructure informatique de l'UQ et je ne serais pas étonné d'apprendre que le mot de passe donné par le BDR est(était) stocké en clair dans une BD de l'UQ.",
                            "score": 0,
                            "author": "fuhrmanator"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "En lien avec les bases de données Oracle utilisées dans les cours, contiennent certaines infos en lien avec le code permanent et autres éléments, etc. Ça a peut-être été réglé, mais il y a 2 ans, ce ne l'était pas",
                    "score": 7,
                    "author": "aLx450",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "L'accès à ses tables ne sont plus accessibles par la population étudiante / employées non concernées par l'information qui s'y trouve ET ça ne devrait pas être possible d'accéder cette info sans les autorisations/accès (si ce l'est toujours, merci de me le signaler en messagerie)",
                            "score": 1,
                            "author": "djuju"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Semi related mais y'a quelques mois j'ai voulu me connecter sur Cheminot, y'a eu une erreur et en appuyant sur OK y'avait des credentials de dev d'auto filled dans le login form, j'ai pu cliquer sur Connecter et ça m'a login sur un compte de dev, où j'ai choke et j'ai instantly fermé Cheminot.\nSi un front-end d'application est capable de fill des infos de login comprenant un mot de passe, jsuis un peu worried si ça a réussi à fetch ce data là de la base de donnée. J'espère que c'était juste des creds de saved en variable dans l'appli pour debugging purposes.",
                    "score": 2,
                    "author": "DeepHex"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Salut,\n\nNous sommes en discussion avec les différentes personnes impliquées pour prendre des actions concernant les spécifications des ordinateurs obligatoires.\n\nJ'invite ceux et celles qui sont intéressé à faire partie d'un focus group en janvier pour discuter de la situation de m'envoyer un courriel à l'adresse [vpfinances@aeets.com](mailto:vpfinances@aeets.com).\n\nBonne fin de session !",
            "score": 10,
            "author": "Popa_bless"
        },
        {
            "level": 0,
            "comment": "Même si beaucoup de changements et de renouvellements ont l'air d'être prévus dans certains cours, totalement d'accord avec toi. A quel moment un cours va nécessiter par exemple un écran 3k et une carte graphique surpuissante ?",
            "score": 10,
            "author": "thibosmont"
        },
        {
            "level": 0,
            "comment": "Personnellement, je vais me présenter au cours avec mon vieux portable 2012. Je suis en génie électrique, pas en programmation. Tant que je suis capable de faire les tâches demander du prof, \"Who cares?\"\nQuelq'un connaît les conséquences de pas suivre ce règlement en matière de Spec?",
            "score": 5,
            "author": "BlastCom",
            "replies": [
                {
                    "level": 1,
                    "comment": "En fait la raison de se règlement, a mon avis, c'est juste pour ne plus avoir à en fournir aux étudiants, et donner la possibilité aux enseignants d'utiliser des logiciels qui exigent une machine performante sous windows, sans avoir à se soucier de ceux qui ne sont pas équipés. Je serai très étonné qu'il y ait des contrôles, ce sera juste \"tant pis pour toi\" si tu n'as pas ça.",
                    "score": 7,
                    "author": "thibosmont",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "C'est exactement ce que je pense. J'ai pas de laptop, et il m'est impossible de travailler dans les labs du cours de LOG680 car plusieurs éléments Python ne sont pas installées. Les profs et chargés ne demandent pas au service technique, donc la « solution » de l'ÉTS est que tu amènes ton propre laptop...",
                            "score": 5,
                            "author": "catadeluxe"
                        },
                        {
                            "level": 2,
                            "comment": "Exact - comme le livre obligatoire que personne ne contrôle. Sauf que télécharger une version PDF d'un GPU ne va pas améliorer la performance de ton ordi.",
                            "score": 1,
                            "author": "fuhrmanator"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Je vois mal comment ils pourraient imposer une \"conséquence\" tbh... Le point est exactement ça en fait, peu importe le programme, tant que tu peux faire ce qui est demandé. Bon, je connais pas les cours d'ELE ou MEC, peut-être que vous avez besoin de CATIA or something, mais même là, un laptop 2012 est amplement suffisant.",
                    "score": 4,
                    "author": "aLx450",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pour MEC, on utilise CATIA, ANSYS et MATLAB principalement. Pour CATIA et ANSYS, il n'y a pas assez de clé Pour tous le monde, alors on utilise vraiment les desktops de l'école. Ça me surprendrais vraiment beaucoup que l'ETS force ça sur les laptops.",
                            "score": 4,
                            "author": "Stonewarder_85",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Perso j'ai reussi au début de cette session-ci à m'installer une license de CATIA sur mon laptop et sur ma tour, il semblait pas y avoir de problème de quantité...",
                                    "score": 1,
                                    "author": "Etienne19381",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Quand j'ai fait mec129, on avais des avertissements que les licenses etais uniquement pour ce cours et de ne pas les donner aux autres sinon on allais en manquer. De la même matière, en mec029 le prof nous as tomber dessus parce qu'on avais pas de license catia (fuck le prof de mec029)...\n\nÇa peut être changer avec le temps.",
                                            "score": 1,
                                            "author": "Stonewarder_85",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Je crois que c'est à cause de la Covid, l'école a eu bcp plus de licenses. Le prof de MEC029 nous encourageait fortement à le downloader chez nous pour qu'on puisse se pratiquer. J'avais Abdelmajid Lajmi.",
                                                    "score": 1,
                                                    "author": "Etienne19381",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Même prof, mais j'ai pas des bons souvenir de ce prof...",
                                                            "score": 1,
                                                            "author": "Stonewarder_85"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Avant de commencer je dois dire que je suis d'accord que les requis étaient trop, mais que la question est plus nuancé qu'on le croit. La plupart des gens semblent assumer que c'est parce que l'école est cheap et ne veut pas investir dans leur infrastrucure, personnellement je ne pense pas qu'il y avait une mauvaise intention derrière.\n\nJ'étais d'accord avec toi jusqu'à tous récemment. Avec l'arrivée des puce m1, de la nouvelle génération de gpu et bientôt de l'architecture zen 4 ca va changé. (ca vient d'un gars avec un laptop i5 gen 3 16gb ram aucun gpu). Les programmes et library qui étaient préalablement petite vont évolué et demander plus de performance, surtout sur les taches de compilation et d'apprentissage machine. \n\nDe plus, le problème est peut-être que le curriculum ne change pas parce qu'ils assument qu'on a des vieilles patates.\n\nJ'ai hate de voir comment ils vont résoudre le problème. (ex: serveur distribuer de tache genre un aws pour faire tes devoirs d'école) Et petit conseil a tout le monde qui peut se le permettre et qui commence prenez votre 2500 par session et acheter qqch de sharp ca fait toute la fucking différence attendre que qqch build en 10 secondes ou 1minutes sur 4 ans.",
            "score": 2,
            "author": "gertrude1928"
        },
        {
            "level": 0,
            "comment": "Je pense qu'ils demandent ça justement pour pouvoir mettre à jour le contenu des cours. Après c'est vrai que les specs pour LOG sont un peu trop élevées. À voir.",
            "score": 1,
            "author": "hadi4172"
        },
        {
            "level": 0,
            "comment": "J'ai terminé mon bac en TI il y a un an. Mon ordi que j'ai monté il y a 10 ans a ces specs : i7 2600k, 16 gb ram ddr3 et RX480.  \nAvec ça j'ai fait les cours d'infographie (OpenGL), apprentissage machine, jeux vidéo, calcul parallèle, réalité virtuelle et pas mal d'autres. \n\n-\nLes cours à l'école sont là pour nous enseigner différentes notions pédagogiques. Nous ne sommes pas là à devoir tout optimiser pour avoir des gains de quelques millisecondes (contrairement à l'industrie). Je n'ai pas eu de cours où je me suis senti désavantagé faces à la classe parce que mon CPU était trop slow !  Si mon code est slow, c'est pas mal plus un problème de logique qu'un élément matériel.\n\n-\n**CEPENDANT**, je comprends la demande d'avoir un ordinateur récent. Il devient difficile de supporter du matériel qui est de moins en moins compatible. *Faire de l'apprentissage machine sans CUDA ?? l'horreur!*\n\n-\nUn autre point. J'ai (à 99% du temps) toujours fait mes laboratoires chez moi. Je me concentre mieux et je travaille mieux de cette façon. En classe je prends des notes papier &amp; crayons. Je ne vois pas pourquoi forcer l'achat d'un ordinateur ***portable***.",
            "score": 1,
            "author": "ZeeKhar"
        },
        {
            "level": 0,
            "comment": "A te lire, on dirait qu’en MEC on a besoin de meilleur laptops pour les logiciels de modelisation 3D qui demandent une pas pire carte graphique.",
            "score": 1,
            "author": "Wasting_timeagain"
        },
        {
            "level": 0,
            "comment": "Quels sont les deux plus grand lobbyistes en recherche oeuvrant dans le domaine du hardware à l’ÉTS?\n\nYup. Rhétorique.",
            "score": 1,
            "author": "TheItGuy1997"
        }
    ]
}