{
    "id": "vxwns7",
    "score": 83,
    "title": "Bâtiment abandonné à côté de l'ETS | Brasserie Dow",
    "author": "Contempory",
    "date": 1657694786.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/vxwns7",
    "media_urls": [],
    "other_urls": [
        "http://www.explorationurbaine.ca/abandonne/Dow/index%20Dow.htm)",
        "https://fr.wikipedia.org/wiki/Brasserie\\_Dow)",
        "http://www.explorationurbaine.ca/abandonne/Mont%20Sinai%20Sanatorium/NBLtd/index%20NBLtd.htm)",
        "https://journalmetro.com/actualites/montreal/1694380/55m-pour-un-nouveau-pavillon-a-lets/)",
        "https://www.youtube.com/watch?v=k09LOdDM65g)"
    ],
    "postText": "Je me demandais c'était quoi le building avec le grillage en face de l'ETS alors j'ai fait quelques recherches. Voici un résumé de ce que j'ai trouvé pour les intéressés !\n\n&amp;#x200B;\n\n\\- Le bâtiment a été construit par la brasserie Dow en 1925 (ils faisaient parti d'un regroupement de brasseries qui s'appelait National Breweries Co.)\n\n\\- La bière Dow était la bière la plus vendu au milieu des années 1960 (plus que Molson et Labatt ensemble).\n\n\\- Il y a eu 16 morts en 1966, ils étaient tous de gros consommateurs de la bière Dow.\n\n\\- La compagnie fait un rappel de bière et jette 500 000 gallons de bière dans le fleuve. La population n'a plus de confiance envers la compagnie donc les ventes diminuent considérablement.\n\n\\- Des analyses ont démontrées qu'il y avait un additif (sel de cobalt) pour augmenter le collet de mousse dans leurs bières. C'est ce qui a causé la mort des 16 personnes.\n\n\\- Les ventes crashent et la brasserie Dow est rachetée par la brasserie O'Keefe en 1967.\n\n\\- Le planétarium Dow est construit en hommage à William Down (il a été donné à l'ETS par la ville en 2018 pour accueillir l'incubateur Centech d'aujourd'hui).\n\n\\- Molson achète la brasserie O'Keefe au milieu des années 1980.\n\n\\- En 1995, Molson décide de mettre ses efforts sur son usine au coin de la rue Papineau. Ils déplacent toutes les choses qui semblent de valeurs mais la brasserie n'en fait pas partie.\n\n\\- L'usine est démontée sans vraiment respecter les règles, le bâtiment est endommagé à plusieurs endroits et plusieurs équipements qui contenaient de l'amiante sont détruits. Le bâtiment se contamine donc d'amiante.\n\n\\- Molson ferme définitivement le bâtiment en 1988.\n\n\\- Le bâtiment est vraiment en mauvais état, rouille, inondation, etc...\n\n\\- Le bâtiment est acheté en 2004 par l'ÉTS. Des portes en aciers sont installées et il y a des pompes pour éviter les inondations dans le sous-sol.\n\n\\- Il y a toujours le tunnel qui reliait l'usine à l'ancienne brasserie Black Horse. Il est toujours utilisé pour acheminé de la vapeur à l'ETS par le CCUM.\n\n\\- L'ETS a comme projet d'en faire un nouveau pavillon. La province donne 55M$ à l'ETS pour faire ce projet. En 2017, l'ETS semble dire que le projet devrait être réalisé dans les 10 prochaines années.\n\n\\- Le building juste à côté de l'usine est aussi abandonné, c'était les bureaux de la National Brewery. Le bâtiment appartient aussi à l'ETS, mais celui-ci doit être conservé, car c'est un bâtiment historique. Toute la décoration est d'origine et il est très bien entretenu.\n\nJe ne garantis pas que toute l'information est correcte, si j'ai dit quelque chose de faux, n'hésitez pas à me le dire !\n\nSi vous voulez plus de détails voici les sites où j'ai pris l'information :\n\n\n[Brasserie Dow](http://www.explorationurbaine.ca/abandonne/Dow/index%20Dow.htm)\n\n[Wikipedia](https://fr.wikipedia.org/wiki/Brasserie\\_Dow)\n\n[National Brewery](http://www.explorationurbaine.ca/abandonne/Mont%20Sinai%20Sanatorium/NBLtd/index%20NBLtd.htm)\n\n[Nouveau pavillon](https://journalmetro.com/actualites/montreal/1694380/55m-pour-un-nouveau-pavillon-a-lets/)\n\n[Vidéo d'urbex](https://www.youtube.com/watch?v=k09LOdDM65g)",
    "comments": [
        {
            "level": 0,
            "comment": "Je vais rajouter ce que je suis au courant. Je n'ai pas de sources cependant vu que c'est des choses entendus pendant mon PFE pour le service immobilier de l'ETS.\n\n\nDOW est supposé être le prochain pavillon de l'ETS (après le F qui est en construction).\n\n\nIl y a présentement des études qui ont été réaliser côté énergétique pour ce nouveau pavillon afin d'être le plus vert possible.",
            "score": 14,
            "author": "Stonewarder_85",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks pour l'info !",
                    "score": 2,
                    "author": "Contempory"
                },
                {
                    "level": 1,
                    "comment": "Un prof de recherche a dit à mon ami que ça va être le pavillon L",
                    "score": 1,
                    "author": "TheLink404"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Je me posais justement la question il y a pas longtemps ,merci !",
            "score": 3,
            "author": "Calgeka",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fait plaisir ! :)",
                    "score": 5,
                    "author": "Contempory"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow merci Contempory c'est fort apprécié💯",
            "score": 3,
            "author": "juicekawaii",
            "replies": [
                {
                    "level": 1,
                    "comment": "W comment",
                    "score": 3,
                    "author": "MuchCash1278"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Quelques photos du planetarium et de ses environs (donc, de la brasserie, et de ce qui est maintenant l'ÉTS) sur le site de la ville de Montréal :) https://ville.montreal.qc.ca/memoiresdesmontrealais/le-planetarium-dow",
            "score": 3,
            "author": "Om0nom"
        },
        {
            "level": 0,
            "comment": "De ce que j'ai entendu **très** récemment il y a plusieurs options envisagées pour ce bâtiment notamment la démolition et la reconstruction du complexe. Le projet en est encore à l'étude, \"en phase de rédaction du dossier d'opportunité\".\n\nJ'ai trouvé [ce lien](https://mtlurb.com/topic/15640-ets-complexe-dow/) aussi avec des images de ce que pourrait ressembler le campus de l'école mais ça date de 2018 déjà",
            "score": 2,
            "author": "SatisfactionDry7051",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yesss ! C'est dans ce document que j'avais lu que le projet était censé être terminé en 10 ans. We'll see I guess",
                    "score": 2,
                    "author": "Contempory"
                }
            ]
        },
        {
            "level": 0,
            "comment": "C'est une très bonne description. Il y a aussi un musée de la brasserie Dow au Rez-de-chaussée du pavillon Ingo (355, rue Peel, Montréal). Je suppose qu'il peut être visité s'il y a de la demande. \n\nSelon des ouï-dire, le nouveau pavillon qui sera construit va accueillir le département de génie électrique, logiciel et TI. Mais cela reste à confirmer officiellement.\n\nJe n'y suis pas allez moi-même, mais on me l'a déjà proposé avant que le bâtiment soit instable. Par contre, j'ai vu des photos. Imaginer une installation industrielle décrépie dont tout ce qui avait de la valeur a été enlevée. Une ambiance des années 1960 à 1970, où les bassins de brassage étaient faits de carrelage. Présence de fragments diverses sur les planchés et de graffitis.",
            "score": 2,
            "author": "FXF_1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Il y a des photos à la fin du premier site que j'ai link ! Effectivement c'est creepy, mais tlm intéressant en même temps hahahahaha",
                    "score": 2,
                    "author": "Contempory"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Je crois que l'ÉTS avait pour plan de bouger pas mal de bureaux administratifs, de départements et la cafétéria au pavillon \"dow\". Ce nouveau pavillon deviendrait le nouveau pavillon principal et le pavillon A serait transformé en pavillon de recherche puisqu'il est le seul pavillon à avoir un monte charge.\n\n&amp;#x200B;\n\nJe dis ça de mémoire de mon temps à l'association étudiante, quand j'y étais en 2018. Ça vaut autant que des rumeurs IMO.",
            "score": 2,
            "author": "allomelo"
        },
        {
            "level": 0,
            "comment": "Pour travailler pour une compagnie qui à comme client l'ÉTS je sais que l'entrée électrique de l'ÉTS date de l'époque de la brasserie DOW.",
            "score": 1,
            "author": "curius_tech"
        }
    ]
}