{
    "id": "x1pz0e",
    "score": 1,
    "title": "Quoi faire ?",
    "author": "Shew_shew",
    "date": 1661882701.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/x1pz0e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Bonjour \n\nAlors je suis en Genie de l environnement et j ai pris 3 cours donc 9 credits au total, jusqu'à a maintenant j ai deux cours faisant partie de ma condition d admission que j ai réussi , mais le derniers cours m a valu un Echec ce qui a considérablement affecté ma moyenne de passage. \nMes questions sont les suivantes : \n\nEst ce que je passe sous tutelle ? Si oui qu est ce que cela veut dire ? \n Ou je suis directement expulsée du programme ? Rachetée... Qu est ce que je deviens? \n\nMerci de me renseigner.\n\nPeace.",
    "comments": [
        {
            "level": 0,
            "comment": "******** PREMIER CYCLE SEULEMENT**********\nD'habitude ces 2,0 et moins. Tutelle: restriction dans le nombre de crédit auxquels l'étudiant peut s'inscrire pendant la période ou il est mit sous tutelle, ou obligation de s'inscrire à un ou des cours en particulier. De plus, ce n'est pas toi qui fait ton horaire mais ton responsable de département. \n\nComme j'ai dit plus haut, sous tutelle tu as obligation d'augmenter ta moyenne en haut de 2 sur 1 ans (2 ou 3 sessions). Une fois ton 1 an terminer, si tu réussis,  ta tutelle disparaît mais reste dans ton dossier cheminot.\n\nTutelle: au terme minimum de 12 crédit  d'inscription, si la moyenne cumulative est inférieur à 2,0 et supérieur à 1,5 , il est mit sous tutelle.\n \nSi à la fin de ton 12 mois de tutelle ta moyenne est encore en bas de 2,0 tu sera suspendu pour les douzes prochains mois. Ensuite, le directeur choisi les cours qui seront accepter dans ton cheminement pour avoir une moyenne de 2,30. Les cours non accepter devrons être refait.\n\nTout cette information se trouve dans le règlement d'étude du 1er cycle que jai trouver direct sur Google avec une recherche\n\n\n*******Pour le deuxième cycle c'est différent ******\nPour le deuxième cycle on parle d'une moyenne de 2,80 à la suite de 9 crédits completés",
            "score": 6,
            "author": "Prestigious-Entry432",
            "replies": [
                {
                    "level": 1,
                    "comment": "Je te suggère d'aller voir ta coordonnatrice de département pour qu'elle puisse t'aider et te donner des conseil pour pas arriver à la tutelle.",
                    "score": 3,
                    "author": "Prestigious-Entry432"
                },
                {
                    "level": 1,
                    "comment": "De plus tu n'as pas encore 12 crédits de fait. Alors fait attention, si la prochaine session t'es t'es bas de 2,0 à la fin, tu sera sous tutelle en janvier",
                    "score": 3,
                    "author": "Prestigious-Entry432",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Je vais ajouter à ton commentaire que l’école regarde la côte après chaque année universitaire, donc à la fin de l’été. Ça veut dire qu’être en bas de 2 à la fin de la session d’automne va rien t’arriver, tu dois juste remonter ta côte pour l’automne prochain.",
                            "score": 3,
                            "author": "RRavefield",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah oui c'est vrai ahah dans mon cas j'étais en bas de 2,0 a la fin de l'été xD sa tomber pile au moment qu'il regarde ahah.",
                                    "score": 1,
                                    "author": "Prestigious-Entry432"
                                },
                                {
                                    "level": 3,
                                    "comment": "Bien reçu , merci a toi pour l intervention. :D",
                                    "score": 1,
                                    "author": "Shew_shew"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "D accord j ai bien compris merci à toi. \n\nDonc si je résume mon cas , je passerai a la 2 ieme session tranquille cet automne n est ce pas ? ( Vu mon 2.1) de moyenne cumulative.",
                            "score": 1,
                            "author": "Shew_shew",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oui mais la prochaine session fait attention de ne pas tomber en bas de 2,0. Si jamais à l'intra tu vois que tu vas couler, va annuler ton cours , ça va paraître dans ton relever mais sa n'affectera pas ta côte",
                                    "score": 3,
                                    "author": "Prestigious-Entry432",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Merci beaucoup ça me rassure tu peux pas imaginer l anxiété que j avais a être sans réponse. \n\nMerci.",
                                            "score": 1,
                                            "author": "Shew_shew",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "C'est clair. Si jamais tu as d'autre question, va voir ton coordonateur. Il va vraiment t'aider et trouver des solutions avec toi.",
                                                    "score": 1,
                                                    "author": "Prestigious-Entry432"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Regarde tes messages.",
                                                    "score": 1,
                                                    "author": "Prestigious-Entry432",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "C est fait vas y",
                                                            "score": 1,
                                                            "author": "Shew_shew",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Would you look at that, all of the words in your comment are in alphabetical order.\n\nI have checked 1,009,652,146 comments, and only 200,484 of them were in alphabetical order.",
                                                                    "score": 1,
                                                                    "author": "alphabet_order_bot"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Déjà quand tu dit génie de l'environement, j'imagine que tu parle de maitrise en génie de l'environement? Si c'est le cas, tout les commentaires que tu as recus actuellement était pour un BAC. \n\n&amp;#x200B;\n\nPour la maitrise, doc, dess, etc, c'est couvert par ce reglement: [https://www.etsmtl.ca/docs/ets/gouvernance/secretariat-general/cadre-reglementaire/documents/reglements-etudes-superieures](https://www.etsmtl.ca/docs/ets/gouvernance/secretariat-general/cadre-reglementaire/documents/reglements-etudes-superieures)\n\nSi tu regarde l'article 6.6.2.a : \\[une exclusion survient quand :\\] a. il a une moyenne cumulative inférieure à 2,5, obtenue après un minimum de neuf crédits évalués dans un programme de deuxième cycle ou après un minimum de six crédits au troisième cycle (art. 10.9; 11.9 et  \n12.12.1);\n\n&amp;#x200B;\n\nDonc si tes trois cours c'était des cours de maitrise et tu as une moyenne de 2.1, tu es exclue. La seule chose que tu peux faire, c'est de demander un appel de la décision, tu peux suivre les démarche indiquer dans la section 6.7 du règlement. \n\n&amp;#x200B;\n\nSI jamais dans tes 3 cours que tu as fait, il y en a au moins 1 que c'est un cours de BAC, ca veut dire que tu as fait moins de 9 crédit à la maitrise et donc tu a une session de plus pour augmenté ta moyenne.\n\ndans tout les cas, rencontré ta coordonatrice académique est toujours une bonne idée.",
            "score": 3,
            "author": "Mathieu2525",
            "replies": [
                {
                    "level": 1,
                    "comment": "C'est pour ça que je l'ai DM et changer mes commentaire x)",
                    "score": 2,
                    "author": "Prestigious-Entry432"
                },
                {
                    "level": 1,
                    "comment": "Et comment je peux savoir quels sont les cours de BAC ? Merci pour ta réponse.",
                    "score": 1,
                    "author": "Shew_shew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Regarde sur le site web de l'ETS,.Normalement il y a une liste de tous les cours  selon le programme d'étude et il me semble qu'il informe si c'est un cours de premier cycle, deuxième  cycle etc.",
                            "score": 3,
                            "author": "Shadoken-TYPE0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tout les cours qui commence par log, gti, mec, ele, gpa, gol, ctn, ing, tch, gia, tin, pre cest des cours de premier cycle. Mais tu peux nous dire tes 3 cours au lieu de te lister tous les cours.",
                    "score": 1,
                    "author": "mathieu55"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Je cherche une réponse, pas un lien. J ai consulté le site j ai besoin qu on réponde a mes questions.",
                    "score": -4,
                    "author": "Shew_shew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jte jurr hahahaha",
                                    "score": 1,
                                    "author": "FitYou6489"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Non ma moyenne actuelle est de 2.1. je passe sous tutelle quand même ? \n\nEt ça veut dire quoi sous tutelle exactement ?",
                    "score": -1,
                    "author": "Shew_shew"
                }
            ]
        }
    ]
}