{
    "id": "x2xfkt",
    "score": 2,
    "title": "Questionnement",
    "author": "zazasouza",
    "date": 1662004052.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/x2xfkt",
    "media_urls": [],
    "other_urls": [],
    "postText": "bonsoir,\n\netant un nouveau etudiant en LOG a partir de cet automne, j'etais entrain de faire un petit tours sur le programme de genie logiciel a l'ets et je me suis poser la question suuivante : pourquoi tant de cours de physique et de chimie a l'ets surtout en LOG.?\n\nJE sais que cest demande par l'OIQ, mais pour ceux qui ont fini en log et qui sont sur le marche du travail quest ce que les cours de physique et de chimie vous ont apporte de plus dans votre vie professionnelle",
    "comments": [
        {
            "level": 0,
            "comment": "C'est plutôt demandé par le BCAPG (Bureau canadien d'agrément des programmes de génie).  \nÇa permet de s'assurer que tout les ingénieurs du canada aient les mêmes bases de connaissances.   \nPourquoi ?\nImagine la formule de chimie suivante :  `H2O` ou [monoxyde de dihydrogène](http://www.dhmo.org/), du monde pourrait penser que mélanger deux éléments hautement inflammable pourrait être dangereux ! Le résultat de cette formule, c'est de l'**eau**.   \n\nPour les cours de physiques, je suis dans le domaine d'interaction en réalité virtuel. Ça ne parait peut-être pas, mais dans le domaine des jeux vidéos ça aide énormément de connaître les formules de physiques pour que le monde *simulé* ait les mêmes réactions que le monde réel. Si la formule `F=ma` n'est pas compris par l'ingénieur LOG qui code l'application, ça va mal aller.  \n\n&gt; Ok, c'est bien beau tout ça, sauf que c'est un exemple du cours de base de physique. À quoi sert le cours de *Physique des ondes* ??  \n\nUn mouvement oscillatoire est une pulsation. Avoir un effet de pulsation (visuel ou sonore) est un élément qui attire de beaucoup l'attention d'une personne. Au lieu de demander à un artiste de créer une animation pour avoir un tel effet, il est possible d'avoir un effet dynamique avec quelques ligne de code.  \n\n-\nDans ce même cours il y a des notions d'optique. Dernièrement je travail sur la génération d'images, faire des rendus d'image photoréaliste complète. Je dois simuler chaque rayon de lumière qui parcours un chemin entre la source de lumière, réfléchir sur des surfaces (réflexion), rentrer dans des surfaces (réfraction), etc.  jusqu'à la caméra. Ça a été pratique d'avoir les notions d'optiques !\n\n==\n\nEn résumé, je comprend parfaitement que la majorité des cours peuvent sembler plate et inutile quand on ne vois pas comment ça peut être appliqué dans notre domaine. Je dirais même que quand on est en classe il est fortement possible que l'on n'ait même pas complètement trouvé sous-domaine d'étude (je n'avais pas pensé aller en jeux, ni à la création d'images). C'est souvent des années plus tard qu'une opportunité s'ouvre et hop ! On se démarque avec nos connaissances que l'on pensait *inutiles* en physique et on commence un nouveau projet !",
            "score": 15,
            "author": "ZeeKhar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ta réponse est 100% exacte.  Je crois aussi que des connaissances en chimie, en physique et en math sont importantes pour la culture scientifique de base d’un ingénieure.  Comme tu dis, ça permet également de nous demarquer dans des domaines qu’on croyait pas être utile lorsqu’on est a l’ecole",
                    "score": 2,
                    "author": "Spirited_Side673"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Je pense pas que l'ingénieur civil typique va concevoir lui-même ces programmes de simulation ou de conception assistée si tu vois ce que je veux dire...",
            "score": 3,
            "author": "FruityStrawberryMilk"
        },
        {
            "level": 0,
            "comment": "$$$",
            "score": 2,
            "author": "mehraj7",
            "replies": [
                {
                    "level": 1,
                    "comment": "okkkey  :)",
                    "score": 1,
                    "author": "zazasouza"
                }
            ]
        },
        {
            "level": 0,
            "comment": "C’est un standard canadien en genie https://engineerscanada.ca/fr",
            "score": 1,
            "author": "junksampler"
        }
    ]
}