{
    "id": "xl93sy",
    "score": 5,
    "title": "emploi en même temps que l'école",
    "author": "ricafo",
    "date": 1663871036.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/xl93sy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Je suis curieux de connaître les emplois que vous avez en même temps de suivre des cours à temps pleins. Travaillez vous 10h/semaine ou 30h/semaine ?\nAvez vous un beau salaire ou non ? Êtes vous capable d'avoir de bonne note malgré tout?\nQue conseillez vous comme emploi en même temps que l'école? Etc",
    "comments": [
        {
            "level": 0,
            "comment": "Voici quelques suggestions :\n\n-Le pub/coop de l'école\n-Le FDETS (ils ont un \"centre d'appel\" les soirs de semaine pour appeler des diplômés pour quêter des dons.. si c'est le genre de job qui te dérange pas)\n-N'importe quel café/épicerie (pour une job un peu \"brainless\", même si quand-même demandant physiquement)\n-si t'est bon/bonne à l'école et pas en début de cheminement, tu peux voir pour être chargé de TP, ou faire du tutorat pour des jeunes.\n-Tu peux aussi proposer tes services à différentes compagnies selon tes qualifications. (J'ai déjà fait de la rédaction technique de rapports pour une compagnie d'inspection. On m'envoyait les photos et conclusions de l'inspection, et je devais rédiger un rapport/faire la mise en page pour le client.)\n\nPour la quantité, je suggère environ 20h/semaine, selon les cours que tu as. (Si tu as moins de cours, tu peux travailler plus, mais ne néglige pas ton sommeil et tes heures de devoirs/travaux. Ça dépend aussi de tes autres activités)",
            "score": 7,
            "author": "Polatouche44"
        },
        {
            "level": 0,
            "comment": "Perso, j'ai fait 2 ans et demi avec 2 ou 3 cours à travailler 30 à 40h/semaine comme tech en électronique et comme programmeur par après. C'est sûr que le stress monétaire est moins grand, mais finir le bac prend plus de temps et soit tes notes souffrent ou ta vie personnelle est inexistante. Je fais maintenant du 4 cours sessions et 16h/sem comme concepteur, et malgré l'argent en moins, je performe pas mal mieux à l'école et j'ai l'impression d'avoir plus de temps pour moi pareil.",
            "score": 6,
            "author": "Kaiser_Blitz"
        },
        {
            "level": 0,
            "comment": "4 cours en meme temps que travailler  15-20h en projets specialisés a l’aeroport de montreal.",
            "score": 4,
            "author": "BEDORAH"
        },
        {
            "level": 0,
            "comment": "En ce moment je travaille environ 8hr/semaine et j'occupe un poste de concepteur en mécanique du bâtiment.  Je me considère relativement bien payé puisque je suis mieux payé que la moyenne des stages 2 sans avoir fait mon stage 1 (créditer) ni mon stage 2 (Je le fais cet Hiver). Au niveau niveau des notes j'arrive à maintenir une côte d'environ 3.0 depuis l'automne 2021. Et perso je n'irais pas à plus d'une journée de travail semaine surtout si tu as 4 cours, tu vas te ramasser avec des cours de soir, ce qui est pas super (selon moi)",
            "score": 2,
            "author": "Etienne19381"
        },
        {
            "level": 0,
            "comment": "Moi j'ai fait mes études à temps plein (4 cours par session tt le temps) en travaillant 16h semaine, la semaine (c'était un emploi à temps partiel après mon S2, j'avais le même salaire). J'ai trouvé que ça faisait vraiment des grosses semaines, mais ça a quand même valu la peine",
            "score": 2,
            "author": "topinfrassi01"
        },
        {
            "level": 0,
            "comment": "Moi je travaille dans une compagnie de transport 20h/semaine, je suis qd même bien payée pour une étudiante. javais 4 cours mais j’en ai annulé 1, je suis qd même à temps plein puisque j’ai 12 credits , ca se fait quand même bien pour l’instant, peut-être que je vais essayer de réduire mes heures à 15-16h rendue aux examens mais pour l’instant tout va bien.",
            "score": 2,
            "author": "Unlucky-Car-1891"
        },
        {
            "level": 0,
            "comment": "Toujours études temps plein avec 14 crédits ou plus. Je travaille maximum 10h semaine. Le même salaire que mon S2 qui était dans la moyenne des S2. \n\nÇa fait de grosse semaine!",
            "score": 2,
            "author": "Better-Row6549"
        },
        {
            "level": 0,
            "comment": "Je work 40h semaine Technicienne pour les moteur Diesel et jai 2 cours",
            "score": 1,
            "author": "FitYou6489",
            "replies": [
                {
                    "level": 1,
                    "comment": "Comment? Etudier a temps plein est obligatoire. Abandons sans remboursement?",
                    "score": 1,
                    "author": "TheItGuy1997",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "C pa obligatoire detudier a temps plein",
                            "score": 1,
                            "author": "FitYou6489",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "T’es au BAC? Y’a un règlement académique qui oblige à suivre 12 crédits.",
                                    "score": 1,
                                    "author": "TheItGuy1997",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Messemble qu'il n'y a pas de reglement qui t'oblige a etre temps pleins. Le reglement dit en fait que ca prend 12 credits pour etre considerer temps plein. Mais tu n'es pas obliger de l'etre. Le seul regle est que tu as 10 ans pour terminer ton bac.",
                                            "score": 3,
                                            "author": "dynamix-1337",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "ui exact 10 ans",
                                                    "score": 1,
                                                    "author": "FitYou6489"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oui au Bac Moi il mont rien dit c just pour linstant mais automne 2023 jrentre temps plein",
                                            "score": 2,
                                            "author": "FitYou6489"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "3 ou 4 cours par session avec 8h de travail à distance",
            "score": 1,
            "author": "Kronostatic"
        },
        {
            "level": 0,
            "comment": "16-21hrs semaine et 4 cours pour un total de 12 crédits. \n Le salaire esf meh, si je pouvais je ferais moins d'heures haha",
            "score": 1,
            "author": "Shadoken-TYPE0"
        },
        {
            "level": 0,
            "comment": "16 heure avec 4 cours en ce moment pour le gouv ~26 par heure",
            "score": 1,
            "author": "Skodd"
        },
        {
            "level": 0,
            "comment": "3-4 cours (12 crédits) + 8~12h comme tech après stage1. 25$/h, 30$/h après stage2.\n\nJ'en connaissait qui faisait du 24h/semaine en plus de 12 crédits. Ça commence à être beaucoup imo.. certains y ont même prit goût et on lâché l'ETS.",
            "score": 1,
            "author": "Shinnyx"
        },
        {
            "level": 0,
            "comment": "12 credits ( 3 cours ) + 10h semaines de travail + sports universitaire sur le cote",
            "score": 1,
            "author": "volt9162"
        },
        {
            "level": 0,
            "comment": "Je travaille comme technicien à la réparation d'outils aux Home Dépot de Montréal à environ 20h par semaine. J'ai un assez bon salaire étudiant dépassant le 20$/h avec mes frais de scolarité payés. Niveau note, ça dépend de la personne et de la motivation, mais j'ai une cote de 4.18, donc tout est possible, même en travaillant à côté. Je fais 16 crédits par session.",
            "score": 1,
            "author": "akitchenslave"
        }
    ]
}