{
    "id": "y5v49n",
    "score": 3,
    "title": "Problème d'eau chaude aux résidences",
    "author": "DeepHex",
    "date": 1665962627.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/y5v49n",
    "media_urls": [],
    "other_urls": [],
    "postText": "Salut, je suis en phase 3 et ça fait quelques semaines que ça peut prendre 15-20 minutes (des fois même plus) à avoir de l'eau chaude pour la douche ou dans la cuisine, mon coloc et moi ça fait plusieurs fois qu'on contacte les réparations et la réception mais ça a pas l'air de s'améliorer, j'me demandais si y'a d'autre monde avec ce problème?\n\nJe sais que ça amène pas à grand chose ce thread là mais j'ai juste envie de vent un peu en solidarité",
    "comments": [
        {
            "level": 0,
            "comment": "Fait toi un automate qui contrôle une vanne avec un timer. Avant de te coucher tu mets l'heure d'ouverture de la vanne dans ton application pis ça ouvre a 5:15 pour purger l'eau froide. Si tu veux y aller une coche de plus, tu te mets deux vannes de contrôle pour le chaud/froid avec un transmetteur de température et un contrôleur PID de température, qui t'envoie une alarme pour te prévenir que ton eau est à la température désirée. Après tu documente le tout pis tu caliss ça sur ton LinkedIn. Le lendemain tu va avoir une multitude d'offre d'emploi. Tu acceptes la meilleure pis tu déménages dans une place ou l'eau chaude est bonne, problème réglé!",
            "score": 31,
            "author": "marcavoin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Found the engineer",
                    "score": 3,
                    "author": "alek_vincent",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tente de finir le cégep since 2017 🥲",
                            "score": 1,
                            "author": "marcavoin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pareil pour moi depuis environ 3 semaines en phase 4. Plusieurs matins où j’ai juste pas pu prendre ma douche.. Y’a pas grand chose à faire, l’administration est complètement inutile (as always)",
            "score": 7,
            "author": "DAAAANTE",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ouais on a juste dû renforcer le stéréotype que le monde en LOG ça pue lol, tu peux juste pas être pressé et prendre une douche rapide le matin c'est désagréable",
                    "score": 5,
                    "author": "DeepHex"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Salut mon violoneux, j’étais en phase 3 ( 3ième étage ) et je peux te confirmer que j’avais le même problème. J’ai fait venir le gars d’entretien, mais ça absolument rien changé, il disait qui comprennait pas LOL. Bref, moi ce que je faisais c’était de laisser couler l’eau du robinet de la cuisine, de la salle de bain et de la douche pendant 10-15 minutes pour purger l’eau froide et avoir de l’eau chaude pour laver ma vaisselle. Côté douche c’était encore pire, des fois la douche devenait quasi froide après être dedans depuis 5-10 minutes. Bref, c’est merdique comme système d’eau chaude.",
            "score": 4,
            "author": "No_CardiologistMrs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Merci du conseil, j'vais voir si ouvrir tous les robinets aide à purger l'eau froide plus vite. En espérant qu'ils arrivent à trouver le problème bientôt, la semaine passée ils ont dit à mon coloc qu'ils étaient justement en train de travailler sur ça mais bon,,,,",
                    "score": 1,
                    "author": "DeepHex"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Apparemment qu'ils viennent de trouver une valve qui était fermée dans un plafond, l'eau a l'air d'être un peu mieux mais ça va rester à suivre",
            "score": 2,
            "author": "DeepHex"
        },
        {
            "level": 0,
            "comment": "Salut, quand j'habitais en phase 4 je remarquais que le soir, vers une certaine heure, j'avais peu d'eau chaude quand je prenais ma douche. J'y allais donc plus tôt et c'était mieux. J'avais comme l'impression que je partageais ma tank à eau chaude avec d'autres personnes du bloc, qui la vidait possiblement et qu'il fallait du temps avant qu'elle se rempli de nouveau. J'ai jamais eu de certitude que c'était vraiment ça par contre",
            "score": 1,
            "author": "Cold_Winter96",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ouais je vois le genre de problème que tu parles mais là je peux prendre une douche à 5h30 du matin et je dois quand même attendre au moins 15 minutes avant que ça devienne assez tiède pour que j'aille sous l'eau, des fois c'est 25 minutes avant que l'eau soit chaude (c'est chiant pour la vaisselle aussi)",
                    "score": 1,
                    "author": "DeepHex"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Même problème que toi et je suis en phase 4 !",
            "score": 1,
            "author": "Hungry-Expert-6201"
        }
    ]
}