{
    "id": "y89pqp",
    "score": 4,
    "title": "Bonjour je me demandais quand aura lieu la prochaine collation des grades/photos pour les étudiants finissant à l'automne 2022!",
    "author": "Then-Pollution484",
    "date": 1666202742.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/y89pqp",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "La réponse était supposée nous être communiquée mi-septembre…",
            "score": 9,
            "author": "thibosmont"
        },
        {
            "level": 0,
            "comment": "J'ai gradué en Printemps 2022 pis on a pas eu de nouvelles non plus...",
            "score": 7,
            "author": "Disastrous_Ad_266"
        },
        {
            "level": 0,
            "comment": "Graduée en été ici, toujours pas de réponse… comme dit plus haut soit disant la date devait nous être communiquée mi septembre… un peu rageant moi qui suis étudiante étrangère mes parents voulaient venir à cette cérémonie mais comme il n’y a pas de dates données ils vont soit payer leur avion très très cher soit pas être présents :( comme une impression d’être jetée de l’école maintenant qu’on paye plus rien 🙄",
            "score": 8,
            "author": "catruz"
        },
        {
            "level": 0,
            "comment": "J'ai envoyé un courriel en septembre dernier pour demander parce que j'ai terminé ma dernière session au printemps et j'avais aucune info. On m'a répondu ça :\n\n\n\n\" Les diplômé(e)s de l’été sont habituellement invités à la collation de l’automne suivant. Ne vous en faites pas, vous recevrez une invitation par courriel en temps et lieu.\n\n\nNous n’avons malheureusement pas encore de dates pour la collation des grades prévue à l’automne. Normalement, c’est plus novembre, mais tout dépend de la disponibilité de la salle de la Place des Arts. Avec la pandémie, beaucoup d’événements sont à rattraper, et il se peut que nous devions faire exception pour avoir un week-end complet, et que le tout soit en janvier 2023. \"",
            "score": 3,
            "author": "BellatorIV"
        },
        {
            "level": 0,
            "comment": "ILS ont Juste envoyé la ceremonies de graduation\nMercredi 30 novembre\n \n\n19 h\n\n \n\nSalle Wilfrid-Pelletier de la Place des arts",
            "score": 2,
            "author": "mahdicanada",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ce n'est pas la cérémonie de graduation mais bel et bien la cérémonie d'engagement ! Avec la Société des sept gardiens",
                    "score": 1,
                    "author": "Then-Pollution484"
                }
            ]
        }
    ]
}