{
    "id": "zqh9xc",
    "score": 6,
    "title": "Question sur l'inscription au CUT",
    "author": "Extension-Beach3125",
    "date": 1671519273.0,
    "url": "https://www.reddit.com/r/etsmtl/comments/zqh9xc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Bonjour, je suis un étudiant dans ma 3ème session au CÉGEP dans un programme de science informatique et mathématique. Je souhaite m'inscrire au CUT pour la prochaine session d'automne. Sur le site de l'ÉTS c'est écrit que l'admission se fait uniquement pour la session d'automne. Est-ce que ça veut dire que c'est trop tard pour que je m'inscrit au CUT?",
    "comments": [
        {
            "level": 0,
            "comment": "[ici](https://www.etsmtl.ca/etudes/admission?utm_campaign=admission_22-23&amp;gclid=Cj0KCQiAtICdBhCLARIsALUBFcG1d_BUsht5bKQhcjpiJWTKqEm62sEEHAIwwFjKoO30TZbV60F7YU4aAv4sEALw_wcB) c'est marqué que tu as jusqu'au premier août pour t'inscrire à la prochaine session d'automne",
            "score": 4,
            "author": "Ellykos"
        },
        {
            "level": 0,
            "comment": "La date limite d’inscription pour le cursus (cut) est le 1er août.  Le cursus dure 2 session et commence obligatoirement en automne, comparer aux programmes de génie que tu peux commencer pas mal au moment de ton choix.  Hésites pas à m’écrire en privé ou sur ce poteau si t’as d’autres questions sur le cursus!  Ou sur l’ets en général!",
            "score": 2,
            "author": "Spirited_Side673"
        },
        {
            "level": 0,
            "comment": "“L’admission se fait uniquement pour la session d’automne” ça veut juste dire que tu dois commencer en automne (septembre), il n’y a pas de cohorte qui commence aux autres sessions.",
            "score": 1,
            "author": "nicolol65",
            "replies": [
                {
                    "level": 1,
                    "comment": "A partir de lan prochain. Le CUT pour Génie Logiciel commence en hiver aussi",
                    "score": 1,
                    "author": "sTacoSam"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Uniquement pour la session d’automne ça veut dire que le programme débute uniquement à la session d’automne. C’est un programme qui dure deux sessions, la première session est à l’automne, la deuxième session est à l’hiver. Autrement dit tu vas pouvoir t’inscrire la session prochaine pour la session d’automne 2023. Si je me trompe pas la période d’inscription est de mi avril ou début mai au 1er aout.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}