{
    "id": "10kgk3o",
    "score": 6,
    "title": "Should I transfer if I'm interested in a liberal arts education?",
    "author": "BlossomUtonium",
    "date": 1674595116.0,
    "url": "https://www.reddit.com/r/cmu/comments/10kgk3o",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've been at CMU for a bit and was hoping to study politics but want more of a liberal arts degree. Should I stick it out or transfer? the school is very technical focused so I'm afraid I'll be limited in opportunities since other departments are much stronger.",
    "comments": [
        {
            "level": 0,
            "comment": "\nWelcome to /r/cmu! **Please use [the megathread](https://www.reddit.com/r/cmu/comments/nenrn2/megathread_9_post_your_questions_about_admissions/?sort=new)** instead of making a new post for questions about admissions, transfers, and general CMU info like majors and dorms.\n\nWe get these kinds of questions a lot, and having the answers in one place is more helpful for everyone. Yours might already be answered!\n\nPlease consider posting to subs like /r/pittsburgh for general life in Pittsburgh questions, dedicated subs like /r/chanceme, /r/ApplyingToCollege, and /r/collegeresults for odds of getting accepted, and using the search in the sidebar.\n\n^(If I've misidentified your post, please ignore this message and instead take it as a reminder to contribute your own answers to the megathread.)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cmu) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Transfer.",
            "score": 15,
            "author": "IntuitivelyClear",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can u provide more context 😅😅",
                    "score": 1,
                    "author": "BlossomUtonium",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's not a strength of the school. There are other places where you will be served better that would have similar admissions requirements.",
                            "score": 10,
                            "author": "IntuitivelyClear"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can absolutely get into politics after being at CMU. There is the Washington Semester program , and plenty of good courses in politics/science,  with a lot of overlap between the RAND institute. However CMU definitely does not have a politically engaged atmosphere, and that can be a downer.",
            "score": 7,
            "author": "sseltze"
        },
        {
            "level": 0,
            "comment": "What do you plan to do for a career?",
            "score": 2,
            "author": "ktxhopem3276",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hoping to go to law school, if that doesn’t work out then HR",
                    "score": 0,
                    "author": "BlossomUtonium",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah you should probably transfer then",
                            "score": 5,
                            "author": "Tarzan1415"
                        },
                        {
                            "level": 2,
                            "comment": "per my username, I have some thoughts lol. DM me",
                            "score": 2,
                            "author": "cmu_law"
                        },
                        {
                            "level": 2,
                            "comment": "I wouldn’t get a degree from cmu just to work in HR unles you’re already rich or got s great scholarship.  I wouldn’t go to law school unless you a very good at it.  I’ve seen a lot of people get liberal arts degrees just bc that can’t decide what they want to do with vague notions of being premed or prelaw and then they end up stuck dead end careers",
                            "score": 2,
                            "author": "ktxhopem3276",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“Just to work in HR?” I work in HR, went to CMU, and am doing quite well, as are plenty of my classmates who majored in social sciences/liberal arts at CMU.",
                                    "score": 1,
                                    "author": "becca1769",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for speaking up because I can’t say I have huge insight into the hr career track.  If you can afford cmu without a lot of  debt, and you can find hr work you like hats off to you.  But I wouldn’t take on a lot of debt when there are cheaper schools that are good for hr.",
                                            "score": 1,
                                            "author": "ktxhopem3276",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you don’t have huge insight into it, it’s probably best not to make sweeping generalizations. Trust me, many of us in an HR role make just as much as people who are in a technical role. There are also cheaper schools that will get people into a good company for CS related roles. I’m not sure where you’re at in your education or your career - but as someone who has been in “corporate America” for 12 years now - the college you attended doesn’t matter as much as we’re led to believe it does.",
                                                    "score": 4,
                                                    "author": "becca1769",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sorry I could have worded it better but you are taking too much offense when my main point is college debt is a huge factor in the discussion.  Comparing cmu cs career potential to hr is kind of a big difference and clearly cmu cs more than pays for itself while cmu liberal arts is for people with rich parents or good scholarships because job prospects are demonstrably worse",
                                                            "score": 1,
                                                            "author": "ktxhopem3276"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Could you elaborate? What would you recommend doing - more career exploration?",
                                    "score": 0,
                                    "author": "BlossomUtonium",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Adding to their point, most schools have an equivalent of this \"career outcomes\" dashboard: https://www.cmu.edu/career/outcomes/post-grad-dashboard.html\n\nThis includes destinations for people who continue education. Check the majors that you're considering and be aware of survey bias.",
                                            "score": 3,
                                            "author": "moraceae"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah you need to examine your strengths and compare that to what companies are hiring for.",
                                            "score": 2,
                                            "author": "ktxhopem3276"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "From your previous post, it looks like you’re an IRP major which is the same as me. As someone who transferred to CMU, I would say it heavily depends on your interests and what you think other schools offer that CMU doesn’t have. There are opportunities for people to get involved especially within the public policy realm, but it takes a bit of searching. It would also help to understand exactly what you’re dissatisfied with be it through academics, job opportunities, extracurriculars, etc. If your plan is to go to law school, I would say whether your transfer or not will not make a significant difference so long as your GPA and LSAT are strong. However, I would try to heed advise from fellow humanities majors. Those in stem tend to be ignorant to the opportunities available to us, so if you’re able to speak to more students in your college/major, I think you’ll get a more accurate perspective to guide your decision on this.  (Which could be helpful given the comments that I’m seeing)",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "While CMU is not at all a liberal arts university, you can definitely design a liberal arts-style education for yourself at CMU. One of the things I love most about CMU is the flexibility of its programs. There are also definitely [educational opportunities connected to politics](https://www.cmu.edu/ips/undergraduate-degrees/index.html) if that's what you want to pursue. However, doing so will require more effort/selection on your part than following a preset politics/liberal arts major at another school. \n\nBUT the way you describe staying at CMU as \"sticking it out\" makes me think that you are not enjoying your time there. If you do not enjoy CMU both academically and socially, then I think you should transfer (which I would say of any school you are not happy at).",
            "score": 1,
            "author": "justaprimer"
        }
    ]
}