{
    "id": "10mkpkh",
    "score": 20,
    "title": "Prospective International Student",
    "author": "Hungry-Reception-284",
    "date": 1674825813.0,
    "url": "https://www.reddit.com/r/cmu/comments/10mkpkh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys,\n\nI'm a bit lost right now, tbh a little shocked that I was accepted into Carnegie Mellon University's PhD program. I'm interested to tour the campus and learn more about the program, but I'd like to hear from current students and graduates about their experiences at the university and Pittsburgh.\n\nHow is the vibe on campus? Are the lecturers approachable and helpful? What is the graduate student community like?\n\nAlso, how is the city of Pittsburgh? Is there a lot to do and see? Is it a decent location to live?\n\nAny ideas or advice would be much appreciated! Thank you in advance!\n\n&amp;#x200B;\n\nPS: I heard there's a Hofbräuhaus.....Can't wait to \"study\" the different types of brews on tap.",
    "comments": [
        {
            "level": 0,
            "comment": "\nWelcome to /r/cmu! **Please use [the megathread](https://www.reddit.com/r/cmu/comments/nenrn2/megathread_9_post_your_questions_about_admissions/?sort=new)** instead of making a new post for questions about admissions, transfers, and general CMU info like majors and dorms.\n\nWe get these kinds of questions a lot, and having the answers in one place is more helpful for everyone. Yours might already be answered!\n\nPlease consider posting to subs like /r/pittsburgh for general life in Pittsburgh questions, dedicated subs like /r/chanceme, /r/ApplyingToCollege, and /r/collegeresults for odds of getting accepted, and using the search in the sidebar.\n\n^(If I've misidentified your post, please ignore this message and instead take it as a reminder to contribute your own answers to the megathread.)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cmu) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "It can depend on the department and who your adviser is but generally CMU is a collaborative environment where you can learn a lot from smart people.  Cmu can be depressing sometimes because there are high expectations and it always seems like there is someone smarter than yourself who doing better.  It takes some practice to control your mental health and avoid imposter syndrome but it is important to keep the perspective that you deserve to be here.\n\nThe metro area is quite large 2 million people and has  a lot of amenities.  It’s not NYC or San Francisco levels of culture but it is a very interesting and unique city.  It has an industrial past as being the steel making capital of the country but most of the factories and the associated pollution has left.  What remains is many nonprofits like cmu, libraries, parks, concert halls and museums that were funded by the riches of industrial robber barrens.   If you are coming from a beach town or a very sunny warm place,  the snow and gray sky’s will be an adjustment but the colors of each season can be vibrant and enjoyable if you know how to look.",
            "score": 11,
            "author": "ktxhopem3276"
        },
        {
            "level": 0,
            "comment": "Great museums (and free admission to most), great parks next to campus (disc golf, hiking, biking), tons of restaurants within walking distance and even more a short bus ride away, bars/clubs if your interested, amazing bike trails all over the city, Obama spoke next door (which was cool), really great theater (both on campus with the T5 drama school, but also multiple theaters downtown (short bus ride)), 4 pro sports teams, lots of festivals, fun art crawls. There's no beach or mountains but otherwise I think you can find whatever you like to do.",
            "score": 4,
            "author": "Rememberthisisreddit"
        },
        {
            "level": 0,
            "comment": "Re: CMU folks being helpful, I would agree with what others have said - it's a very collaborative environment and I've never had someone not be helpful to me.\n\nRe: the vibe, it's somewhat work-focused. You're surrounded by folks who're absolutely world-class, it's mostly a huge pro, sometimes a con. But I would say that there's plenty going around on campus if you're more of a work-life kinda person.\n\nRe: the city, it's a decent mid-sized city. Rents are cheap so you have money to do things which is good.  If you're used to big city life you'll miss some things though.\n\nThese are definitely very important factors, but I would also understand the culture in the department/research group you're looking to work with. An excellent research group culture can make up for the worst city in the world, and no amount of other things will make up for a poor research group fit.",
            "score": 4,
            "author": "_smartalec_"
        },
        {
            "level": 0,
            "comment": "Congratulations on getting in! I'm glad you brought up Hofbräuhaus, I'm actually organizing a group to try out the restaurant next weekend, you should definitely come!",
            "score": 3,
            "author": "bendod89",
            "replies": [
                {
                    "level": 1,
                    "comment": "I‘d love to join! But I’ll only be starting later this year so I’ll be spending the next couple of months back home until fall. But next winter, I‘d definitely be down!",
                    "score": 5,
                    "author": "Hungry-Reception-284"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alumnus from 10 years ago here, did my BS and MS there in Engineering. Note that my experience come from my department so if you're in a different program your mileage may vary.\n\nCampus vibe is very work focused, there's a pressure to always be doing something amongst you and your peers. Not saying that there ain't time/room for fun and extracurriculars but there's an ambient vibe to do something beyond just your classes. As a grad student I'd imagine you'll have more focus on research towards your PhD and put a good amount of time into that, lectures, and maybe TA work that would be expected of you.\n\nProfessors are approachable and very open to research opportunities and collaboration. As an undergrad I'd talk to professors about research they're doing or Small Undergraduate Research Fund (SURF) Grants without any real apprehension, so long as the work/idea sounded solid. Even did some grad research courses as an undergrad there just because I signed up for the class; CMU I found is very willing to enable people to try some new stuff if they make a solid enough proposal around it.\n\nRegarding life as a grad student was a bit weird for me since I did undergraduate there so a lot of my friends in the years below me were around so I wasn't as much a fish out of water as most of the grad students joining with me. I navigated both the grad and older undergrad circles and from what I've observed most of the grad students tended to keep to their circles, not really exploring much of campus life outside of the work tied to the PhD. Given the workload, the age gap, and the time needed to warm up to some stuff on campus I don't fault most of them for not jumping into these campus activities. It's not unheard of to have grad students do things like S'n'S, Buggy, or Dancer's Symposium (I once knew a girl who did Buggy for 8 years) but it's not the norm. Most grad students I've met during my MS were ones I met during classes, projects, or the happy hours the department would throw every few weeks or so, knock a few beers back, swap stories, good times.\n\nRegarding other grad departments, I had a handful of friends in the Heinz College programs, two I knew from undergrad and one I met outside of CMU so I can't say much about the vibes with their program but I haven't met one I didn't like so my impression's pretty positive.\n\nThe only other grad students I got to know well enough were Tepper grad students. I'm not sure if this is my experience with Tepper people but the ones I talk to don't seem to like or want to know students/campus life outside of their program; much more aggressively than other grad students at CMU. One told me that she wanted the whole Tepper building locked to only Tepper people in order to \"prevent those undergrads from making out all over the building\". Some of them have even gone so far as to create student organizations exclusively for Tepper students, e.g. there's [an outdoor club for undergrate + graduate students](http://www.cmuexplorers.org/) and there's a second one that [Tepper students made for Tepper students](https://tartanconnect.cmu.edu/toac/home/). If this is the program you're going into then you may build tight bonds within this group but you'll miss out on CMU's collaborative nature and ability to network across disciplines. \n\nPittsburgh's a decent Medium sized city, large enough where you have museums, concerts, and sports, but small enough that you can get around most of it in like 20 minutes if you have a car. The bus system is serviceable, I never grew up in a city with good public transit so I don't have a metric besides Pittsburgh but my friends from other major cities go \"it's fine\". Rent during my time was cheap, me and three friends had a 3 bedroom apartment on Wilkins for about $1100/mo so I paid about $320/mo which the $12/hr job working maybe 10hrs/week was enough to cover and then some. This was 10 years ago. I hear the city's a bit more pricy now so it might be trickier. Perhaps find some other grad students and split an apartment like me and my friends did with a friend who's local; Godspeed.\n\nAnd yes! There is a Hofbrauhaus, I don't know how it compares to the other ones, probably not as good as the original one but then again that's a rather high bar. Beer comes in those glass steins and you can dance on the chairs, but not the tables, there's a live polka band that takes requests. I can't speak to the legitimacy of the experience compared to the real deal but it's worth at least seeing once to check it off the list.\n\nCouple of tips:\n\n\\-the weather is a strange thing in Pittsburgh. April of I wanna say 2016 we had one day of heavy rain, then a nice 80F sunny day, then snow, all in the same weekend. Helps to have a small umbrella, and a packable jacket in your trunk at all times in case a surprise downpour occurs.\n\n\\-Grad students did not get Spring Carnival off during my time there. I think it's changed, but if not I highly recommend you at least take the time to enjoy Friday and Saturday and watch the buggy races, enjoy the carnival rides, check out Booth, see the free concert if the act(s) are good.\n\n\\-Take the fence if you can. It's one of those weird campus traditions where you and your friends will be up all night you might as well paint a fence while you're waiting for your code to compile and have you/your friends/your organization say something to the rest of the campus.\n\n\\-Generally people at CMU are friendly, we're all just tired and I felt that there was a sense of camaraderie in the fact that we are all going through some flavor of hell and if we can help we can. Sometimes we're too tired/busy and we can't help, it's not you, it's just the project/research/exhaustion kicking our collective asses.\n\nI might have overdone it but I'd rather give you too much info rather than too little. Let me know if you want any details on anything specific.",
            "score": 4,
            "author": "ReliabilityEngineer"
        },
        {
            "level": 0,
            "comment": "Hey! Congratulations on the acceptance. I'd like to know about the department/program you were selected for and whether you had an interview. Apologies for being off-topic, but anxiety got the better of me.",
            "score": 3,
            "author": "StealthViper19",
            "replies": [
                {
                    "level": 1,
                    "comment": "just DM me, I’ll be happy to answer any questions!",
                    "score": 2,
                    "author": "Hungry-Reception-284"
                }
            ]
        },
        {
            "level": 0,
            "comment": "First of all congrats!! The vibe on campus is what you make of people and who you surround yourself with. People do work hard and most of my social life is study sessions with friends, but I find that despite people being really smart, most are down to earth and just looking to have fun. The graduate student community is nice, but I think a lot depends on your department. I love my department and the friends I have made; I also made friends in other departments too because those people were more social for going out on the weekends, getting breakfast together, etc. I have some friends that aren't really friends with people in their programs too, it just depends. One of my friends switched to my program because he hated his previous one, but loves ours because it's friendlier. Onto the city of Pittsburgh, it's not NYC, bands aren't coming through every weekend and there aren't a million clubs, etc. I do really love it here though, but because I like mid-sized cities and the sense of community I have found in my neighborhood. The locals are friendly and laid back and there's something new to do if you look for it. The rent is cheap, there is an airport if you get bored and want to jet set for a weekend. I think the main complaints I have is I wish there was better hiking/mountains locally and more artists came through town to play concerts.  Feel free to DM me if you'd like :)",
            "score": 2,
            "author": "scvmfvckflovver"
        },
        {
            "level": 0,
            "comment": " If you like Hofbrauhaus you will love all the microbrews locally produced — liquors as well.",
            "score": 2,
            "author": "mmobley412"
        }
    ]
}