{
    "id": "113hws8",
    "score": 4,
    "title": "How to get to Philadelphia if I don't have a car?",
    "author": "ice1000kotlin",
    "date": 1676521645.0,
    "url": "https://www.reddit.com/r/cmu/comments/113hws8",
    "media_urls": [],
    "other_urls": [],
    "postText": "The best I can guess is ✈ or 🚉. I haven't checked for ✈ but Amtrak is likely to take 7~8 hrs, which is very long, and the price is ~90 bucks. Is there any other ways that I'm not aware of?",
    "comments": [
        {
            "level": 0,
            "comment": "The thing about the train is that you can actually used that time to work, watch TV, study etc. Plus when you factor in waiting at the airport (and especially the bus to the airport if that’s your plan) then the trains only fourish hours longer at the worst. I’d say it’s definitely worth some thought.",
            "score": 19,
            "author": "neptunethecat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good point!",
                    "score": 1,
                    "author": "ice1000kotlin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Legroom too",
                            "score": 2,
                            "author": "neptunethecat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Megabus. Its faster than the train and dirt cheap.",
            "score": 16,
            "author": "Ixidor89"
        },
        {
            "level": 0,
            "comment": "greyhound if you're willing to do that LMAO",
            "score": 14,
            "author": "No_Anxiety_3567",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is the fastest and most affordable way. Literally cheaper than driving. But...  it is not luxurious.",
                    "score": 10,
                    "author": "z-nut"
                },
                {
                    "level": 1,
                    "comment": "Id rec megabus if it goes there. Megabus was a very pleasant experience",
                    "score": 4,
                    "author": "BurnBrightPhoenix"
                },
                {
                    "level": 1,
                    "comment": "Thanks. That's part of the results I've found on Wanderu...",
                    "score": 1,
                    "author": "ice1000kotlin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When do you plan to head there?",
            "score": 2,
            "author": "Accomplished_Tip_169",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's in the next semester. My gf lives in Philadelphia and I'm thinking about it.",
                    "score": 1,
                    "author": "ice1000kotlin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are buses.",
            "score": 2,
            "author": "isitsummeryet34y"
        },
        {
            "level": 0,
            "comment": "I've taken Megabus to Philly, the price is okay but the last time I took it the bus broke down late at night and the driver was a dick about it and the other passengers and I were stuck on the side of the road with no lights nor heat in the January winter for many hours until we were finally picked up by a second bus. They sent me an email promising a refund that I never got. Would not buy again.",
            "score": 2,
            "author": "Third_Corinthian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for sharing that!",
                    "score": 1,
                    "author": "ice1000kotlin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Try ourbus it was 48 round trip and super clean and nice!",
            "score": 2,
            "author": "Zestyclose-Self2665",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ourbus is the way to go on the cheap and a LOT better experience than greyhound because it tends to be all students in the bus",
                    "score": 1,
                    "author": "noire23"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amtrak is definitely the best way if flying is out of your budget. Southwest used to do direct flights between Philly and Pittsburgh for dirt cheap, but that was like 15 years ago lol. Yes, the train is long, but it’s actually a fairly comfortable experience - much better than the bus. I’ve done it all and highly prefer the train.",
            "score": 1,
            "author": "becca1769"
        },
        {
            "level": 0,
            "comment": "Megabus still a thing?",
            "score": 1,
            "author": "ComprehensiveCat7515"
        },
        {
            "level": 0,
            "comment": "Amtrak has discounts for students under 24, and additional discounts if you book at least 2 weeks in advance.\n\nI've found it to be worth it, especially with the time I get to read and sleep and do whatever other work I need on the train.",
            "score": 1,
            "author": "Historical_Yak529"
        }
    ]
}