{
    "id": "11fq76s",
    "score": 1,
    "title": "CS Transfer Credit?",
    "author": "aivilo1610",
    "date": 1677724152.0,
    "url": "https://www.reddit.com/r/cmu/comments/11fq76s",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone transferred in credit for CS? Specifically 110/112? Does it have to be python?",
    "comments": [
        {
            "level": 0,
            "comment": "\nWelcome to /r/cmu! **Please use [the megathread](https://www.reddit.com/r/cmu/comments/nenrn2/megathread_9_post_your_questions_about_admissions/?sort=new)** instead of making a new post for questions about admissions, transfers, and general CMU info like majors and dorms.\n\nWe get these kinds of questions a lot, and having the answers in one place is more helpful for everyone. Yours might already be answered!\n\nPlease consider posting to subs like /r/pittsburgh for general life in Pittsburgh questions, dedicated subs like /r/chanceme, /r/ApplyingToCollege, and /r/collegeresults for odds of getting accepted, and using the search in the sidebar.\n\n^(If I've misidentified your post, please ignore this message and instead take it as a reminder to contribute your own answers to the megathread.)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cmu) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I can't remember the exact number but I had two or three courses from community college--one being data structures in C++--count for 122.",
            "score": 3,
            "author": "Jeep70cp"
        },
        {
            "level": 0,
            "comment": "Got transfer credit for 110 from a class that was entirely matlab",
            "score": 2,
            "author": "claygames"
        },
        {
            "level": 0,
            "comment": "I'll just through this out there -- 112 with Kosbie was one of the best classes I have ever taken.  I felt bad for the people who placed out into 122.",
            "score": 1,
            "author": "ImOnLinuxBitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "you definitely miss out on the shared struggle that is that class and not having taken it i felt both that i  made missed out of this shared social moment at cmu and felt like i was on the back foot in the following cs class i took 122",
                    "score": 1,
                    "author": "coolhihi11"
                },
                {
                    "level": 1,
                    "comment": "I'm a ChemE sophomore rn so 112 is not for me loll",
                    "score": 1,
                    "author": "aivilo1610"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was able to get my AP credit to cover 112 which was taught in java but i also had a transfer declined for another class so your mileage may very",
            "score": 1,
            "author": "coolhihi11",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "aivilo1610"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What was the class number?",
                    "score": 1,
                    "author": "aivilo1610"
                }
            ]
        }
    ]
}