{
    "id": "11oq3b0",
    "score": 19,
    "title": "Quiet places to be alone",
    "author": "steelandsteeler",
    "date": 1678556517.0,
    "url": "https://www.reddit.com/r/cmu/comments/11oq3b0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m going through mental health and was wondering if anyone knew places that were a) decent study areas with b) a little bit of privacy so that I could deal with on and off panic attacks… thanks! I’m just trying to get through this semester without staying in my dorm the entire time",
    "comments": [
        {
            "level": 0,
            "comment": "Hey, if you need someone to talk to or just be with you while you’re going through your episodes, you can always DM me. Take care!",
            "score": 5,
            "author": "ProcedureDull1684",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a pretty strong support network but I appreciate the offer. Thanks for your kindness.",
                    "score": 3,
                    "author": "steelandsteeler",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is good to know, OP!",
                            "score": 1,
                            "author": "ProcedureDull1684"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hunt basement rooms",
            "score": 4,
            "author": "IVSimp"
        },
        {
            "level": 0,
            "comment": "Late night my friends and I enjoyed Wean fifth floor classrooms, they'd be my go to for all nighters. Super quiet and private. Though not sure whether it's still as accessible now. Please seek help if you can, that's what helped me graduate in the end. You'll get through this but you shouldn't have to go it alone.",
            "score": 3,
            "author": "xcanyoudiggitx",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a therapist and a psychiatrist, so no worries on that front. It’s just a matter of getting through my mandatory class so I don’t have to take a year off. Thank you for your concern! I’m just trying to bug my roommate less (lol)",
                    "score": 2,
                    "author": "steelandsteeler"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sending good thoughts your way.",
            "score": 2,
            "author": "reedGG21",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! You take it easy as well :)",
                    "score": 2,
                    "author": "steelandsteeler"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bonus if they’re empty during the day!",
            "score": 1,
            "author": "steelandsteeler"
        },
        {
            "level": 0,
            "comment": "The posner study rooms are nice, you just have to reserve them when you get there.",
            "score": 1,
            "author": "RealisticInterview34"
        },
        {
            "level": 0,
            "comment": "CPDC study rooms (in the evenings); classrooms on Wean fourth floor, behind the fire gates in front of the elevators; classrooms on Wean fifth floor; classrooms on Wean sixth floor on the side closer to Doherty; classroom on Wean eighth floor near the link to Doherty",
            "score": 1,
            "author": "ResearchPure5308"
        }
    ]
}