{
    "id": "11ukoqm",
    "score": 18,
    "title": "Is doing Masters in Computer Science worth it, amidst current Market layoffs?",
    "author": "CuriousDepartureOne",
    "date": 1679136004.0,
    "url": "https://www.reddit.com/r/cmu/comments/11ukoqm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi folks, \n\nI have been admitted to the Masters in Software Engineering program at Carnegie Mellon University, and I am truly impressed by its course offerings. However, given the current market scenarios(ongoing layoffs), I am hesitant to pursue the program. Although my current salary of $55,000 in India is considered good here, I would have to take a loan of $100,000 to attend the program and compete for placements next August(2024). \n\nMy concern is that the job market may not improve by then, and I may not be able to secure a decent job. As an Indian, I am also subject to stringent immigration laws, and I only have 90 days to find a job on OPT. Additionally, I must find a company that is financially strong enough to sponsor my H1B Visa application. Although I recognize the prestige of CMU, these factors are causing me significant anxiety.",
    "comments": [
        {
            "level": 0,
            "comment": "\nWelcome to /r/cmu! **Please use [the megathread](https://www.reddit.com/r/cmu/comments/nenrn2/megathread_9_post_your_questions_about_admissions/?sort=new)** instead of making a new post for questions about admissions, transfers, and general CMU info like majors and dorms.\n\nWe get these kinds of questions a lot, and having the answers in one place is more helpful for everyone. Yours might already be answered!\n\nPlease consider posting to subs like /r/pittsburgh for general life in Pittsburgh questions, dedicated subs like /r/chanceme, /r/ApplyingToCollege, and /r/collegeresults for odds of getting accepted, and using the search in the sidebar.\n\n^(If I've misidentified your post, please ignore this message and instead take it as a reminder to contribute your own answers to the megathread.)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cmu) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Note that the masters in software engineering is not the masters in computer science. So you may get a variety of responses for one, when you meant to ask about the other.",
            "score": 7,
            "author": "moraceae",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right, even though the courses would be different. The career trajectory wouldn’t be much. According to cmu stats more than 80% in both go for SDE roles.",
                    "score": 2,
                    "author": "CuriousDepartureOne"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t base the decision on current market actions, base it on the value you would get educationally and market outlooks for the rest of your career. Education is a long term investment - but still up to you to decide if it’s worth it",
            "score": 5,
            "author": "pieface100"
        },
        {
            "level": 0,
            "comment": "The tech layoffs were largely caused by massive over hiring during the pandemic.  The labor market is correcting now, but will soon begin another upward trend.",
            "score": 18,
            "author": "EverythingGoodWas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hoping that man 🤞🏼🤞🏼",
                    "score": 4,
                    "author": "CuriousDepartureOne",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I work as a Software Engineer, and just had a working lunch with one of the Google C suite guys, those were his words.",
                            "score": 7,
                            "author": "EverythingGoodWas"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Outside of very large technology companies (i.e. FAANG-ish), the market for software engineers in the US is fine right now and probably still will be in a year. Many companies in other industries are still hiring and the competition for those roles is normal. Which isn’t to say that getting a job will be *easy*, you still have to be competent; but, it’s not any harder now than at most other times. \n\nMoreover, you’ll never regret investing in yourself (so do it early and often), and timing the job market is as difficult as timing the stock market (exploit opportunities when they arise, but be flexible). \n\nSource: got my BSCS in 2011 from somewhere else, MS from CMU in 2013, and have had no problems finding positions since then.",
            "score": 5,
            "author": "Viper8"
        },
        {
            "level": 0,
            "comment": "Congrats on the admission! Contrary to other opinions, I would personally not take out a loan of 100k just to get a two year master here. I feel like most of the software engineering jobs in the US can be obtained with a bachelor degree with the exception of few positions. Also, finding jobs will not be easy if you are looking for people to sponsor a H1B visa even when you take in account the prestige of CMU.",
            "score": 2,
            "author": "Tasuka987",
            "replies": [
                {
                    "level": 1,
                    "comment": "How about UIUC undergraduate computer engineering? How good would it be for finding jobs that sponsor H1B and internships, connections etc.",
                    "score": 1,
                    "author": "Historical-Meaning78",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "UIUC is a very prestige school for ECE and CS, so I think you should be good. Nevertheless, there will still be competition.",
                            "score": 1,
                            "author": "Tasuka987",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To clarify, an undergraduate degree from UIUC is better than a graduate degree from CMU when looking for a job with an H1B sponsorship?",
                                    "score": 1,
                                    "author": "Rememberthisisreddit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think the commentary is that there isnt a significant advantage",
                                            "score": 1,
                                            "author": "sumguy3111"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats on being admitted!! I feel like from your loan of $100k, you could probably triple your current salary minimum with an MS in SWE. You will most definitely earn it back with some time. Also, like others are saying, by the time you graduate the market will probably be better than its current state.\n\n\nCongrats again :)",
            "score": 3,
            "author": "anthonybustamante"
        }
    ]
}