{
    "id": "11urc88",
    "score": 10,
    "title": "CMU MSCV",
    "author": "Hydrox__",
    "date": 1679153175.0,
    "url": "https://www.reddit.com/r/cmu/comments/11urc88",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone,\n\nI just got admitted to CMU MS in Computer Vision! I am also admitted to Berkeley MEng in EECS and UCSD MS in CS. I am not sure on what to do. CMU and Berkeley are cleary more prestigious but both programs are also more specialized. While I am more interested by CV and Robotics at the moment, I would have like to do a course or two in \"classic\" software. But I don't see myself refusing CMU or Berkeley just for that.   \nChoosing between CMU and Berkeley is a hard choice.\n\nHas anyone done the MSCV and has an opinion on it?",
    "comments": [
        {
            "level": 0,
            "comment": "Berkeley &gt;&gt;&gt;&gt; Pittsburgh",
            "score": 3,
            "author": "anthrax3000"
        },
        {
            "level": 0,
            "comment": "Congrats! Personally I would suggest MSCV based on the experience of my friend. As far as I know, MSCV is an one-and-a-half year program, which can let you get a summer internship and thus help seeking a full time job. This can be important especially if you are an international student like me. Meanwhile, MEng at Berkeley is a 9-month program, and since last year no extensions were permitted. That means you have to find a job in that short period of time.\n\nAlso, I believe there would be more freedom in course selection for MSCV than EECS MEng. Berkeley only offers a specific list of course that you're allowed to take, so if you're interested in a wide range of topics, MSCV can be the better choice.",
            "score": 2,
            "author": "Zestyclose_Ad2617",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Zestyclose\\_Ad2617\n\nThanks a lot! Really useful to have some practical insights. Your friend was/is in the MSCV? Would he/she be ok to answer some questions?  \nEither way, thanks again for taking of your time to help me, means a lot.",
                    "score": 1,
                    "author": "Hydrox__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well he went to MSCV last year and told me about his experience a couple months ago. I'm not sure whether he uses Reddit, but I can try to tell you what I know.",
                            "score": 1,
                            "author": "Zestyclose_Ad2617",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sure!  \nI saw that you can be a teaching assistant starting semester 2. Is this a hard limit like it is completely impossible to have a TA in the first semester?  \nAlso, how much of the tuition does the TA cover ?\n\nWhere is he working now? Is it easy to do an internship or to get a job in California despite the distance?",
                                    "score": 1,
                                    "author": "Hydrox__",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The MSCV program is really good with the best professors in computer vision teaching you. The capstone project is often collaborations with good industry partners like Meta. \nThey don't let you TA until after you've taken the course. That's why it starts in semester 2. But TA will barely cover tuition since the pay is ~$20/hour I think. That's the main downside, that it's expensive. But you will have a good alumni network to tap into when job searching as well as connections from your professors and capstone mentors.",
                                            "score": 2,
                                            "author": "tomas_carota",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks a lot for the answer. So the TA pays \\~$20/hour (that's \\~$1000/month more or less I think?) which is good for living cost but does not provide any additional tuition coverage? So in the end the master still cost \\~$80k if I'm correct.",
                                                    "score": 1,
                                                    "author": "Hydrox__",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes, that's correct. From what I saw, most did not do TAs. Many had worked for a few years, had family pay for it, or had loans. However, many had well paying summer internships at big tech companies that paid $10k/month pretax, but that will depend on your interviewing skills.",
                                                            "score": 1,
                                                            "author": "tomas_carota"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "MSCV student here, getting a TA job is not easy, most of the TAs are PhD student. Otherwise, the curriculum is good and very flexible, you can take many courses from other School/Dept. Above all of that, learning from peers is one of the most valuable exp, and research opportunities are everywhere. DM me if you have additional question \\^\\^",
                                                            "score": 1,
                                                            "author": "Apprehensive-Ad422"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}