{
    "id": "1250yjq",
    "score": 4,
    "title": "Internal transfer",
    "author": "Jealous-Leave379",
    "date": 1680034820.0,
    "url": "https://www.reddit.com/r/cmu/comments/1250yjq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I recently got accepted to Information Systems and I am not totally sure yet about what I want to major in. How hard is it easy to transfer from IS to MCS or SCS?",
    "comments": [
        {
            "level": 0,
            "comment": "\nWelcome to /r/cmu! **Please use [the megathread](https://www.reddit.com/r/cmu/comments/nenrn2/megathread_9_post_your_questions_about_admissions/?sort=new)** instead of making a new post for questions about admissions, transfers, and general CMU info like majors and dorms.\n\nWe get these kinds of questions a lot, and having the answers in one place is more helpful for everyone. Yours might already be answered!\n\nPlease consider posting to subs like /r/pittsburgh for general life in Pittsburgh questions, dedicated subs like /r/chanceme, /r/ApplyingToCollege, and /r/collegeresults for odds of getting accepted, and using the search in the sidebar.\n\n^(If I've misidentified your post, please ignore this message and instead take it as a reminder to contribute your own answers to the megathread.)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cmu) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Transfers between the colleges vary in difficulty.  Either way, it will depend on your major and how you’ve done in classes in that major until officially transferring.  I started out in H&amp;SS and finished in MCS.  IS is a really good degree and all the kids I graduated with are doing amazing.  SCS is more difficult to transfer to.  In a lot of ways CMU is not a good place to be of you don’t know your path.  Over a decade later I’m still figuring it out, and some important things about the University have changed in the years since.  What would you do in MCS?",
            "score": 2,
            "author": "awesomelybearded"
        },
        {
            "level": 0,
            "comment": "MCS not bad, SCS chance close to 0",
            "score": 2,
            "author": "lijordon"
        },
        {
            "level": 0,
            "comment": "near impossible to transfer to scs",
            "score": 2,
            "author": "Tarzan1415"
        },
        {
            "level": 0,
            "comment": "https://www.reddit.com/r/cmu/search?q=transfer&amp;restrict_sr=on&amp;sort=relevance&amp;t=all",
            "score": 1,
            "author": "GGC_PollyLejustice"
        }
    ]
}