{
    "id": "129mcj5",
    "score": 5,
    "title": "Problem logging into HealthConnect",
    "author": "[deleted]",
    "date": 1680444515.0,
    "url": "https://www.reddit.com/r/cmu/comments/129mcj5",
    "media_urls": [],
    "other_urls": [
        "https://preview.redd.it/da5t2tynahra1.png?width=1468&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=f3789256cef4372d5647f306d43b02a223fbcf8a"
    ],
    "postText": "Hello, CMU admit here.\n\nI am trying to log into HealthConnect as one of the steps post acceptance, but every time, it shows me this message:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/da5t2tynahra1.png?width=1468&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=f3789256cef4372d5647f306d43b02a223fbcf8a\n\nI tried virtually all methods I can think of, and none of them worked for me. Is this normal, or am I doing something wrong? Thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "Try the following steps in order, proceeding with the next step if the current one doesn’t resolve your issue.\n\n1. Log into HealthConnect through a private or incognito browsing window.\n2. Log into HealthConnect through another web browser altogether.\n3. Try logging into HealthConnect on another device, such as a smartphone, and disconnect from your home Wi-Fi.\n4. Try logging into your email using the following link: https://email.cmu.edu/\n4a. You can also try logging into SIO, Housing Portal, etc. but email is usually a good litmus test as to whether there is an issue with your account.\n5. If steps 1-3 failed but you could log into your email, reach out to University Health Services (UHS) ASAP and let them know you tried all of the steps above, and that you can log into your email and other CMU services without issue. Their email is health [at] andrew.cmu.edu.",
            "score": 1,
            "author": "maskedmuskmelon"
        },
        {
            "level": 0,
            "comment": "Please let me know if you find the solution because I'm having this problem too!!!...",
            "score": 1,
            "author": "Procrastimagine",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m still having the problem!!! Apparently we just have to wait and that solves the problem, so I’m just waiting",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ya, emailed the department. They said it doesn't open until mid-May. Wish they clarified this in the portal...? (Unless they did. Then mb).",
                            "score": 1,
                            "author": "Procrastimagine"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I emailed the health department and they said that we (incoming fall freshmen) won't be able to sign in until mid or late May. We're not added to HealthConnect yet.",
            "score": 1,
            "author": "Procrastimagine"
        }
    ]
}