{
    "id": "12bqhp5",
    "score": 15,
    "title": "Someone Please Explain The Bus System at CMU - New Grad Student",
    "author": "Jayyyz10",
    "date": 1680630056.0,
    "url": "https://www.reddit.com/r/cmu/comments/12bqhp5",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, can someone please explain to me what are the transportation services that I am paying for every semester? What is the difference between shuttle and normal bus? Can I board any bus at Pitt using the ID or are there only select few busses?",
    "comments": [
        {
            "level": 0,
            "comment": "You can board a red and white CMU shuttle or a Port Authority public bus. You cannot ride a Pitt shuttle",
            "score": 14,
            "author": "PghSubie",
            "replies": [
                {
                    "level": 1,
                    "comment": "According to here: https://www.pc.pitt.edu/buses-shuttles/routes-schedules/non-pitt-riders CMU students are allowed to ride Pitt shuttles. However, I'm not sure if it's out of date.\n\nI have definitely ridden the Pitt shuttles before -- they've never checked my ID or anything.",
                    "score": 6,
                    "author": "RaffyCh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's new information to me",
                            "score": 1,
                            "author": "PghSubie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is an old post, but I'd like to confirm this is true via meetings I've had with the Parking &amp; Transportation Committee on campus.",
                                    "score": 1,
                                    "author": "acheng98"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So except the Pitt shuttle I can board all the other public busses with the CMU ID?",
                    "score": 3,
                    "author": "Jayyyz10",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Pitt shuttle is certainly not a public bus.",
                            "score": 6,
                            "author": "PghSubie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Alright got it, so I can get on CMU Shuttles and Port Authority busses. are the frequency of busses good enough to not worry about reaching cmu on time",
                                    "score": 2,
                                    "author": "Jayyyz10",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Use the Transit app. They show real time PRT bus locations and it is decently accurate. Though if you live far away and want to be on time 100% of the time, don’t rely on it or just leave early. Busses generally come every 5-20 minutes depending on location and time of day. \n\nThe CMU shuttles can be tracked using the Ride Systems app. I have only used it once and I am not sure exactly how the system works.",
                                            "score": 2,
                                            "author": "klausklass"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Google maps can probably answer that better than Reddit can",
                                            "score": 3,
                                            "author": "PghSubie"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Depends on where you're bussing from - most grad students are in Shadyside, Squirrel Hill, and Oakland neighborhoods where you'll have no problem reaching campus within 25 min. Some busses are not as reliably on time, but they're frequent which that it's not a problem. Transit app is currently the best for tracking live bus times.",
                                            "score": 1,
                                            "author": "nicebowlofsoup"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Where are you bussing from?",
                                            "score": 1,
                                            "author": "talldean",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Near Mellon park, 5th Ave Shady Side",
                                                    "score": 1,
                                                    "author": "Jayyyz10",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;5th Ave Shady Side\n\nThat would be real easy to get to campus.  I would generally just take a PAT Bus right down Fifth, and get off at Fifth and Morewood, the edge of campus.\n\nYou could also do this on a bicycle, but I'd not take Fifth Ave in that case.  Take the sidewalk (on Fifth) half a block, then go one block north of Fifth and go parallel to it, then take the left onto Morewood and go directly onto campus. \n\n(Kentucky Ave, right on Aiken, left on Westminster, past the really really ritzy mansions there, right at the next block, left onto Castleman which is also kinda cool, then left on Morewood and campus is there.)",
                                                            "score": 1,
                                                            "author": "talldean",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "thank you so much for the reply! I will definitely follow your advice &lt;3",
                                                                    "score": 1,
                                                                    "author": "Jayyyz10"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are two separate bus services for CMU students: 1) the PRT City of Pittsburgh mass transit system, and 2) the CMU Shuttle service\n\n1) **PRT schedules** can be found here: [https://www.rideprt.org/all-schedules/](https://www.rideprt.org/all-schedules/) Look for 61A, B, C, and D routes, the 67 and 69, and 71A, B, C, D routes for the lines that run through the CMU campus.\n\n2) The **CMU Shuttle** service is a free rides along various round trip routes, all departing from campus and repeating throughout the day according to these routes and schedules: [https://www.cmu.edu/parking/transport/shuttle.html](https://www.cmu.edu/parking/transport/shuttle.html) \n\nBoth PRT busses and CMU Shuttle are free of charge with your CMU ID. Note that you can actually use the entire PRT system freely with your CMU ID, which is great for when you want to explore the city.\n\n&amp;#x200B;\n\nHope this helps!",
            "score": 7,
            "author": "plaidandpickles",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;PRT busses and CMU Shuttle are free of charge with your CMU ID. Note that you can actually use the entire PRT system freely with your CMU ID, which is great for when you want to explore the city.\n\nThis is perfect! thank you so much for the detailed response, I have a much better idea about the entire system now",
                    "score": 4,
                    "author": "Jayyyz10"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just adding some info in case you have never ever taken a public bus before:\n\nHow to Ride the Bus:\n\n1. When bus approaches, stand at the bus stop sign, face bus, and stick out your right hand. Do not touch cars. The bus's two front lights will blink when the driver has seen you (or is about to stop anyways).\n\n2. Wait for anybody to get out first.\n\n3. Get on bus. \n\n4. Tap bus pass / feed bus cash\n\n5. Take your place. Order of priority:\n\n    - open seat without anybody next to you\n    - any open seat\n    - walk as far as u can to back of bus and stand there. \n\nTry to leave the front seats for people with mobility issues if you are able-bodied.\n\n6. When you need to get off, you'll request a stop: press the (red) stop button on a pole or pull the (yellow) string above the window. Bus will stop at the next designated stop. Try to request early enough to give the bus driver enough time to stop.\n\n7. Get off.",
            "score": 11,
            "author": "nicebowlofsoup",
            "replies": [
                {
                    "level": 1,
                    "comment": "1a. Also do not lick the walls of the bus",
                    "score": 3,
                    "author": "klausklass",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "7a. Do not “get off” on the bus, but rather physically get off the bus towards your destination",
                            "score": 5,
                            "author": "lasidlasdd"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.cmu.edu/idplus/services/transportation.html",
            "score": 2,
            "author": "AxsDeny"
        },
        {
            "level": 0,
            "comment": "Anything on the PRT system is free with a CMU ID. Even trains and the inclines.\n\nOne caution about the busses, at the bus stops closer to campus, right before the 9:30 and 11am classes start, you'll have trouble getting on a bus because it's full of other CMU students trying to get to class too.",
            "score": 1,
            "author": "DaGr8Bungholio"
        },
        {
            "level": 0,
            "comment": "Nice",
            "score": 1,
            "author": "Matrix_01"
        }
    ]
}