{
    "id": "12s6v0k",
    "score": 1,
    "title": "15122",
    "author": "Other-Corner4078",
    "date": 1681931581.0,
    "url": "https://www.reddit.com/r/cmu/comments/12s6v0k",
    "media_urls": [],
    "other_urls": [],
    "postText": "How hard is this course for someone with a biology background? Is it possible to audit this course ? Is the support system for this course as good as the 112 course and are there any prerequisites for it",
    "comments": [
        {
            "level": 0,
            "comment": "It should definitely be a breeze with a biology background. The first midterm is all about the mitochondria and its role as the powerhouse of a cell. You also learn about trees in biology (maybe even AVL trees?) and I heard they do those in 122.",
            "score": 5,
            "author": "D_Dink"
        },
        {
            "level": 0,
            "comment": "112 is the prerequisite and if you did ok in it you should be fine. There's tons of support.",
            "score": 1,
            "author": "Rememberthisisreddit"
        },
        {
            "level": 0,
            "comment": "Hello!\n\nI am currently taking 15-122. I did really bad last semseter on it. I have done less bad this semester. Here goes.\n\n&amp;#x200B;\n\n1) How hard is the course? It varies. Start your homework early, I realized this late but the assignments get a lot easier when you don't have a deadline looming. Start early, the course gets exponentially easier. Beyond that, its a lot of thinking. Like, start planning your code. Draw stuff. Plan more. Learn how to debug. Learn good coding practices(make your code nice and clean and neat if you can) and that'll make it a lot easier when you're debugging. \n\n2) idk how auditing works, probably? you could also just like, hop into the classroom, there's usually open seats.\n\n3) I love the support system. Shoutout the TAs who sit through my incoherent rambling when I fuck up. TAs? excellent. Labs? Excellent. Reci? excellent. Only problem is that there's an OH queueue that can be murderous on bad days. Otherwise, easily one of the best supported classes.\n\n4) 112 is the only prereq.\n\n&amp;#x200B;\n\nthe only thing i really did differently between F22 and S23 was start early, go to lecture, and study the slides. I went from \\~36 through the first 6ish weeks, to a 92 rn, with only a couple assignments and a final in the way of an A(my first A at cmu :))))\n\nhave fun, good luck :)",
            "score": 1,
            "author": "Congress1818"
        }
    ]
}