{
    "id": "12yox1k",
    "score": 49,
    "title": "Help me put my friend in his place",
    "author": "Ok_Interaction8645",
    "date": 1682441348.0,
    "url": "https://www.reddit.com/r/cmu/comments/12yox1k",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, so I’m petty. I was accepted into the school of art at CMU and am planning to attend! Super excited. So in saying that I’m more of a humanities/ art/ business kinda person and not so much stem.\n\n\nSo yesterday, I was talking to a friend and he was joking how I wasn’t going to make money with art and like other things that we joke about. But one thing struck a chord, when I made a comment about maybe experimenting in CS he laughed and said something along the lines of, “ha, you in Carnegie Mellon cs? I would start to question how good the program was” and continued on about “knowing your strengths and sticking to it”\n\nNow, Ik I’m not a stem girl but I’ll be dammed if I let someone tell me what I am not capable of. I don’t want him to apologize, I want revenge, I want blood. \n\nSo, with all that being said what resources do y’all suggest for me to learn the fundamentals to succeed for at least a couple of classes in CS in Carnegie Mellon. Ik there’s an introductory course at CMU and I’ve found some resources online but Ik CS is hard and especially at CMU so any advice would help 😊😊\n\nThank you in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "The intro cs class, 15-112, is completely online at CS academy, which is free. I would start doing that to get a head start on the content. By the end of the semester long class, a complete beginner to programming should be able to code and animate sudoku and tetris from nothing. That includes solving a sudoku board in milliseconds, which is pretty cool. Basically everyone, including non-stem majors, take the class",
            "score": 54,
            "author": "Tarzan1415",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg that sounds perfect!! Thank you so much ☺️",
                    "score": 8,
                    "author": "Ok_Interaction8645"
                },
                {
                    "level": 1,
                    "comment": "&gt; CS academy\n\nI haven't heard of this, can anybody take courses on it?",
                    "score": 2,
                    "author": "oak-hearted"
                },
                {
                    "level": 1,
                    "comment": "How can I get credit for 15-112 from CS academy if I'm not paired up with a teacher? I'm an incoming student.",
                    "score": 1,
                    "author": "uttermostjoe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know/not sure if you can. The most common way people got credit for 112 is a 5 on AP CSA, but the difficulty of AP CSA is nowhere that of 112",
                            "score": 1,
                            "author": "Tarzan1415",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My high school doesn't offer AP CSA, but I do have some programming experience. Perhaps I should take the placement exam for 15-112, which I heard mainly tests basic Java knowledge",
                                    "score": 1,
                                    "author": "uttermostjoe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The course is in Python. Also, I don't think the placement exam allows you to skip to 112 and go to 122. And the course is not very basic. By the end, you should be an intermediate level programmer. Look at the old websites of the course and try the final exams. That will let you know where you stand.\n\nThe hardest topic in the course is backtracking, so if you're able to consistently write those algorithms, you're at the level for the next course",
                                            "score": 1,
                                            "author": "Tarzan1415",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you very much. I have experience writing algorithms like backtracking from doing competitive programming. I will look at past final exams and see if I should try to skip the course.",
                                                    "score": 1,
                                                    "author": "uttermostjoe"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "the placement exam does let you skip into 122; it was 18/20 on mcqs this year to skip",
                                                    "score": 1,
                                                    "author": "lunarbaihu"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "112 also low key fun if u do something h find cool for ur term project! I made a really bad tower defense game but it was hella fun to code and balance",
                    "score": 1,
                    "author": "Domination411"
                }
            ]
        },
        {
            "level": 0,
            "comment": "a) where's he going? trust me, I got a shit ton of material on almost every college \n\nb) seconding what everyone says about  112, but also like, check out the BCSA!\n\nc) also also also, check out Infinite Descent by Clive Newstead for an introduction to discrete math, which is a big part of CS beyond 112, and will put you in great stead\n\nd) check out IDeATe!",
            "score": 22,
            "author": "Congress1818"
        },
        {
            "level": 0,
            "comment": "There is a solid amount of crossover between art and computer science at Carnegie Mellon! \n\nI have my BFA in Fine Arts from CMU but in the course of finishing the program I took the introductory programming course (In the spring, at the time it was 15-110 in Java with David Kosbie) I also took Gadetry which was a course about making embedded systems and custom printed circuit-boards. As well as a number of art courses that integrated computer aided design (Digital Fabrication, Kinetic Sculpture, CAD with the Design College) \n\nThere are lots of opportunity to test the waters of programmatic and generative art especially through courses offered at the [STUDIO for Creative Inquiry](https://studioforcreativeinquiry.org/) If you fall in love with the idea of staying on a CS track there is also the BCSA program \"Bachelors of Computer Science and Art\" in the [BXA department](https://www.cmu.edu/interdisciplinary/programs/)\n\nCollege is 100% the time to experiment with these possibilities and there is a lot of help offered, especially to non-majors. GO TO OFFICE HOURS if you are struggling. Teaching Assistants are there to help and they enjoy helping folks. I would not have got through these courses without assistance. There is no shame in it. \n\nSome things you will be successful in, some things will be a struggle but anyone who questions the rigor, or the difficulty that comes with any and all majors at CMU has not experienced it. The university is one of the most prestigious in the country and it earns that reputation in spades. \n\nYour art program will also not be easy. But you can handle it! Good Luck!",
            "score": 10,
            "author": "Aun_vre"
        },
        {
            "level": 0,
            "comment": "Seconding u/Tarzan1415 on CSAcademy. Additionally, you can take a look at [previous versions](https://www.cs.cmu.edu/~112/syllabus.html) of 112, when we didn’t use CSAcademy (go to Previous Versions and click on any of the semesters to access that semester’s website). The notes aren’t as detailed as CSAcademy’s but the homeworks are different. The starter files are included on the site, and in F22’s homework 5 one assignment is to make an image viewer of a brain!",
            "score": 10,
            "author": "underwaterpancakes"
        },
        {
            "level": 0,
            "comment": "Honestly fuck that, I think you can be successful doing CS for sure, and college is the time to try things you haven’t before and discover new interests! Also, I second everyone telling you to take 112, I went in with very little prior experience not expecting to enjoy it or do well and it ended up being my favorite class I’ve taken here so far (might be biased because I TA for it now tho…)\n\nI don’t think CS3 on CS Academy is available to people that aren’t currently taking the course, but past versions of the course website have extensive notes that could help you get a head start. (I will caution you that 112 uses a slightly different graphics framework now, and the content it covers changes slightly every semester.) 112 doesn’t assume prior knowledge, though, so you don’t necessarily need to self study to do well and get a lot out of it.\n\nGood luck!!",
            "score": 9,
            "author": "solidFruits"
        },
        {
            "level": 0,
            "comment": "Cs + art are great especially if you’re interested in UI/UX. Check out the HCI minor or additional major",
            "score": 7,
            "author": "aSliceofPepperonni"
        },
        {
            "level": 0,
            "comment": "I grew up in Pittsburgh. It is an honor to attend CMU for really any major. Great alumni base. I have a friend who is finishing up her art major. I'm sure she will do fine with the connections she made at CMU. I'm starting my master's at CMU in May. I had a different school I was going to go to but I found a program that really fits my career goals—product management. Be proud of yourself and don't worry too much about what other people say. But what can I say? I have a mathematics bachelor's bc a professor at my undergrad school told me I'll never get a math degree.",
            "score": 3,
            "author": "Lord412"
        },
        {
            "level": 0,
            "comment": "I guess it depends what you want out of it. There is 112 and also 151. Both can be self studied online. If you want to just learn to code then 112 is perfectly serviceable. If you want to have some of the foundations to take other courses and actually end up liking it you may find 151 interesting, though it is strictly a math course",
            "score": 2,
            "author": "Yoshbyte"
        },
        {
            "level": 0,
            "comment": "Outside of CMU, there's [MIT's Missing Semester](https://missing.csail.mit.edu/) and the [GitHub Student Developer Pack](https://education.github.com/pack) with your .edu email!\n\nI'd also really recommend stopping by student events like ScottyLabs and ACM@CMU where there'll be mentors (and prizes!) available to try out a topic or technology over a weekend.",
            "score": 2,
            "author": "TheMagicalWarlock"
        },
        {
            "level": 0,
            "comment": "Honestly, with an art and CS degree you will be rubbing it in his face after graduation (provided he stick to some software engineering career). All artists can be replaced by generative AI and eventually SE wil be replaced by AI given the current progress. So keep working hard and think about jobs that may leverage your art and cs degree better down the line. For UI UX design jobs it would probably be people who have a good taste in artistic design (even psychology) that may be preferred.",
            "score": 1,
            "author": "hydrargyrumss"
        },
        {
            "level": 0,
            "comment": "Your friend's attitude, which is hardly unique, irritates me so, so much.  Computer science is, historically, and really ought to conduct itself as a melting-pot discipline.  \"Thinking like a computer scientist\", by which I mean building and using (and knowing when to violate!) *abstractions* to design and understand complex things, is a general skill and we should be striving to make it available to anyone.  Dually, without *things* to think about, which largely come from other disciplines, computer science would just be a weird little branch of mathematics.  (I am, perhaps, a little jaded, having been a physicist who hung around CS people before getting that degree, too.)\n\nOthers have said that 15-112, the introduction to the task of *coding*, is available online, and while knowing how to code is absolutely important (and there are so, so many language to choose from; don't get discouraged if you find that you don't like the first one you try!), you might also want to devote some time to the *theory* side.  You say you're not a STEM person, so I'm not sure what you'd consider your mathematical background to be, but the textbook for 15-151 is also available online at [https://infinitedescent.xyz/dl/infdesc.pdf](https://infinitedescent.xyz/dl/infdesc.pdf) and looks pretty good!  Even CS people occasionally discount math, but it's excellent training for *abstraction* and the *art* of matching problems to one's available tools.\n\nYou didn't say what kind of art you do, but you might want to reach out to my friend [https://www.morphingmatter.cs.cmu.edu/people/lea](https://www.morphingmatter.cs.cmu.edu/people/lea) if the kinds of things she does appeal.  There's also [https://ideate.cmu.edu/facilities/index.html](https://ideate.cmu.edu/facilities/index.html) with resources for digital fabrication and shoving little computers into real-world objects (\"physical computing\").  If music's more your thing, there's [https://www.cs.cmu.edu/\\~music/](https://www.cs.cmu.edu/~music/) (perhaps most well known for their robotic bagpipe player... it's definitely a CMU thing.)\n\nIf I can be of further assistance, please ask.",
            "score": 1,
            "author": "nwf"
        }
    ]
}