{
    "id": "1324q3z",
    "score": 6,
    "title": "prerequisites for 400 level courses with no listed prereqs",
    "author": "Congress1818",
    "date": 1682704236.0,
    "url": "https://www.reddit.com/r/cmu/comments/1324q3z",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm talking about stuff like 11-411(NLP), 80405 (game theory) and 80413(category theory). THey don't have explicit prerequisites, but what courses are reommended for the understanding necessary for them?",
    "comments": [
        {
            "level": 0,
            "comment": "For 11411, taking an intro AI course (15281) or intro ML course (10301 or 10315) would be helpful since it gives you a high level overview of what machine learning is whereas 11411 focuses more on ML models for specific NLP tasks. The coding is in Python so that's not difficult, probably 15112 and definitely 15122 would be good enough. Statistics might be useful, but they review this in class so not necessary. You can always talk to your advisor or email the professor if you want a better understanding of the expected background for a class.",
            "score": 4,
            "author": "shr4162",
            "replies": [
                {
                    "level": 1,
                    "comment": "oh okay, thanks",
                    "score": 1,
                    "author": "Congress1818"
                },
                {
                    "level": 1,
                    "comment": "By \"probably 15110 and definitely 15122 would be good enough,\" you mean \"110 is probably good enough and 122 is definitely good enough, right? Also did you mean 112?",
                    "score": 1,
                    "author": "KhepriAdministration",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oops, I meant 112 instead of 110. And yes, I didn’t take 112 but I think it should be good enough, I know 122 is definitely enough.\nEdited the original to correct 110 -&gt; 112",
                            "score": 1,
                            "author": "shr4162"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would take an algebra class before category theory.",
            "score": 3,
            "author": "xeyalGhost"
        },
        {
            "level": 0,
            "comment": "For Game Theory, concepts or some similarly rigorous proof-y math class.\n\nFor Category Theory, at least Abstract Algebra and maybe Set Theory.",
            "score": 3,
            "author": "Decent-Froyo-6876"
        },
        {
            "level": 0,
            "comment": "11-411: good to have familiarity with ML (10-301). Some other ML elective (11-485) would be even better. At the very least, have Probability (36-226, 21-325, or similar) and 15-112/22 under your belt.\n\n80-405: good to have Intro Micro (73-102) under your belt, and Probability and/or Concepts (21-127) would also be nice. I think there's also Decision Theory (80-305) that serves as a very natural prereq for it. Other than that, you could probably go in blind\n\nNot sure about the third course",
            "score": 2,
            "author": "zleventh"
        },
        {
            "level": 0,
            "comment": "Make sure you learn Kazakh cause the courses are only taught in that",
            "score": 1,
            "author": "WPIFan"
        }
    ]
}