{
    "id": "13ov1f4",
    "score": 15,
    "title": "Socializing as a Grad Student",
    "author": "Mundane_Gene_5473",
    "date": 1684771473.0,
    "url": "https://www.reddit.com/r/cmu/comments/13ov1f4",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm an incoming international PhD student at CMU. During my undergrad, I've always found it hard to socialize and make friends. What are the best ways to socialize and make friends to hang out with regularly at CMU? Or maybe even dating?\n\nI can think of joining clubs, but are they very active at CMU? Personally, I'm into some sports, but not much into creative activities like music. Although I'm not averse to learning anything new.\n\nSorry if all of this sounds silly, just that I've been an introvert all my life lol",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; I can think of joining clubs, but are they very active at CMU?\n\nThere are many active clubs at CMU for all kinds of stuff. That said, CMU does a pretty bad job of including graduate students into the clubs. For instance, they don’t invite grad students to the club fair, and there are not really grad student specific clubs.\n\nBut I still encourage you to join clubs (I have as a graduate student). Just know that they will be mostly undergrads.\n\nThe graduate student assembly puts on graduate student events that you should definitely try out. For instance, this summer, they are doing graduate student intramural sports. They have had trivia, skiing, etc.\n\nIn general, I think most phd students get their friends from their program. So like if you are a phd student in X subject, you should probably try to befriend your fellow phd students in X. I recommend setting up some group chat/slack/etc for your incoming cohort to get the socialization started.",
            "score": 11,
            "author": "Fake_Name_6",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am surprised by that. I thought 50% of CMU's student population are grad students!",
                    "score": 5,
                    "author": "fibncl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Over 50% are grad students but grad students tend to be less involved socially, usually primarily sticking to their departments. There's generally not much grad participation in the context of clubs.\n\nThere are a few though, especially cultural organizations ([e.g. these](https://www.cmu.edu/graduate/student-life/graduate-student-organizations/university-organizations.html)) - check out TartanConnect for a comprehensive list!\n\nhttps://tartanconnect.cmu.edu/home_login",
                            "score": 3,
                            "author": "acheng98"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks for the advice!",
                    "score": 1,
                    "author": "Mundane_Gene_5473"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve been in this situation many years ago, and while cmu definirely has clubs, they don’t generally feel welcoming to PhD students. You’ll be older than most of the students, and you’ll be considered at a different stage. \n\nYou’re better off finding friends from your country of origin, or finding friends at Pittsburgh at large. Over the years Pittsburgh has acquired a larger group of urban professionals than it had a couple of decades ago, so it’ll be easier to find people around your age who aren’t originally from Pittsburgh or who care about more than football",
            "score": 2,
            "author": "slpgh"
        },
        {
            "level": 0,
            "comment": "I didn't join any clubs as a UG. However, coming back to school as a PhD, I felt more socially confident and charismatic and have been involved with a few orgs.\n\nThere are so many to try. Some will vibe immediately, some may not click. Any really deep friendship takes 6+ months to form so just be patient and stay positive/open-minded. Don't be afraid to text people about hanging out...the ones that respond and return the favor later will become your homies.",
            "score": 2,
            "author": "Surveyor7"
        },
        {
            "level": 0,
            "comment": "Join the incoming grad student Discord!! https://discord.gg/frT4QD6N",
            "score": 2,
            "author": "dawizard2579",
            "replies": [
                {
                    "level": 1,
                    "comment": "It says link is expired",
                    "score": 2,
                    "author": "batty_mgb7"
                }
            ]
        }
    ]
}