{
    "id": "13s0bxw",
    "score": 14,
    "title": "How do you make friends in cs courses with their strict collaboration policies?",
    "author": "Far-Phone5265",
    "date": 1685066800.0,
    "url": "https://www.reddit.com/r/cmu/comments/13s0bxw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I feel like my experience taking cs courses has been kind of isolating and I haven't been able to make many friends or never had anything like some study group. I'm not sure if it's for the best or not, but sometimes I feel like I'm missing out on learning opportunities. I often wonder the way that the people that finish the homework's the day its released think and sometimes wonder if I'm missing in some way of thinking of approaching problems. I've seen myself grow and improve a lot and make tremendous progress especially considering I never saw myself taking any cs courses or doing anything cs related, but I feel like without office hours I wouldn't be able to survive these courses and sometimes wonder how I would've came up with some stuff without any guidance. I wonder what it's like to be the kind of person who has never needed  office hours. Am I missing out on something?",
    "comments": [
        {
            "level": 0,
            "comment": "Most CS courses have a whiteboard policy, no? \n\nThe whiteboard policy encourages a lot of collaboration at least in my experience.",
            "score": 9,
            "author": "klausklass",
            "replies": [
                {
                    "level": 1,
                    "comment": "I haven't taken any of the upper level cs courses yet. I've only take the 15-1xx courses and one 15-2xx course.",
                    "score": 3,
                    "author": "Far-Phone5265",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know it’s a bit cliche but tbh you can just reach out to people and ask to study with them, preferably people you have already interacted with before.",
                            "score": 3,
                            "author": "klausklass"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, intro CS courses do tend to be stricter about collaboration policies. As you start taking more 2xx+ level courses you will see whiteboard policies explicitly stated, or at least implicitly understood.\n\nTo quote 210 policy from when I took it, \"To facilitate cooperative learning, it is permissible to discuss a homework assignment with other students, provided that the following whiteboard policy is respected.\"\n\nBut personally, as long as you don't directly talk about / copy / look at solutions with your peers, high level discussions are permissible (and often greatly helpful) in any CS classes in my experience.",
                            "score": 1,
                            "author": "Alan7996"
                        },
                        {
                            "level": 2,
                            "comment": "I'm assuming you took 213, which is definitely the strictest of the 200-levels wrt collaboration. 251 and 451 require you to have a group for many assignments so that could be a good opportunity to meet new people and help you learn. 210 is also more relaxed about collaboration.\n\nIf you're looking to make more CS friends, have you considered joining ScottyLabs? I found SI sessions helpful for meeting new people, so that might be something to consider if you're still taking math classes.\n\nAlso, there are very, very few people who are finishing the 200-level CS homework the day it's released. While you should really try to avoid comparing yourself to other people, I would *especially* avoid comparing yourself to these people. You likely lead a more balanced life than most of them, and that is something to celebrate more so than being some kind of coding whiz (or having the assignments from when you took the class in a prior semester, which is often the case...).",
                            "score": 1,
                            "author": "thinker111111",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't know if I have the most balanced life. I feel like everything I do revolves around work and even the stuff I do like have good sleep habits or eating well serve to help me with my work, though I have been able to manage it and stay on top of it, it feels like it's the only thing I've done or am doing. I definitely will consider your suggestion to join ScottyLabs and I was interested in other organizations on campus to extend the content of the courses outside of the classroom or things I could consider pursuing myself and also how to remain consistent in pursuing them with the workload.",
                                    "score": 1,
                                    "author": "Far-Phone5265",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because you’re worried that your life revolves around work, I suggest joining an org that’s not directly tied to cs. What are you interested in? Is there anything you’ve wanted to try but never gotten around to? Or maybe something in the catalog looks super cool but you’ve never even considered it before (juggling? improv?)? Try to select one org to try next semester and block out the time like you would a class. Once that time becomes unavailable, you will naturally shift your work to different times of day (obviously, there is a limit to this so start with a 1-2 hour/week thing)",
                                            "score": 1,
                                            "author": "thinker111111"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be frank, people do what they need to do to survive CMU",
                    "score": 5,
                    "author": "AdChemical9067"
                },
                {
                    "level": 1,
                    "comment": "People who get busted for AIVs care a lot.",
                    "score": 2,
                    "author": "Rememberthisisreddit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Several of the upper level classes I took you were REQUIRED to work with a partner on homework and projects, I feel like the department is not anti-collaboration at all.",
            "score": 1,
            "author": "NLoUDH"
        },
        {
            "level": 0,
            "comment": "You don't have to study with someone to be friends. Just stay talking to them.",
            "score": 1,
            "author": "Rememberthisisreddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're right. There are people I've met through my cs courses, but I've felt the friendship to be superficial in the sense that I only happen to see them during lecture or whenever I happen to come across them, but even then when there happens to be a situation where collaboration is allowed like some in class activity or 122/150 labs I always ended up working alone.",
                    "score": 1,
                    "author": "Far-Phone5265"
                }
            ]
        }
    ]
}