{
    "id": "1495486",
    "score": 4,
    "title": "Where to open the bank account at CMU?",
    "author": "CuriousDepartureOne",
    "date": 1686741046.0,
    "url": "https://www.reddit.com/r/cmu/comments/1495486",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am joining CMU this fall. I needed some help in deciding where to open my bank account. I heard digital banks like Zolve are better than traditional banks but how do I decide among available digital banks like Zolve, Sable etc. There isn't much on the internet. Generally Reddit search could solve this but with the ongoing protest, I can't get much clarity.",
    "comments": [
        {
            "level": 0,
            "comment": "Most students Open an Account with PNC and Chase. PNC is more like a local bank and has its presence in and Pittsburgh along with East Coast. Chase is almost everywhere.",
            "score": 1,
            "author": "Immediate_Price6777"
        },
        {
            "level": 0,
            "comment": "As others said, go with PNC. It's offering is decent, has partnership with CMU, no account maintenance fees and their savings account is currently giving 4.3%.",
            "score": 1,
            "author": "kp729"
        },
        {
            "level": 0,
            "comment": "I recommend PNC cause CMU has a partnership with them and their ATMs are on campus (no cash withdrawal fee)",
            "score": 1,
            "author": "Tarzan1415"
        },
        {
            "level": 0,
            "comment": "I'd go with PNC over Chase or any other option.\n\nI graduated ten years ago and still bank with PNC.",
            "score": 1,
            "author": "theorem_lemma_proof"
        },
        {
            "level": 0,
            "comment": "Thanks for the clarity folks. Can you shed some information/experience with Zolve as well? Its super hyped up on our graduate whatsapp group.",
            "score": 1,
            "author": "CuriousDepartureOne",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think Zolve is popular for international students if they want to live here after college since it builds your credit score but I don’t think they have a savings account where they pay you interest. The other benefit is you don’t need a SSN to open the account. Check out zolve.com",
                    "score": 1,
                    "author": "soccerjageitos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "go to the pnc on craig\n\nopen the student account\n\nshould be no fees if you deposit a certain amount a month and no atm transaction fees",
            "score": 1,
            "author": "kawasakininja213"
        },
        {
            "level": 0,
            "comment": "To add: pnc rejects student applications if you open an account with chase first for some reason that they do not disclose",
            "score": 1,
            "author": "BurnBrightPhoenix"
        },
        {
            "level": 0,
            "comment": "PNC student account has additional benefits that a traditional bank account doesn’t have",
            "score": 1,
            "author": "durrr228"
        },
        {
            "level": 0,
            "comment": "I graduated in 2014 and I still use pnc as my primary account to this day. The account types, security, service etc are all great",
            "score": 1,
            "author": "LaLaBeast"
        }
    ]
}