{
    "id": "gn049d",
    "score": 235,
    "title": "When people on Reddit ask whether to pass/fail a class",
    "author": "a1120",
    "date": 1589931619.0,
    "url": "https://www.reddit.com/r/cmu/comments/gn049d",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "And it doubles as admissions counseling as well!",
            "score": 32,
            "author": "talldean"
        },
        {
            "level": 0,
            "comment": "The answer to 99% of the questions that get posted here is \"Go Talk To Your Advisor\"",
            "score": 25,
            "author": "jakdak",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honest question but how does your advisor help you? I graduated a couple years ago and I never talked to my advisor once in 4 years. And my advisor never once reached out to chat with me either. I guess I should have put in the effort though. I just didn't know how they helped.",
                    "score": 1,
                    "author": "biostrike",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In SCS, stuff that advisors have done for me or for people I know:\n\nThat you can get from peers,\n\n- Course advice.\n- General support in times of stress, as someone to talk to and to vent to.\n- A rough sense of where people are going and what they are doing upon graduation.\n- Candid advice on \"should I work or take classes with professor XYZ? how are they as a person?\"\n\nThat you cannot get from peers,\n\n- Long-term high-level statistics on where people go and what people do.\n- Advice backed by decades of advising experience on questions like \"grad school? industry? job X or job Y?\".\n- Ability to give waitlist statistics, ability to get you off waitlists as need dictates (that waitlist isn't first-in-first-out).\n- Adding/dropping courses late.\n- Advocating on your behalf to course instructors. For example, if you encounter difficult family situations or fall sick, they can negotiate the framework for possible homework extensions, leniency in grading, etc.\n- Wider access to opportunities, e.g., \"you should think about going to Grace Hopper\", \"you really want to go to XYZ conference? Let's see if we can make that happen\", \"are you interested in joining student organization XYZ? It seems like a good match\", etc.\n\nAdvisors are some of the most powerful advocates that a student can have. They can hook you up with whatever resources you need to succeed. You also get taken much more seriously if your advisor is backing you up. But ultimately the advisors need to know that you exist, and they can only really help people who want to be helped. If a student prefers to fly solo, that's fine by them (as it should be, we're all old enough to have some personal responsibility).\n\nThough I'm guessing that I've seen advising at its best. Your mileage may vary.",
                            "score": 8,
                            "author": "moraceae",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah OK, this is a great explanation! I was in MCS, and have heard that the SCS advisors are pretty awesome (I remember my friends going to them a lot). Thanks for sharing! My time has passed but hopefully somebody else sees your comment and benefits. I'll definitely share your comment anytime I stumble across other people questioning the value of advisors :)",
                                    "score": 1,
                                    "author": "biostrike",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cheers! :)",
                                            "score": 1,
                                            "author": "moraceae"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If anyone la interested tho, you should be able to make the change from 05/18 to 05/26 on SIO",
            "score": 1,
            "author": "snachm"
        }
    ]
}