{
    "id": "zw0bds",
    "score": 2,
    "title": "Should I take 21-254 or 21-241 for ECE?",
    "author": "caca_majada",
    "date": 1672097567.0,
    "url": "https://www.reddit.com/r/cmu/comments/zw0bds",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I’m an ECE freshman. I took 21-122 my first semester and am planning to take 21-127 next semester. I was wondering if for sophomore year I should take 21-254 or 21-241. I want to have a solid understanding of linear algebra and don’t want to sacrifice knowledge that could potentially be important for machine learning by taking 21-254 (since I know it covers some vector calc too). \n\n\nI also really want to take 21-260, so 21-254 sounds more convenient as I’d have some multivariable calc under my belt. Should I just go for 21-254 then? Or is 21-241 worth taking if I really want a good understanding of matrices and linear algebra? Thank you so much in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "Take 18202",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I want to have a really good understanding of math though. From what I hear, 18-202 is really general and while it covers a lot of math required for ECE, it doesn’t really focus on explaining why things work.",
                    "score": 1,
                    "author": "caca_majada"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would take 21-254. Matrices and linear algebra concepts in general are super important depending on which track within ECE you take. That being said, make sure you plan it out to fully satisfy the ECE math req - you need to take 18202 and 2 math electives or 2 basic math reqs and then 2 OTHER math/science electives.",
            "score": 2,
            "author": "milkshake_312"
        },
        {
            "level": 0,
            "comment": "If you're just looking to take 10-301, 254 would probably be the way to go, but you'd be fine with 241 if you know how to find a gradient/partial derivative.",
            "score": 1,
            "author": "jugfondler"
        }
    ]
}