{
    "id": "1451ofl",
    "score": 45,
    "title": "What are some films with the largest runtime difference in their Theatrical to Extended versions?",
    "author": "zackphoenix123",
    "date": 1686306912.0,
    "url": "https://www.reddit.com/r/movies/comments/1451ofl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Rewatching lord of the rings and the Hobbit really got me thinking. Since the Hobbit in total added like 1 whole hour of extra content and Lord of the Rings added 2 hours.\n\nI was wondering what other films have a lot of added content in their extended cut and how different that would make the films. On one hand, I can think the extended cut could either make the fine pacing drag, or flesh out the rushed pacing in the theatrical. Or that the extended could just have a whole new side plot not present in the theatrical. \n\nI wanted to mention Zack Snyder's Justice League, but that's like a completely different movie on its own.",
    "comments": [
        {
            "level": 0,
            "comment": "Kingdom of Heaven DC is 50 minutes longer than the theatrical.",
            "score": 43,
            "author": "AMJ_004",
            "replies": [
                {
                    "level": 1,
                    "comment": "And vastly better.",
                    "score": 27,
                    "author": "AuntOfManyUncles"
                },
                {
                    "level": 1,
                    "comment": "and it’s a vastly superior film with the DC",
                    "score": 10,
                    "author": "andyislegend"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Once Upon A Time In America",
            "score": 30,
            "author": "alexdelarge2021",
            "replies": [
                {
                    "level": 1,
                    "comment": "2 hr and 19 min theatrical vs 4 hr and 11 minutes extended DC\n\nAnd Heavens gate with 2 hr and 29 min corporate revised theatrical vs 3 hr and 36 min restored DC",
                    "score": 17,
                    "author": "Canmore-Skate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Although in the case of Once Upon a Time in America the short version was only released in America, in Europe they released the 3 hours and 49 minutes version.",
                            "score": 4,
                            "author": "DeLousedInTheHotBox"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "One that comes to my mind is Dune (1984) by David Lynch. Theatrical release was 137 minutes (2h 17min) while the extended edition is 190 minutes (3h 10min). The order of some of the scenes is also different if I remember correctly.",
            "score": 22,
            "author": "ApplePie4all",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a HUGE difference given it's only one movie. Was the movie generally good? I heard the Novels like pioneered the Sci-Fie Genre, but I've never really heard of the films till the recent one came out.",
                    "score": 4,
                    "author": "zackphoenix123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's... interesting.  It's a David Lynch movie, so it's weird as hell, which fits the crazy future setting, but it's also incredibly dense and the last act is a *mess*.  I've not seen the Extended Edition (which is **not** the Director's Cut, mind you), so it probably helps clear things up a bit, but I can't imagine it making it a *good* movie, just better.",
                            "score": 15,
                            "author": "ShaunTrek",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait wait wait, extended edition is not the directors cut? I'm confused",
                                    "score": 2,
                                    "author": "zackphoenix123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Extended version of Dune is credited to Alan Smithee, which is code that the director didn't want their name attached to the movie.",
                                            "score": 17,
                                            "author": "crazydave333"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There has never been a true Director's Cut of Lynch's Dune released.  His version is over 4 hours long.  The Extended Cut was done by Producers / Editors.",
                                            "score": 4,
                                            "author": "ShaunTrek"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Others haven't mentioned about the extended 1984 version of Dune, is that a lot of the additional material is about the world building, so it does things like showing production designs with narration explaining the back story of a lot of things.  It's no wonder Lynch wouldn't put his name on it.",
                                            "score": 2,
                                            "author": "crystalistwo"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I recommend the Spicediver 4k fan edit available on youtube. As a big fan of the 1984 movie, it's the definitive version for me.",
                                            "score": 1,
                                            "author": "friedpickle_engineer"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Visually, I think it's fantastic. It's probably the best visual representation of the Dune universe that has been put to film (apart from a few things like ornithoptors, and the obviously dated 1980s special effects). It really captures the feel of a universe that developed interstellar spaceflight without the use of advanced computers. However, it completely butchers the plot, it's obvious that someone (either Lynch or the studio) didn't understand the underlying themes of the book at all (the deconstruction of the Hero's Journey), and has real trouble adapting the voluminous amount of internal monologues the book contains into something that works on the screen (Lynch opts to literally convert them to whispered voiceover).\n\nVilleneuve's movie(s), while not as visually bizarre and alien, is superior in everything that matters. He actually understands Herbert's messages in the book, is able to convey the monologues visually through his actor's performances, and the plot follows the book really well (with the exclusion of a couple plot points - the book is so dense, it's understandable). I really hope Warner allows him to do Dune Messiah and Children of Dune.",
                            "score": 7,
                            "author": "WhoCanTell"
                        },
                        {
                            "level": 2,
                            "comment": "It's good for the time, but it's hard to rewatch now, would just go with the new version.  \nBut the old version have Sting and Patrick Stewart so there is that.",
                            "score": 1,
                            "author": "manrata",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How would you compare the old film to the original Star Wars Trilogy? I heard star wars was inspired from Dune.\n\nAlso, is the old Dune also split into multiple movies or just one? I plan to watch the old films first, then the new ones",
                                    "score": 1,
                                    "author": "zackphoenix123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The old dune movie is just one movie, it adapts the first book and in the last 10 minutes it adds elements of the book sequels\n\nThe idea of adapting Dune and all the drafts for a failed attempt for sure influenced Star Wars, at the core of the story they share a lot of similarities since both tackle the call of the hero myth",
                                            "score": 2,
                                            "author": "drelos",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "**Dune** by Frank Herbert\n\nBook description may contain spoilers!\n&gt;&gt;!NOW A MAJOR MOTION PICTURE directed by Denis Villeneuve and starring Timothée Chalamet, Zendaya, Jason Momoa, Rebecca Ferguson, Oscar Isaac, Josh Brolin, Stellan Skarsgård, Dave Bautista, Stephen McKinley Henderson, Chang Chen, Charlotte Rampling, and Javier Bardem A deluxe hardcover edition of the best-selling science-fiction book of all time—part of Penguin Galaxy, a collectible series of six sci-fi/fantasy classics, featuring a series introduction by Neil Gaiman Winner of the AIGA + Design Observer 50 Books | 50 Covers competition Science fiction’s supreme masterpiece, Dune will be forever considered a triumph of the imagination. Set on the desert planet Arrakis, it is the story of the boy Paul Atreides, who will become the mysterious man known as Muad’Dib. Paul’s noble family is named stewards of Arrakis, whose sands are the only source of a powerful drug called “the spice.” After his family is brought down in a traitorous plot, Paul must go undercover to seek revenge, and to bring to fruition humankind’s most ancient and unattainable dream. A stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction. Penguin Galaxy Six of our greatest masterworks of science fiction and fantasy, in dazzling collector-worthy hardcover editions, and featuring a series introduction by #1 New York Times bestselling author Neil Gaiman, Penguin Galaxy represents a constellation of achievement in visionary fiction, lighting the way toward our knowledge of the universe, and of ourselves. From historical legends to mythic futures, monuments of world-building to mind-bending dystopias, these touchstones of human invention and storytelling ingenuity have transported millions of readers to distant realms, and will continue for generations to chart the frontiers of the imagination. The Once and Future King by T. H. White Stranger in a Strange Land by Robert A. Heinlein Dune by Frank Herbert 2001: A Space Odyssey by Arthur C. Clarke The Left Hand of Darkness by Ursula K. Le Guin Neuromancer by William Gibson For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.!&lt;\n\n*I'm a bot, built by your friendly reddit developers at* /r/ProgrammingPals.  *You can summon me with certain* [commands](https://www.reddit.com/user/BookFinderBot/comments/13z7slk/bookfinderbot_commands/). *Or find me as a browser extension on* [Chrome](https://chrome.google.com/webstore/detail/book-finder/jajeidpjifdpppjofijoffbcndlpoedd?utm_source=reddit&amp;utm_medium=social_media&amp;utm_campaign=comments). *Opt-out of replies* [here](https://www.reddit.com/user/BookFinderBot/comments/144zmjb/bookfinderbot_optout/). *If I have made a mistake, accept my apology.*",
                                                    "score": -2,
                                                    "author": "BookFinderBot"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I liked it. Great cast. Although the effects are from the 1980s, it was well done for that time. Was obviously not as popular as the SW movies but it was/is a good movie for sci-fi fans. Plus, I like David Lynch's work a lot.",
                            "score": 1,
                            "author": "ApplePie4all",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I must say that I really like what Denis Villeneuve did with the remake.",
                                    "score": 3,
                                    "author": "ApplePie4all",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think Lynch got the STORY just fine, where Villanueve got the story and the overall FEEL of the books a little better. I think V’s slower pacing helped a lot.",
                                            "score": 3,
                                            "author": "CivilRuin4111"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Troy. It's a 30 minute difference. \n\nJustice League. Idk if this technically counts. Snyder intended the first Justice League to be around 2.5 hours. Before WB let him go.  Snyder Cut is about 4 hours.",
            "score": 16,
            "author": "TheCosmicFailure",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd really count Justice League if only we actually got to see Snyder's justice league in theatrical rather than the altered version Joss Whedon put out. Technically a theatrical release of Justice League, but at the same time very different.",
                    "score": 5,
                    "author": "zackphoenix123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Das Boot (1981).   The original theatrical cut was 149 minutes. The \"original uncut\" version released in 2004 was 293 minutes.  The full uncut version is fully worth watching.",
            "score": 48,
            "author": "bfloblizzard",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;The \"original uncut\" version released in 2004 was 293 minutes.\n\nNow that's not fair. The longer versions of Das Boot are billed as a TV miniseries.",
                    "score": 19,
                    "author": "Chen_Geller",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just went by the terms used for the different versions on the film's Wikipedia page.  Watching is a hefty undertaking no matter how you approach it haha.",
                            "score": 4,
                            "author": "bfloblizzard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Things would've been different if the DC of The Keep has been released. Unfortunately, now, one could only imagine.",
                                    "score": 1,
                                    "author": "Shoddfsdgf"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for mentioning this because I remember watching it on the BBC as a kid in the 90s and remember it as a miniseries. Then I saw it was a film and I thought wtf??",
                            "score": 1,
                            "author": "Cyril_Clunge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah. There are lots of \"super-long\" movies that are actually miniseries, including off the top of my head:\n\nDas Boot\n\nFanny and Alexander\n\nGettysburg\n\nNovecento (two movies)",
                                    "score": 4,
                                    "author": "Chen_Geller",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Carlos is a more recent example.",
                                            "score": 3,
                                            "author": "NeoNoireWerewolf"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Happy cake day!",
                    "score": 2,
                    "author": "Historical-Snow2660"
                },
                {
                    "level": 1,
                    "comment": "Das Boot... I've never heard of that before. What's it about?",
                    "score": 3,
                    "author": "zackphoenix123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "German sailors serving on a submarine in WWII.   I've seen comments by Naval veterans who hold it in high esteem as the most accurate portrayal of what it is like serving on a submarine.",
                            "score": 21,
                            "author": "bfloblizzard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "and OP don't get hung up about it portraying Nazis sympathetically. IIRC, many American audiences were dismissive (many celebratory) at the beginning caption when it was said that many German submarines died. However, by the end they found themselves moved at test screenings.\n\nIt doesn't justify their politics at all.",
                                    "score": 11,
                                    "author": "Athragio",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There was basically one real Nazi in the entire film. Everyone else were just people who had no other choice but to wear the uniform trying not to die.",
                                            "score": 15,
                                            "author": "ChooseACoolName",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Theres more than one. You have the political officer on the sub and the proud nazi official on the supply boat they meet up with before attempting to go through Gibraltar. And some of the people at the party right at the beginning are very offended when the old drunk captain makes his comments about the Nazi leadership and their ineptitude.",
                                                    "score": 7,
                                                    "author": "Heiminator",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I meant main characters,  but true.",
                                                            "score": 9,
                                                            "author": "ChooseACoolName"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "There was no political officer in the film.  U-boats didn't have political officers, not like the Soviets and their [zampolits](https://en.wikipedia.org/wiki/Political_commissar).   \n\nYou're thinking of the IWO (Eins WO - First Watch Officer), who is an ardent Nazi.",
                                                            "score": 6,
                                                            "author": "dittybopper_05H",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You’re right, that’s the character i was referring to",
                                                                    "score": 2,
                                                                    "author": "Heiminator"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don't really mind any portrayal of anything in a story as long as the story itself is good. I might check this one out. The theatrical and extended one",
                                            "score": 1,
                                            "author": "zackphoenix123"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Actually, I've been told by bubble-head friends that Down Periscope is the most accurate portrayal.   \n\nDas Boot, while an \\*EXCELLENT\\* film, is not as accurate as a lot of people think it is.   It's based on a fictionalized account of U-96's seventh war patrol, the translated logbook of which is available here:  [https://www.uboatarchive.net/U-96/KTB96-7.htm](https://www.uboatarchive.net/U-96/KTB96-7.htm)\n\nThe events described in the movie are greatly exaggerated over real life.  For example, the commander of U-96 during that patrol, KpLt Heinrich Lehmann-Willenbrock didn't die:  He lived to 734 years old, dying in 1986, and he actually served as a technical advisor for the film.\n\nPlus, the author of the novel the film is based on says it wasn't a realistic portrayal.   They got the technical details down pat, but the behavior of the actors were completely wrong:\n\n[http://www.cs.ovgu.de/\\~junghans/dasboot/inhalt.html](http://www.cs.ovgu.de/~junghans/dasboot/inhalt.html)\n\nAnd it's not just the author, a bunch of former U-boat sailors say it wasn't like that either.  Here is a scholarly work discussing that, and the other problems with Das Boot:   \n\n[https://www.jstor.org/stable/441638?seq=1](https://www.jstor.org/stable/441638?seq=1)",
                                    "score": 1,
                                    "author": "dittybopper_05H",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;For example, the commander of U-96 during that patrol, KpLt HeinrichLehmann-Willenbrock didn't die:  He lived to 734 years old, dying in1986, and he actually served as a technical advisor for the film.\n\nThat's impressive!  I didn't realize he caught the tail end of the Crusades.",
                                            "score": 1,
                                            "author": "ScientificSkepticism",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Those were dog years.",
                                                    "score": 1,
                                                    "author": "dittybopper_05H"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just for clarity, there are **3** versions of *Das Boot* \\- the 149 minute 1982 theatrical release, the 208 minute 1998 Director's Cut, and a TV miniseries edit released in 1984 that is about 300 minutes long with opening and closing credits for each episode and short recaps of the prior episode.\n\nThe miniseries edit is what OP is talking about - in 2004 it was released on DVD for the first time as \"The Original Uncut Version,\" but the DVD stitched it together like an unbroken film. The 300 minute miniseries becomes a 293 minute movie when you remove all the recaps and episode credits.\n\nHonestly, the 208 minute Director's Cut is the best version to watch unless you can actually find the episodic miniseries edit (which has now been released on Blu-Ray in Europe). The unbroken \"Uncut Version\" movie is a bit much; the natural breaks in the miniseries version of it make it an easier watch.",
                            "score": 3,
                            "author": "EveryGoodNameIsGone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The double-sided dual-layer DVD that had the best English dub of a foreign-language film I’ve ever seen? I’m still kind of salty about this dub not being included in digital versions of the film, because sometimes I’m lazy or tired and don’t want to read subtitles for three hours. \n\nBut, guess what I’m doing today? I’m reading subtitles for three hours.",
                                    "score": 1,
                                    "author": "TheUmgawa"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "German submarine in WWII. Probably actually one of the best war movies ever made.",
                            "score": 2,
                            "author": "ChooseACoolName"
                        },
                        {
                            "level": 2,
                            "comment": "one of the best german film ever made.",
                            "score": 1,
                            "author": "Xavercrapulous"
                        },
                        {
                            "level": 2,
                            "comment": "Adding that the theme to this movie is worth just listening to alone, it's awesome, and with proper sound you feel it to your soul.  \nEsspecially after watching the movie.",
                            "score": 1,
                            "author": "manrata"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's one of maybe 2 blurays I own that actually needs 2 disks. But well worth it.  Even the old VHS version had 2 tapes.",
                    "score": 1,
                    "author": "ChooseACoolName"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Apocalypse Now/redux.",
            "score": 16,
            "author": "ChooseACoolName"
        },
        {
            "level": 0,
            "comment": "The watchmen full directors cut is almost an hour longer I believe.",
            "score": 13,
            "author": "gullinviewbots",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll add my unsolicited opinion.  Of the 3 versions of Watchmen, this is the version to watch.  There's Theatrical, Director's Cut, and Complete.  The \"Complete\" version edits in the animated short film of the comic that the kid reads, \"Tales of the Black Freighter\".  It works in the comic, but all it does is slow the movie down.  Director's Cut is recommended.",
                    "score": 18,
                    "author": "crystalistwo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I enjoyed seeing it once but since watchmen is one of the few movies I rewatch every few years I do directors cut since.  Theatrical cut makes some stuff make no sense with what it removed.",
                            "score": 4,
                            "author": "gullinviewbots"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's an entire *Witcher* television series in Poland (*The Hexer*) that was cut down to an incomprehensible two-hour movie.",
            "score": 13,
            "author": "AndyKaufmanSentMe"
        },
        {
            "level": 0,
            "comment": "Alexander (by Oliver Stone) has a 175 minute theatrical cut and a whopping 214 minute “Final Cut”",
            "score": 10,
            "author": "chrisball96",
            "replies": [
                {
                    "level": 1,
                    "comment": "Alexander also released a director's cut that was 9 minutes *shorter* than the theatrics cut. Then the final cut at 214, and then the Revisited Final Cut back down at 206.",
                    "score": 2,
                    "author": "sielingfan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ultraviolet went from some like 122 minutes to 89 because of studio interference. They basically cut out the plot of the movie and only left action sequences.",
            "score": 6,
            "author": "DolphinPunchShark"
        },
        {
            "level": 0,
            "comment": "This is theatrical vs director's cuts:\n\n* Until the End of the World - 129 min\r\n* Once Upon a Time in America - 90 min\r\n* Heaven's Gate - 70 min\r\n* Das Boot - 59 min\r\n* Apocalypse Now - 55 min\r\n* Watchmen - 53 min\r\n* Kingdom of Heaven - 50 min",
            "score": 5,
            "author": "jgpalanca"
        },
        {
            "level": 0,
            "comment": "I'd say we can still count Justice League since the only new scene Snyder added to the film was the ending Knightmare scene. The rest was just cut from the theatrical cut for some dumb reason.",
            "score": 13,
            "author": "JohnnyJayce",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s correct, though a lot of the CGI was unfinished, so that’s where the budget went, since he shot the Knightmare scene in his backyard.\n\nIronically, there’s still a deleted scene.  WB wouldn’t let him include a Green Lantern scene, so he used Martian Manhunter instead.",
                    "score": 7,
                    "author": "Odd_Advance_6438",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The inclusion of Martian Manhunter was such a weird call imho, Lennix is cool and would fit the character, but the implication that he's been around doing fuck all and then spying on Lois is so weird",
                            "score": 7,
                            "author": "gee_gra",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "a friend of mine edited that scene so that you see Martha visiting Lois, but it cuts before the reveal that it's Manhunter - it works far better",
                                    "score": 5,
                                    "author": "Bisexual_Apricorn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Excellent call, I'm not sure if Martha Kent and Lois got a scene in those movies where it was actually her, it just makes MM look like an aloof creep",
                                            "score": 4,
                                            "author": "gee_gra"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did you watch it?  I mean, one release meant that a man, who was going through a terrible tragedy, would have to try to focus on polishing a turd, or hire another director to do re-writing and re-shoots that resulted in a less-polished turd.\n\nScylla and Charybdis",
                    "score": -1,
                    "author": "crystalistwo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "According to Snyder he only reshoot one scene, which is most likely the Knightmare sequence and when Affleck wakes up. So the movie already was there. Whedon just couldn't polish it like Snyder could and did.",
                            "score": 3,
                            "author": "JohnnyJayce",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Polish isn't the word I'd use for what Whedon tried to do. He reshot like 70% of the film. He 100% tried to change the film. But idk if that was his own choice or the Studio's demands\n\nWe can see that even the \"same\" scenes were reshot to have more jokes. Stuff like digging up grave and Lois in the farm scene",
                                    "score": 8,
                                    "author": "zackphoenix123"
                                },
                                {
                                    "level": 3,
                                    "comment": "He only added one scene, but Whedon didn't use most of the stuff Snyder shot originally. \n\nIt was a restoration of a movie that already existed, yes, but that movie was not what we saw in the theatrical release at all. Joss Whedon reshot or changed something in almost every freaking scene.\n\nIf you watch just the Steppenwolf and the Cyborg scenes in both films, you will see completely different characters.",
                                    "score": 3,
                                    "author": "miloc756"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bergman’s Fanny and Alexander was 180 minutes in theaters but 314 when played as a miniseries on tv.",
            "score": 5,
            "author": "Adequate_Images"
        },
        {
            "level": 0,
            "comment": "The original Erich von Stroheim's Greed from 1924 was 9 hours long. The last version he liked was six hours long. \n\nThe final theatrical release was 143 minutes long. The cut footage is lost. But there is a reconstructed version of it that is 239 minutes long. It's an unorthodox extended director's version but fits the question.",
            "score": 5,
            "author": "Juleset"
        },
        {
            "level": 0,
            "comment": "There are three cuts of Brazil ranging from 94 to 142 minutes.",
            "score": 3,
            "author": "Obfusc8er"
        },
        {
            "level": 0,
            "comment": "Almost Famous: untitled / bootleg is 40minutes longer, extends a lot of scenes and adds more character stuff in.",
            "score": 2,
            "author": "Dave_Eddie",
            "replies": [
                {
                    "level": 1,
                    "comment": "any chance said deleted scenes are available. I know YouTube only has the chars in a radio station where they begin to argue.",
                    "score": 1,
                    "author": "getBusyChild"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kingdom of Heaven (144m theatrical vs 194m Directors Cut)",
            "score": 2,
            "author": "redronin7"
        },
        {
            "level": 0,
            "comment": "Maybe not the largest (since some of those have already been mentioned), but Betty Blue's theatrical cut is 2 hours, while the director's cut is slightly over 3.",
            "score": 2,
            "author": "DeLousedInTheHotBox"
        },
        {
            "level": 0,
            "comment": "Heaven’s Gate (1980) has several versions, but the theatrical cut was 149 minutes, while the restored Criterion version is 216 minutes.\n\nUntil the End of the World (1991) also had multiple versions, where the US theatrical release was 158 minutes, the European theatrical release was 179 minutes, and the director’s cut is 287 minutes.",
            "score": 2,
            "author": "CroweMorningstar"
        },
        {
            "level": 0,
            "comment": "*That Thing You Do!*, of all things, has a director's cut that's 40 minutes longer.",
            "score": 2,
            "author": "ifinallyreallyreddit"
        },
        {
            "level": 0,
            "comment": "Monty Python and the Holy Grail “Special Edition” has 24 extra seconds.",
            "score": 2,
            "author": "George8TheCat"
        },
        {
            "level": 0,
            "comment": "Michael Mann's The Keep (1983) has been released as a 1 hr and 36 mins movie. But, the original DC of the movie ran 3 and a half hours. And, guess what, the DC of this movie's never been released.\n\nThings would've been different if the DC of The Keep has been released. Unfortunately, now, one could only imagine.",
            "score": 3,
            "author": "AMJ_004"
        },
        {
            "level": 0,
            "comment": "Zack Snyder Justice League is the obvious example I guess, its literally like a whole different movie",
            "score": 1,
            "author": "BillMcCrearysStache"
        },
        {
            "level": 0,
            "comment": "I guess you can count The Trip films, where the movies come in around 2 hours while the TV series each one is edited from run three hours.",
            "score": 1,
            "author": "a3poify",
            "replies": [
                {
                    "level": 1,
                    "comment": "But isn't that the other way round? The original version is the TV show and the movie version is the cut one, there is no real extended version I think.",
                    "score": 0,
                    "author": "kpt_graubrot"
                }
            ]
        },
        {
            "level": 0,
            "comment": " “Leon: The Professional” is like 30 minutes longer than “The Professional” and, while the scenes added back have some very… disturbing themes, I think tell the story much better than the theatrical version.",
            "score": 1,
            "author": "CivilRuin4111"
        },
        {
            "level": 0,
            "comment": "There are multiple cuts of *Metropolis* ranging from 84 minutes (the 1984 cut) to 148 minutes (the 2010 restored cut). \n\nThe theatrical cut of *Superman* (1978) is 143 minutes while the extended television cut is 188 minutes.",
            "score": 1,
            "author": "ChrisCinema"
        },
        {
            "level": 0,
            "comment": "Lord of the ring two towers is 30 min longer.  Return of the king us 45min longer.  The Two Tower was already long but the extra 30min added a lot",
            "score": 1,
            "author": "helio987"
        },
        {
            "level": 0,
            "comment": "Zack Snyder's Justice League",
            "score": 1,
            "author": "Henry2k"
        },
        {
            "level": 0,
            "comment": "Not quite what the OP asked. But Aliens Directors Cut - which is only 20 mins longer - is superior for one added scene: Ripley mourning the death of her fully grown daughter. The guilt she feels and the loss all feeds into her need to take care of Newt. Without that scene, her motherly affection and protectiveness is still sweet but feels a little forced. The context matters.",
            "score": 1,
            "author": "homecinemad"
        }
    ]
}