{
    "id": "145k22c",
    "score": 10,
    "title": "What’s an underwhelming death of a great movie character",
    "author": "Helloimafanoffiction",
    "date": 1686352711.0,
    "url": "https://www.reddit.com/r/movies/comments/145k22c",
    "media_urls": [],
    "other_urls": [],
    "postText": "For me Bane in The Dark Knight Rises was done dirty he’s great throughout most of the film even with the voice (I love it for the record) then it’s revealed his not the true villain he’s just a henchman then he gets shot or run over I don’t know what happened he just isn’t there anymore it wasn’t very memorable",
    "comments": [
        {
            "level": 0,
            "comment": "Captain James Tiberius Kirk.",
            "score": 13,
            "author": "poo_poo_undies"
        },
        {
            "level": 0,
            "comment": "Data in Star Trek Nemesis. Total ripoff/rehash of Spocks self sacrifice in Star Trek 2.",
            "score": 10,
            "author": "homecinemad"
        },
        {
            "level": 0,
            "comment": "I don't think she's a great character but why did Padme die of a broken heart",
            "score": 26,
            "author": "kingkibc",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Somehow, Padme died.”\n\nSee? It’s poetry.",
                    "score": 19,
                    "author": "Camp_Coffee"
                },
                {
                    "level": 1,
                    "comment": "\"She's lost the will to live?! What is your degree in, poetry? You sorry bunch of hippies! For God sakes, don't use the billions of dollars of medical equipment around us, why don't we all just get on our knees and pray?\"\n\nhttps://www.youtube.com/watch?v=eAKtZ_r0V6E",
                    "score": 8,
                    "author": "shewy92"
                },
                {
                    "level": 1,
                    "comment": "Similar to Ali McGraw's character in Love Story, the death is subsumed in the plot. It doesn't matter how she died, just that he deals with it. The two movies assume people are familiar with the canon, so they just move the plot ahead. A death scene would interrupt and be superfluous.",
                    "score": 5,
                    "author": "daisy_belle1313"
                },
                {
                    "level": 1,
                    "comment": "People can be overcome with severe grief that physiological symptoms including death can happen. Tragically, when Carrie Fisher passed away, her mother was so distraught she had a stroke the day after and passed as well.",
                    "score": 12,
                    "author": "majorminus92",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That doesn't make it a narratively satisfying outcome, though. And Star Wars ain't exactly the poster child for realistic fiction.",
                            "score": 10,
                            "author": "boywithapplesauce",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly. It’s a space fantasy. Someone dies of a broken heart? It just shows just how much she loved Anakin and how his betrayal against everything she stood for was enough to cause her to lose the will to live. There are cases in our world of people dying of a broken heart (I.e the husband of the teacher who was killed in the Uvalde shooting who died after learning his wife had been massacred).",
                                    "score": 3,
                                    "author": "majorminus92",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They established Padme as headstrong and plucky. She's a Senator and a Queen. And then she dies of a broken heart?\n\nCharacter assassination, I call it.",
                                            "score": 7,
                                            "author": "boywithapplesauce",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "All that can literally go out the window once she became married to Anakin. She literally spends all ROTS just sitting in maternity clothes and slowly coming to terms with Anakins dark side leanings. Once Obi-Wan forces her to realize that Anakin has turned to the dark side she tries one last ditch effort to convince him to leave his mission of taking over the galaxy. She realizes that the man she fell in love with was no longer someone she knew. She held on for Luke and Leia but once they were born she couldn’t keep living with the fact her husband had betrayed everything the Jedi and Republic stood for.",
                                                    "score": 3,
                                                    "author": "majorminus92",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't know, while it's theoretically possible, I'm of the opinion that they botched the execution. And I'm not the only one. \n\nDefend the filmmaker's choices, if you want, but I am not sold. I should have been sold on it in the theaters. That's when it mattered. I am not going to take back my honest impression of the scene when I watched it.\n\nIt's like saying that Daenerys's heel turn made perfect sense. I don't disagree! But how they executed it was laughable.",
                                                            "score": 8,
                                                            "author": "boywithapplesauce"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Might as well have Leia die of grief too after her son killed his dad.",
                                                            "score": 6,
                                                            "author": "Whalesurgeon"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Anakin also tried to choke her out before Obi intervened, so she was taking a lot of body stress even before giving birth to twins.",
                    "score": 6,
                    "author": "ArcadianBlueRogue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I really think if they'd said \"Childbirth complications\" or \"Anakin accidentally killed her with the Force choke\" or \"Vader/Sidious drained her life force to keep Vader alive\" that scene would not be nearly as memed.\n\nIt's just the idea of literally dying of sadness that crosses the line into unintentional hilarity.",
                            "score": 6,
                            "author": "GuyKopski"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah you're right, just seemed a little silly.",
                            "score": 4,
                            "author": "kingkibc"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Palpating stole her life to keep Anakin alive.\n\n….\n\nIt’s not a tale the Jedi would tell you.",
                    "score": 3,
                    "author": "DrRexMorman"
                },
                {
                    "level": 1,
                    "comment": "It happens several times in Shakespeare and it's not like SW is hard sci fi. It's effectively a space skinned and sword and sorcery fantasy story where something theatrical and heightened like that would fit. Not saying it's a great scene or anything but I don't think there's anything wrong with the overall idea or that it doesn't fit in SW.",
                    "score": 1,
                    "author": "CountJohn12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So I could only think of two times this happened in a Shakespeare play, and I looked it up and confirmed it. It’s just King Lear and Lady Montague. And Lear was already dying at the beginning of the play. So I wouldn’t say several Shakespearean characters died of a broken heart. There are examples (including the incredibly obvious example) of characters committing suicide because of love, but they didn’t just drop dead. And that would have been a more interesting conclusion for Padme, too.",
                            "score": 2,
                            "author": "spiderlegged"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Boba Fett\n\nEdit: They did retcon his death, I guess. But for years, that was a real head scratcher.",
            "score": 9,
            "author": "boywithapplesauce"
        },
        {
            "level": 0,
            "comment": "Palpatine II. It's just so...bleh in the end.\n\nKylo Ren. It's just so...illogical.",
            "score": 16,
            "author": "Consistent-Annual268",
            "replies": [
                {
                    "level": 1,
                    "comment": "You tried to apply logic to the sequels? Well that's where you went wrong.",
                    "score": 15,
                    "author": "bender1_tiolet0"
                },
                {
                    "level": 1,
                    "comment": "I liked the idea that Palpatine was unstoppable in conventional battle and the only way to defeat him was to catch him with his pants down through Vader's sacrifice. But then Rey just shows up and kicks his ass. Which is a boring way to end a movie anyway, the good guy should win through being smarter or more virtuous, not just winning a fight.",
                    "score": 3,
                    "author": "CountJohn12"
                },
                {
                    "level": 1,
                    "comment": "To that end, I hated the way the Skywalker Saga died.",
                    "score": 4,
                    "author": "Camp_Coffee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Charlie Sheen's character in Young Guns 2. He went out like a sucker.",
            "score": 6,
            "author": "tone1492",
            "replies": [
                {
                    "level": 1,
                    "comment": "That was the first Young Guns. I thought it was effective to get them all shook and turn over the group dynamic. You're right though, that was an ugly way to bite it in a real way.",
                    "score": 6,
                    "author": "kazh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I stand corrected I thought it was the second movie",
                            "score": 3,
                            "author": "tone1492"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The character of Alien, played by James Franco in *Spring Breakers*. He's a mesmerizing presence for a large part of the film and is killed offscreen in a very anticlimactic manner. I know that's the point, and it's brilliant, but it's jarring.",
            "score": 10,
            "author": "kleptophobiac",
            "replies": [
                {
                    "level": 1,
                    "comment": "He gets shot in the head onscreen, I believe.",
                    "score": 1,
                    "author": "mikeweasy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I must be either misremembering it, or perhaps I saw a different version.",
                            "score": 3,
                            "author": "kleptophobiac",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They show it",
                                    "score": 1,
                                    "author": "mikeweasy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was disappointed with Banes' death, too. Talia reveal towards the end takes away from Bane. \n\nMerlin and Roxis deaths in Kingsman 2. \n\nElizabeth Shaw in Alien Covenant. Not great per se. But she was good in Prometheus. \n\nLaurie Strode in Halloween Resurrection",
            "score": 10,
            "author": "TheCosmicFailure",
            "replies": [
                {
                    "level": 1,
                    "comment": "will never forgive kingsman 2",
                    "score": 8,
                    "author": "BusinessPurge"
                },
                {
                    "level": 1,
                    "comment": "They way they killed Roxy absolutely ruins the move for me.  As obvious an example of 'fridging' as they come.",
                    "score": 7,
                    "author": "addy-Bee"
                },
                {
                    "level": 1,
                    "comment": "We don't even see Bane's body. \n\nAlso I just remembered how shit Talia's death was acted",
                    "score": 3,
                    "author": "shewy92"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Josh Brolin dying off-screen in No Country for Old Men",
            "score": 14,
            "author": "PhinsFan17",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s kind of the point.  Carla Jean dies the same way.",
                    "score": 16,
                    "author": "KnotSoSalty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a \"great\" character,  Qui gon Jin in Phantom Menace was underwhelming.  Seemed like he died way too soon in the movie.\n\nCersei Lannister in Game of Thrones (not a movie obviously)",
            "score": 14,
            "author": "cloroxbb",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm so tired of people dying from rocks or falling in lava",
                    "score": 10,
                    "author": "kingkibc"
                },
                {
                    "level": 1,
                    "comment": "&gt; Seemed like he died way too soon in the movie\n\nHe died at the end of the movie though?\n\nAlso I see it like how Obi Wan died to Vader, he willingly died for plot reasons/to give his young apprentice a better chance at doing good and/or changes his apprentice's motivations",
                    "score": 4,
                    "author": "shewy92"
                },
                {
                    "level": 1,
                    "comment": "Didn't Qui Gon die towards the end of Phantom Menace?",
                    "score": 3,
                    "author": "ImCommandmentShepard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just checked he dies with 17:30 left to play including credits, pretty much the climax of the film. Very confused about the original comment.",
                            "score": 3,
                            "author": "NoCountry4OldMate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Perhaps they meant really early into the trilogy?",
                                    "score": 2,
                                    "author": "ImCommandmentShepard",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I guess it's been too long since I've watched it then... it seemed sudden to me for some reason",
                                            "score": 1,
                                            "author": "cloroxbb"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I guess it's been too long since I've watched it then... it seemed sudden to me for some reason",
                                    "score": 1,
                                    "author": "cloroxbb"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I guess it's been too long since I've watched it then... it seemed sudden to me for some reason",
                            "score": 1,
                            "author": "cloroxbb"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The warriors 3 in the third Thor movie",
            "score": 8,
            "author": "HighLordSaber"
        },
        {
            "level": 0,
            "comment": "James Bond in No Time to Die\n\nThat was just lame, they could have come up with something better than that. Whole movie was garbage as well, respectfully.",
            "score": 15,
            "author": "dood0906",
            "replies": [
                {
                    "level": 1,
                    "comment": "Making him into a young child's daddy was lame. Parental self-sacrifice isn't what I'm looking for with James Bond",
                    "score": 15,
                    "author": "oldspice75",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "agreed",
                            "score": 4,
                            "author": "dood0906"
                        },
                        {
                            "level": 2,
                            "comment": "Yep, parental love is the least I expected from Bond. Not to mention that child is from one of the most forgettable bond girls ever.",
                            "score": 2,
                            "author": "Puzzled-Journalist-4"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A simple way to divide quality Bond movies is into good ones where the villain wants money and bad one where the villain has world domination/destruction in mind.\n\nGood:\nGoldfinger, Goldeneye, and Casino Royale\n\nBad:\nMoonraker, The World is Not Enough, No Time to Die",
                    "score": 6,
                    "author": "KnotSoSalty"
                },
                {
                    "level": 1,
                    "comment": "I would take that over someone shooting him and him bleeding out any day.",
                    "score": 1,
                    "author": "mikeweasy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree. And I love how this moment tied into the themes of the movie, about the conflict between living and surviving.",
                            "score": 2,
                            "author": "Master-Improvement-4",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes that too.",
                                    "score": 1,
                                    "author": "mikeweasy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Layer Cake, Daniel Craig's character.",
            "score": 3,
            "author": "JohnnyJayce",
            "replies": [
                {
                    "level": 1,
                    "comment": "Curious why you think this? I thought it was quite fitting.",
                    "score": 6,
                    "author": "TehNoobDaddy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The dying was, the execution of dying wasn't.",
                            "score": 3,
                            "author": "JohnnyJayce",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Again I think it was done well. He said all a long he wanted to get out, then was made to do some more work by more powerful people which he eventually overcomes but a long the way he fucks over that thought him a friend. At the end he's the top dog and thinks he's getting out, thinks he's won but his demise comes by someone he thought lesser of and when he would seemingly feel nobody could touch him, despite him thinking he's the kinder more honourable gangster.",
                                    "score": 2,
                                    "author": "TehNoobDaddy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And then he is killed by a dumbass because XXXX cucked him.",
                                            "score": 2,
                                            "author": "JohnnyJayce"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "James Bond, killed by Q.",
                    "score": 2,
                    "author": "obeythed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Agree on Kirk. Unlike a lot of other ST Trek fans I don't object to the idea of his dying if it's something badass and cool but don't just have him fall of a bridge.",
            "score": 2,
            "author": "CountJohn12"
        },
        {
            "level": 0,
            "comment": "Josh Brolin as Llewelyn Moss in No Country for Old Men.",
            "score": 2,
            "author": "DaveshPatel93101",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats the point.",
                    "score": 2,
                    "author": "mikeweasy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can you explain more about what you mean? Thanks!",
                            "score": 1,
                            "author": "DaveshPatel93101"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Totally agreed about Bane. TDRK is my favorite of Nolan's trilogy, and I loved finally seeing a great version of Bane in a feature film and Tom Hardy was terrific. But revealing him as ultimately just a henchman and brushing him off in the blink of an eye really pissed me off.",
            "score": 1,
            "author": "dantoris",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait what? Different tastes aside, how do you brush aside all that shit about all the police going into the fucking sewers and coming up to fist fight people with guns etc. writing in the movie? How does that not make it worse for you, than what was in Nolan Bat 1 &amp; 2?",
                    "score": 1,
                    "author": "arkan0ir"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean, there are a thousand movie deaths like that. The writers sometimes think it's an obligation to kill off interesting supporting characters just to get stuck with the bland protagonists. Horror movies are especially guilty of that",
            "score": 1,
            "author": "sotommy"
        },
        {
            "level": 0,
            "comment": "I hated Bane's death.\n\nAlso I just remembered how shit Talia's death was acted.\n\nBoba died like a bitch too. He showed for 5 minutes in the movies and died. Same with Phasma. She didn't do anything but get captured in one movie and then die in the next after an underwhelming fight.",
            "score": 1,
            "author": "shewy92"
        },
        {
            "level": 0,
            "comment": "Black Widow in endgame",
            "score": 1,
            "author": "mnombo"
        }
    ]
}