{
    "id": "1464nrh",
    "score": 68,
    "title": "Sean Harris Appreciation Post",
    "author": "Lonely-Specialist-40",
    "date": 1686414827.0,
    "url": "https://www.reddit.com/r/movies/comments/1464nrh",
    "media_urls": [],
    "other_urls": [],
    "postText": "This man is an incredible actor. Like straight up and down, an incredibly skilled actor. From absolutely nailing it as an Australian serial killer in the true story 'The Stranger' to being a random adviser to a King in the King. This guy is amazing.   \n\n\nSean Harris is my favourite actor right now, and it's a pleasure to live on the same plane as that master. ",
    "comments": [
        {
            "level": 0,
            "comment": "He stars in my all-time favorite [High Quality Gif](https://old.reddit.com/r/HighQualityGifs/comments/60fxf7/browsing_reddit_when_all_of_the_sudden/).\n\nBut ya, he's one of those actors that I'm glad whenever he shows up in a movie because he always elevates it.",
            "score": 33,
            "author": "Dysthymike"
        },
        {
            "level": 0,
            "comment": "He put in an Oscar winning performance during his five minutes in the very average Harry Brown.\n\nHe didn't have to go that hard, but I appreciate that he did.",
            "score": 18,
            "author": "TheDadThatGrills"
        },
        {
            "level": 0,
            "comment": "He was good in Macbeth",
            "score": 9,
            "author": "TylerDurdenUMD"
        },
        {
            "level": 0,
            "comment": "First in my radar as Ian Curtis in 24 Hour Party People, he was superb in that.",
            "score": 7,
            "author": "CruiseLifeNE"
        },
        {
            "level": 0,
            "comment": "He was one of the only bright spots of The Green Knight for me. What is great is that he seems to be immune to typecasting as only a villainous character. \n\nI feel like his career is probably only just getting started on its upwards trajectory and that is a great joy for me",
            "score": 5,
            "author": "Cheap-Explorer76",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really liked the Green Knight, and I did like him in it. He really brought a quiet but palpable dignity and sense of regality.",
                    "score": 8,
                    "author": "NickRude"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Still amazed that he was the creature (Craig) in 'Creep' (2004)",
            "score": 7,
            "author": "MissingLink101"
        },
        {
            "level": 0,
            "comment": "I hope you've seen Possum. He goes deep in that movie.",
            "score": 5,
            "author": "8itmap_k1d",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great flick.",
                    "score": 1,
                    "author": "JoeMagnifico"
                }
            ]
        },
        {
            "level": 0,
            "comment": "On a Rewatchables podcast on MI:Fallout they mentioned he wasn't up to the standard of villain for that franchise but I totally disagree. He has such an ambiguous look and voice that worked perfectly.\n\nI think he's a great actor.",
            "score": 5,
            "author": "dat89",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I actually think he isn't suited to the generic villian trope. He is a true character actor, his best roles are ones where he is able to fully explore the complexity of the character.   \n\n\nCheck out the Stranger and you'll know what I mean. He is playing a truly dispicable disgusting human being, but throughout the movie he displays them in a realistic way, as somebody who is as complex as anyone else and shows you why in reality people like that are so dangerous. Because in reality, evil people don't always seem so evil. Which is something all of his best roles are able to convey.   \n\n\nIn MI:Fallout I imagine (haven't seen it) he's just playing generic bad guy, and it wouldn't really suit IMO.",
                    "score": 2,
                    "author": "Lonely-Specialist-40"
                }
            ]
        },
        {
            "level": 0,
            "comment": "His one scene is Harry Brown makes the entire movie",
            "score": 3,
            "author": "YogSothothOfficial"
        },
        {
            "level": 0,
            "comment": "He has such an interesting voice. Always a great surprise to see him pop up in a movie I didn't know he was in",
            "score": 3,
            "author": "GrapefruitAlways26"
        },
        {
            "level": 0,
            "comment": "He had a pretty interesting turn as a very dedicated assassin in The Borgias.",
            "score": 3,
            "author": "Threadheads",
            "replies": [
                {
                    "level": 1,
                    "comment": "He brings that incredible air of menace, even when he isn’t doing or saying anything. But I also think he made the role of Micheletto more interesting and complex than it could have been with someone else.",
                    "score": 2,
                    "author": "Doubly_Curious"
                },
                {
                    "level": 1,
                    "comment": "Ah I loved that show.",
                    "score": 2,
                    "author": "SanTheMightiest"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He was in a movie called FLIGHT OF THE PHOENIX that I subtly love",
            "score": 4,
            "author": "profound_whatever",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you seen the (far superior) 1965 original starring James Stewart?",
                    "score": 1,
                    "author": "Twigling"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really loved his ailing Arthur in the Green Knight. He's also excellent t in his bit in Spencer as well.",
            "score": 1,
            "author": "AlanMorlock"
        },
        {
            "level": 0,
            "comment": "Should check out the Netflix series Southcliffe",
            "score": 1,
            "author": "lost_in_tran5lation"
        },
        {
            "level": 0,
            "comment": "RIP SAMWISE",
            "score": -4,
            "author": "Blade_Trinity3",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's Sean Astin...?",
                    "score": 1,
                    "author": "happybarfday",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh okay, i thought Rudy was dead for a minute",
                            "score": -3,
                            "author": "Blade_Trinity3"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've seen little of Sean Harris, but when I have seen him, I always think... \"How have I not seen more Sean Harris? This is amazing work.\"",
            "score": 1,
            "author": "hombregato"
        }
    ]
}