{
    "id": "146h59q",
    "score": 3,
    "title": "Gunfight scenes",
    "author": "JB_lx",
    "date": 1686447407.0,
    "url": "https://www.reddit.com/r/movies/comments/146h59q",
    "media_urls": [],
    "other_urls": [],
    "postText": "Which movie has the most accurate to reallife gunfight scene I always see the scenes in movies or some series and I wondered if there even are any  which depict it pretty well and maybe also a Answer to know if \"CIA Agents\" are in the field and if they are if they really are moving through those bullets while shooting the others and sometimes hitting them.",
    "comments": [
        {
            "level": 0,
            "comment": "For a crime movie, No Country for Old Men. For a war movie, come and see. They used live machine gun fire for some scenes.",
            "score": 18,
            "author": "LeepaTime",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, you see a cow get gunned down for real in that movie.",
                    "score": 0,
                    "author": "Fast-Insurance5593"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Open Range.\n\nNo comparison to most Western shoot outs…",
            "score": 16,
            "author": "Bright_Equipment_116",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here looking for this. I rarely notice sound and editing but both were fantastic in this flick.",
                    "score": 3,
                    "author": "klockensteib",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Indeed. Saw it at a good theater and was amazed.",
                            "score": 2,
                            "author": "Bright_Equipment_116"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You the one killed our friend?",
                    "score": 3,
                    "author": "AMJ_004"
                },
                {
                    "level": 1,
                    "comment": "What I was going to say. It catches the absolute chaos, as well as the fact that in a gunfight most shots are misses, between the adrenaline and the fact that everyone is moving.",
                    "score": 3,
                    "author": "leftai2000"
                },
                {
                    "level": 1,
                    "comment": "Totally out of the blue what happened to Coates's character. Went down faster and harder than he did in The Last Boy Scout.",
                    "score": 2,
                    "author": "chaingun_samurai"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Way of the Gun",
            "score": 10,
            "author": "kitty_galore2023",
            "replies": [
                {
                    "level": 1,
                    "comment": "I ain't no gun tactics expert, even in an armchair sense, but I did like how deliberate the actions of the characters are during the shootouts. The actors absolutely sell the feeling that they're shooting for their lives without getting too flashy with it.",
                    "score": 2,
                    "author": "Turok1111"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The sheer chaos of Black Hawk Down",
            "score": 10,
            "author": "teedeeguantru",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup.  Know someone who was there and he’s always mentioned that and just the noise.",
                    "score": 3,
                    "author": "TylerDurdenUMD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a movie. But the Aussie TV show Mr Inbetween is brilliant in depecting all aspects of a gun fight. The sounds, the Squib explosions, reloading tactics and general carnage of those scenes is absolutely first rate",
            "score": 7,
            "author": "Famous-Background329"
        },
        {
            "level": 0,
            "comment": "Wind River. Perhaps not the quintessential “gunfight” but I loved the tension",
            "score": 6,
            "author": "dirtymikentheboys88"
        },
        {
            "level": 0,
            "comment": "The OK corral scene in Tombstone was historically correct.",
            "score": 13,
            "author": "Psychological-Rub-72",
            "replies": [
                {
                    "level": 1,
                    "comment": "Doc Holliday had a 90 round mag in that revolver",
                    "score": 7,
                    "author": "HotboxedTurtleOnZees",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's daisy if he did.",
                            "score": 8,
                            "author": "shaka_sulu"
                        },
                        {
                            "level": 2,
                            "comment": "He was known to carry two revolvers pretty sure they were a colt single action army and a remington thunderbolt. He also had a dubble barled shot gun. So 14 rounds give or take.",
                            "score": 2,
                            "author": "Confident_Bottle_102"
                        },
                        {
                            "level": 2,
                            "comment": "I'm your huckleberry",
                            "score": 0,
                            "author": "kitty_galore2023"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a gunfight per see, but [*Come and See* (1985)](https://www.youtube.com/watch?v=zjIiApN6cfg) features ultra realistic gunfire. The filmmakers used live rounds and they actually shot a cow.\n\nThere have been a couple of movies about Operation Anthropoid, most notably *Atentát/The Assasination* (1964), *Operation Daybreak* (1972), and *Anthropoid* (2016). All three movies (especially the first and last) have accurate reenactments of the assasination, and the paratroopers' final stand in the church (apart from that, they're also very accurate to the events). Though they use sten guns in the church (in real life, they probably only had pistols).",
            "score": 10,
            "author": "kiwi-66"
        },
        {
            "level": 0,
            "comment": "Heat",
            "score": 36,
            "author": "jasandliz",
            "replies": [
                {
                    "level": 1,
                    "comment": "The footage of Kilmer shooting in two directions and reloading so efficiently is used at Fort Liberty. \n\nThe Marines also show the shootout scene.",
                    "score": 8,
                    "author": "Hollandmarch76",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've never heard of anyone using heat as a training video.",
                            "score": -1,
                            "author": "FederalAd1771",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[here](https://www.mentalfloss.com/article/72525/15-epic-fact)\n\n[and here](https://www.yardbarker.com/entertainment/articles/amp/20_facts_you_might_not_know_about_heat/s1__35424164)",
                                    "score": 4,
                                    "author": "Hollandmarch76",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "lmao sure man clickbait lists are great proof. Nobody uses heat as tactical training tools.",
                                            "score": -2,
                                            "author": "FederalAd1771",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't know why they linked those articles instead of just [quoting Mann directly](https://deadline.com/2015/09/michael-mann-heat-al-pacino-robert-de-niro-ferrari-christian-bale-toronto-film-festival-1201529118/): \n\n&gt; They got so good that the footage of Val Kilmer, firing in two directions and doing a reload without a cut, they used that at Fort Bragg for Special Forces training. Like, what percent of you is going to get as good as this actor? Just smooth.\n\nIt doesn't sound like they used it for actual training though, more of like an inspirational \"if an actor can do it, so can you\" thing.",
                                                    "score": 13,
                                                    "author": "Bloody_Conspiracies",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Dude.  Nobody fucking uses it. Let it go. I was in the Corps and no Rct or UH unit or security detach used anything from this movie. Stfu",
                                                            "score": 0,
                                                            "author": "CrayonSupplier",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm not saying whether it's true or not. I'm just saying that the director said it. Relax.\n\nIt's no wonder the US military has a reputation for violence when soldiers are getting angry over small things like this.",
                                                                    "score": 2,
                                                                    "author": "Bloody_Conspiracies"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I doubt fort libertys SWCS shows this stupid movie to ABC or D",
                                            "score": 0,
                                            "author": "CrayonSupplier"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is the right answer.",
                    "score": 3,
                    "author": "Impossible_Mall6133"
                },
                {
                    "level": 1,
                    "comment": "Dude. You only like it because of the echo sound the director uses. Apart from that, it was not realistic. Magazines lasting forever. No cracking and zipping of rounds (like black hawk down and we were soldiers) I can go in",
                    "score": -7,
                    "author": "CrayonSupplier",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Andy McNab (aka Steve Mitchell) choreographed that whole shootout, hes quoted as saying he tried to make it as realistic as he possibly could, and the guy knows a thing or two about combat.",
                            "score": 4,
                            "author": "extra-long-pubes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well. It wasn’t. I know a thing or two about combat. And everything I said was completely true. Go watch the videos of the Hollywood shoot out. Nothing in that movie looks like that",
                                    "score": -6,
                                    "author": "CrayonSupplier",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So you know more than the most decorated tier 1 SF soldier in the UK military? Sorry Audie didn't know that was you",
                                            "score": 6,
                                            "author": "extra-long-pubes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You cant compare Heat and BHD. Heat was basically a section attack/fighting withdrawl in an open large street, mostly 2 way range. BHD has various different urban environments, more POV, 360 battle, on ground and elevated levels. So the sounds, movement, weapon systems, echos etc are all different. Both are GREAT, but too many variables to include.",
                                                    "score": 4,
                                                    "author": "RGR_SC4306",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "We are are talking about sound. Buddy. Let me ask you a question, tell me what was realistic and unrealistic in the film with the shoot out scene.\n\nAlso, what does the sound engineers ability to recreate  the bullets whizzing and cracking , hitting , and ricocheting in BHD have to do with it being in Mogadishu as opposed to LA? Explain",
                                                            "score": 1,
                                                            "author": "CrayonSupplier",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Both movies and various scenes both are realistic. Crack and thump happens at the target’s end, not the shooter’s end: BHD has more pov from troops under contact. We have more troops, multiple firing positions, multiple different weapon calibres, different surfaces. The whole movie is an emersion of the chaos of combat.  We have troops trying to locate en, reacting to threats all the time. Heat has a set piece action scene that is top notch tactics, the criminals react text book to threat and show off some good fire and maneuver,  but it happens in a vaccum. A large open street and cars, therefore the claustraphobic element of emersion is not there. Again both are excellent examples of shoot outs, but to limit BHD to a single one is not doing it justise.",
                                                                    "score": 2,
                                                                    "author": "RGR_SC4306",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Wtf are you talking about. BHD is in the streets downtown fool. And the rifle sounds and operations were far more realistic. you don’t know what you’re talking about man. It’s a loud echo and there’s no dialogue or music in the background. That’s what made it more realistic than previous shoot out movies",
                                                                            "score": 0,
                                                                            "author": "CrayonSupplier",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "different type of streets. You cannot compare the streets in both movies. One has narrow one has large, that effects the sound. Talking tactics, kilmer blasts full auto standing with an M4 = zero rounds on target = no suppressive fire (when rounds are such that you cannot continue on your chosen course of action). The cops are out ranged with shotguns and pistols, yt go static and fire. Most troops fight on a 3 to 1 ratio; cops had that, and didnt close the distance. The issue with heat is that, with all movies, the action happens because it has too, no sense of death or fear. With BHD, we get the actual unknown, and that conveys alot more, and the sound is better.",
                                                                                    "score": 1,
                                                                                    "author": "RGR_SC4306",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Flawless Victory!",
                                                    "score": 1,
                                                    "author": "Boozin37",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What is. He didn’t answer anything. I said the sound not the movie.  The sound effects. Dumb ass",
                                                            "score": 0,
                                                            "author": "CrayonSupplier"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I know his input was in anyway asked or given in the book (which is far better) and that what we his experience was did not transfer over with the director. I believe the sound was also used in the movie with fox and cruise as well in the alley scene. \nWhat is unrealistic about the shoot out is what I said before. The magazines being fired as if they were 100 round drums, the lack of zipp sound , Ricochet sound and impacts. also the m4 used with a flash suppressor his flashing like crazy. It would look like air / gas pushing out. I made examples of movies that created it right. I always catch the basic. 100 being shot on automatic in a 30 round mag. That’s a dead giveaway that it isn’t realistic.",
                                                    "score": 1,
                                                    "author": "CrayonSupplier"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Why do I have to be Audie Murphy in order to understand what rounds sound , look and feel like over my head? what rifles look like shooting , and what impact rounds look like and sound like.",
                                                    "score": 0,
                                                    "author": "CrayonSupplier"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "GO WATCH THE WEST HOLLYWOOD SHOOT OUT. ITS LIVE IN CAMERA!!! Why tf do you need a former SF dude WHOSE getting paid AND probably would say anything to promote and agree with the scene considering his name is involved with the production. Truth is. It isn’t the most realistic. Go watch the West Hollywood shoot out.",
                                                    "score": 0,
                                                    "author": "CrayonSupplier"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "13 Hours seems pretty realistic for even for a Michael Bay movie.",
            "score": 5,
            "author": "Turok1111",
            "replies": [
                {
                    "level": 1,
                    "comment": "Super realistic, even how people act when shot is pretty on point",
                    "score": 3,
                    "author": "RGR_SC4306"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Obviously John Wick 4.\n\n\n Sicario seemed on point for gun fights.",
            "score": 15,
            "author": "scurvy4all",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very realistic. Attempting to engage Delta operators forming an L shaped ambush? Yeah, you're getting smoked.",
                    "score": 3,
                    "author": "hpshaft",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://youtu.be/wUJqPYDp0_Y\n\nIf you don’t know who Larry Vickers is, young Delta guys went to bed wearing Larry Vickers pajamas.  Dude is a legend.",
                            "score": 3,
                            "author": "TylerDurdenUMD"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Green room has some pretty realistic violence in it including a shotgun to the face",
            "score": 3,
            "author": "BillMcCrearysStache"
        },
        {
            "level": 0,
            "comment": "CIA field agents ? WTH are you asking?",
            "score": 4,
            "author": "CrayonSupplier"
        },
        {
            "level": 0,
            "comment": "In the Line of Fire (Not the Clint Eastwood movie) FBI shootout with the Miami bank robbers.",
            "score": 2,
            "author": "flstnrider"
        },
        {
            "level": 0,
            "comment": "Definitely the Basketball Diaries. There's usually only one person with a gun.",
            "score": 2,
            "author": "Correct_Influence450"
        },
        {
            "level": 0,
            "comment": "Heat",
            "score": 2,
            "author": "ESComments"
        },
        {
            "level": 0,
            "comment": "Apalusa spelling ? With vigo mortenson and ed haris. Good gun fight where they all shoot from close range all get hit sum get killed. Plus vigo has a 8 gauge and thats just cool",
            "score": 2,
            "author": "Confident_Bottle_102",
            "replies": [
                {
                    "level": 1,
                    "comment": "Appaloosa",
                    "score": 1,
                    "author": "MyLeftNutIsSore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup im a plumber spelling aint my strong suit",
                            "score": 2,
                            "author": "Confident_Bottle_102",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Plumbing is a skill with outstanding marketability and real-world value. I'm afraid I cannot say the same for my correct spelling of a film title haha. \n\nAnd speaking of the film, great pick. Quick trivia question for you: what's a film from the 90s where one of the main characters shares Ed Harris's character's name, Virgil Cole?",
                                    "score": 2,
                                    "author": "MyLeftNutIsSore",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "William defoe flight of the intruder?",
                                            "score": 2,
                                            "author": "Confident_Bottle_102",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "YES!!!!!!!!!!!!!!",
                                                    "score": 2,
                                                    "author": "MyLeftNutIsSore",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hes pretty good actor. Have you seen inside yet? Pretty ok flix. His john wick charater is a fav to marcus",
                                                            "score": 2,
                                                            "author": "Confident_Bottle_102",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's the one where he's an art thief? Not yet, tho I've seen it available to stream so I'll have to check it out. Have you seen The Hunter with him in it? Excellent movie where he's brought in to find a tasmanian tiger in the wild.",
                                                                    "score": 1,
                                                                    "author": "MyLeftNutIsSore",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yup the art thief. Yeah thats a good movie to.",
                                                                            "score": 2,
                                                                            "author": "Confident_Bottle_102"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a movie but The Wire 2-09. Bunch of idiots shooting at each other in the street, not a single one of them hits their intended target, but an innocent child is killed by a stray round.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "When a Delta Force LEGEND like Larry Vickers says you did a good job, you did a great job:\n\nhttps://youtu.be/fEZeb5lKPkk",
            "score": 2,
            "author": "TylerDurdenUMD"
        },
        {
            "level": 0,
            "comment": "Act of Valor. The whole thing.\n\nUS DoD allowed active duty Navy SEALs to be cast. The gunplay is as real as it gets.\n\nIt is a thinly veiled recruitment film, however.\n\nhttps://www.youtube.com/watch?v=eZw9O9e3QNw&amp;t",
            "score": 7,
            "author": "ddbaxte",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was pretty meh on this movie but that scene where the boat swoops in and blows the SUV apart is sweet. If I remember correctly, they used live rounds during this part.",
                    "score": 1,
                    "author": "Turok1111"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The action scenes in the series Echo 3 were highly realistic.",
            "score": 1,
            "author": "kitty_galore2023"
        },
        {
            "level": 0,
            "comment": "Heat",
            "score": 1,
            "author": "korndawg69"
        },
        {
            "level": 0,
            "comment": "The way of the gun",
            "score": 1,
            "author": "chedykrueger"
        },
        {
            "level": 0,
            "comment": "Heat(1995) has some really intense shoot out sequences.",
            "score": 1,
            "author": "Otherwise_Dust_2331"
        },
        {
            "level": 0,
            "comment": "Sicario",
            "score": 1,
            "author": "Boris_Jakov"
        },
        {
            "level": 0,
            "comment": "Heat \n\nJohn Wick\n\nCollateral \n\nSicario \n\nBlack Hawk Down\n\nSaving Private Ryan",
            "score": 1,
            "author": "Knowledgendary"
        },
        {
            "level": 0,
            "comment": "Breaking point staring Donnie Yen. Real gun dynamics including emptying whole clips ina frantic moment and not hitting something close.",
            "score": 1,
            "author": "HomeIsButADream"
        },
        {
            "level": 0,
            "comment": "The sound design in Michael Mann's Heat has to be seen/heard to be believed. All around excellent.",
            "score": 1,
            "author": "Stormy8888"
        },
        {
            "level": 0,
            "comment": "The ambush scene in Clear and Present Danger.\n\nGovernment agancies show this to their trainees because of its accuracy.",
            "score": -2,
            "author": "shaka_sulu"
        },
        {
            "level": 0,
            "comment": "Michael Mann consults extensively with police/military pros on his films. Apparently his gunfight aces are generally pretty realistic. Also, not John Woo 🤣!",
            "score": 0,
            "author": "hanshotfirst_1138"
        }
    ]
}