{
    "id": "146lk34",
    "score": 0,
    "title": "How come Bird Box was so disliked?",
    "author": "bitchyswiftie",
    "date": 1686461669.0,
    "url": "https://www.reddit.com/r/movies/comments/146lk34",
    "media_urls": [],
    "other_urls": [],
    "postText": "The teaser for the spiritual sequel set in Barcelona released a few days ago and it looks promising! It prompted me to ask why the first one was so disliked by audiences? It's been a while since I've seen it but all things considered, it was a pretty solid movie. Interesting creatures (that we never even see), interesting plot, characters, scares, and the acting and effects were great. I really don't understand why some people didn't like the first one.",
    "comments": [
        {
            "level": 0,
            "comment": "I just thought it was dumb. Dumb people doing dumb things against a dumb threat. And something about the Crazy People didn't sit right with me. Like, if you're normal, seeing these Whatevers makes you instantly kill yourself with whatever is handy, but if you're... what, bipolar? Schizophrenic? Autistic? Then the Whatevers seem to really rock your socks, and you become obsessed with showing them to normal people. I don't know if that's supposed to be some kind of metaphor, or what, but it never stopped annoying me. It was an annoying movie. And the viral marketing was annoying too.",
            "score": 10,
            "author": "EarthExile"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Similar concept but with more stupid people",
                    "score": 6,
                    "author": "citypanda88"
                },
                {
                    "level": 1,
                    "comment": "I'm not sure how this is a legit criticism though.\n\n&gt;The film rights to Bird Box were optioned by Universal Pictures in 2013, prior to the book's release. Scott Stuber and Chris Morgan were set to produce the film. In July 2017, after Stuber became head of the feature film division of Netflix, it was announced that Netflix had acquired the rights to the book and would develop the film\n\nWhile it's true that Netflix's production timeline for Birdbox was behind AQP, it's not really fair to call it a copy. Stuber was into this property years before AQP came into existence.",
                    "score": 5,
                    "author": "theyusedthelamppost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's an unfortunate coincidence of release timings, but which never bodes well for the less recognised film - see Antz vs. Bug's life for example",
                            "score": 6,
                            "author": "RiteCraft"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because some months earlier “A Quiet Place” was released, and it was a massive success with the public and the critics. Bird Box has a very similar concept, so people inevitably made comparisons. The thing is: Bird box is way more dumb and forgettable than A Quiet Place. Bird Box also made a lot of success, but it didn’t had the same impact as A Quiet Place.",
            "score": 12,
            "author": "jorge-ben-jor"
        },
        {
            "level": 0,
            "comment": "It was enjoyable and forgettable.  It doesn't need a sequel.",
            "score": 6,
            "author": "Willy_wolfy"
        },
        {
            "level": 0,
            "comment": "Netflix films have a challenge staying in the zeitgeist.",
            "score": 2,
            "author": "Sosgemini"
        },
        {
            "level": 0,
            "comment": "Probably because it was overhyped by a massive viral media campaign and the movie itself was pretty mid",
            "score": 9,
            "author": "SweetzDeetz"
        },
        {
            "level": 0,
            "comment": "I wasnt aware that people disliked it. Im sure some people did, but generally was fine. Also horror movies dont do well with general audiences anyway.",
            "score": 4,
            "author": "Sulley87"
        },
        {
            "level": 0,
            "comment": "I liked it and thought it was well done, I don’t think it was game changing but I really enjoyed it. I think people were expecting it to be something it wasn’t, that’s what happens when movies get so much word of mouth",
            "score": 4,
            "author": "Drewhasspoken"
        },
        {
            "level": 0,
            "comment": "Cause MGK was so utterly terrible in it. (Liked the rest, though).",
            "score": 1,
            "author": "atleastnottoday87",
            "replies": [
                {
                    "level": 1,
                    "comment": "I ... Forgot he was even there",
                    "score": 1,
                    "author": "bitchyswiftie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because it was boring and it sucked",
            "score": 1,
            "author": "JPumpkinhead1991"
        },
        {
            "level": 0,
            "comment": "Bird Box was a massive success. It was not disliked.\n\nSome people disliked the movie, but that's not the same thing as disliked by the general audience.\n\nAnd for a horror movie, the reviews aren't bad.\n\nThe movie sort off fall into the space of not good, not bad, fun for people who like the genre.\n\nWhen the movie became successful, there was a minor backlash.",
            "score": 1,
            "author": "QuintoBlanco"
        },
        {
            "level": 0,
            "comment": "It wasn’t the best.",
            "score": 1,
            "author": "DognamedTurtle"
        },
        {
            "level": 0,
            "comment": "It was fine. I think a quiet place being sogood over shadowed bird box.",
            "score": 1,
            "author": "Malcolm_McMan"
        },
        {
            "level": 0,
            "comment": "I think it’s not well received because it’s quite obvious all anyone had to do was wear a vr helmet and the monsters are powerless",
            "score": -7,
            "author": "Jholmes1023"
        },
        {
            "level": 0,
            "comment": "I remember being particularly annoyed that after getting me invested in her having to make a choice between the two children, it cops out and there's no repercussions. How do two small children, who have never left their home before, survive capsizing in rapids?",
            "score": 0,
            "author": "sipsagoon"
        }
    ]
}