{
    "id": "147a8ki",
    "score": 0,
    "title": "What are the most overlooked or least talked about great movie trailers?",
    "author": "Feldo93",
    "date": 1686529981.0,
    "url": "https://www.reddit.com/r/movies/comments/147a8ki",
    "media_urls": [],
    "other_urls": [],
    "postText": "Probably an odd question to ask, but I recently got to thinking about the teaser trailer for the movie 'Epic' and the final trailer for the movie 'Valerian And The City Of A Thousand Planets', two trailers that I think are really solid (albeit advertising what turned out to be bad movies) but not really talked about when the topic of good trailers come up, so my question to you guys is: \n\nWhat trailers do you like that no-one ever really talks about?",
    "comments": [
        {
            "level": 0,
            "comment": "I loved Barbarian (2022) because it didn't spoil the film unlike every trailer these days.",
            "score": 5,
            "author": "Whereiscatlin",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a great one. I also liked the fake trailer they did a few weeks after it was out where they promote it as something completely different. [Barbarian 'Long' trailer ](https://youtu.be/zUqIv5PvbGk)",
                    "score": 1,
                    "author": "Feldo93"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I still rewatch the Cloud Atlas extended trailer sometimes, never fails to get my heart pumping \n\nhttps://youtu.be/hWnAqFyaQ5s\n\nI thought the trailer for the Gambler starring Mark Wahlberg was pretty tight, got me to see the movie which ultimately sucked hard (in my opinion), decent trailer though! \n\nRewatching it’s not as good as I thought it was when I was in college, but wanted to include both sides of the coin (movie I like and dislike but the trailer hit home before seeing it). \n\nhttps://youtu.be/Y5gPQXbFs9Y",
            "score": 4,
            "author": "MinshewManiaBOAT",
            "replies": [
                {
                    "level": 1,
                    "comment": "That Clout Atlas trailer is so good and the one for The Gambler is actually decent",
                    "score": 3,
                    "author": "Feldo93"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Personally I found Dark Knight to have a great trailer and teaser trailer. The whole marketing for that film was amazing for me",
            "score": 3,
            "author": "SamSAHA"
        },
        {
            "level": 0,
            "comment": "Jason Bourne",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Jesus Christ, that's...\"",
                    "score": 2,
                    "author": "trylobyte"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Fugitive trailer is perfect. Gives you the premise, and nothing more. Zero spoilers.",
            "score": 3,
            "author": "hour_of_the_rat"
        },
        {
            "level": 0,
            "comment": "Man of Steel (2013) had one of the best teaser trailers ever.",
            "score": 3,
            "author": "fungobat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah yes, back when they submitted the trailer under the classification 'Cloak and Dagger'",
                    "score": 2,
                    "author": "Feldo93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just curious, what does that mean?",
                            "score": 2,
                            "author": "fungobat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To try and hide the surprise of it appearing before The Dark Knight Rises, the trailer was submitted to the film classification organisations such the BBFC under a different title, 'Cloak And Dagger'",
                                    "score": 3,
                                    "author": "Feldo93",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh wow. Never knew that. And Cloak and Dagger is a fun '80s movie!",
                                            "score": 2,
                                            "author": "fungobat"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was blown away by 'Sin City' teaser trailer.\n\nhttps://youtu.be/uLkBO66vySg",
            "score": 3,
            "author": "trylobyte",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hadn't seen this one before. Very stylish and doesn't really spoil everything",
                    "score": 1,
                    "author": "Feldo93"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[This one.](https://youtu.be/vKQi3bBA1y8)",
            "score": 2,
            "author": "quickjump"
        },
        {
            "level": 0,
            "comment": "The Lighthouse trailer got me hyped",
            "score": 2,
            "author": "alexdelarge2021"
        },
        {
            "level": 0,
            "comment": "Little Children",
            "score": 2,
            "author": "CincinnatusSee"
        },
        {
            "level": 0,
            "comment": "The Independence Day trailers were great, back in the day.  A series of them leading up to the release, no spoilers.",
            "score": 2,
            "author": "CaptinOlonA"
        },
        {
            "level": 0,
            "comment": "Terminator 2 teaser trailer - seeing the terminator being assembled and going into the bio-flesh regenerator was epic. It didnt give away anything about the film and it felt like an extension of the first film.\n\nHighlander:Endgame (FX trailer) - It made me so hyped because it advertised a film that seemed really grand in scope. Like it was the big finale of the franchise. The actual movie wasnt much like the trailer , but to this day the trailer still seems entertaining.\n\nHighlander 3:The Sorcerer trailer - its again another example of a trailer depicting a really big movie with a certain vibe and tone. It used the title font of the tv series and it had some nifty music. The actual film wasnt as good. \n\nCase 39 - the trailer is unique because it depicts the film with a very specific plot. That a little girl is being pursued by a demonic presence. Even including specific scenes that showcase that plot. The actual film was very different in structure. What I find very unique about this instance, is that there were complete scenes shot specifically for the advertising promotion that go with the premise that this little girl is in fact the victim. While in the actual film the scenes look re-edited to go with the movie's actual plot. I'd never seen that before, where theres actually 2 versions of certain scenes. Actually in full, not just little snippets. Yet no one ever talks about the movie or the trailer. Though some were convinced that there was in fact a complete alternate cut of the film. Some even insisted they saw that alternate cut at screenings , but theres been no evidence of that.",
            "score": 2,
            "author": "donutpower"
        },
        {
            "level": 0,
            "comment": "Og alien",
            "score": 2,
            "author": "crazyromangross"
        },
        {
            "level": 0,
            "comment": "Last Action Hero teaser trailer",
            "score": 2,
            "author": "MorimotoK"
        },
        {
            "level": 0,
            "comment": "Wrath of the titans",
            "score": 2,
            "author": "MidichlorianAddict"
        },
        {
            "level": 0,
            "comment": "I thought all of the trailers for The Muppets (2011) were fun.",
            "score": 2,
            "author": "Consistent_Case_5048",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love the Girl With The Dragon Tattoo style one. [This one](https://youtu.be/0PUbrcST26s)",
                    "score": 2,
                    "author": "Feldo93"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[The Black Dahlia](https://youtu.be/xCDXPn7OnrI)  One of the best trailers ever, but the movie is sadly a complete mess",
            "score": 2,
            "author": "moonraker400",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is a pretty striking trailer and the music is oddly haunting yet inviting in a strange way",
                    "score": 2,
                    "author": "Feldo93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It got me into Death In Vegas!",
                            "score": 2,
                            "author": "moonraker400"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Prometheus trailer was so good and got me so excited for it, I know a lot of people ended up not liking the movie itself, and even though it didn't live all the way up to my hype, I still really like it",
            "score": 2,
            "author": "Andy_Popss",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's funny as I think that a lot of the backlash to the movie was more so due to the level of the promise and quality set up by that trailer rather than the movie itself",
                    "score": 1,
                    "author": "Feldo93"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Lightyear teaser trailer is absolutely incredible. The cover of Starman gives me goosebumps.",
            "score": 2,
            "author": "_JR28_"
        },
        {
            "level": 0,
            "comment": "I really liked the second trailer for [300: Rise of an Empire](https://youtu.be/jGEERBDelH8).",
            "score": 2,
            "author": "Fools_Requiem"
        }
    ]
}