{
    "id": "147ab91",
    "score": 0,
    "title": "John Wick 4's overall execution looks like it was supposed to be a videogame",
    "author": "Pennarello_BonBon",
    "date": 1686530197.0,
    "url": "https://www.reddit.com/r/movies/comments/147ab91",
    "media_urls": [],
    "other_urls": [],
    "postText": "I don't know if this has already been talked about as I'm pretty sure I can't be the only one who noticed it but I'm sharing my observation anyways. \n\nI found too many stuff that are reminiscent of things I commonly see in videogames (mainly older ones). The flat delivery of lines from the characters, the indifference of the extras to the violence going on around them as if they're NPCs, all the way to Wick being seemingly invincible to things that have killed many of his enemies instantly.\n\nEven the way the action scenes are setup, Wick looks like he's going through a level, going from one battle section to the next. The enemies seem to appear out of nowhere and weirdly stay in plain sight during a gun fight. The set pieces are ridiculous as well, not that unrealistic fight scenes are uncommon.\n\nI watched the 1st one a long time ago and only remember the premise of him seeking revenge for his dog(?) But is the whole series like this? Curious what others think.",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;But is the whole series like this?\n\nYes.",
            "score": 35,
            "author": "poo_poo_undies",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, the first one was way better.",
                    "score": 16,
                    "author": "CaineBK",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "agreed",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The franchise takes inspiration from a lot of things. Personally I loved The Warriors shout out.\n\nPretty sure that top down scene was inspired by hotline Miami",
            "score": 23,
            "author": "Antic_Opus",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was inspired by the Hong Kong massacre",
                    "score": 6,
                    "author": "No_Yesterday_3044",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The radio DJ was straight out of Warriors",
                            "score": 11,
                            "author": "kitty_galore2023"
                        },
                        {
                            "level": 2,
                            "comment": "which itself was lifted / inspired from Hotline Miami.  Sry not trying to argue or be the \"acksshullly\" guy, i just like hotline alot.  \n\n&amp;#x200B;\n\n12 is Better Than 6 is a hotline miami esque game but done Wild West style.",
                            "score": 3,
                            "author": "Turddburgle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;which itself was lifted / inspired from Hotline Miami\n\nNope. They got the idea from a different title.",
                                    "score": 1,
                                    "author": "arealhumannotabot"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I gotta find an Imgur post I saved a while ago.  The OP went all out discussing Hong Kong action flicks and their influence on Hollywood movies.  OP provided links, example gifs, suggestions and more\n\nEDIT: found it on [reddit](https://www.reddit.com/r/movies/comments/9xcect/my_case_for_hong_kong_action_movies_imgur_album/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=1&amp;utm_term=1)",
                            "score": 1,
                            "author": "riegspsych325"
                        },
                        {
                            "level": 2,
                            "comment": "I wasn't familiar with that game, so the lack of capitalization on the first and last words of the title made me read this as \"the action scene was inspired by a tragedy in Hong Kong.\" Game looks good, though!",
                            "score": 1,
                            "author": "LastKnownWhereabouts"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've wondered if the Warriors bit with the DJ was itself a reference to American Graffiti",
                    "score": 2,
                    "author": "arealhumannotabot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The overhead mansion chase was confirmed to be inspired by a video game.",
            "score": 11,
            "author": "FloridaFlamingoGirl"
        },
        {
            "level": 0,
            "comment": "The first film was stylish but I didn't find it to feel like cut scenes from a video game. The second film did start to give me that vibe. \n\nThe fourth film intentionally does the video game style. When the camera goes into the top down view, that was inspired by a video game. The director was very proud of that. I took the showdown in the traffic to be like a stage from Super Smash Bros. lol. Having John face off against the stage boss in each act...I mean its kind of silly with the \"villains\" they had in this installment. I kept thinking with how excessive and over the top the films have been, may as well just make it a video game series, instead of these long drawn out movies.",
            "score": 9,
            "author": "donutpower"
        },
        {
            "level": 0,
            "comment": "I noticed this too. But so what? I still enjoyed the movie. I love the whole series.",
            "score": 8,
            "author": "Still_Smoke8992"
        },
        {
            "level": 0,
            "comment": "The whole series is not shot like this.  I agree with you. As I was watching I kept thinking it was as if they played a video game, recorded it, snd then reenacted it with humans.\n\nOne of the things that led me to that was the way people would get shot like four times and just keep coming",
            "score": 4,
            "author": "RustywantsYou"
        },
        {
            "level": 0,
            "comment": "My theory as to why/how John Wick 5 and The Matrix 5 will be one and the same: \n\n&gt;!He (John Wick) was Neo all along; neither of which died, but awaken to find that \"they\" (he) never actually defeated the machines (The High Table). Nor was he ever truly outside \"the\" Matrix, but rather within a seemingly endless series of matrices. But the Architect continues to wipe his memory every time he thinks he's won, putting him (and Morpheus/The Bowery King) in different video game environments (e.g., cursing him to fight waves upon waves of deadly assassins (agents)), if only to keep him busy for as long as he [virtually] can...!&lt;",
            "score": 4,
            "author": "YeahBowie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is this something possible like there's a connection between the studios and people making both movies or is it just your fan theory? It'd be wild of it's true.",
                    "score": 1,
                    "author": "Pennarello_BonBon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe they're both owned by Warner Bros. But it's just my theory. :)",
                            "score": 1,
                            "author": "YeahBowie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah, it'd be cool nonetheless",
                                    "score": 1,
                                    "author": "Pennarello_BonBon"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seems like the movies became more video game inspired/oriented as the series progressed.  1 and 2 had a story with some fleshed out characters and dialogue.  3 and 4 were more of \"go see this guy for your mission and kill 100 randos at some location to move onto the next level\".  4 was especially like this.  Tougher opponents with more body armor that required multiple shots to put them down and then a headshot to finish them off.",
            "score": 3,
            "author": "DukeRaoul123"
        },
        {
            "level": 0,
            "comment": "The fights got a bit over long and repetative. It was hard to stay engaged when the guys were all in bulletproof suits, getting shot didn't seem to have any consequences and you pretty much knew who was going survive in each fight.\n\nStill, it's a triumph of choreography with unbroken cinematography. A dying art among modern action films.",
            "score": 2,
            "author": "kitty_galore2023",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's weird. Guys get shot so many times and getting coming back up",
                    "score": 2,
                    "author": "bunnytheliger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I assume you're younger than me cause people criticize the Wick movies like action movies of the 80s and 90s weren't absolutely bonkers and ridiculous",
                            "score": 2,
                            "author": "arealhumannotabot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't know any 80s movies where henchmen has to be shot a million times to stay dead like John Wick.",
                                    "score": 2,
                                    "author": "bunnytheliger",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not saying it's the exact same things copy and paste, but it's just as ludicrous",
                                            "score": 1,
                                            "author": "arealhumannotabot"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was kinda bored through most of the movie really. Shotgun blast to the chest? No worries. Fall from 3rd story window? Up you get. Hit by a car at speed? Walk it off. Multiple bullet impacts? Bee stings. Endless series of baddies waiting their turn to get a personalised head shot? Yawn.",
                    "score": 3,
                    "author": "Obnubilate"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I tried posting a thread and it wouldn't post.  Does anyone know if the sub is blacking out and if so how long",
            "score": 1,
            "author": "CircusOfBlood",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just posted right now, so I think the sub is still active. I frequent another sub that I can't acess, most probably due to the protest. I can't even see it like it's set to private. So if you can access this, it's probably fine?",
                    "score": 1,
                    "author": "Pennarello_BonBon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most subs are starting at midnight tonight.",
                            "score": 2,
                            "author": "CircusOfBlood"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes it is I believe",
                    "score": 1,
                    "author": "OrbitOrbz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Know if it's 2 days or indefinitely?",
                            "score": 1,
                            "author": "CircusOfBlood"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The 1st one and 2nd one is good but then it turns 2 and half hours of Max Payne gameplay",
            "score": 1,
            "author": "bunnytheliger"
        },
        {
            "level": 0,
            "comment": "Parts of it are explitly video game homages (to games thst are themselves heavily john wick influenced)",
            "score": 1,
            "author": "AlanMorlock"
        },
        {
            "level": 0,
            "comment": "Play the game John wick hex or just watch a video of it",
            "score": 1,
            "author": "EvenDranky"
        },
        {
            "level": 0,
            "comment": "It’s the best film in the franchise imo I just don’t like how some characters it seemed like it took about 80 rounds to kill em but other than that I enjoyed it",
            "score": 1,
            "author": "Kingss121"
        },
        {
            "level": 0,
            "comment": "even john wick 1 has a couple of video game-like shots. THe climactic boss fight between Reeves and Storemare starts off looking like a side-scroller boss battle.",
            "score": 1,
            "author": "arealhumannotabot"
        },
        {
            "level": 0,
            "comment": "The top-down scene in John Wick 4 immediately made me think of Hotline Miami.",
            "score": 1,
            "author": "FuriouSherman"
        },
        {
            "level": 0,
            "comment": "I have the same feelings about mando.",
            "score": 1,
            "author": "smittyhotep"
        },
        {
            "level": 0,
            "comment": "“I found too many stuff that…”.",
            "score": 1,
            "author": "Themtgdude486",
            "replies": [
                {
                    "level": 1,
                    "comment": "?",
                    "score": 1,
                    "author": "Pennarello_BonBon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your english.",
                            "score": 1,
                            "author": "Themtgdude486"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "thats kinda the shtick of the whole series, but yeah I noticed it a lot more in 4.  Imo they kinda over did it and it lost some of its charm.",
            "score": 0,
            "author": "Fancy_Combination436"
        }
    ]
}