{
    "id": "148lf2o",
    "score": 0,
    "title": "What similarities, if any, are there between The Big Lebowski and No Country For Old Men?",
    "author": "Tap-in-Bogey",
    "date": 1686679050.0,
    "url": "https://www.reddit.com/r/movies/comments/148lf2o",
    "media_urls": [],
    "other_urls": [],
    "postText": "**The Big Lebowski** and **No Country For Old Men** and the Coen brothers two most famous movies (or at least the ones I hear referenced the most) .  The plots and manner of speaking have nothing in common.  Unlike other A-list directors (Nolan, Scorsese, Tarantino, PTA) it's hard for me to see any stylistic similarities between the 2 films. I'm sure there is, I just haven't noticed it; even after multiple viewings of both movies.",
    "comments": [
        {
            "level": 0,
            "comment": "Like most films in the Coen’s body of work, both The Big Lebowski and No Country offer a very nihilistic world view that binds them thematically.\n\nIn both films, the driving motivation for each character is to gain possession of a briefcase of money. However, as the plots unfold, the consequences begin piling up, and ultimately no one wins, rendering all the suffering caused by those consequences meaningless.\n\nBoth movies posit that the universe is chaotic and things happen for no reason. This philosophy is very prominent in the film noir sub-genre, which both TBL and No Country draw from extensively. The former is essentially a reimagining of the plot from The Big Sleep with a stoner, deadbeat in place of the hard-boiled detective. And the latter relocates the power struggle between agents of differing morality that would normally be found in a big city to the rural west.\n\nWhere the films differ is in their ultimate outlook of the remaining characters in the wake of the chaotic events. In TBL, The Dude and Walter still manage to find happiness in the little things, despite now seeing how uncaring and meaningless the universe is, perfectly summed up by the refrain, “Fuck it, let’s go bowling.” This is vastly different from the ending of No Country which sees Tom Bell withdraw from his old life by handing in his badge when he realizes he no longer understands the meaningless violence of the world.",
            "score": 11,
            "author": "NbdyFuckswTheJesus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks ChatGPT",
                    "score": -4,
                    "author": "Klutzy-Blueberry-740",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doubtful. Especially looking at the comma usage.\n\nPlus, the username is a Lebowski reference. More likely they’re just a fan.",
                            "score": 3,
                            "author": "Dottsterisk"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I dont really see any, other than they both sort of have a detective noir spin, but dramatically different in pacing and tone. \n\nThe Coen brothers are fantastic filmmakers that have made more gems than stinkers.  Their filmography is sort  of mind blowing.",
            "score": 10,
            "author": "rayinreverse"
        },
        {
            "level": 0,
            "comment": "Oh good question. Two of my top movies to watch. Especially The Big Lebowski. I can't count how many times I've seen that movie. One of my all time favorites.\n\nYou're right, there certainly isn't a lot of similarities. But I think there are some. There's spattering's of dark/dry humor throughout No Country For Old Men similar to The Big Lebowski. For example:\n\nThe shopkeeper's response when Llewelyn asks him if they get a lot of people coming into his shop not wearing any clothes: \"No, sir. It's unusual.\"\n\n* Beforehand, when Llewelyn walks in wearing nothing but a hospital robe and the boots he bought, the clerk's first response is \"How're them Larry's holding up?\"\n\nHere's a pretty good list of a bunch of others.\n\n[https://tvtropes.org/pmwiki/pmwiki.php/Funny/NoCountryForOldMen](https://tvtropes.org/pmwiki/pmwiki.php/Funny/NoCountryForOldMen)",
            "score": 3,
            "author": "pliving1969",
            "replies": [
                {
                    "level": 1,
                    "comment": "Guess I’m going down a tv tropes rabbit hole. Been a while.",
                    "score": 1,
                    "author": "danimal6000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The lighting is less natural in The Big Lebowski, but Roger Deakins uses very even tones and minimal camera movements in both movies. Both are essentially crime stories, of course, centered around a guy who's forced to evaluate his life at a late age. Bridges and Tommy Lee are both propelled through this twisty turny misadventure because of a case of stolen money, but neither pursue any particular goals of their own. Fate and happenstance play a big role in their stories, and of course there's always a narrator talking over a Western landscape.",
            "score": 3,
            "author": "RemakeEverything"
        },
        {
            "level": 0,
            "comment": "I would say Fargo is more famous than No Country for Old Men or The Big Lebowski.",
            "score": 4,
            "author": "PecanPizzaPie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats just like, your opinion, man",
                    "score": 2,
                    "author": "oofomammoot"
                },
                {
                    "level": 1,
                    "comment": "No, not exactly. In terms of which movie's more famous, first, No Country for Old Men, second, The Big Lebowski and then Fargo.",
                    "score": 0,
                    "author": "AMJ_004",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "According to whom?",
                            "score": 2,
                            "author": "PecanPizzaPie"
                        },
                        {
                            "level": 2,
                            "comment": "I think I'd have to disagree. I'd say Lebowski is probably the most well known of the three. It has almost a cult following where the other two do not. All you have to do is google The Big Lebowski and you'll notice the endless amount of Lebowski paraphernalia you can find to buy. You won't see anything that comes close it with the other two movies.",
                            "score": 1,
                            "author": "pliving1969",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think to a cinephile, that may be the case, but generally speaking Fargo has more renown.  After all, it has a TV show based on the film.  If you want to get into numbers, though, none have earned as much as True Grit, so there is that.  Definitely Lebowski is more quotable and relatable to some demographics, but Fargo is more commonly known among all demographics, hence my reasoning.\n\nBut, alas, this is a dead horse upon which we beat.\n\nhttps://www.reddit.com/r/movies/comments/2vdemb/fargo_the_big_lebowski_or_no_country_for_old_men/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
                                    "score": 1,
                                    "author": "PecanPizzaPie"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They both involve deals gone bad and some third party trying to keep the bag of money for themselves.\n\nThey both feature nihilistic villains.\n\nAnd I guess they both end in a way that the protagonist didn't really have much of an effect on the overall outcome of things.",
            "score": 1,
            "author": "Bodymaster"
        },
        {
            "level": 0,
            "comment": "They both suck!",
            "score": -11,
            "author": "True-Fly1610",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice of you to take a break from commenting on \"things you'd like to do\" to various women posting in the NSFW subs you seem to spend most of your time on.",
                    "score": 5,
                    "author": "ElCochinoFeo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pretty worried about me bro, checked me out and wrote a paragraph. Last time I checked it’s still America if you don’t like my opinion tough shit. You probably a liberal that gets all but hurt when somebody doesn’t have the same opinion. So have yourself a great night playing x box in your mom’s basement 😂🤣😂🤣",
                            "score": -2,
                            "author": "True-Fly1610"
                        }
                    ]
                }
            ]
        }
    ]
}