{
    "id": "148lxyx",
    "score": 8,
    "title": "What are some must-see classics?",
    "author": "efaefabanefa",
    "date": 1686680427.0,
    "url": "https://www.reddit.com/r/movies/comments/148lxyx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm in a very lonely place in my life right now so I thought I'd pick up a new hobby by filling my Letterboxd. I love animation, sci-fi and fantasy. Westerns really intrigue me and I'd love to watch some. I'm starting to enjoy comedies now, too. Give me some must see movies whether they fit my criteria or not! :\\]",
    "comments": [
        {
            "level": 0,
            "comment": "Nausicaa of the Valley of the Wind",
            "score": 11,
            "author": "HamiltonBlack"
        },
        {
            "level": 0,
            "comment": "The Magnificent Seven is a great western.",
            "score": 8,
            "author": "oldandintheway1155",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know I’m going to get hate for this, but the 2016 remake is good, too",
                    "score": 1,
                    "author": "mehwars"
                }
            ]
        },
        {
            "level": 0,
            "comment": "2001: A Spce Odyssey.\nThe ultimate masterpiece",
            "score": 7,
            "author": "CosumedByFire"
        },
        {
            "level": 0,
            "comment": "Comedies: \n\nTropic Thunder \n\nThe Blues Brothers \n\nWhite Men Can't Jump 1992\n\nMean Girls \n\n\nAnimation: \n\nHow To Train Your Dragons Trilogy \n\nCoco \n\nRango \n\nMulan \n\nFrozen 1\n\nTangled \n\nLion King \n\nNightmare Before Christmas \n\nCoraline \n\n\nSci Fi: \n\nBR 2049 \n\nChildren of Men \n\nGattaca \n\nBlade Runner \n\n2001 A Space Oydessy \n\nEx Machina \n\nAnnihilation \n\n\nFantasy: \n\nLOTR franchise \n\nStar Wars Original Trilogy \n\nBig Trouble In Little China \n\nPans Labyrinth \n\n\nWestern:\n\nTombstone \n\nUnforgiven \n\nDjango Unchained \n\nHell Or High Water",
            "score": 7,
            "author": "TheCosmicFailure",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh wow, thank you so much!!",
                    "score": 4,
                    "author": "efaefabanefa"
                },
                {
                    "level": 1,
                    "comment": "Hahaha, I've watched all of those animated films. I love them so much",
                    "score": 4,
                    "author": "efaefabanefa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have u seen Mitchell's Vs The Machines? \n\nNot considered a classic yet. But I thought it was great.",
                            "score": 3,
                            "author": "TheCosmicFailure"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ratatouille. Masterpiece of a movie.",
            "score": 18,
            "author": "bobbydazzler2806",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah!! It's so good! I love it so much. You're right, I should watch this over and over again haha",
                    "score": 1,
                    "author": "efaefabanefa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Westerns? Okay...\n\n* War Wagon (John Wayne, Kirk Douglas)\n* Two Mules for Sister Sarah (Clint Eastwood, Shirley McLaine)\n* Silverado (Kevin Kline, Danny Glover)\n* Young Guns (Emilio Estevez, Kiefer Sutherland)",
            "score": 7,
            "author": "CountHonorius",
            "replies": [
                {
                    "level": 1,
                    "comment": "YOUNG GUNS II, BAY-BEE",
                    "score": 2,
                    "author": "poo_poo_undies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "SHOT DOWN ...",
                            "score": 2,
                            "author": "Decent-Ground-395",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "IN A BLAZE OF GLORY!",
                                    "score": 1,
                                    "author": "mehwars"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Stagecoach\n\nThe Man who shot Liberty Valance\n\nRio Bravo",
                    "score": 2,
                    "author": "deathisyourgift2001"
                },
                {
                    "level": 1,
                    "comment": "Silverado is pretty ideal for a classic western. For other great westerns you can look at:\n\n* Maverick (it's a comedy though)\n* True Grit \n* Tombstone \n* 3:10 to Yuma",
                    "score": 2,
                    "author": "ConfusedPanda76",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maverick was great - saw it on its opening night. Tombstone's outstanding. 3:10 to Yuma...was that a Bronson flick?",
                            "score": 2,
                            "author": "CountHonorius"
                        },
                        {
                            "level": 2,
                            "comment": "True Grit (with Jeff Bridges) and 3:10 to Yuma are so good!",
                            "score": 2,
                            "author": "solrackratos"
                        },
                        {
                            "level": 2,
                            "comment": "Maverick is dope. I wore out that VHS as a kid…",
                            "score": 1,
                            "author": "TheKramer89"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd add Unforgiven to that excellent list.",
                    "score": 1,
                    "author": "Leading_Kangaroo6447"
                },
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "efaefabanefa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you're starting to enjoy comedies, Ferris Bueller's Day Off is definitely a classic. You can watch it on Amazon Prime Video, Paramount+, Apple TV, etc.",
            "score": 3,
            "author": "AM53108",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's good :)",
                    "score": 1,
                    "author": "efaefabanefa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Go for all... or most, of John Hughes' filmography. Ferris Bueller, Breakfast Club, Weird Science, Sixteen Candles, Plane Trains Automobiles, Uncle Buck. \n \nCurly Sue and She's Having A Baby is only if you truly fall in love with his other films and need more. But still, I'd go for the ones he wrote but didn't direct before that: The Vacation movies, Home Alone 1 and 2, Beethoven...",
                            "score": 1,
                            "author": "Schlappydog"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Blazing Saddles \n\nYoung Frankenstein\n\nSpaceballs\n\nMclintock (John Wayne western)",
            "score": 4,
            "author": "Hearing_Leopard6703"
        },
        {
            "level": 0,
            "comment": "Akira is a classic anime movie",
            "score": 3,
            "author": "crazycalv",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have to admit, as someone who loves anime, I haven't seen Akira :'))",
                    "score": 1,
                    "author": "efaefabanefa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You need to watch it! What amazes me is that it’s all hand drawn",
                            "score": 2,
                            "author": "crazycalv"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Animation - The Lion King, Toy Story, Fantasia, Spirited Away, Mulan, My Neighbor Totoro, The Little Mermaid, Aladdin, Snow White and the Seven Dwarfs, Pinocchio &amp; Beauty and the Beast\n\nSci-Fi - 2001: A Space Odyssey, Metropolis, Star Wars: A New Hope, The Empire Strikes Back &amp; Return do the Jedi\n\nFantasy - The Wizard of Oz and The Lord of the Rings Trilogy\n\nWestern - The Good, the Bad and the Ugly &amp; The Magnificent Seven\n\nComedy - Ferris Bueller's Day Off, When Harry Met Sally, Pulp Fiction, Seven Samurai &amp; PlayTime\n\nNote: I added Seven Samurai to the comedy genre because I thought the scenes with Kikuchiyo was pretty funny and hilarious. \n\nAlso other genres to include\n\nRomance - Casablanca, The Notebook, Titanic &amp; Beauty and the Beast\n\nGangster - Pulp Fiction, The Dark Knight, The Godfather Trilogy (haven't seen 2 or 3) &amp; Goodfellas\n\nHorror/Thriller - The Silence of the Lambs, Psycho, The Exorcist (I don't like this movie but just watch it), A Nightmare on Elm Street, Rear Window, Scream, Vertigo, The Birds and North by Northwest\n\nHistorical Epic - The Ten Commandments, Lawrence of Arabia, Ben-Hur, Spartacus, Schindler's List, Cleopatra, Titanic, Saving Private Ryan &amp; Gone with the Wind",
            "score": 3,
            "author": "XxMarvin1H2a3p4p5yxX"
        },
        {
            "level": 0,
            "comment": "Animation --&gt; Everything by Hayao Miyazaki.\n\nWestern --&gt; The searchers, The man who shot Liberty Valance, The horse soldiers, The Man from Laramie, Winchester 73, Man of the West, Red river, Rio Bravo (classic westerns). Rio Conchos, Ride the high country, Major Dundee, The wild bunch, Pat Garrett &amp; Billy the kid, Two rode together, Cheyenne Autumn, The shootist (crepuscular / revisionist westerns). The dollar trilogy, Once upon a time in the west, Django, The great silence, A professional gun, Tepepa, Man to man, The big gundown, Face to face, Run, man, run, My name is nobody (eurowestern).\n\nFantasy: Labyrinth, The Dark Crystal, Conan the Barbarian",
            "score": 8,
            "author": "Ramoncin",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Animation --&gt; Everything by Hayao Miyazaki.\n\n~~Everything by Hayao Miyazaki~~ Everything by Studio Ghibli - Isao Takahata is also a fucking genius.",
                    "score": 1,
                    "author": "btaz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd start with the [AFI 100 list](https://www.afi.com/afis-100-years-100-movies-10th-anniversary-edition/). Plenty of great mainstream classics.",
            "score": 3,
            "author": "jupiterkansas"
        },
        {
            "level": 0,
            "comment": "The Assassination of Jesse James by the Coward Robert Ford\n\nOpen Range",
            "score": 3,
            "author": "Sthrax"
        },
        {
            "level": 0,
            "comment": "Western = Quigley Down Under - Tom Sellick in Australia with one badass rifle.  A fantastic movie (has allen rickman as well).\n\nWestern Adjacent - Akira Kurosawa's Yojimbo &amp; Sanjuro (two movies) as long as you can do subtitled movies, these are awesome.\nIf you can handle a 3+ hr long black/white subtitled movie, Seven Samurai is truly an epic - that final battle is something else.  Takes a committment though - many westerns have been directly influenced by these films.\n\nSci-Fi - I am always recommending 'A Boy and His Dog' - old school but one of the best endings.\n\nBlade Runner is my personal all time favorite - the atmosphere, the characters, the whole world is so genuine feeling.  The soundtrack really makes it too.\n\nFantasy - The Labrynth was a childhood favorite that still 100% holds up - wacky but fun - David Bowie is in there doing his thing.\n\nIf you haven't seen the original 'Willow' that also holds up quite well overall.",
            "score": 3,
            "author": "Mr_IsLand"
        },
        {
            "level": 0,
            "comment": "Unforgiven. One of the best movies ever made.",
            "score": 3,
            "author": "SnazzyShoesKen"
        },
        {
            "level": 0,
            "comment": "Here are some of my favourites:\n\nAmelie (great feel good movie)\n\nCasablanca \n\nShawshank Redemption\n\nSpirited Away\n\nHighlander (The first one only.  There can be only one)\n\nUnforgiven \n\nThe Never Ending Story\n\nPrincess Bride\n\nCrouching Tiger Hidden Dragon\n\nAlien\n\nAliens",
            "score": 3,
            "author": "joleger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spirited away and the never ending story were my childhood!!!",
                    "score": 1,
                    "author": "efaefabanefa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here are some of my favorite western movies, for your consideration:\n\n\\-*The Magnificent Seven* (1960) - Seven gunslingers travel to Mexico to protect a defenseless village there from a gang of bandits. It's got phenomenal music, characters, action scenes, pacing, actors, and food-for-thought, making it my favorite western of all time.\n\n\\-*High Noon* (1952) - A Wild West town marshal (Gary Cooper) must organize a posse when he learns of a gang of outlaws coming into town to kill him on his retirement day at noon. It's not a shoot-'em-up movie (though there are a couple of terrific action scenes), being more of an inspiring, entertaining analysis of what makes some people so heroic and others so cowardly.\n\n\\-*Duck, You Sucker* (1971) - A Mexican bandit and an Irish revolutionary team up to rob the Mesa Verde bank, but end up involved neck-deep in the Mexican Revolution. Its political thesis couldn't be any less clear, but it's a riveting, electric tale of friendship.\n\n\\-the Man with No Name trilogy (*A Fistful of Dollars* \\[1964\\], *For a Few Dollars More* \\[1965\\], and *The Good, the Bad and the Ugly* \\[1966\\]) - Clint Eastwood stars as the gunslinging drifter the Man with No Name, shooting up bad guys and making some cash on the side, in this world-famous \"spaghetti western\" (Italian-made western) trilogy.\n\n\\-*Django* (1966) - This iconic \"spaghetti western\" is about a coffin-dragging gunslinger who finds himself in the middle of a range war between Mexican revolutionaries and racist, ex-Confederate renegades.\n\n\\-*Once Upon a Time in the West* (1968) - This probably isn't the first western you should start out with, but you definitely should work your way up to this \"spaghetti western\" epic about strangers arriving in a growing Wild West town, making bloodshed inevitable. It's pretty slowly paced, but it still manages to entertain, thanks to its intriguing narrative, music, cinematography, etc.\n\n\\-*Jeremiah Johnson* (1972) - Some guy decides to become a mountain man, in what could be the definitive mountain man western.\n\n\\-*Shane* (1953) - In one of the all-time great lone-gunslinger movies, a retired gunslinger (Alan Ladd) settles down with a homesteader family, only to find that he can't outrun his calling in life.\n\n\\-*Unforgiven* (1992) - Clint Eastwood stars in this revisionist western as a retired gunman who saddles up for one final job when he's hired to avenge the mutilation of a prostitute.\n\n\\-*Winchester '73* (1950) - James Stewart sets off on a journey to recover a prized rifle of his that was stolen. It's an excellent fusion of the psychological western and the action-adventure-western.\n\n\\-*High Plains Drifter* (1973) - Clint Eastwood plays a mysterious gunslinger who starts raising Hell in a Wild West town.\n\n\\-*The Professionals* (1966) - A team of gunslingers is organized to rescue a woman who was kidnapped by Mexican revolutionaries.\n\n\\-*Vera Cruz* (1954) - This influential action-adventure-western is about a team of gunslingers who're hired to escort a French countess across rebel-held territory in Mexico during the Franco-Mexican War.\n\n\\-*Bad Day at Black Rock* (1955) - In the film that put director John Sturges on the map (he would later direct the masterpieces *The Magnificent Seven* \\[1960\\] and *The Great Escape* \\[1963\\]), a mysterious man shows up in a teeny-tiny Western American town following World War II and starts asking a bit too many questions, prompting violence from the locals.\n\n[Anyway, if you're a newcomer to classic cinema (which you may not be), I have a Letterboxd list of classic movies that I would personally consider approachable/watchable/accessible/engaging/manageable/recommendable for somebody just getting into the classics (that I always share when this sort of question is asked). It leans heavily on the action, adventure, crime, war, and western genres at the moment, but I'm hoping to work that out in the future, as I add more films to the list. Click the \"Read notes\" button near the top of the screen to see a paragraph for each movie explaining why I chose it for the project and a one-sentence plot summary.](https://letterboxd.com/thehestinator/list/entry-level-cinema-accessible-entertaining/)\n\nGood luck!",
            "score": 3,
            "author": "DifferentOpinionHere",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for putting so much effort into this comment! It means the world to me :))",
                    "score": 2,
                    "author": "efaefabanefa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Two good war films if you’re into them:\n\nLawrence of Arabia (1962) - an amazing piece of cinematography. Probably one of the most beautifully shot films of the 20th century. Sure there’s some modern issues of casting white people as Arab characters, such as Sir Alec Guinness playing Prince Faisal, but for the day it was probably one of the most fantastically cast line ups. Warning, it is almost 4 hours long. \n\nThe Bridge on the River Kwai (1957) - a quirky, riveting story of British POWs building the China-Burma railway during the Second World War. A thrilling ride all the way through. Wonderfully cast, wonderfully filmed.",
            "score": 3,
            "author": "triws"
        },
        {
            "level": 0,
            "comment": "&gt; Westerns really intrigue me and I'd love to watch some.\n\nStagecoach\n\nThe Ox-Bow Incident\n\nHigh Noon\n\nJohnny Guitar\n\nThe Searchers\n\nThe Man Who Shot Liberty Valance\n\nThe Good the Bad and the Ugly\n\nUnforgiven",
            "score": 7,
            "author": "BEE_REAL_"
        },
        {
            "level": 0,
            "comment": "Star Wars.",
            "score": 6,
            "author": "fbeast77"
        },
        {
            "level": 0,
            "comment": "Comedy, western, sci fi?\n\nThe Apartment\n\nThe Good The Bad and the Ugly\n\nBlade Runner",
            "score": 4,
            "author": "amplifylight",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thankyou!",
                    "score": 1,
                    "author": "efaefabanefa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Citizen cane,\nThe deer hunter,\nGodfather,\nCasino,\nKids,\nThe Cannonball run,\nReservoir dogs",
            "score": 2,
            "author": "tikkamasalachicken"
        },
        {
            "level": 0,
            "comment": "Basically anything by Akira Kurosawa, was so influential and important that he basically changed how filming a movie was done. Soooooo many American westerns are either based on or inspired by Kurosawa's movies.",
            "score": 2,
            "author": "admiralrico411"
        },
        {
            "level": 0,
            "comment": "I firmly believe Spirited Away is the best movie ever made",
            "score": 2,
            "author": "KingBowserGunner",
            "replies": [
                {
                    "level": 1,
                    "comment": "I totally agree with this. One of my favourite Ghiblis for sure",
                    "score": 1,
                    "author": "efaefabanefa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Animation:\n- The Night is Short, Walk on Girl\n- Persepolis \n- Tokyo Godfathers \n- Millennium Actress\n- Paranoia Agent \n- Paprika \n- Fantastic Mr. Fox \n- Isle of Dogs \n- The Iron Giant \n- Memories \n- The Last Unicorn \n- Sita Sings the Blues\n- Song of the Sea\n- The Book of Kells \n- Chico and Rita \n- In this Corner of the World \n- Titan A.E. \n- The Secret of NIMH \n- Loving Vincent \n- A Town Called Panic \n- Flavors of Youth \n- The Prophet \n- April and the Extraordinary World \n- Waking Life \n- The Breadwinner \n- Long Way North\n- Yellow Submarine \n- The Garden of Words \n- Mary and Max\n- A Silent Voice \n- Dante’s Inferno (2007)\n- A Cat in Paris \n- Read or Die \n- Miss Hokusai \n- My Entire High School Sinking Into the Sea",
            "score": 2,
            "author": "butcherbunbun10",
            "replies": [
                {
                    "level": 1,
                    "comment": "from the ones I have seen on the list, (Fantastic Mr Fox, Isle of Dogs, The Garden of Words, A Silent Voice), I will assume your taste is immaculate and I will watch the others. I suggest Grave of the Fireflies by studio ghibli if you haven't already watched it, btw!! It's the only film you'd love but never would want to watch again",
                    "score": 2,
                    "author": "efaefabanefa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Grave of the Fireflies is wonderful. The only reason I didn’t recommend any Ghibli films was because others had beaten me to it. If you’d like any more film recs, please let me know. ☺️",
                            "score": 1,
                            "author": "butcherbunbun10"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "*Aachi &amp; Ssipak* \\- 2006 Korean animated sci-fi comedy film. \n\n*Duel in the Sun* \\- Western from 1946. \n\n*The Dinner Game* \\- French comedy from 1998. \n\n*Death at a Funeral* \\- the British one from 2007.",
            "score": 2,
            "author": "bangdazap"
        },
        {
            "level": 0,
            "comment": "Fantastic Mr. Fox",
            "score": 2,
            "author": "KillaCatz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Watched and loved. Now I'm the biggest fan of wes anderson. (can't wait for asteroid city!!)",
                    "score": 2,
                    "author": "efaefabanefa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Casablanca\n\nRan (Akira Kurosawa)\n\nDonnie Darko\n\nPrimer\n\nOnce Upon A Time In The West",
            "score": 2,
            "author": "jpers36"
        },
        {
            "level": 0,
            "comment": "For comedies try Blazing Saddles and Young Frankenstein and for Sci-Fi try Inception and Interstellar",
            "score": 4,
            "author": "OldSchoolGamer1973"
        },
        {
            "level": 0,
            "comment": "The Coen Bros’ True Grit.",
            "score": 2,
            "author": "poo_poo_undies"
        },
        {
            "level": 0,
            "comment": "Comedies:\n\nBlazing Saddles\n\nAirplane \n\nSomething About Mary\n\nSpaceballs\n\nYoung Frankenstein \n\nTommy Boy\n\nMonster Squad",
            "score": 2,
            "author": "bonemonkey12"
        },
        {
            "level": 0,
            "comment": "For comedy:\n\nBlazing Saddles. Airplane. Hot Shots. Loaded Weapon. Team America. Three Amigos. Anchorman. Zoolander.\n\nFor Westerns:\n\nHateful Eight. Magnificent Seven. Tombstone. Django Unchained. No Country For Old Men. 3:10 to Yuma. There Will Be Blood. The Quick and The Dead. Anything starring Clint Eastwood. Westworld.\n\n\nFor Sci Fi\n\nThe Matrix (all) Star Wars (all). Blade Runner (all). Back to the Future (all). Robocop (first two). Terminator (as many as you can stand). Alien (all, including the Prometheus ones). Total Recall (Both versions but watch the Arnie one first because it’s just better). Predator (first one only). Running Man.\n\nDon’t know about the rest. Not my thing. \n\nEnjoy / downvote if I missed the brief 👍",
            "score": 1,
            "author": "Dude_and_The_Bug",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nahh, you hit it well. Plus I did say it doesnt matter if you give a wider range of movies :))",
                    "score": 2,
                    "author": "efaefabanefa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kool ‘n The Gang!",
                            "score": 1,
                            "author": "Dude_and_The_Bug"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a classic but The Harder They Fall is a western from 2021.\nNot like a masterpiece but it's fun af. Feels like a well done movie adaptation of Red Dead Redemption.",
            "score": 1,
            "author": "SwordfishOk9739"
        },
        {
            "level": 0,
            "comment": "Unforgiven is mandatory watching for Westerns.\n\nTombstone.... not so much. sorry guys, but that movie is corny af.",
            "score": 1,
            "author": "Inevitable_Soft4897"
        },
        {
            "level": 0,
            "comment": "sci-fi: Blade Runner, Star Trek 2, Tron\n\nwestern: Rio Bravo\n\ncomedy: Airplane!, Ghostbusters\n\nfantasy: Ladyhawke, The Dark Crystal\n\nwildcard: First Blood, Apocalypse Now",
            "score": 1,
            "author": "MurkDiesel"
        },
        {
            "level": 0,
            "comment": "Animation and fantasy? The Last Unicorn.",
            "score": 1,
            "author": "binaryeye"
        },
        {
            "level": 0,
            "comment": "Seven Samarui",
            "score": 1,
            "author": "FlimtotheFlam"
        },
        {
            "level": 0,
            "comment": "Goodfellas",
            "score": 1,
            "author": "JobRich1277"
        },
        {
            "level": 0,
            "comment": "Who Framed Roger Rabbit.",
            "score": 1,
            "author": "co1one1huntergathers"
        },
        {
            "level": 0,
            "comment": "Yooo, what's up with the downvotes! Aren't y'all supposed tobe movie enthusiasts?",
            "score": 1,
            "author": "efaefabanefa"
        },
        {
            "level": 0,
            "comment": "Sci fi try district 9 and chappie they are special but really good.",
            "score": 1,
            "author": "Shippou1992"
        },
        {
            "level": 0,
            "comment": "Since someone already mentioned Star Wars which combines basically all the things you're looking for, you can go back to the movies that influenced it: \n\nMovies by Akira Kurosawa (*The Hidden Fortress*, *Seven Samurai*, *Yojimbo*)\n\nMovies by Fritz Lang (*Metropolis*, *Die Nibelungen*, *Destiny*, and a number of noir films he did after relocating to the US)\n\nMovies by John Ford (*Stagecoach*, *My Darling Clementine*, *The Searchers*)\n\nMovies by John Huston (*The Maltese Falcon*, *The Treasure of the Sierra Madre*, *The Man Who Would be King*)\n\nMovies Ray Harryhausen did the animation on (*7th Voyage of Sinbad*, *Jason and the Argonauts*, *The Valley of Gwangi*)\n\nMovies by Sergio Leone ('Dollars' trilogy, *Once Upon a Time in the West*)",
            "score": 1,
            "author": "ifinallyreallyreddit"
        },
        {
            "level": 0,
            "comment": "Trainspotting\n\nKiki’s Delivery Service\n\nThe Killer (1989)",
            "score": 1,
            "author": "garrisontweed"
        },
        {
            "level": 0,
            "comment": "I'm going to completely disregard all of your criteria and say that The Before trilogy (Before Sunrise, Before Sunset, Before Midnight) are some of my favorite movies. They're more romantic drama than anything you mentioned, but Ethan Hawke and Julie Delpy have insane chemistry. The films were made 9 years apart from each other and follow the relationship between the two main characters. Each film explores different stages of the relationship. Absolutely fantastic films in all aspects.",
            "score": 1,
            "author": "pyrobryan"
        },
        {
            "level": 0,
            "comment": "Megamind\n\nIs an amazing movie when you're feeling like an outcast or feeling like \"I'm not allowed to feel like a good guy right?\" It's super fun and has a lot of feel-good rock soundtracks",
            "score": 1,
            "author": "Professional_Toe_285"
        },
        {
            "level": 0,
            "comment": "I’m not super big into Westerns but Tombstone and Unforgiven are both excellent and aged very well",
            "score": 1,
            "author": "DamnImAwesome"
        },
        {
            "level": 0,
            "comment": "Wall-E is a classic\n\nThe Blues Brothers \n\nRaiders of the Lost Ark\n\nBack to the Future\n\nDazed and Confused\n\nFast Times at Ridgemont High\n\nIf you need a good laugh, check out Adam Sandler’s 90s output\n\nWhen it comes to Westerns, two words: John Wayne",
            "score": 1,
            "author": "mehwars"
        },
        {
            "level": 0,
            "comment": "My pic picks:\n\nIt Happened One Night (1934)\nThe Adventures of Robin Hood (1938)\nSergeant York (1941)\nIt’s a Wonderful Life (1946)\nThe African Queen (1951)\nAn American in Paris (1951)\nThe Quiet Man (1952)\nSeven Brides for Seven Brothers (1954)\nSabrina (1954)\nTwelve Angry Men (1957)\nWest Side Story (1961)\nMy Fair Lady (1964)\nThe Sound of Music (1965)\nThe Great Race (1965)\nThe Good, The Bad, and The Ugly (1966)\nThe Lion in Winter (1968)\nPatton (1970)\nThe Sting (1973)\nThe Outlaw Josey Wales (1976)\nStar Wars (1977)\nApocalypse Now (1979)\nRaiders of the Lost Ark (1981)\nAbsence of Malice (1981)\nThe Verdict (1982)\nThe Princess Bride (1987)\nRoxanne (1987)\nPretty Woman (1990)\nBeauty and the Beast (1991)\nGroundhog Day (1993)\nThe Fugitive (1993)\nJurassic Park (1993)\nThe Shawshank Redemption (1994)\nPulp Fiction (1994)\nApollo 13 (1995)\nThe Matrix (1999)\nThe Bourne Identity (2002)\nDodgeball (2004)\nThe Incredibles (2004)\nLincoln (2012)\nGuardians of the Galaxy (2014)",
            "score": 1,
            "author": "Common_Flight2521"
        },
        {
            "level": 0,
            "comment": "Alien",
            "score": 1,
            "author": "Paisleyhobo"
        },
        {
            "level": 0,
            "comment": "Truman Show and Groundhog Day if you’re feeling introspective!",
            "score": 1,
            "author": "Axem_Blue"
        },
        {
            "level": 0,
            "comment": "These are '60s and '70s:\n\n\\*Rosemary's Baby (great movie no matter how you classify it)\n\nLooking for Mr. Goodbar\n\nThe Exorcist\n\nJaws\n\nThe Apartment\n\nBlow-Up\n\nTaxi Driver\n\nThe Omen\n\nThe Wicker Man\n\nClockwork Orange\n\n\\*The Last Picture Show\n\nSaturday Night Fever\n\nThe Sting\n\nDeliverance\n\n\\*Being There\n\nAnnie Hall\n\nNetwork\n\nRepulsion\n\nMovies marked with \\* are my favorites (but I like them all).",
            "score": 1,
            "author": "PsychologicalTip"
        },
        {
            "level": 0,
            "comment": "The original Out of Towners with Jack Lemmon and Sandy Dennis is a great comedy.",
            "score": 1,
            "author": "SportsRMyVice"
        },
        {
            "level": 0,
            "comment": "Westerns: The Sergio Leone trilogy - A Fistful of Dollars, For a Few Dollars More, The Good The Bad and the Ugly.",
            "score": 1,
            "author": "SportsRMyVice"
        },
        {
            "level": 0,
            "comment": "The movies I recommended are old but have stood the test of time.  Whichever ones you choose, I hope you enjoy the experience!",
            "score": 1,
            "author": "SportsRMyVice"
        },
        {
            "level": 0,
            "comment": "Casablanca\n\nThe Adventures of Robin Hood\n\nForbidden Planet\n\nThe Searchers\n\n2001: A Space Odyssey \n\nThe Haunting",
            "score": 1,
            "author": "MovieMike007"
        }
    ]
}