{
    "id": "148mhva",
    "score": 0,
    "title": "has anyone seen the movie super dark times?",
    "author": "Wide_Fox9863",
    "date": 1686681895.0,
    "url": "https://www.reddit.com/r/movies/comments/148mhva",
    "media_urls": [],
    "other_urls": [],
    "postText": "i recently watched the movie super dark times for the first time. this movie was absolutely wild and at no point in time did i ever really know what to expect next. the ending confused me and i’m not sure if it’s supposed to be interpreted into our own ending based on what we thought or if that’s how the movie was supposed to end. \n\nwhat are your guys’ thoughts on this movie if you’ve seen it? (it’s on tubi for those who are wondering)",
    "comments": [
        {
            "level": 0,
            "comment": "We did an epsiode on it in the early days of my podcast. It is super dark but it's a decent movie.",
            "score": -5,
            "author": "ACinavirtualworld",
            "replies": [
                {
                    "level": 1,
                    "comment": "there’s so many questions i have that didn’t get answered during the movie that i hoped would. \n\n1. why did josh start killing people randomly? why did he try to kill allison and her friend??\n\n2. what happened to their other friend? he was in the beginning of the movie then randomly dropped off after the scene where he told zach he didn’t want to be friends. \n\n3. did zach end up dying? \n\n4. what ended up happening to josh?",
                    "score": 1,
                    "author": "Wide_Fox9863",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you wanna check out the podcast you might get some answers. It's called bottom of the stream. Search it up on all podcasts apps. It was a few years ago so You might need to scroll back a bit though. Haha",
                            "score": -8,
                            "author": "ACinavirtualworld"
                        }
                    ]
                }
            ]
        }
    ]
}