{
    "id": "7k0uie",
    "score": 97130,
    "title": "Why Everybody Should Be Very Afraid of the Disney Death Star: “Disney would control as much as 40 percent of the the U.S. movie business, and 40 percent of the U.S. television business”",
    "author": "User0989",
    "date": 1513356115.0,
    "url": "https://www.reddit.com/r/movies/comments/7k0uie",
    "media_urls": [
        "https://www.theatlantic.com/business/archive/2017/12/disney-21st-century-fox/548492/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The great Disney Google War of 2026",
            "score": 9706,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The war that was won by Amazon.",
                    "score": 4648,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Amazon just shipped the weapons. \n\n\n...to both sides. For free if you have prime, of course.",
                            "score": 2568,
                            "author": "Irrational_hate81",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Alexa, add Nuclear Bombs and spite to my shopping list.",
                                    "score": 1140,
                                    "author": "the_fuego",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They should arrive in 2 business days.",
                                            "score": 378,
                                            "author": "AnimeLord1016",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Later that week.....\n\n\"Dammit Alexa...another Bath bomb and a two liter of Sprite?\"",
                                                    "score": 548,
                                                    "author": "damonx99",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"Okay I'll add that to your cart.\"",
                                                            "score": 358,
                                                            "author": "Kingjay814",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "\"We suggest you buy our dedicated dash button for easier access\"",
                                                                    "score": 50,
                                                                    "author": "maydarnothing",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "... Who sold weapons to both sides for as long as they could get away with... Until Drone Harbour happened, and the were dragged, kicking and screaming into an unprofitable war.\n\nIn the end, Amazon claimed itself the victor, in spite of the fact that half of the European market had disappeared behind an iron firewall, and all of the corporations on the other side were now flying red logos...",
                            "score": 2193,
                            "author": "Dirty-Soul",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Rule of Acquisition # 76: \"Every once in a while, declare peace. It confuses the hell out of your enemies.\"",
                                    "score": 76,
                                    "author": "HashMaster9000",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "R/writingprompts",
                                    "score": 550,
                                    "author": "TheAmazingPapaya",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 97,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Would the fighters be named Amazonians?",
                            "score": 77,
                            "author": "NOFORPAIN",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Google is on a completely other level than Disney. Like really, it's not even comparable",
                    "score": 651,
                    "author": "le_GoogleFit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Alphabet (Google's parent company) could even *buy* Disney. Imagine that.",
                            "score": 542,
                            "author": "thax9988",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And then Apple buys Time Warner.\n\nCould happen...but you'd think at some point it one of these megacorps is going to way overstep it's bounds and monopoly busting is back. We'll see.",
                                    "score": 253,
                                    "author": "a_citizen_of_abc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; And then Apple buys Time Warner.\n\n[And then...](https://www.theonion.com/just-six-corporations-remain-1819564741)",
                                            "score": 185,
                                            "author": "Keyframe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Is that a 1998 theonion post?",
                                                    "score": 93,
                                                    "author": "EvilEggplant",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Bill Clinton, chief executive of **U.S. Government, a division of MCI-WorldCom**, praised Monday's merger as \"an excellent move.\"\n\nThis almost seems real",
                                                    "score": 96,
                                                    "author": "argote",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Trust-busting is on its way. It's doubtful that Disney would be on the chopping block, though. It's... entertainment. Of all the hills to die on, that's not the best choice.  \nWe all know the best choice.  \nIt's the telecos. It's always been the telecos.  \nTransportation and communication. Those are the two things that it's so profitable to monopolize, and which can do the most harm to society if they are monopolized.  \nFrankly, the net neutrality hubbub is accelerating this course, but I'm sure everyone involved is going to make their money fast and get out before the shit they've stirred up comes home to roost.",
                                            "score": 132,
                                            "author": "odaeyss",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not sure how accurate it is, but a quick Google search (haha, slightly ironic) showed that Disney has a net worth of $98 billion, and Google has a net worth of $428 billion. Again, not sure on accuracy, but it sure as hell shows that Disney ain't got nothing on Google. ",
                                    "score": 67,
                                    "author": "LadyofRivendell",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Notice that he's talking about Alphabet which has a much higher net worth at close to $600 billion.",
                                            "score": 50,
                                            "author": "ivoryt",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3631,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is why I fear any political party that has a good relationship with a news outlet",
                    "score": 1296,
                    "author": "Whatyoushouldask",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Especially without any concept of fairness or truth in reporting accountability. \n\n\"But this is 'murica it doesn't happen here, that's USSR, North Korea, China, Vietnam commie propaganda stuff.'\n\nhaha, yeah...it does.",
                            "score": 404,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I heard on a podcast (Storm of Spoilers actually) them discussing the deal and how in the novel Cloud Atlas (I've seen the movie, never read the book) movies in the future are all called Disneys, because Disney owns all entertainment. Seems like that is a little too close on the nose now. ",
            "score": 14698,
            "author": "ThisHappenedAgain",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn they should've found a way to keep that in the movie. I gotta read that book sometime.",
                    "score": 3806,
                    "author": "ThomYorkeSucks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"If there be any eyrie so desolate, or isle so remote, that one may there resort unchallenged by an Englishman, 'tis not down on any map I ever saw\" ",
                            "score": 1052,
                            "author": "Voidsabre",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It’s a great read. One of the best books I have ever read. ",
                            "score": 517,
                            "author": "deathbunny600",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is it as confusing as the movie? (I haven't seen the movie in years maybe it wasn't actually confusing)",
                                    "score": 189,
                                    "author": "Didactic_Tomato",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No.  The movie jumps all over the place but the book has a Russian doll type structure - the story set furthest in the past starts the book and cuts out half way through before moving on to the next story which is also cut in half and so on.  The story set in the far future is a complete narrative in the middle before moving back into the past with the remaining halves of the other stories in reverse chronological order.\n\nHope that makes sense.  But trust me, the structure is easy to follow in the book.",
                                            "score": 938,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'll try to pick it up then! I was intrigued with the movie but Jesus...",
                                                    "score": 185,
                                                    "author": "Didactic_Tomato",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "One of the things the movie failed to convey or utilize was the book's construction, and how it aided the storytelling. The stories are arranged like a Matryoshka doll—each story is nestled within its immediate predecessor, so it goes 1-2-3-4-5-6-5-4-3-2-1.\n\nThe result is a feeling like the fall of a rollercoaster throughout the whole second half of the book, as you continue going deeper and deeper into each story as the previous protagonist experiences it for themselves.\n\nSeriously, pick it up if you get a chance. I know it's still early, but I think it's a solid contender for one of the Best Fiction Novels of the 21st Century.",
                                            "score": 377,
                                            "author": "Token_Why_Boy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't think adapting that into a movie would have worked and I vastly prefer the way they did it, using clever editing to weave together scenes with similar tones and themes from different time periods.",
                                                    "score": 149,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I liked the way the movie was edited as it expressed the themes of reincarnation and past mistakes being repeated arguably better than the book managed.  But every single person I know who saw the film without reading the book said they had trouble understanding it.",
                                                            "score": 117,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Personally I didn't other than the Halle Berry plotline. Everything else was really easy to understand for me at least unless there was something I'm missing and I'm an idiot.\nEdit: to clarify I don't think there's anything wrong with not understanding it and that all sounds like a humble brag reading back. I still don't understand Arrival.",
                                                                    "score": 29,
                                                                    "author": "danny22210",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You speak the true true",
                    "score": 944,
                    "author": "munk_e_man",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wait, that's Cloud Atlas! Get outta here Neytiri!",
                            "score": 311,
                            "author": "ATCaver",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[Funhaus reference detected](https://youtu.be/WFQAnvxjwCM?t=20s)",
                                    "score": 137,
                                    "author": "Leroy_Kenobi",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Jaaake Suuuuley",
                                    "score": 27,
                                    "author": "deekofpaen"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "God damn navi, get James Cameron out of here",
                            "score": 146,
                            "author": "StalkingLlama",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Demolition Man taught me that in the future, [all restaurants are Taco Bell...](https://youtu.be/xFiDoOgRTpk)",
                    "score": 149,
                    "author": "PraxisLD",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Wow I forgot about that. The book took it a bit farther than the movie iirc. Gas was Exxon, coffee was Starbucks, any weapon was called a Colt. I definitely recommend it! Always good to be reminded that we're living in a dystopian future novel. ",
                    "score": 588,
                    "author": "jane_errant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Qtips and bandaids.",
                            "score": 362,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 206,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "All restaurants are Taco Bell.",
                            "score": 67,
                            "author": "jmsturm",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I expect movie theaters and cable/satellite providers to feel a lot of pressure. Disney has a lot of leverage for increasing what they charge. I'm prepared for prices to rise",
            "score": 11602,
            "author": "-deteled-",
            "replies": [
                {
                    "level": 1,
                    "comment": "as well as piracy",
                    "score": 7956,
                    "author": "reganomics",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hmm, what just got repeal after being lobbyed by ISPs? I'm sure there's no conflict there",
                            "score": 3770,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "piracy exists outside of america as well",
                                    "score": 2788,
                                    "author": "SocketRience",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But America's the only thing that exists in the whole universe ",
                                            "score": 4757,
                                            "author": "gabriel1313",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Its a fact. [Look at this map of the known world.](http://blog.muipr.com/wp-content/uploads/2015/05/american-globe.jpg)",
                                                    "score": 2140,
                                                    "author": "RyukaBuddy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That map is woefully inaccurate. It's missing Mexico, the only other place that exists, and where all the problems come from.",
                                                            "score": 2100,
                                                            "author": "Jenga_Police",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Don't forget North Mexico! Where the polar bears and the best breakfast food sauce comes from",
                                                                    "score": 311,
                                                                    "author": "logout_penguin",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "But Donald Trump walled that place off and it sank into the ocean because of all the immigrants who couldn't get over the wall. ",
                                                                    "score": 608,
                                                                    "author": "Greyclocks",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Piracy will continue to flourish as long as VPNs hosted in various countries function properly. It just takes a little more effort (and a small amount of money) now.",
                                    "score": 84,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They may as well just outright *buy* AMC and then we can get a good ol-fashioned Anti-trust lawsuit going!",
                    "score": 189,
                    "author": "GodFeedethTheRavens",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As an AMC shareholder.. yay!\n\nAs a lover of going to AMC theatres, boo!",
                            "score": 135,
                            "author": "Hvarfa-Bragi",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1107,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What happened with the LA Times?",
                            "score": 265,
                            "author": "MichaelMoniker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Disney banned their critics/reporters from viewing advanced copies of any of their movies due to unfavorable reviews and the times calling out their shady business dealings in Anaheim, this would hurt the times because other reviewers get to see and write their reviews while they do not. \n\n\nFortunately [Disney folded and reversed their decision due to negative press and other news papers boycotting Disney and not writing Disney reviews](https://www.nytimes.com/2017/11/07/business/disney-la-times.html), if there is one thing we can use to at least try to keep Disney from doing stuff like this is that Disney cares very much about their public image and they've spend decades trying to perfect it. ",
                                    "score": 869,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "With that much power, Disney can do stuff like this much more subtly, without hurting their public image.",
                                            "score": 226,
                                            "author": "casce",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They did a report on how Disney has been fucking over the city of Anaheim, by basically funneling most of the money that should go back to the city into their own pockets. (The parking garages that they use, for example, are technically owned by the city, but the city barely sees any of the money that they should from garages.) Disney was so upset by this article that they banned the LA Times from reviewer screenings of their movies, meaning that they couldn't write reviews of them. Thankfully, other news organizations stood by the LA Times in solidarity and I think they were told that their movies wouldn't be considered for Academy Awards. They eventually lifted the ban.",
                                    "score": 400,
                                    "author": "TheRationalDove",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just for clarity, Disney is fucking Anaheim over, but I believe they're doing it in a legal way. In the garage example, it's not like they're hiding money, but instead they pay only a dollar to lease the garages. \n\nIt's a horrible example of how a larger corporation can control a local government. ",
                                            "score": 214,
                                            "author": "zdfld",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I can completely see the age of the $20 movie ticket creeping up on us",
                    "score": 234,
                    "author": "putinspenis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Where I go in NY they average about 15, with the nicer theater being 18.50, that's not 3d or anything either those are about 25 a ticket. I see the age of the $25 normal and an upcharge for 3d.",
                            "score": 159,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "$23 Ticket for a movie last night checking in. ",
                            "score": 57,
                            "author": "WutIzDees",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now, witness the power of this fully-operational oligopoly!",
            "score": 17997,
            "author": "YabukiJoe",
            "replies": [
                {
                    "level": 1,
                    "comment": "*Mickey mouse laugh*",
                    "score": 7800,
                    "author": "ManIWantAName",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*Goofy huyucks*",
                            "score": 5807,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is how the world ends. Not with a bang, but with a huyuck.\n\nEdit: well, gawrsh thanks for the gold *huyucks menacingly*",
                                    "score": 8299,
                                    "author": "ballercrantz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[Famous last words](https://www.youtube.com/watch?v=0kAEthfslsE)",
                                            "score": 441,
                                            "author": "keithmac20",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thats pretty terrifying given the context.",
                                                    "score": 237,
                                                    "author": "ballercrantz",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You DON'T \n\n*kicks nick jonas*\n\nFUCKING\n\n*kicks him again*\n\nTALK TO ME\n\n*kicks him again*\n\nTHAT WAY ^haha",
                            "score": 865,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[From Southpark Season 13.](https://www.youtube.com/watch?v=TF4_4g1B2Ug)\n\nJeez, has it really been that long...",
                                    "score": 394,
                                    "author": "M37h3w3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah... I just watched this episode last night and was super unsettled. It's real world application is equally terrifying.",
                                            "score": 81,
                                            "author": "kittydiablo",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "YOU LITTLE\n\n*kicks him again*\n\nPIECE \n\n*kicks him again*\n\nOF SHIT ^haha\n\n*kicks him again*\n\n ",
                                    "score": 258,
                                    "author": "KenshiroTheKid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Now go out there and make me some god damn money haha\"",
                                            "score": 139,
                                            "author": "zigzi",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "YOUR JOB IS TO MAKE LITTLE GIRLS GINNIES TINGLE, BECAUSE WHEN LITTLE GIRLS GINNIES TINGLE, I MAKE MORE MONEY! ",
                                    "score": 135,
                                    "author": "deadacclaim",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ohh, I'm afraid the collusion deals will be quite operational when your anti-trust laws arrive...",
                    "score": 613,
                    "author": "Wolf6120",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They've altered the deal. Pray they don't alter it further. ",
                            "score": 277,
                            "author": "imbignate",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You say that like Disney doesn't intend to buy the U.S. Government next.\n\nSoon, Disney *will* be the Senate.",
                            "score": 257,
                            "author": "timedragon1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Actual Disney quote:\n\n*\"The Imperial Senate will no longer be of any concern to us. I've just received word that the Emperor has dissolved the council permanently. The last remnants of the Old Republic have been swept away.\"*\n\nThis is scary stuff.",
                                    "score": 284,
                                    "author": "Spider_Dude",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "*Not. Yet.*",
                                    "score": 39,
                                    "author": "livefreeordont",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's unfortunate.  Nobody thinks about little old Disney that makes cute movies from our childhood, but they've been aggressive in lobbying to make copyright more draconian and just generally screwing over progressive free speech legislation.  They're not a nice company.  ",
                    "score": 1896,
                    "author": "jerkfacebeaversucks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And they are the biggest reason the cost of cable packages going up the last 20 years with their forced bundling of channel packages to last mile providers.  While you're all pissed at the cable/dish company, Disney is laughing with a clean reputation. ",
                            "score": 490,
                            "author": "Jadaki",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't even fuck with cable anymore. Haven't for awhile. This all just furthers my resolve.",
                                    "score": 158,
                                    "author": "SoggyMcmufffinns",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Whenever I bring this up Disney/Marvel fanboys just shrug. It’s pretty much the definition of desiring entertainment more than freedom.",
                            "score": 954,
                            "author": "Thanes_of_Danes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Brave New World.. Except Disney is 1960s kid friendly. ",
                                    "score": 268,
                                    "author": "Tooneyman",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; Whenever I bring this up Disney/Marvel fanboys just shrug. \n\nThis isn't limited to fanboys at all. That's just the prevailing attitude of today. Our politicians are openly bribed. It isn't an opinion. It's factually true. We live in a time where corporations bribe those in power. If you aren't raging in the streets, then what else do you do other than shrug and live your life?",
                                    "score": 616,
                                    "author": "Levitlame",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People are just memeing about crossovers but this is really not great.",
                    "score": 154,
                    "author": "sosig_1",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I heard a rumor that Disney is in talks to buy the rights to mars, so they can have a literal Disney world.\n\nHowever, I also started the rumor.",
            "score": 6716,
            "author": "PM_Me_Your_Fortune",
            "replies": [
                {
                    "level": 1,
                    "comment": "Disney Vs SpaceX\n\nThat'll be interesting",
                    "score": 955,
                    "author": "ed_menac",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah I heard that too!\n\nJust there now, when I read your comment.",
                    "score": 118,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good ... Good ... let the hate flow through you. \n\n- Emperor Mouse",
            "score": 6063,
            "author": "TheVentiLebowski",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ha-ha",
                    "score": 868,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "POWER!! ULTIMATE POWER!! ^^ha^ha",
                            "score": 447,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can't wait for Adult Swim to pick on that. Which is the only good thing to come out of this new corporate behemoth.",
                    "score": 205,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "South Park did a riff on it",
                            "score": 136,
                            "author": "_Coffeebot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "trey parker knew all along not to fuck with [mr mouse](https://www.youtube.com/watch?v=TF4_4g1B2Ug)",
                                    "score": 83,
                                    "author": "transhumanistic",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember when there were only 3 TV networks. Showing a repeat of *Gone With the Wind* was a big deal back then.\n",
            "score": 1946,
            "author": "brunnock",
            "replies": [
                {
                    "level": 1,
                    "comment": "ABC wasn't really on par with the other two networks until the mid-seventies.",
                    "score": 282,
                    "author": "JournalofFailure",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They were the new network when I was a kid.",
                            "score": 69,
                            "author": "stopthemadness2015",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When I was a kid, in Newfoundland, Canada, we could get ABC, NBC and PBS on cable, but not CBS.  (It was channel 19, but our TV only went to 13.)  And we didn't have Fox until the early nineties.",
                                    "score": 53,
                                    "author": "JournalofFailure",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pepperidge Farm remembers.",
                    "score": 671,
                    "author": "Obversa",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Waiting for them to execute order 66",
            "score": 860,
            "author": "unguardedsnow",
            "replies": [
                {
                    "level": 1,
                    "comment": "don't worry there is a small child somewhere in the desert lands of northern africa who has been foretold to bring balance to the force",
                    "score": 424,
                    "author": "transhumanistic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Quick send Liam Neeson ",
                            "score": 137,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So now Disney essentially dictates pretty much all media that any person from 0-18 sees, right?",
            "score": 3856,
            "author": "MountandJew",
            "replies": [
                {
                    "level": 1,
                    "comment": "How much time do people 0-18 spend watching YouTube vs other sources of media?\n\n",
                    "score": 1762,
                    "author": "8604",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1824,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We've reached the point where Disney owns Epic Rap Battles of History.\n\nI've seen Blade Runner, I know where we're gonna end up.",
                                    "score": 1828,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I found that out from the Jim Henson vs Stan Lee battle. ",
                                            "score": 455,
                                            "author": "Jasontheperson",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 136,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'm owning this battle, in fact I own this whole series!",
                                                    "score": 87,
                                                    "author": "Ganterpore",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 116,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I can confirm. Most of the youtubers I follow are part of Maker Studios, thus being \"owned\" by Disney as of this year.",
                                    "score": 174,
                                    "author": "valriia",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Disney owns Fullscreen which is the biggest YouTube network so I think they're still right.\n\nEdit: It sounds like I might be thinking of Maker. Not sure though.\n\nEdit 2: Sorry guys I was thinking of Maker. My mistake.",
                            "score": 248,
                            "author": "akaTheHeater",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "AT&amp;T owns Fullscreen. Disney owns Maker Studios though so they still have a big presence on YouTube.",
                                    "score": 132,
                                    "author": "20_hundred"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m just shook at the fact that the same people who own Frozen and Moana also own Alien and Predator now.",
            "score": 6570,
            "author": "DoctorMonkeyMan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Already did it, it's called \"Lilo and Stitch\"",
                    "score": 2926,
                    "author": "CptNonsense",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is there something about Lilo I should know? ",
                            "score": 373,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She's an alien predator... she caught Stitch, who is a child alien.\n\nOr... she is a child predator, who caught an alien; Stitch.  \n\nTake your pick.",
                                    "score": 366,
                                    "author": "Xiver1972",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; she is a child predator",
                                            "score": 78,
                                            "author": "Get_magiscoped",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Crossover confirmed!",
                    "score": 1670,
                    "author": "VikingRabies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Alien versus Predator confirmed as a world in Kingdom Hearts 4",
                            "score": 1056,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Coming in 2067",
                                    "score": 484,
                                    "author": "brasco975",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Maybe sooner if Disney buys Square Enix",
                                            "score": 232,
                                            "author": "piratekingdan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Square Enix is working with Warner Bros/MGM for the upcoming Tomb Raider Film. Probably a less than likely aquisition at this point. Although, there is the upcoming Avengers video game from Square Enix, so I guess never say never. I just don't want to live in a world where Lara Croft is a Disney Princess.",
                                                    "score": 145,
                                                    "author": "Anchor689",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Then buying Warner Bros it is!",
                                                            "score": 45,
                                                            "author": "Jackamalio626",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Elsa vs. Predator",
                            "score": 171,
                            "author": "vwhaulic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel like Elsa could destroy a predator easily. She can conjure sentient beings and create ice castles in mere seconds while changing into an ice dress and letting her hair down.",
                                    "score": 265,
                                    "author": "Jerrnjizzim",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah but if she doesn't know the Predator is hunting her then the Predator can probably take her out before she can react.",
                                            "score": 139,
                                            "author": "vwhaulic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But does Elsa put off any actual heat? Would the Predator even be able to track her in her natural element?",
                                                    "score": 449,
                                                    "author": "ampillion",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "that's a really valid point in a ridiculous conversation.",
                                                            "score": 592,
                                                            "author": "monstrinhotron",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "/r/whowouldwin",
                                                                    "score": 156,
                                                                    "author": "FGHIK",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "In Predator 2 Gary Busey's team have thermal suits they think can make them invisible to the Predator, and it works until the Predator switches it's sensors from heat detection to motion detection and kills them all effortlessly",
                                                            "score": 137,
                                                            "author": "baroqueworks",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Motion sensors probably wouldn't be too useful in a blizzard",
                                                                    "score": 79,
                                                                    "author": "springthetrap",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That and the snow would make the Predator's camo not operate very well. She can see the flakes and footprints right?\n\n\nI am wondering we got a few Xenomorphs in the mix, can they take her?\n\n\n**Coming 2020, the crossover event of the decade. Alien vs. Predator vs. Elsa.**",
                                                                            "score": 62,
                                                                            "author": "suenopequeno",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well I would watch Alien vs. Stitch...",
                            "score": 125,
                            "author": "dromni",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm all for a Ducktales finds a cave full of alien eggs live action movie.  ",
                                    "score": 96,
                                    "author": "giantvoice",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Duck Tales!\n\n*Ooo-ooo-oo*\n\nDon't take off your mask or you'll get \nFacehugged",
                                            "score": 72,
                                            "author": "thwerg",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 185,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Does this mean Ripley is a Disney Princess now?  We need a Reddit discussion thread to figure out the new royalty tree.",
                                    "score": 122,
                                    "author": "reality_aholes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ripley is a not Royalty. But the facehuggers are technically the princesses of the Queen...",
                                            "score": 108,
                                            "author": "stoicsilence",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 79,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also this is the last thing I have a problem with. Most large studios produce a wide range of different movies. Why not?",
                            "score": 20,
                            "author": "zh1K476tt9pq"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So you’re saying the next special edition blu-ray for Predator will open with the Disney castle?",
                    "score": 129,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What was the whole deal about a few months ago? That Disney was forcing all theaters showing Last Jedi to keep it in theaters for two months and on their biggest screens, or else they don't get to show it at all? AND that they keep like 70% of ticket sales? Now Disney can pull even more of this shit. ",
            "score": 1273,
            "author": "baerton",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always thought  movie theatres made close to zero percent on ticket sales ",
                    "score": 443,
                    "author": "Pman90",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For the first 2 weeks or so they make hardly anything usually. Just depends. Movie theaters are a food catering business. ",
                            "score": 500,
                            "author": "t2guns",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 637,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My local theater is nice. First time I've been to it. Shitty food but the seats leaned back. \n\nGuess that makes up for it.",
                                            "score": 90,
                                            "author": "t2guns",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They should start an ISP and then throttle their content on other providers. ",
            "score": 1209,
            "author": "Nilosyrtis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Part of this acquisition means Disney now owns a stake in European ISP's.",
                    "score": 548,
                    "author": "Takeabyte",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I keep finding out about more and more shit this deal gives them. What else do they own...??",
                            "score": 333,
                            "author": "UncleSlim",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This deal keeps getting worse all the time! ",
                                    "score": 284,
                                    "author": "imbignate",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pray Disney doesn't alter it any further.",
                                            "score": 333,
                                            "author": "UncreativeTeam",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kind of ironic this is mentioned yet the fact that most of mass media is owned by a select few companies is not known by many people. The majority of main stream news is controlled by a few corporations. That should be a cause of concern yet I don't see it mentioned that often.\n\n",
            "score": 66,
            "author": "Loud_Volume",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You should look at how they treat their Disney Junior talent if you want any indication of their ruthlessness. The titular star of Doc McStuffins was hired and fired for every recording session over the two and half that she she worked for them.",
            "score": 1392,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "having some experience with the Disney machine, it is vile from the core. they are vicious raptors posing as fluffy bunnies.",
                    "score": 1063,
                    "author": "WhiteRau",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My friend did an internship at Disney in Orlando. Saw it as a way to advance her hospitality resume.\n\nShe worked as a greeter at a restaurant in the park. As in her entire job was saying hi to families and taking them to their table and then sitting and waiting for the next one.\n\nShe had no transportation, and therefore had to do all activities and eat almost exclusively through the park. Due to her wages, and the sheer ridiculousness of park pricing, she left the internship almost completely broke. Her housing for her and fellow interns was basically 3rd tier community college dorms (paraphrasing her words). \n\nSpeaking out against well... really anything about your situation or Disney in general would ensure you didn't advance in the company past that level. That's basically because all her fellow employees were cutthroat motherfuckers that would turn on people simply to show their loyalty to the company and shoot down others' chances.\n\n\nShe said that you basically had the option to subject yourself to these degrading conditions for a couple years to maybe advance a few rungs in the hospitality ladder, which help explains the vicious atmosphere between employees. \n\nI wish I was making all this up, and yes, this is a secondhand retelling, but she stood by everything, and said she's terrified of anyone who's subjected themselves to that corporate attitude for so long as to actually rise to the top.\n\nAnyways I got carried away, but yeah Disney ain't so cuddly once you peel away the surface.",
                            "score": 631,
                            "author": "lmMrMeeseeksLookAtMe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 230,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's Disney. The simple fact she was accepted for an internship there speaks on its own (as far as resumes go).",
                                            "score": 279,
                                            "author": "lmMrMeeseeksLookAtMe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 32,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 173,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I've known a ton of people who did the Disney internships and came away with the exact opposite experience. My understanding is that the Disney internships usually make people become obsessed with Disney, and some cases makes them really hate it.",
                                    "score": 87,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "*Clever mouse.*",
                            "score": 428,
                            "author": "Tokemon12574",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How ironic would it be if they became the empire.",
            "score": 523,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Mickey Mouse logo was really a silhouette of the Death Star appoaching  a pair of twin worlds all along. ",
                    "score": 366,
                    "author": "AuthenticHuman",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty soon, it will just be Amazon, Disney, and Google.\n\nOh, and probably GE, too.\n\nWhat are you guys planning for the corporation-controlled dystopian future?",
            "score": 521,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shadowrunning, mostly",
                    "score": 318,
                    "author": "Inurian59",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "And i'm sure with what happened yesterday the internet is going to be included in this somehow. ",
            "score": 287,
            "author": "qquicksilver",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well yeah, Fox owned part of Hulu, which is partially owned by Time Warner Cable, so I'd imagine (if repealing NN is evil) that TWC will make it easy with no extra cost to stream HD Hulu, and might be keen on throttling and charging for unrestricted access to Prime / Netflix.\n\nEDIT: Lots of responses and questions here! \n Honestly I was just talking out of my ass and regurgitating shit I hear elsewhere to argue with people.  No clue if any of it was true lmao",
                    "score": 162,
                    "author": "WeekendNachoSupreme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Time Warner Cable was spun off from Time Warner and TWC was purchased by Charter Communications in 2016.\n\nSo Time Warner doesn't have a stake in the ISP side anymore. While Comcast has a 30% stake in Hulu.\n\nTime Warner also only has a 10% stake in Hulu, with Disney and Fox having 30% each, but with this buyout, Disney will have a 60% majority share over Hulu.",
                            "score": 88,
                            "author": "Ygoat",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What, movies are going to get shittier, or ticket prices are going to get more expensive?\n\nFrankly, anything that drives people away from Hollywood is probably a good thing.\n\nYou know, the more you tighten your grip, the more star systems will slip through your fingers, and all that....",
            "score": 853,
            "author": "styopa",
            "replies": [
                {
                    "level": 1,
                    "comment": "The video game industry went through and Indie revolution over the last decade. Why not the movie industry?",
                    "score": 170,
                    "author": "LegacyLemur",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Distribution. Indies need to sell to Netflix, Amazon or Disney if they want people to discover their work. As Amazon and Netflix get more popular, they’re going to want bigger budgets and bigger attached names before they buy content, which blocks out a lot of indies. \n\nGoing through a smaller paid distribution service (Vimeo, for example) is possible, but then they’d need an even larger marketing budget to get the eyeballs. \n\nFestivals are cool, but jumping from success there to commercial success is like winning the lottery. \n\n\nTL;DR: There’s no Steam store for movies. ",
                            "score": 76,
                            "author": "bking",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That’s actually a fair point we are all kind of panicking over this and indie movies is probably what’s going to happen if things get as bad as everyone is thinking",
                            "score": 93,
                            "author": "Patari2600",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "because audiences demand MORE EXPLOSIONS\nand good CG is expensive",
                            "score": 75,
                            "author": "nyanlol",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also, Fox now has $50 billion to dump into their news organization. \n\nEdit: My dumb baby brain now better understands the terms of the deal. Stocks really more than some walking around cash. Thanks for the replies!",
            "score": 1624,
            "author": "aarswft",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not necessarily...\n\n&gt; agreement for Disney to acquire 21st Century Fox, including the Twentieth Century Fox Film and Television studios, along with cable and international TV businesses, for approximately $52.4 billion in stock (subject to adjustment)\n\nMy understanding is that no cash is exchanging hands in this deal. Disney also take on $13.7billion in debt from Fox.\n\nMy question is - How much of Disney will Rupert Murdoch own?\n",
                    "score": 599,
                    "author": "DPBH",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think the Guardian estimated that the Murdoch's stake in Disney would end up somewhere between 4 and 5 percent. ",
                            "score": 398,
                            "author": "Schopenhauer939",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a sweet chunk of mouse. ",
                                    "score": 406,
                                    "author": "CavalierEternals",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For reference, Steve Jobs had 7.7% of Disney and was the largest single shareholder. ",
                                            "score": 131,
                                            "author": "luke_in_the_sky",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "5% of the world? Deal! ",
                                    "score": 137,
                                    "author": "fighterace00",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 52,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "hm makes a lot more sense why Disney would want to leave netflix.",
            "score": 103,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They pretty much own Hulu.  Netflix is their competition.",
                    "score": 60,
                    "author": "AnAppariti0n",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please Lucas save us! We didn't really hate you. We just didn't like the fart jokes and endless string of lame meetings. \n\n",
            "score": 577,
            "author": "InvisibleLeftHand",
            "replies": [
                {
                    "level": 1,
                    "comment": "No we just hate all the terrible dialog. George, imagine worlds and let someone else do the talking.",
                    "score": 640,
                    "author": "lizrdgizrd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I watched the prequels recently and it really does feel like it’s just the dialogue that’s the problem. The settings and even major plot points could be extremely cool, they’re just all delivered in the worst possible way.",
                            "score": 455,
                            "author": "AnyGivenWednesday",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you just boil the prequel trilogy down to the plot points it's really got this amazing story of intrigue, temptation, loyalty, love, duty, betrayal, confusion, all that good stuff that makes for interesting and internally conflicted characters.  But they sucked, because nobody would give Lucas any usable input because my god, this guy brought us Star Wars, he's clearly a genius and how dare I try to impose my sense over his.",
                                    "score": 434,
                                    "author": "BEEF_WIENERS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or film direction.  Lucas is the definition of an idea man (a good one) who needs people with the technical to translate it to film.",
                                            "score": 183,
                                            "author": "Science_Smartass",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; because nobody would give Lucas any usable input because my god, this guy brought us Star Wars, he's clearly a genius and how dare I try to impose my sense over his.\n\nIt was worse than that, I believe, people that he trusted, like Lawrence Kasdan said 'no' when Lucas came up to him prior to Phantom Menace, just to read it and evaluate it. Kasdan just said something like 'you should do your 'vision', george'.\n\nIt felt to me that Kasdan knew very well that Lucas writing would be a trainwreck and let it happen. Maybe to teach a lesson, since he got onboard on Star Wars with JJ.\n\nLucas called Spielberg to direct Phantom Menace, and Spielberg said something like 'star wars is your thing, george'.\n\nSpielberg, when he has a good story, he would cut throats to get it. Directing Star Wars should be exhilarating for him, but said no.\n\nThe old school Star Wars artists didn't want to work with George again. Something gone horribly wrong in the Return of the Jedi production, because even Lucas was fed up with it. Whole teams were dismantled, he had his divorce with Marcia, which helped to develop the series, and Lucas would then only work with agreeable 'brand new talents'. He was never the same afterwards, making bland by-the-book products (Young Indiana Jones was so meh). Like he lost his edge there. \n\nWhen he tried to get the gang back together, they left him high and dry. \n\nThe thing is, you can never build something important alone. Even if you have billions. George is probably a very difficult person.\n\n",
                                            "score": 88,
                                            "author": "6675636B6D6500",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's a good story told really, really poorly.\n\nAt least that's what I tell myself.",
                                    "score": 78,
                                    "author": "sgthombre",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is a crossover comic where Vader fights the Aliens and its fucking awesome.",
            "score": 355,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "star wars *and x-men in the mcu! it is just as Patton Oswald foretold!",
                    "score": 190,
                    "author": "ATG77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"...it's Chewbacca's severed head!\"",
                            "score": 68,
                            "author": "brycedriesenga",
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}