{
    "id": "10jsvju",
    "score": 5,
    "title": "No big awards to put on application.",
    "author": "EsotericScientist",
    "date": 1674521682.0,
    "url": "https://www.reddit.com/r/MITAdmissions/comments/10jsvju",
    "media_urls": [],
    "other_urls": [],
    "postText": "How likely am I to go far if I don’t have many awards to show for my extracurriculars?\n\nThis is one of my dream schools and I am super interested in physics/robotics. I currently lead a research team and have cofounded a battlebots club at my school. I don’t know if this is enough, however. I participate in vex robotics, taekwondo, and have played violin for 7 years, but I don’t have significant awards to back up these interests. Im in my junior year currently and don’t have much time. What should I do?",
    "comments": [
        {
            "level": 0,
            "comment": "I had no awards. Sometimes pursuing what you love doesn't give you accolades.\n\nHeck, that's probably a free essay topic I just gave you. Have fun",
            "score": 10,
            "author": "A-Square",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is interesting to think about. What did you pursue?",
                    "score": 2,
                    "author": "EsotericScientist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was involved in the newspaper for three years, did sci-oly but only got regional awards (which mean nothing) and no state awards, and I did a lot of other stuff but just for a semester so I don't think I indicated that on my app",
                            "score": 2,
                            "author": "A-Square"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My kid (admitted EA) didn’t have any huge national awards—mostly regional or county in music and writing.\n\nDid you get into any county/regional ensembles for music?\n\nHave you tried the physics Olympiad?\n\nRobotics is awesome…make sure you submit a maker portfolio.\n\nAlso, consider what else you can do in the community with your interests and make sure you document all hours. You might be able to get a service award.\n\nIf you have a project that really excites you, you might be able to submit it to some contests.\n\nTalent is important but it doesn’t have to be big award winning displays of talent. I think the keys are passion, leadership, commitment to community…what you do isn’t as important as the motivation for why you are doing it. Are you someone who is driven to solve global challenges? Do you want to help people? What makes you tick and how have you pursued that? It sounds like you are well on your way to a good answer to these questions.",
            "score": 3,
            "author": "FlamingoOrdinary2965"
        }
    ]
}