{
    "id": "11p6qqt",
    "score": 2,
    "title": "What can I do?",
    "author": "Interesting_Bicycle5",
    "date": 1678600202.0,
    "url": "https://www.reddit.com/r/MITAdmissions/comments/11p6qqt",
    "media_urls": [],
    "other_urls": [],
    "postText": "Getting in to MIT\n\nAlright this might sound dumb or impossible to ask on Reddit, but I’m a 16 year old kid who really wants to get into MIT, I’m Canadian but have been studying for the SAT, and I have really good grades but what I’m worried about is my extracurriculars. I wanna make a difference in the world, one that helps people so I’ve started with small things like volunteering at my school, coaching volleyball and playing it and some tutoring, I’ve also participated in senior physics Olympics and placed 6th/60 in a category, but I just know it’s not enough and I thought it couldn’t hurt to ask for some help.",
    "comments": [
        {
            "level": 0,
            "comment": "Well, you can always \"do better\" but that's not helpful because not everyone at MIT is the best possible person from their school or state.\n\nWhat you're already doing is great. Anyone can get good grades or test scores, so definitely keep doing that, and then as for extracurriculars, **do what you're passionate about.**\n\nIf you have the grades / tests, then you're put into the pool of applications that are reviewed by admissions, and that's where you have to shine. So my advice is to start thinking about your essays: craft a narrative of what you're passionate about and how your experiences prove that you've pursued those passions.\n\nFor example, I was super into writing and art, so I was involved in the yearbook &amp; newspaper at my school: just an article writer for yearbook, but I climbed to Editor-in-Chief of the newspaper. And my essays talk about the fun experiences I had.\n\nSo you want to make a difference in the world by tutoring, coaching, and competing. Talk about that in your essays, get your foot in the door by doing well on tests, and you'll come into MIT!",
            "score": 3,
            "author": "A-Square"
        },
        {
            "level": 0,
            "comment": "Dog, just got accepted to MIT literally 6 hours ago, feeling unreal. \n\nYeah what he said is pretty true. I’m absolutely floored that I got in at all.  I Have a good ACT, 4.0 GPA, all that jazz, but I’m no tech wizard, or some math Olympiad— I didn’t even mention any technology stuff on my application and I applied for computer engineering… and I think that’s why I got in. \n\nInstead of tech, I talked about my passion for designing board games, my families mixed racial background, my volunteering at a summer camp, and how I designed a house of cards for a national competition (it wasn’t a card competition, it was a surface level art competition that I entered with “3D art” which was super ambitious and hard but made for an amazing engineering and persevere and essay) in my essays. \n\nMy point is: there might have been other kids with stuff like you that got rejected today, but I broke the zone that everyone else was doing. My Ecs aren’t as impressive at face value I think, but mit has a butt crap ton of kids with the impressive stuff. They need creativity and unique thingamajigs and all that razzmatazz. \n\nSo find some kooky stuff and bring it. Write essays about the narrative like bro said, and make yourself stand out as , yes, and Olympiad but also an avid birdhouse designer who has competed on a national level (can’t be that hard to find a comp to enter, right?) or something like that, idk, you’re creative.",
            "score": 3,
            "author": "oaklawanda1",
            "replies": [
                {
                    "level": 1,
                    "comment": "YOO CONGRATS MAN",
                    "score": 1,
                    "author": "Interesting_Bicycle5"
                },
                {
                    "level": 1,
                    "comment": "I know it’s not anywhere near application time for me but could I read your essay for it if you don’t mind?",
                    "score": 1,
                    "author": "Interesting_Bicycle5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks so much",
                                    "score": 1,
                                    "author": "Interesting_Bicycle5",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No prob, Bob. \n\nIf you ever wanna know more about the applying process, or mit, or anything at all really, lmk. I think you’ve got the stuff to make it happen",
                                            "score": 1,
                                            "author": "oaklawanda1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks so much man, when is the ideal time to start your admission essays?",
                                                    "score": 1,
                                                    "author": "Interesting_Bicycle5",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So I started mine during the summer, and when I say that I mean I stared at a blank google doc for a few hours and watched mit vlogs. I was in my schools marching band, and we practiced mondays Tuesdays thursdays and Fridays from 4:30-8 after school from July to November, with comps on weekends, so I had literally no time to write during these months. It was worth it tho to do band. \n\nI ended up GRINDING during winter break. I mean I threw away december for this man. I came home every day and wrote essays and tweaked and fine tunes and rewrote and sent out and got feedback for weeks. I left the house twice during all of winter break. I know that sounds bad, and I kinda regret it, but I got in so it’s worth it. My motivation the entire time was “I really Want this, and I did not put in all of this time and sweat and effort to give up now because it seems hard!” And I GRINDED, dude. Those essays? That’s like at least the 7th version or later of each one. My dad would review what I had done every night and k would work on making edits on til late, then wake up and work til he got home from work, then repeat. \n\nI know it sounds rough, and it really was. It was an unhealthy work schedule (I HIGHLY recommend using pomodoro method of studying: it’s a website called pomofocus.something and it’s basically a work 25 minutes, 5 minute break timer. I used that thing an insane amount. \n\nBut to answer your question, it’s never too early to start I think. Having anything going into app season is better than nothing. Of course, you can rewrite stuff whenever you feel like it’s not showing you",
                                                            "score": 1,
                                                            "author": "oaklawanda1",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And that’s another thing: show the real you. I can explain more later about it, but be the real you. Don’t fabricate what you think they’re wanna see. Be the whole some you and try to show the best image of what you actually are. Be real, fam.",
                                                                    "score": 1,
                                                                    "author": "oaklawanda1",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thanks so much man, will for sure take everything into account when the time comes and I’m always open to any advice you’re willing to share",
                                                                            "score": 1,
                                                                            "author": "Interesting_Bicycle5"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, thanks so much!",
            "score": 1,
            "author": "Interesting_Bicycle5"
        }
    ]
}