{
    "id": "m7ta3l",
    "score": 4,
    "title": "I'm in 9th grade and from the U.K.",
    "author": "[deleted]",
    "date": 1616081260.0,
    "url": "https://www.reddit.com/r/MITAdmissions/comments/m7ta3l",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm in 9th grade and I'm I have my eyes set on MIT. Though I do know I will have to be applying as an international applicant. \n\nI know that the competition for undergraduate (especially for international students) is notoriously tough.\n\nI have a few questions:\n\nWhat score should I be aming at on my SAT? \n\nDo my GCSEs matter?\n\nWhat should I do to boost my chances of getting in? \n\nI am planning to start a YouTube channel for fun about science etc, would that help at all?\n\nI believe that in the UK it is much easier to get accepted compared to places like India. But there are a lot of people smarter than me.",
    "comments": [
        {
            "level": 0,
            "comment": "Assuming MIT goes back to requiring SATs after this year, their 25th percentile is around 1500. This means if you have below that your SAT is probably gonna be a liability on your application.\n\nBut know a high SAT doesn't guarantee you anything at a place like MIT. I applied with a 1560 and a 4.0 gpa this year and got rejected. I've seen other people on here who applied with 1590 and got rejected.",
            "score": 1,
            "author": "Wallabemine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea the time I apply they are going to require SAT. What SAT subjects should I choose for MIT?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "MIT doesn't accept subject tests anymore. They made the Decision last year that going forward they wouldn't consider them in their admissions decisions.\n\nhttps://mitadmissions.org/blogs/entry/a-special-announcement-about-sat-subject-tests/",
                            "score": 1,
                            "author": "Wallabemine",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Strange. I emailed the admission office and they said that they require SAT admission post covid and they won't be removing it for next year's applications.\n\nAlso in the article you linked they said that they will no longer include the SAT in their admission process but In the next paragraph it they state that they will continue to require SAT or ACT. Is their something I'm missing here?",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There's one test that's just called the SAT. This test is math and English. Then there are tests called SAT subject tests. MIT used to have both the SAT AND SAT subject tests (which are each on one specific subject: math, physics, etc.) in their admissions process. Going forward they will just have the SAT.",
                                            "score": 1,
                                            "author": "Wallabemine",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I see thanks for clarifying this.",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's ok. When you asked what subjects you should take I assumed you were asking what SAT subject tests you should take.\n\nThe SAT is just one long test that is just math and English. If you want to do well in it I highly recommend signing up to khan academy and learning through the test there. \nTake as many practice tests as you can.",
                                                            "score": 1,
                                                            "author": "Wallabemine"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey one thing I noticed in the recent times is that college board is completely removing SAT subject terms and going for AP tests.  \nSAT is also getting a makeover due to the current covid situation and I think it'll continue after that too  \nJust check this video once\n\n[https://www.youtube.com/watch?v=TWpyL3U8GFE](https://www.youtube.com/watch?v=TWpyL3U8GFE)  \n\n\nThought I'll just let you know",
            "score": 1,
            "author": "IcecreamMan_1006",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks. Sorry for late reply",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No no it's okay",
                            "score": 1,
                            "author": "IcecreamMan_1006"
                        }
                    ]
                }
            ]
        }
    ]
}