{
    "id": "rjkwg3",
    "score": 15,
    "title": "A tough rejection",
    "author": "StatisticianFew7205",
    "date": 1639874993.0,
    "url": "https://www.reddit.com/r/MITAdmissions/comments/rjkwg3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was rejected in early action and I have no idea why I was not al least deffered. I am an international student with 1570 SAT,  7.5 IELTS and a great interview. Moreover, I have developed a few apps which were downloaded more than 1.5 million times all over the world. I feel like I have no chances of being admitted to any university and I completely lost my motivation for giving the best of myself every day😥",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah, it's pretty tough for international students. I'm an international student too from a prestigious high school, a 1550 on the SAT ,a 43/45 Predicted grade for the IB, good ECs and I was also rejected.\n\n&amp;#x200B;\n\nI think its damn cutthroat.\n\n&amp;#x200B;\n\nAlso, don't lose hope and motivation. I looked at this rejection with a certain perspective which I think may help everyone rejected:\n\n* You gave your 100%. Be proud of your effort and growth\n* You're achievements aren't going away with this rejection. You're still the person you were a week back! Be proud and look forward to the future\n* It's MIT's loss that they couldn't admit you. If you're feeling particularly unhappy or vengeful - make sure mit regrets rejecting you\n\nAnd lastly, just a reminder that don't lose hope. There's always something good you can do - irrespective of which uni you end up going to. In the long run, personal drive is what makes the biggest difference so make sure you don't lose that drive and hunger",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I Guess they just didn’t deferred us, internationals.",
            "score": 2,
            "author": "Juannnm_"
        },
        {
            "level": 0,
            "comment": "Don't don't feel bad about it!!! MIT is especially tough to internationals compared to other schools... It does NOT reflect on you as a person. I'm sure you'll get into somewhere great!",
            "score": 2,
            "author": "DankKing256"
        },
        {
            "level": 0,
            "comment": "I’m an international student from Vietnam with 111 TOEFL, 1470 SAT and was deferred. For me my stats is not as impressive as many of you guys, and it really shows that the process does not reflect your abilities and chances at other colleges too! I don’t think I’ll be accepted in Regular action, but I’m sure we’ll be able to find the school that is the best fit for us!",
            "score": 4,
            "author": "diamonddang"
        },
        {
            "level": 0,
            "comment": "Keep in mind they can only admit about 10% of their student body as international. If I recall this makes for about 1 in 50 internationals being admitted, probably last year and this year even less. What I'm saying is that it has *absolutely nothing* to do with you or your potential to do amazing things in your country or any country and throughout the world. Keep up the good work and remember that college should never be the end goal, only an aid to accomplish whatever you plan to do in life.",
            "score": 0,
            "author": "adriannow"
        },
        {
            "level": 0,
            "comment": "Me too. Where are you from?",
            "score": 1,
            "author": "Pascortium234"
        },
        {
            "level": 0,
            "comment": "I'm also an international and have only got 1480 on my sat and got deferred l. I really have no idea what's happening.",
            "score": 1,
            "author": "Alexbouret"
        },
        {
            "level": 0,
            "comment": "Hey is it because that you didn’t write your essays well? I have a friend who was rejected in EA last year and was a national scholar of Poland who had built a solar aircraft as well. He ended up going to UPenn’s double degree program with Wharton and Engineering school called M&amp;T. So don’t lose hope!!",
            "score": 1,
            "author": "Material-Confusion33"
        },
        {
            "level": 0,
            "comment": "Similar here. 1560 SAT and 114 TOEFL. National Physics and CS awards with research with top unis in my country and BU. NPO that worked with the national government. Student ambassador and MUN\n\nI guess it’s probably because we are internationals, which make things a lot worse. Also this year if you are from China/ Taiwan, things probably go bad. 50% less admitted students in early rounds",
            "score": 0,
            "author": "Expert-Fun4159",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where did you hear the news about 50% decrease in students from China/Taiwan?",
                    "score": 1,
                    "author": "Pascortium234"
                },
                {
                    "level": 1,
                    "comment": "What is the source of this statement: \"Also this year if you are from China/ Taiwan, things probably go bad\"?",
                    "score": 1,
                    "author": "ArghBH",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was from a lot of sources my counselor, my friend at a counseling company, Crimson, etc",
                            "score": 1,
                            "author": "Expert-Fun4159",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why would China/Taiwan be lumped together?",
                                    "score": 1,
                                    "author": "ArghBH",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Idk. I’m from Taiwan and it confuses me a lot. However this has been factual since last year, and this year was just even worse",
                                            "score": 1,
                                            "author": "Expert-Fun4159",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ok; just wondering if you had a reliable source from MIT Admissions (otherwise this is all hearsay). You say \"factual\", but without actual proof, it's hardly fact.",
                                                    "score": 2,
                                                    "author": "ArghBH"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "tbh i don't even know what i expected. if you don't have ISO gold medals and published research you stand practically no chance as an international",
            "score": 0,
            "author": "[deleted]"
        }
    ]
}