{
    "id": "144cert",
    "score": 491,
    "title": "White House says it is still assessing origin of Kakhovka dam destruction, but Russia ultimately to blame",
    "author": "KI_official",
    "date": 1686238367.0,
    "url": "https://www.reddit.com/r/worldnews/comments/144cert",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "On Tuesday the US said that they would publish evidence that points to Russia being responsible. Have they released it yet?\n\n&gt; However, two U.S. officials and one Western official earlier told NBC News that the U.S. has intelligence that is leaning toward Russia as the perpetrator of the attack. U.S. officials were working to declassify some of the intelligence and share it as early as Tuesday afternoon.\n\nSource: https://www.nbcnews.com/news/world/live-blog/khakovka-dam-live-updates-ukraine-russia-blew-up-kherson-rcna87855",
            "score": 10,
            "author": "green_flash"
        },
        {
            "level": 0,
            "comment": "You telling me Ukrainian super soldier didn't infiltrate the dam under Russian control and detonate hundreds of kg of explosives? Unbelievable.",
            "score": 47,
            "author": "usmcBrad93",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's not what the article says. The WH is saying they don't actually have evidence Russia blew the dam up themselves. Then the WH proceeded to esswntially say that even if Russia didn't carry out the attack its still their fault because they were illegally occupying it at the time of destruction.\n\nAlso a side not, you dont need to infiltrate a dam to blow it up, a good example is the very famous WW2 dam busting raid carried out by the RAF where pilots skipped bombs off the water into the dam destroying it.",
                    "score": 29,
                    "author": "Brownbearbluesnake",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Also a side not, you dont need to infiltrate a dam to blow it up, a good example is the very famous WW2 dam busting raid carried out by the RAF where pilots skipped bombs off the water into the dam destroying it.\n\nI've heard about the dambusters twice in this context and I'm already fed up with it. Preparations went on for over a year, it took special equipment and training, and they still weren't particularly successful. Plus it's a little much to compare a WWII special operation with Ukraininan bombers that aren't even flying and even if they were they don't have the weapons, and even if they did, there were no air raids going on.",
                            "score": 2,
                            "author": "medievalvelocipede",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I only used as an example to show that it is possible to destroy a dam in that manner, wasn't trying to suggest its something Ukraine actually did",
                                    "score": 1,
                                    "author": "Brownbearbluesnake"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Those bombs weighed like 4000kg. The largest modern bombs are something like 500kg. We don’t have anything like that anymore",
                            "score": 8,
                            "author": "chris_paul_fraud",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Laughs in GBU-43/B. I know Ukraine doesn't have them and the US made them for one particular use. But its 11,000kg.",
                                    "score": 8,
                                    "author": "Ksp-or-GTFO",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I recommend using gbu-57a/b mop instead. It's \"only\" 14,000kg.",
                                            "score": 3,
                                            "author": "dead97531"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "US B-21 support raids for Ukraine when?",
                                            "score": 5,
                                            "author": "chris_paul_fraud"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "4200kg in a 60 inch diameter cylinder with a hydrostatic fuse.\n\nBut It’s world war 2 tech, it wouldn’t take any time to make. I suspect it would not need to weigh quite as much by using modern explosives -but I’m no explosives expert so maybe that’s wrong.\n\nIt couldn’t be airdropped without modifying current hardware (if at all) but there are other ways to deliver a barrel full of explosives to the base of a dam.",
                                    "score": 2,
                                    "author": "Isopbc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, ww2 planes are known for being sturdy beasts, some that had been in museums are sometimes cleaned and oiled and had shown that they can still fly.\n\nOn other hand, wouldn’t a missile launched from a tank or truck do the same nowadays?",
                                            "score": 2,
                                            "author": "Kurarashi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The bouncing bomb was designed to sink once it reached the dam so it would have the additional water pressure to break the dam.\n\nCould the same be achieved by a bunker buster missile? I’m not sure, concrete penetration is far advanced today compared to the 40’s. My gut says it’s too much though and it would still need to be underwater to break the dam.\n\nIn which case a missile probably wouldn’t work. A torpedo might, I don’t know if they had a net set up or not at the dam in Ukraine. \n\nMy personal choice for delivery method would be using divers and a mini sub to place the bomb right against the base of the dam.",
                                                    "score": 1,
                                                    "author": "Isopbc"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm not basing my sarcastic comment solely on the article, but basing it on the advantage destroying the dam offers Russia as it likely slows down a Ukrainian counter offensive, if not making several of their planned areas of attack impossible to traverse for some time.\n\nThey likely planned for this contingency, but it's still not ideal for Ukraine.\n\nhttps://www.google.com/amp/s/www.nbcnews.com/news/amp/rcna87879",
                            "score": 2,
                            "author": "usmcBrad93",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn hadn't seen that article before. After reading it I actually am starting to think it really could've been caused by the comination of poor maintenance and letting the water level get to high",
                                    "score": 2,
                                    "author": "Brownbearbluesnake",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; letting the water level get to high\n\nGiven that Russia intentionally got the water level that high...",
                                            "score": 6,
                                            "author": "ChanceryTheRapper"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Russia raised the water levels to an all-time high, and wrote a new law forbidding investigations of hydraulic structures days before the damn was destroyed. Hmmm",
                                            "score": 3,
                                            "author": "usmcBrad93"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You expect anyone here to read the article and not just respond to the headline?",
                            "score": 1,
                            "author": "Marcus_McTavish"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Captain Ukraine^TM",
                    "score": 2,
                    "author": "Funkit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This language used is similar to when that Ukrainian missile landed in Poland and killed two people. Evasive statements at first but saying it never would have happened without a war being started in the first place.",
            "score": 29,
            "author": "Tashre",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not really, this time Ukraine has receipts. Russian armor were warned to evacuate in intercepted communications",
                    "score": 16,
                    "author": "a-really-cool-potato"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Regardless of what happened, could be literally anything, just a total fuck-up on either side, only one country brought war to this region and has the moral responsibility for any destruction that happens there: Russia.",
            "score": 12,
            "author": "BlueHighwindz",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;could be literally anything, just a total fuck-up on either side\n\nYou misspelled \"Russia\".",
                    "score": 8,
                    "author": "JumpyFail5461"
                },
                {
                    "level": 1,
                    "comment": "Yeah how dare Ukraine fuck up by being invaded!",
                    "score": -2,
                    "author": "Spreckles450"
                }
            ]
        },
        {
            "level": 0,
            "comment": "America, with Mel Blanc's voice: I don't know how ya's done it ***but I know YA'S DONE IT!!!***",
            "score": 2,
            "author": "Sharp-Dark-9768"
        },
        {
            "level": 0,
            "comment": "It's pretty obvious now that it was mined. There are unexploded mines washing up on shore just downstream of it (and detonating), and several videos of such.\n\nThe volume of explosives really practically removes the possibility of a stealth/UDT attack just from a weight perspective. You can, however, just dump a shitload of mines over the side of the dam on a timer...",
            "score": 1,
            "author": "hawkeye18"
        }
    ]
}