{
    "id": "1459j3c",
    "score": 3844,
    "title": "Iceland to Suspend Embassy Operations in Russia",
    "author": "AirbreathingDragon",
    "date": 1686327428.0,
    "url": "https://www.reddit.com/r/worldnews/comments/1459j3c",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Proud of my government for this.\n\nMost of us would have preferred the tone of the message to be harsher, but in terms of international relations \"we really don't want you here, could you please go away\" is probably as good as it's going to get. For now.",
            "score": 320,
            "author": "burpten",
            "replies": [
                {
                    "level": 1,
                    "comment": "Setting a precedent for suspending diplomatic operations in Russia (but not outright cutting ties) is quite plenty in of itself, especially if it compels other countries to follow suit.\n\nNot to mention that Iceland has historically been on good terms with Russia, which lends this decision more weight.",
                    "score": 95,
                    "author": "AirbreathingDragon"
                },
                {
                    "level": 1,
                    "comment": "Iceland always stands for what's right. We Lithuanians still remember that you were the first ones to recognise us as an Independent country. So small yet so brave ❤",
                    "score": 120,
                    "author": "lithuanian_potatfan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, thank you! I think the recognition of the Baltics did a lot to establish our identity as a young democracy at the time. In a good way. In a way, you made us what we are. So cheers to you!",
                            "score": 75,
                            "author": "burpten",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is such a wholesome comment chain, like a breath of fresh air, I love it.",
                                    "score": 44,
                                    "author": "oathark"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Please Lithuania, shut down Russian trains. Don't let em ram through your rails",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not allowed by the EU. If we as much as changed the tracks to European gauge the EU would nuke us economically.",
                                    "score": 6,
                                    "author": "lithuanian_potatfan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just pull a leaf out of Russia's book and shut them down for \"maintenance\" all the time.",
                                            "score": 7,
                                            "author": "Exovian"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I faintly remember that the EU tried to do something I proposed but after fake russian threats immediately retreated. To say that it was sad to witness is to understate",
                                            "score": 2,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Why? Nobody needs those rails. Rip them out.",
                                            "score": 1,
                                            "author": "Iapetus_Industrial"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Dude u ruined it...",
                                    "score": -2,
                                    "author": "oathark"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As I remember from my short time living in Iceland, you as a people are polite, almost Canadian polite 😉, so the message was on point",
                    "score": 10,
                    "author": "Sharchir"
                },
                {
                    "level": 1,
                    "comment": "“ I’m sorry Russia, you had a couple of decades to learn how to sit at the adults table, it’s not me, it’s you",
                    "score": 2,
                    "author": "Dropped-pie"
                },
                {
                    "level": 1,
                    "comment": "You should be. Good for you guys!\n\nI wish my government would follow your lead but I  bet it never will.",
                    "score": 1,
                    "author": "Allemaengel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Iceland only has 18 embassies?",
            "score": 32,
            "author": "mixduptransistor",
            "replies": [
                {
                    "level": 1,
                    "comment": "And there are only 14 embassies in Iceland, + small population = Few diplomats\n\nThus the government is very selective about where it chooses to have embassies, prioritizing those with strong trade and political ties. They're also reciprocal, so if the Netherlands or Spain or Italy were to establish an embassy in Iceland then it would respond in kind, alas...",
                    "score": 46,
                    "author": "AirbreathingDragon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, embassies are expensive, and if they aren’t accomplishing much, they can be hard to justify.",
                            "score": 22,
                            "author": "EqualContact",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wonder why countries don't do embassy co-op? Smaller countries can use a portion of other countries facilities. Yes state secrets blah blah, but for some countries like Iceland, it might make sense.",
                                    "score": 2,
                                    "author": "gaukonigshofen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Idk about embassy roommates, but countries do sometimes represent other countries when they have no representation in that country. For instance, there is no US embassy in Iran. There is a 'United States Interests Section' in the Swiss embassy. The Swiss act on USA's behalf in Iran.",
                                            "score": 12,
                                            "author": "RousingRabble"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They sometimes do.\n\nThe Icelandic embassy in USA is inside the Swedish one for example.\n\nIn other countries they just have a consular office, so not as expensive and can be run in a co-op.",
                                            "score": 5,
                                            "author": "legbreaker"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well, if you are a EU citizen, you can go to the embassy of any EU country and they have to help you. So in a way, it's big embassy co-op.",
                                            "score": 6,
                                            "author": "HelloThere_1138"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Think Canada does do this with UK in a couple places.  Basically have a desk inside the British embassy.",
                                            "score": 2,
                                            "author": "Zonel"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Iceland's embassy in Helsinki handles the Baltic countries as well as Finland... I think most Icelandic embassies handle multiple countries",
                                            "score": 1,
                                            "author": "PrumpuBuxni"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I see we have one here in Helsinki. If I went there do you think I could have a bottle of Brennivin?",
                            "score": 2,
                            "author": "noetkoett"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They likely just don’t have enough of a relationship with most countries. \n\nInstead they’ll have interest sections in the embassies of other countries. \n\nMy guess is probably Sweden, Denmark, or Norway is their choice to host their interest sections in countries where it doesn’t make sense to have an embassy.",
                    "score": 7,
                    "author": "UselessInsight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, Nordic countries in general have a lot of co-operation between embassies, so Iceland will rely on other Nordic embassies in areas where it doesn't have representation.",
                            "score": 5,
                            "author": "harassercat"
                        },
                        {
                            "level": 2,
                            "comment": "List of cities with Iceland embassies: \n\nVienna, Brussels, Ottawa, Beijing, Copenhagen, Paris, Berlin, New Delhi, Tokyo, Oslo, Warsaw, Moscow (RIP), Stockholm, London, Washington DC. They also have embassies in Uganda and Malawi which I’m curious about",
                            "score": 1,
                            "author": "zachzsg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;They also have embassies in Uganda and Malawi which I’m curious about\n\nThose are due to Iceland's developmental cooperation with the two countries, and also to service Icelanders in Africa more generally.",
                                    "score": 3,
                                    "author": "AirbreathingDragon"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good. I hope more countries follow suit",
            "score": 19,
            "author": "Adraco4"
        },
        {
            "level": 0,
            "comment": "Tók sinn tíma enn þetta tókst ❤🇮🇸🇺🇦",
            "score": 72,
            "author": "TheIntellekt_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love that as a Norwegian I can kinda understand some of this and then not have a clue about the rest. ‘Tók sinn tima’ I’m guessing is ‘Tok sin tid’ (Norwegian)/ ‘Took its time’ (English)?",
                    "score": 19,
                    "author": "Cohibaluxe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Took its time but we did it”",
                            "score": 14,
                            "author": "oliprik",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Verbatim “ took its time but it took”",
                                    "score": 3,
                                    "author": "Truthb0mber"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good. No point in dealing with liars who will only use you for personal gain anyway.",
            "score": 11,
            "author": "FM-101"
        },
        {
            "level": 0,
            "comment": "Iceland ftw!",
            "score": 22,
            "author": "Dazzling_Ad8519"
        },
        {
            "level": 0,
            "comment": "put those operations on ice",
            "score": 45,
            "author": "Fresh_wasabi_joos",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's cold..",
                    "score": 13,
                    "author": "RU4realRwe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They instituted a freeze on that relationship",
                            "score": 9,
                            "author": "Initial-Rope",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Iceland doesn't get snowed by anyone.",
                                    "score": 4,
                                    "author": "Allemaengel"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's going to have a chilling effect",
                                    "score": 1,
                                    "author": "nomofica"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone tell me something terrible the Icelandic government or people have done in the last few decades.  I only seem to hear positive information about them.  There has to be some dirt somewhere.",
            "score": 4,
            "author": "BoldestKobold"
        },
        {
            "level": 0,
            "comment": "You know you’ve fucked up hard when even ICELAND suspends their embassy. Icelanders are some of the nicest and cool headed people.",
            "score": 3,
            "author": "Dan-the-historybuff"
        },
        {
            "level": 0,
            "comment": "Thank you Iceland. you guys are amazing",
            "score": 3,
            "author": "aridiculousmess"
        },
        {
            "level": 0,
            "comment": "Way to go, Iceland.  If a few more countries follow suit it will infuriate Putin's ego.",
            "score": 2,
            "author": "macross1984"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": " за рішення Ісландії призупинити роботу посольства в Москві та звернутися до Росії із запитом про обмеження роботи її посольства в Рейк'явіку. Росія має бачити, що варварство веде до повної ізоляції. Я закликаю інші держави наслідувати приклад Ісландії.",
            "score": 4,
            "author": "Leikita",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree, Iceland has the right idea here and other nations should follow.  Isolate Moscow from the world stage since they constantly act in bad faith.",
                    "score": 26,
                    "author": "SlothOfDoom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it is simple to realise that’s what he wants though, soviet union was also pretty isolated, limited trade also helps propaganda and false information spread, so it’s a double-edged blade",
                            "score": 4,
                            "author": "secusse"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's insane to watch world relations crumble like this. \n\nWe're living in the preface to a dystopian themed novel.",
            "score": 3,
            "author": "iamelloyello",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah. We're living in the preface to our future. And it's bright, I think :).",
                    "score": 16,
                    "author": "burpten"
                },
                {
                    "level": 1,
                    "comment": "“Crumble like this” bro world relations are pretty great all things considered, shit was way worse from basically the 2010s to the dawn of man.",
                    "score": 3,
                    "author": "General_Industry4619"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everyone else has no balls",
            "score": 2,
            "author": "Few-Ability-7312"
        },
        {
            "level": 0,
            "comment": "We should never suspend Embassy operations in another country unless it means war.",
            "score": -7,
            "author": "psilon2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;We should never suspend Embassy operations in another country\n\nCountries do it all the as cost cutting measures. A small nation like Iceland doesn't have the resources to waste on an expensive but empty embassy.",
                    "score": 3,
                    "author": "Kingofearth23"
                },
                {
                    "level": 1,
                    "comment": "It is war though",
                    "score": 5,
                    "author": "Ithrazel"
                },
                {
                    "level": 1,
                    "comment": "Well, russians say they are at war with \"the West\", or with NATO, or with the USA, basically with the big chunk of the world. Seems reasonable to me to cut them off by these countries.\n\nAlso these c*nts deserve much worse than embassy closure for what they do to my country.",
                    "score": 2,
                    "author": "RegularStain"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Iceland's decision to suspend embassy operations in Russia is likely due to political tensions between the two countries. It's not uncommon for nations to take diplomatic actions in response to disagreements or conflicts with other nations. However, this move may have potential consequences and could negatively impact the relationship between Iceland and Russia.",
            "score": 1,
            "author": "-Omichael"
        },
        {
            "level": 0,
            "comment": "Good. Now do China. Also suspend ALL trade with China now.",
            "score": -1,
            "author": "Itchy_Feedback9275"
        },
        {
            "level": 0,
            "comment": "The ladder going to Sportacus's blimp retracts into the ship and it departs.",
            "score": 1,
            "author": "AnthillOmbudsman"
        },
        {
            "level": 0,
            "comment": "Out of curiosity, how difficult is it for a country to pack up and leave their embassy building during a conflict like this? I can image Russia getting pissed off at the decision and trying to sabotage or attack the embassy members. Would they even get a flight out of the country without Russia stepping in? I know it wouldn’t benefit Russia in the slightest to get involved but we know how spiteful and petty they are.",
            "score": 1,
            "author": "GET_IT_UP_YE"
        },
        {
            "level": 0,
            "comment": " Awesome. \n\nI know where my family is doing it’s shopping from now on!",
            "score": 1,
            "author": "J4MES101"
        },
        {
            "level": 0,
            "comment": "För helvette island, skulle vart stängd för länge sen.",
            "score": -2,
            "author": "al_pacappuchino",
            "replies": [
                {
                    "level": 1,
                    "comment": "...Du inser att ambassaden här i Sverige (tyvärr) fortfarande är öppen va...?",
                    "score": 3,
                    "author": "walkingbartie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Faktiskt inte. Men Fan vad ruttet, bara bränn ner skiten.",
                            "score": 1,
                            "author": "al_pacappuchino"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really? Iceland is shutting down in Russia? Well now the shits about to go down!",
            "score": -9,
            "author": "Aggravating-Issue915",
            "replies": [
                {
                    "level": 1,
                    "comment": "When Iceland recognized the independence of the Baltic states in 1991, the Soviet Union collapsed shortly after....",
                    "score": 8,
                    "author": "Ithrazel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great.\n\nWhat about that free trade agreement that keeps the Ukranian economy running? Vastly more important for them.\n\nNope, sorry - too much of a hassle. Our government is a disgrace, sorry Ukraine.",
            "score": -11,
            "author": "Jarri88"
        },
        {
            "level": 0,
            "comment": "They haven’t yet?",
            "score": -6,
            "author": "gsxrfrost"
        },
        {
            "level": 0,
            "comment": "Now close the Chinese one as well.",
            "score": -2,
            "author": "BadEmbarrassed3334"
        },
        {
            "level": 0,
            "comment": "Wait, Russian Embassies have supermarkets?\n\n/s",
            "score": -1,
            "author": "Jhyrith"
        },
        {
            "level": 0,
            "comment": "Took them long enough",
            "score": 0,
            "author": "thebobsalad"
        }
    ]
}