{
    "id": "1460okk",
    "score": 679,
    "title": "Indigenous groups turn to Brazil’s highest court to stop police violence",
    "author": "newnemo",
    "date": 1686404728.0,
    "url": "https://www.reddit.com/r/worldnews/comments/1460okk",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;Brazil’s largest coalition of Indigenous groups has filed a motion with the country’s highest court in response to escalating police brutality against Indigenous peoples in the state of Mato Grosso do Sul.\n\n&gt;In the first seven months of 2022, 759 violent incidents with police were recorded, involving a total of 113,654 families and 33 killings in land-related conflicts in rural areas of the country, marking a 150% increase from the first six months of 2021.\n\n&gt;Most cases of violence are tied to disputes over non-demarcation lands; Indigenous peoples, attempting to reclaim their ancestral territory, often run into conflicts with landowners, such as farmers or developers, which end in forceful police interventions.\n\n&gt;The Indigenous coalition is requesting the installation of GPS equipment and recording systems on security officers’ uniforms and vehicles, as well as measures aimed to improve their training and public protocols to protect human rights.\n\narticle continues...",
            "score": 16,
            "author": "newnemo"
        },
        {
            "level": 0,
            "comment": "This is the best tl;dr I could make, [original](https://news.mongabay.com/2023/06/indigenous-groups-turn-to-brazils-highest-court-to-stop-police-violence/) reduced by 95%. (I'm a bot)\n*****\n&gt; Indigenous groups are seeking urgent measures against the escalation of police violence they face in seeking to reclaim their ancestral lands in Brazil&amp;#039;s Mato Grosso do Sul state.\n\n&gt; The Articulation of Indigenous Peoples of Brazil, the country&amp;#039;s largest coalition of Indigenous groups, recently took the issue to the Supreme Federal Court, seeking the adoption of measures to tackle police brutality and misconduct by the state military police.\n\n&gt; The Observatory of the Criminal Justice System and Indigenous Peoples, an Indigenous civil society organization, published a statement calling the police operation illegal.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/14610r5/indigenous_groups_turn_to_brazils_highest_court/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~688455 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Indigenous**^#1 **people**^#2 **police**^#3 **land**^#4 **state**^#5",
            "score": 3,
            "author": "autotldr"
        }
    ]
}