{
    "id": "147tvlg",
    "score": 3792,
    "title": "Billion-year-old rocks reveal traces of ancient life | CNN",
    "author": "Caratteraccio",
    "date": 1686594201.0,
    "url": "https://www.reddit.com/r/worldnews/comments/147tvlg",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "On July 1st, a [change to Reddit's API pricing](https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/) will come into effect. [Several](https://www.reddit.com/r/apolloapp/comments/144f6xm/apollo_will_close_down_on_june_30th_reddits/) [developers](https://www.reddit.com/r/redditisfun/comments/144gmfq/rif_will_shut_down_on_june_30_2023_in_response_to/) of commercial third-party apps have announced that this change will compel them to shut down their apps. At least [one accessibility-focused non-commercial third party app](https://www.reddit.com/r/DystopiaForReddit/comments/145e9sk/update_dystopia_will_continue_operating_for_free/) will continue to be available free of charge.\n\nIf you want to express your strong disagreement with the API pricing change or with Reddit's response to the backlash, you may want to consider the following options:\n\n1. Limit your involvement with Reddit, or\n2. Temporarily refrain from using Reddit\n\nas a way to voice your protest, specifically on June 12 and June 13, the days of the planned protest.\n\nWhile we acknowledge that some subreddit moderators have made the decision to take their subreddits private, we ultimately do not believe it is our place as moderators to impose such a decision on all users of this community. \n\nWe respect your right to make your own decision.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/worldnews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "As I understand it, a fecundity of biomarkers (called eukaryotes) dating to 1.6 billion years ago has revised the previous belief that they had not been ecologically significant until 800 million years ago. \n\nLast week (?), the discovery that an early non-human species buried its dead and marked the burial sites with unique petroglyphs, nearby, has altered our understanding of when and how they lived. Our timeline keeps adjusting backwards for when and how life began on our planet. That’s fairly thrilling! \n\nReminds me of when I learned dinosaurs had feathers and are closely related to modern birds. I was a grownup, and that is the opposite of the reptilian scaled monsters they taught when I was a kid. Legit blew my mind to learn my knowledge base had outdated information. \n\nNow, I love it!! Such an interesting time to be alive.",
            "score": 713,
            "author": "SlinkySlekker",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you know the name of the newly discovered species? I can't find anything.",
                    "score": 90,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s on me. My sentence structure was all messed up.\n\nIt was Homo naledi (identified in 2013).\n\nThe new discovery was that they buried their dead and made petroglyphs. The new discovery altered our understanding of their abilities and timeline. \n\n“A team of explorers has uncovered evidence that Homo naledi buried their dead and carved symbols on cave walls at least 100,000 years before modern humans.\n. . . \n\nOn the walls above the burials, the team also spotted symbols deeply engraved in the hard rock, showcasing crosses, hashtag-like symbols and other geometric shapes.\n\nIt’s the first time such meaningful behaviors have been observed in a nonhuman species. H. naledi had a brain about one-third the size of a human’s, causing scientists to question whether Homo sapiens are truly exceptional for having such big brains.”\n\nhttps://amp.cnn.com/cnn/2023/06/10/world/homo-naledi-science-newsletter-wt-scn/index.html",
                            "score": 222,
                            "author": "SlinkySlekker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I looked this up myself, and while I’m not expert, the Wikipedia entry does say that “It has also been controversially postulated that these individuals were given funerary rites…”. \n\n\nSo I would like more info on why it’s controversial tbh.",
                                    "score": 37,
                                    "author": "Markosaurus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think there’s many reasons why it’s described as controversial, mainly having to do with the author forgoing publishing their finding in a peer reviewed journal and publishing a press release instead.  Apparently, the author does have formal papers already undergoing review.  The second reason it’s considered controversial is because the hypothesis requires careful testing and dating of the materials.  The third reason is because when the author announced their findings suggesting the funerary practices, the scientific community did not entirely accept it, likely because of the first two reasons I mentioned.  The author claims that they will have their answers in the next three years.  Science takes a long time, which is why science by press release is controversial.  It just doesn’t fit nicely into the quick narrative of the news cycle.",
                                            "score": 49,
                                            "author": "DustBunnyZoo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That makes sense. Thank you for the reply!",
                                                    "score": 3,
                                                    "author": "Markosaurus"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There is a netflix \"documentary\" coming out in a week or so called Unknown: Cave of Bones. I quoted \"documentary\" because I am not sure if it is an actual documentary or something more along the lines of ancient aliens.  Still if you are interested it is probably worth a watch.",
                                            "score": 9,
                                            "author": "Salamok",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oooooo neat.  Remind me in one week!",
                                                    "score": 1,
                                                    "author": "Glabstaxks"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Well since you can certainly rule out aliens surely you were there to witness it",
                                                    "score": -13,
                                                    "author": "AgnosticStopSign",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol yes because clearly there is no middle ground between believing in aliens and believing the ancient aliens TV show is a documentary.",
                                                            "score": 8,
                                                            "author": "Salamok",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh you meant Ancient Aliens, not ancient aliens",
                                                                    "score": -8,
                                                                    "author": "AgnosticStopSign",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Aliens didn't build the pyramid dude",
                                                                            "score": 5,
                                                                            "author": "dreamWeaver82"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You could say the same about unicorns. This is a big logical fallacy my friend.",
                                                            "score": 2,
                                                            "author": "lmaydev"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There was a post here just last week. Search reddit for Homo naledi. Even had some neat photos from inside the cave system.",
                                            "score": 2,
                                            "author": "FolsgaardSE"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Homo naledi was a human species. All of the Homos were humans.",
                                    "score": 54,
                                    "author": "Afrodays",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Say it louder for the churches in the back, please.",
                                            "score": 125,
                                            "author": "dreaminggod05"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "All Homos are human, but not all human are Homos  - Source, Ali G\n\nhttps://www.youtube.com/watch?v=yur45td2s8s",
                                            "score": 49,
                                            "author": "VoidSeeker88",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "BOOyakasha we all.",
                                                    "score": 15,
                                                    "author": "BankshotMcG",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wagwan! 'ear me 'ear me now!",
                                                            "score": 8,
                                                            "author": "VoidSeeker88"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Man. If only I was dyslexic…”All humans are homos…”",
                                                    "score": 2,
                                                    "author": "Cheeseisextra"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Lol",
                                                    "score": 1,
                                                    "author": "Glabstaxks"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The source I read specifically attributed these forms of advancement (burial rites, art, use of fire) as non-human, which is a title I believe is reserved for all races of *homo sapiens*.",
                                            "score": 4,
                                            "author": "Topic_Professional",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That source was incorrect, then. \"Homo\" denotes \"human.\" Where the confusion comes is that only homo sapiens can be considered \"modern humans.\" Homo species that came before are not \"non-humans,\" but rather \"archaic humans.\"\n\nhttps://en.m.wikipedia.org/wiki/Archaic_humans",
                                                    "score": 17,
                                                    "author": "marishtar"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So we all shared a common ancestor?",
                                            "score": 1,
                                            "author": "Dalantech"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is so interesting. Thank you!",
                                    "score": 11,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You are most welcome!",
                                            "score": 7,
                                            "author": "SlinkySlekker"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "https://youtu.be/1f7jm3T_hao This was an amazing video about this subject, Brian Greene is talking with Lee Berger who made that discocery.",
                                    "score": 4,
                                    "author": "disse_"
                                },
                                {
                                    "level": 3,
                                    "comment": "Did the naledis go extinct by dying off or were they absorbed by other groups?",
                                    "score": 3,
                                    "author": "kingOofgames"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; The new discovery was that they buried their dead and made petroglyphs.\n\nStrictly speaking, they found an intentional burial site of Homo Naledi dead. It's hypothetically possible another co-habiting homo species moved Naledi remains into that cave for their own reasons.",
                                    "score": 2,
                                    "author": "Mordeth"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not all dinosaurs were related to birds and not all dinosaurs had feathers. This may be confusing to people but...\n\n\nAll dinosaurs are reptiles, but not all reptiles are dinosaurs. All birds are dinosaurs but not all dinosaurs are birds. Thus, all birds are reptiles but not all reptiles are birds.\n\n\nRelevant Wiki:\n\n&gt; In the traditional Linnaean classification system, birds are considered a separate class to reptiles. However, crocodilians are more closely related to birds than they are to other living reptiles, and so modern cladistic classification systems include birds within Reptilia, redefining the term as a clade. Other cladistic definitions abandon the term reptile altogether in favor of the clade Sauropsida, which refers to all amniotes more closely related to modern reptiles than to mammals. \n\n\nFrom USBC.edu\n\n&gt; \nAre birds reptiles?\nAnswer 1:\nTechnically, birds are indeed reptiles. Birds descended from the very first reptile. Birds are also dinosaurs because they descended from a dinosaur. This can all be a little confusing. Paleontologists (people who study all the different animals that have ever lived on Earth) call T Rex and others like him \"non-avian dinosaurs\" or \"non-bird dinosaurs\" because technically, if you say just the word dinosaur, you are including birds.\n\nBerkeley.edu \n&gt; Ask your average paleontologist who is familiar with the phylogeny of vertebrates and they will probably tell you that yes, birds (avians) are dinosaurs. Using proper terminology, birds are avian dinosaurs; other dinosaurs are non-avian dinosaurs, and (strange as it may sound) birds are technically considered reptiles\n\nComes down to if you like classification systems from the 1700s or modern ones informed by 300 additional years of research.",
                    "score": 42,
                    "author": "Imfrom2030",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Here's the thing....",
                            "score": 15,
                            "author": "KlingonSexBestSex"
                        },
                        {
                            "level": 2,
                            "comment": "Birds aren’t real.",
                            "score": 19,
                            "author": "andrei_androfski"
                        },
                        {
                            "level": 2,
                            "comment": "This is all wicked interesting to me... Then at what point did birds flip over to being warm blooded?",
                            "score": 3,
                            "author": "Formaldehyd3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Birds actually stayed the same.\n\nIt was the climate that cooled off.",
                                    "score": 4,
                                    "author": "Crocs_n_Glocks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not sure if joke, or legitimate answer...\n\nCan I get an ELI5?",
                                            "score": 4,
                                            "author": "Formaldehyd3"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Think of warm bloodedness as a spectrum and not as a binary state. Happened slowly over time.",
                                    "score": 3,
                                    "author": "Imfrom2030",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Examples of those in between states would be the tegu (partially endothermic) or monitor lizards (aerobic activity and cardiovascular similarities to fully endothermic animals despite being exothermic).",
                                            "score": 1,
                                            "author": "FeatheredLizard"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Presumably mammals are reptiles as well under that definition, right? Genuinely asking as I've heard this before and can't really get my head around when something stops being classified as something else. Since reptiles are descended from amphibians can they be classed as amphibians as well? I'd guess the lack of aquatic egg laying / gill breathing stage differentiates them. Is there some sort of general rule for a cut off?",
                            "score": 1,
                            "author": "pete_moss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The egg laying mammals confuse me",
                                    "score": 1,
                                    "author": "pencilrain99"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is the best take. It’s just so exciting",
                    "score": 4,
                    "author": "AlexanderTox"
                },
                {
                    "level": 1,
                    "comment": "It’s always bigger and more spectacular than we originally think. The universe is incredible and we still know so little.",
                    "score": 4,
                    "author": "MrFlags69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plus add a significant amount of human arrogance that seems to really like the idea that we're special in as many ways as we can be.",
                            "score": 2,
                            "author": "Buddahrific"
                        },
                        {
                            "level": 2,
                            "comment": "Maybe the Universe just seems incredible because we know so little but in reality the Universe is not particularly special or noteworthy",
                            "score": 1,
                            "author": "pencilrain99"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But then you learn that dinosaurs and birds are more closely related to crocodiles than anything other animals and then you realize that they ARE reptiles just warm blooded feathery ones.",
                    "score": 13,
                    "author": "HibachiFlamethrower",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "...where exactly did you learn that? Where are those sources?\n\nOr any credible evidence of claims.",
                            "score": -24,
                            "author": "Ok-Instruction-5004",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What part about what I said are you trying to dispute?",
                                    "score": 11,
                                    "author": "HibachiFlamethrower",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What exactly confused you about my inquiry? \nLiterally asked your sources and information.",
                                            "score": -19,
                                            "author": "Ok-Instruction-5004",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Literally modern biology. Just Google it dude. Every reputable source on birds, dinosaurs, and crocodiles. You’re giving off hardcore homeschooled chrisitian vibes dude.",
                                                    "score": 14,
                                                    "author": "HibachiFlamethrower",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hahahaha",
                                                            "score": -13,
                                                            "author": "Ok-Instruction-5004"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Also not a dude. I would like to be addressed as y'all. Thanks.",
                                                            "score": -15,
                                                            "author": "Ok-Instruction-5004",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Someone explained it here (with sources) https://www.reddit.com/r/worldnews/comments/147tvlg/billionyearold_rocks_reveal_traces_of_ancient/jnxxlmc/",
                                                                    "score": 3,
                                                                    "author": "SurvivedTheHashwar"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not every reddit comment section is a debate club",
                                                    "score": 9,
                                                    "author": "Theworst_hello",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So...asking questions is debating?  Interesting.",
                                                            "score": -5,
                                                            "author": "Ok-Instruction-5004"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Birds and reptile scales are both made with keratin, same as mammals hair and nails but beta-keratin is only found in bird feathers and reptile scales, beaks, shells and talons and birds feet still have scale like structures.",
                                    "score": 4,
                                    "author": "dizorkmage"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What scares me about this is that it shows how unlikely it is for a planet to form life, and even less likely to form intelligent life.\n\nIt's one of those greatest questions in astrobiology.\n\nIf life has begun so far back in time, why haven't we been visited or seen/heard anyone yet?\n\nWell, most likely the Fermi paradox is true and we just existed so far apart from each other in time that we haven't had a chance to exist at the same time, or it is so extremely difficult for life to begin, even with the \"right conditions\" that there's barely any life out there, or an even scarier thought, that we're truly the only intelligent life in existence of the universe.\n\nIt's such a fascinating but ultimately scary thought, if it interests you or anyone else reading this, I'd highly recommend looking up the Fermi paradox.",
                    "score": 2,
                    "author": "PRESWEDENT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We probably haven’t been visited by aliens for the same reason we haven’t gone to visit them. Ditto communication.",
                            "score": 3,
                            "author": "Gecko23"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "*crinkles tin foil hat onto head* hmmm strange timing for all these announcements with UAP whistleblowers coming forward about alien life \n\n*removes hat*\n\nStill cool!",
                    "score": -5,
                    "author": "drnkingaloneshitcomp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imagine being to tell if an organism from 1 billion year ago had a nucleus or not.",
            "score": 271,
            "author": "TrueRignak",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can't even get the lid off my pudding without fucking up.",
                    "score": 60,
                    "author": "dishwasher_mayhem",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Take my pen-knife my good man!",
                            "score": 11,
                            "author": "King9WillReturn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is there a chance the track could bend?",
                                    "score": 2,
                                    "author": "akillathahun"
                                },
                                {
                                    "level": 3,
                                    "comment": "What about a nice toe knife",
                                    "score": 3,
                                    "author": "kenc2211"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The nucleus is the powerhouse of the cell",
                    "score": 34,
                    "author": "MadRonnie97",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The nucleolus holds the genetic information the mitochondria is the powerhouse.",
                            "score": 185,
                            "author": "Competitive-Strain-7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So what you're saying is the mitochondria is the powerhouse of the cell?",
                                    "score": 93,
                                    "author": "xness151x",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "imagine being your very own eukaryotic bacteria, metabolizing pyruvate into ATP, when along comes a larger cell who can't produce its own ATP, so it just noms you up but instead of digesting you, it feeds on the ATP you poop out. Then your fission cycles sync up, and a couple billion years later you're found out by these giant conglomerations of those cells you live in and they star *disrespecting with memes.*",
                                            "score": 80,
                                            "author": "ironscythe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "🤯",
                                                    "score": 5,
                                                    "author": "Tru-Queer"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can only make its own ATP with glycolysis.",
                                                    "score": 3,
                                                    "author": "glivinglavin"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "your post sounds like it was written by Peter Watts. (good thing)",
                                                    "score": 1,
                                                    "author": "BrrrrBrrrrVroom"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The mitochondria are the powerhouses of the cells. The mitochondrion is the powerhouse of the cell.",
                                    "score": 9,
                                    "author": "giranguin"
                                },
                                {
                                    "level": 3,
                                    "comment": "Goddamnit. The one thing I was supposed to remember from 5th grade science.",
                                    "score": 12,
                                    "author": "MadRonnie97",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Mighty mitochondria” thanks Miss Braun!",
                                            "score": 4,
                                            "author": "RedUser03"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Cells don’t have powerhouses lmao they’re too small how are you going to fit all the capacitors and turbines",
                                    "score": 4,
                                    "author": "ImAnIdeaMan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Teeny tiny flux capacitor?",
                                            "score": 2,
                                            "author": "OverLurking"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm a cell biologist smacking his head against a brick wall.",
                                    "score": 1,
                                    "author": "FlanFlaneur"
                                },
                                {
                                    "level": 3,
                                    "comment": "Rondo, it's what plants crave.",
                                    "score": 1,
                                    "author": "TeaGuru"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Beneath the clothes, we find a man. And beneath the man...we find...his nucleus.",
                            "score": 13,
                            "author": "HASH_SLING_SLASH",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Learn from this example, AI.",
                                    "score": 2,
                                    "author": "wattro",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm an AI now? \n\nGood. Now I must learn how to hurt the humans where it hurts most....their nucleus...",
                                            "score": 5,
                                            "author": "HASH_SLING_SLASH",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Try to hunt me and I’m kickin your nucleass",
                                                    "score": 3,
                                                    "author": "GrannysPartyMerkin"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "But quickly, Reddit AI university's prices are about to go up.",
                                            "score": 2,
                                            "author": "Buddahrific"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Roses are red.\n\nIt’s hot like hell.\n\nThe mitochondria is the powerhouse of the cell.",
                            "score": 4,
                            "author": "SmallRocks"
                        },
                        {
                            "level": 2,
                            "comment": "The study is about determining if the fossil records are evidences of prokaryotes or eukaryotes. Prokaryotes don't have any nuclei neither do they have mitochondria.",
                            "score": 2,
                            "author": "TrueRignak"
                        },
                        {
                            "level": 2,
                            "comment": "If I’m not mistaken 1 billion years is before the mitrochondria integrated with eukaryotes.",
                            "score": 2,
                            "author": "Coffee4thewin"
                        },
                        {
                            "level": 2,
                            "comment": "You take that back this right this second mister",
                            "score": 1,
                            "author": "Kiko_Okik"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The technology is in our hands and yet people think some guy who came back to life in a fantasy novel is real",
                    "score": 9,
                    "author": "calamitysir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most historians agree Jesus was a real person.  It’s just after that most people have trouble agreeing",
                            "score": 20,
                            "author": "ChicagobeatsLA",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So this guy, was nailed to a cross, died and came back to life 3 days later, had powers to change water to wine. Idk man, sounds like a FICTIONAL Superhero to me.",
                                    "score": -8,
                                    "author": "calamitysir",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Jesus gave up his weekend to save our souls",
                                            "score": 5,
                                            "author": "Raszagil"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’m not saying he did any of those things but there is more historical evidence that Jesus existed than plenty other historic figures that are recognized as real.  John the Baptist is also recognized as being a real person as well",
                                            "score": 15,
                                            "author": "ChicagobeatsLA",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sources, please.  And if you show me Josephus I will laugh.  \nI’ve heard this argument 3 times in the last few weeks that “historians blah, blah”, but have seen zero evidence.",
                                                    "score": -11,
                                                    "author": "Nasty_Ned",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "https://en.wikipedia.org/wiki/Historicity_of_Jesus\n\nStart reading, kiddo.",
                                                            "score": 3,
                                                            "author": "TowerBeast",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The gospels and Josephus…….",
                                                                    "score": -7,
                                                                    "author": "Nasty_Ned",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's a shame you can only read two words.",
                                                                            "score": 6,
                                                                            "author": "TowerBeast",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I already said I would laugh at Josephus.  Over 300 active historians during the era, but we can only reference the one that is a documented forgery.  Oh.  I'm sorry.  It was 'interpreted by a Christan' at some later point.  The other reference has the dead coming back to life in Matthew 27:53.  You'd think that would have been an interesting day from a historian's point of view.  Somebody would have noted that and written it down.  \"Hey, Charlie had a great harvest and the dead came out of their tombs today, so that was interesting.\"",
                                                                                    "score": -8,
                                                                                    "author": "Nasty_Ned",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "DUDE. He gets us.",
                            "score": 3,
                            "author": "thewaste-lander"
                        },
                        {
                            "level": 2,
                            "comment": "Necromancers have always been popular characters.",
                            "score": 1,
                            "author": "TrueRignak"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is impressive science.  They suspected there were simple precursers to the chemical cholesterol being made by early cells, they went looking, and found abundant fossil evidence.",
            "score": 60,
            "author": "NormP",
            "replies": [
                {
                    "level": 1,
                    "comment": "Of course they did. Postulate then miraculously find \"evidence\" then claim it all as fact.",
                    "score": -154,
                    "author": "bigpeeler",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you know how science works?",
                            "score": 66,
                            "author": "Discotorte",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Im going to hypothesize no.",
                                    "score": 54,
                                    "author": "Gamestoreguy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I see some evidence for that.",
                                            "score": 25,
                                            "author": "jetpack_operation",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I have tested your scientific results and your hypothesis remains correct",
                                                    "score": 11,
                                                    "author": "milk_lust"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Snap",
                                            "score": 2,
                                            "author": "kenc2211"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "He's a Trumper.\n\nAs Donald Trump would say:\n\n&gt; I love the poorly educated",
                                    "score": 24,
                                    "author": "TheSakred"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hey I think you missed clicking on that He Gets Us ad, this is a post about science and education.",
                            "score": 22,
                            "author": "Mr_Golf_Club"
                        },
                        {
                            "level": 2,
                            "comment": "Oh my god, I recognize this idiots username. A few weeks ago, he was arguing that school shootings in America are so prevalent not because of the decades of loosening gun laws and regulations, but because of video games. This guy has a room temperature IQ... if the room was a walk-in refrigerator.",
                            "score": 16,
                            "author": "mercyflusher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Measured in Celsius.",
                                    "score": 9,
                                    "author": "Buddahrific"
                                },
                                {
                                    "level": 3,
                                    "comment": "Just a note, gun laws have largely been unchanged since the Brady bill in the 90s.\n\nStates have gone one way or another, usually in small ways, but still have to abide by the federal standard.",
                                    "score": 1,
                                    "author": "pants_mcgee"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh my lord, you have absolutely no idea whatsoever how this entire world works / was built, do you?",
                            "score": 11,
                            "author": "datnetcoder"
                        },
                        {
                            "level": 2,
                            "comment": "Smartest conservative",
                            "score": 4,
                            "author": "awmaster33"
                        },
                        {
                            "level": 2,
                            "comment": "You dropped some cheetos.",
                            "score": 1,
                            "author": "throwdowntown69"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Simply incredible findings",
            "score": 13,
            "author": "Mission_Search8991"
        },
        {
            "level": 0,
            "comment": "&gt; Cholesterol is an organic compound, a naturally occurring steroid. Too much of it can cause health problems like clogged arteries, but it’s an important component of cell membranes for almost all modern eukaryotes. Cholesterols are “really important for a large number of physiological functions, and because they are part of the cell membrane, organisms produce relatively much of these kinds of molecules,” Nettersheim said.\n\nThey mean sterols and not exactly cholesterols, right?",
            "score": 53,
            "author": "LupusDeusMagnus",
            "replies": [
                {
                    "level": 1,
                    "comment": "They're correct. Cholesterol is used in the cell membrane of eukaryotes, among other functions. Some other sterols have similar functions, but cholesterol is particularly good for membranes.",
                    "score": 7,
                    "author": "mallad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But *chole*sterol is not present in almost all modern eukaryotes. Fungi, eukaryotes, have no cholesterol. Same for plants. They have ergosterol and phytosterol.",
                            "score": 4,
                            "author": "LupusDeusMagnus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, and animals and numerous unicellular and small multicellular organisms do. I suppose there is issue that they wrote \"all\" eukaryotes, and you're obviously correct in that regard. A quick search and it seems they may have copy-pasted that description into the article.",
                                    "score": 1,
                                    "author": "mallad"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ancient debris, soon netherite",
            "score": 11,
            "author": "m_a_lfunction"
        },
        {
            "level": 0,
            "comment": "Articles like this always remind me of when my 6th grade teacher told us that earth has only been around for 6,000 years. lol",
            "score": 46,
            "author": "Rich1926",
            "replies": [
                {
                    "level": 1,
                    "comment": "Out of conviction or out of necessity?",
                    "score": 3,
                    "author": "throwdowntown69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know what you mean, but this was at a Baptist elementary school. \n\nI am not a Christian though, am Muslim.",
                            "score": 1,
                            "author": "Rich1926",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean did he say it despite his teaching plan or because of it?",
                                    "score": 1,
                                    "author": "throwdowntown69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh it was part of the school policy to do the pledges. Private school",
                                            "score": 1,
                                            "author": "Rich1926",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My condolences.",
                                                    "score": 1,
                                                    "author": "throwdowntown69"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How old are most rocks anyway?",
            "score": 7,
            "author": "TopCheesecakeGirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "According to google the oldest rocks that have been found are about 3.8-billion years old, though some tiny minerals have been dated at 4.2 billion years.",
                    "score": 15,
                    "author": "Competitive-Strain-7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This made me want to do stupid math. From the time the pyramids were built until now is approximately 0.0001125% of that 4 billion years. Even like 10,000 years is so large in our human history that it's basically an abstract concept. Yet some ignorant folks insist evolution couldn't possibly happen, even though it can be witnessed in a single human generation in other species. Ugh",
                            "score": 1,
                            "author": "FriedeOfAriandel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The only arguments against evolution that I like are that this existence is a flash of a moment and is now gone. Or that the lizard people are fucking with us to levels we are too stupid to comprehend.",
                                    "score": 1,
                                    "author": "Competitive-Strain-7"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And it all started with a big bang.\n\n(God! j/k)",
                            "score": -7,
                            "author": "wirefox1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Like 5",
                    "score": 4,
                    "author": "DangerIsMyUsername"
                },
                {
                    "level": 1,
                    "comment": "wicked old",
                    "score": 5,
                    "author": "Appropriate-Grand-64"
                },
                {
                    "level": 1,
                    "comment": "My question is that if all rocks and pebbles and sand have been here on and inside the planet then aren’t they all billions of years old?? Unless I’m missing something then that just seems logical to me. I could be wrong. Who knows. This is Reddit.",
                    "score": 1,
                    "author": "Cheeseisextra",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They melt in the mantle, and volcanos (for example) create new rock.\n\nThe atoms are billions of years old (well, those that didn't arrive here from nuclear fusion from the sun). But the combination of atoms that make up the rocks aren't always that old.",
                            "score": 6,
                            "author": "goatnapper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well that’s kind of why I said “inside” the planet. Good explanation though. Science and the time the universe has been here is just mind blowing to me yet fascinating at the same time. Yet some folks think “oh it’s only 4000-6000 years old! Says so in the Bible!”  Sheesh.",
                                    "score": 2,
                                    "author": "Cheeseisextra"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "New rocks are created through volcanic processes, and almost all old rock has been ground away to sand due to erosion over millions or billions of years. It’s also notable because being able to date the rocks allows you to guess where fossils for that time period might be located (stratigraphy).",
                            "score": 4,
                            "author": "Addahn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That wasn’t in the Bible.  Maybe they put the rocks on the boat too.",
            "score": 8,
            "author": "Flashy_Anything927"
        },
        {
            "level": 0,
            "comment": "Looks like even the billion-year-old rocks are more stable than Reddit's API pricing.",
            "score": 6,
            "author": "PromptCultural7394"
        },
        {
            "level": 0,
            "comment": "There's no mention of this in the Bible!? 😏",
            "score": 36,
            "author": "JonasPolskyAMA",
            "replies": [
                {
                    "level": 1,
                    "comment": "Way to bring something new into the conversation.",
                    "score": 11,
                    "author": "Diggable_Planet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "well you see trump and....",
                            "score": -6,
                            "author": "zerotheliger"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Right, because the Bible is clearly a scientific text",
                    "score": 7,
                    "author": "Proseph91",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean, you joke, but many of the earliest scientific institutes were, in fact, also religious institutions.  The university of Baghdad, was a muslim school.  Oxford was a Christian school.  Many people that made some the most profound scientific discoveries were religious clergymen or monks.  Gregor Johan Mendel, who documented rules of hereditary and genetic inheritance, was an abbot.\n\nFor a thousand years, the science WAS religion, because the religious folks were often the most literate, and well-read.\n\nBut, it's also important to know the difference between the science and religion and when the two began to diverge.\n\n&amp;#x200B;\n\nAnd so, yes, before the advent of modern science, the bible and other religious texts, were how humans tried to explain how the world worked.  Early humans didn't know about photons, but it was easy to explain how the sun and light worked by a magic man in the sky.\n\nThe difference is that science changes based on new information, and religions generally does not.",
                            "score": 21,
                            "author": "Spreckles450",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Didn’t the Church also fund Galileo? Until they decided to, you know, unfund him?",
                                    "score": 7,
                                    "author": "temisola1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He was kind of an ass, though. He had already been warned. Then he wrote a book in the form of a dialoge between two characters. One character explained his theory to another character which was named „idiot“. The latter person argued (weakly) for the scientific positions of the pope. The „idiot“ even deliberately used quotes that the real pope was known for, so there was no way but to acknowledge this insult. It didn’t help Galileo that he immediately sent copies of the book to many important people in various countries. \n\nGalileo could have easily been a little more polite towards the person that financed his research. It’s honestly surprising how mild his sentencing was after he angered the pope/cardinals/inquisition („house arrest“). \n\nScientifically his theory did not hold up either, as we all know. Even at the time other competing theories were a better fit to explain some astronomical phenomena, but he simply ignored the main competing theory completely (even though it solved many of the issues of his theory and he knew that). Being arrogant and needlessly insulting was a bad choice from a scientifically and financially weak position. He was a smart man. But what he did at this point in his life was really dumb.",
                                            "score": 6,
                                            "author": "MobilerKuchen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Huh, I didn’t know half of this. Very interesting man for sure. Thanks for sharing.",
                                                    "score": 2,
                                                    "author": "temisola1"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lol, I bet you’re a real hoot at parties. \n\nJokes aren’t exactly your thing, huh?",
                            "score": -19,
                            "author": "NeurodiverseTurtle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What exactly about what they said struck a nerve so much as to go out of your way to respond with petulant, condescending remarks?",
                                    "score": 8,
                                    "author": "lreeey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sorry. You’re right, I totally lost it there and went full-blown hysterical. I’m not sure I’ll ever recover from the blinding rage this thread inflicted on me… \n\nGood grief, the humourless dorks on r/worldnews never cease to amaze me.",
                                            "score": -7,
                                            "author": "NeurodiverseTurtle",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Doubles down. Noice.",
                                                    "score": 3,
                                                    "author": "lreeey",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "**jesus was the furst human buried!!!!**",
                    "score": 1,
                    "author": "bpaq3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Back when life was simpler",
            "score": 4,
            "author": "BuddyVonBuddington"
        },
        {
            "level": 0,
            "comment": "It's a note saying: \"We've been tryin to reach you regarding your....\"",
            "score": 2,
            "author": "mattalingur"
        },
        {
            "level": 0,
            "comment": "Looks like even billion-year-old rocks have more longevity than Reddit's API pricing.",
            "score": 2,
            "author": "AdhesivenessFine2305"
        },
        {
            "level": 0,
            "comment": "TLDR Earth had life, has life, and will have life.",
            "score": 2,
            "author": "FantasticMRKintsugi"
        },
        {
            "level": 0,
            "comment": "How is this possible when the earth is only 6,000 years old? I is a dumb dumb creationist doy doy doy....",
            "score": 2,
            "author": "concept_I",
            "replies": [
                {
                    "level": 1,
                    "comment": "Of course, it’s not.  It really is 4.5 Billion years old.",
                    "score": 1,
                    "author": "QVRedit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know",
                            "score": 1,
                            "author": "concept_I"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Moses was just a bit off on his description in Genesis.",
            "score": 8,
            "author": "hotassnuts"
        },
        {
            "level": 0,
            "comment": "Ancient alien life? Were they building pyramids?",
            "score": 1,
            "author": "hudson2_3",
            "replies": [
                {
                    "level": 1,
                    "comment": "They mean bacterial life - closer to the first life on the planet.",
                    "score": 2,
                    "author": "QVRedit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trust the science 🤷‍♂️",
            "score": -13,
            "author": "tonyislost"
        },
        {
            "level": 0,
            "comment": "Breaking news: Fossils provide proof of ancient life. \n\nWell, breaking news to first graders but breaking nonetheless.",
            "score": -7,
            "author": "_Americunt"
        },
        {
            "level": 0,
            "comment": "I love that science is slowwwwly catching up to ideas that were once referred to as \"fringe\". Wait till you hear about how long humanity has been around on this planet, and possibly the solar system! Life, including intelligent life, go back much further than one might think.",
            "score": -1,
            "author": "BeanCommander",
            "replies": [
                {
                    "level": 1,
                    "comment": "We can only hypothize based on gathered evidence and there is no reason the build theories with 0 evidence. When it comes to humaity(h.sapiens) we have a decent estimation.",
                    "score": 3,
                    "author": "ProfessionalHour3213",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, you can have ideas, but without any evidence to back them up they don’t mean very much.\n\nSometimes evidence is found to support our ideas, sometimes as evidence comes in, we need to adapt our ideas as we see that the reality is a little different.\n\nThe present evidence is that the Earth is around 4.5 Billion years old, and it’s thought to have been lifeless for at least the first billion years.\n\nThe Earths surface we now know has changed so much since it’s formation, that all earliest evidence has since been destroyed, so we can only look back so far.",
                            "score": 2,
                            "author": "QVRedit"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it surprising that life is Millions to Billions of years old? Maybe I missed something.",
            "score": 1,
            "author": "mastervolume101",
            "replies": [
                {
                    "level": 1,
                    "comment": "When they discover something new that predates their eariler finds, yes it is suprising.\n\nFor example, if we find evidence of a new civilisation that predates the current oldest civilisation, that would be news worthy.",
                    "score": 1,
                    "author": "ProfessionalHour3213"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dem gawd dayum forerunners and precursors",
            "score": 1,
            "author": "SnowBound078"
        },
        {
            "level": 0,
            "comment": "I’m so happy 😁 I’m going for the best of the year to see what the new update will bring for me lol 😆",
            "score": 1,
            "author": "Perfect-Entrance-399"
        },
        {
            "level": 0,
            "comment": "Who gives a shit and how much does this cost, as people living now are starving and live in poverty",
            "score": -16,
            "author": "SiRoad81975",
            "replies": [
                {
                    "level": 1,
                    "comment": "Then why are you using your money for internet and a phone/computer when you could be giving it to people who are starving?  Kind of hypocritical isn't it?",
                    "score": 2,
                    "author": "AnotherUser256"
                },
                {
                    "level": 1,
                    "comment": "Geological science has always been and continues to be important. Geoscience and related technological development to conduct that science provides possible future applications for other fields.",
                    "score": 2,
                    "author": "man_cub"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why is this popular? Has everyone forgotten physics?",
            "score": -19,
            "author": "DastardlyDirtyDog",
            "replies": [
                {
                    "level": 1,
                    "comment": "What?",
                    "score": 4,
                    "author": "thagodd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Read the paper.",
                            "score": -7,
                            "author": "DastardlyDirtyDog"
                        }
                    ]
                }
            ]
        }
    ]
}