{
    "id": "e970b3",
    "score": 134859,
    "title": "Prince Andrew accuser's sends out cryptic tweet: \"I am making it publicy known that in no way, shape or form am I sucidal. I have made this known to my therapist and GP- If something happens to me- in the sake of my family do not let this go away and help me to protect them\"",
    "author": "Augie-Morosco",
    "date": 1576070403.0,
    "url": "https://www.reddit.com/r/worldnews/comments/e970b3",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "A couple of years ago in Argentina, we had a similar case. \n\nNatacha Jaitt was model/host that denounced, among many things, a ring of pedofile human trafficking that involved Gustavo Vera (a friend of the pope). \n\nreading this news, i got chill down my spine. Natacha twitted something **eerily similar** saying *\"I will not commit suicide. I won’t be bought off or drown in a bath tub, nor will I shoot myself in the head. So, if that happens: I wasn’t me. Save this tweet.\"*\n\nheres the link  [https://twitter.com/NatachaJaitt/status/981971273004744707](https://twitter.com/NatachaJaitt/status/981971273004744707)\n\n  \nShe was found dead two weeks before she was scheduled to give testimony in court.",
            "score": 3977,
            "author": "Pabloidemon",
            "replies": [
                {
                    "level": 1,
                    "comment": "She made the accusations a talk show on national television in Argentina. They knew how it would look, and they still killed her.\n\nNatasha Jaitt Discusses Pedophile Network: https://www.youtube.com/watch?v=6TgHxIdkZls\n\n(read the YouTube comments)",
                    "score": 1071,
                    "author": "Aether-Ore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One might say that they did it that way because they knew how it would look.",
                            "score": 358,
                            "author": "dk_lee_writing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 417,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's sickening things like this that make me wish the Punisher wasn't fictional.",
                    "score": 664,
                    "author": "TookMyFathersSword",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very VERRRYYY similar circumstances to Argentinian model Natacha Jaitt. Tweeted that she was in no way suicidal or wanted to die after exposing/accusing some high up people of pedophilia. She was found dead in a hotel room.\n\n&gt;https://nypost.com/2019/02/26/former-playboy-model-found-dead-after-ominous-tweet/",
            "score": 11393,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This world is insane.",
                    "score": 4655,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 262,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That would have been an impactful moment in your life I imagine.",
                                    "score": 27,
                                    "author": "grubber26",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 28,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Makes more sense if you consider the actual value those in power place on an individual life; spoiler, it isn’t much.",
                            "score": 1804,
                            "author": "Middle_Eats",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wrong. They place great great value on their own lives.",
                                    "score": 509,
                                    "author": "Sckaledoom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We can only refer to them as they. We can't even name a single name other than Epstein.",
                                            "score": 200,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Breaking news: The team looking into the Epsteim suicide have all committed suicide. Tragic event. The mere fact that they were looking into a suicide made them all suicidal. I say we stop any further investigations into this matter before more people are pushed to off themselves. Just go watch [your favorite youtuber](https://www.youtube.com/watch?v=fdovlF9THg8&amp;list=UUlJJFaoPpGdM_xefdc6hcew) or something and forget all about this case before you get urges to suicide yourself too",
                            "score": 361,
                            "author": "BitcoinAddictSince09",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely tragic. Ten people all committing suicide by stabbing themselves in the back 20+ times each.",
                                    "score": 69,
                                    "author": "Bizzle1389",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can never find her original accusations. Seriously so hard to find. All I can ever see is the tweet about her not wanting to kill herself. The lack of anything fruitful coming from her story concerns me for the one being discussed in the article. The blatant silencing of everyone involved with this type of stuff is getting tired. I wonder if it will ever change.",
                    "score": 1118,
                    "author": "ihatemyaveragecock",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it almost seems like her original accusations have been scrubbed from the internet.\n\nI understand publications don't want to parrot potentially libelous unproven claims, but all they need to do is preface them with \"allegedly\" and they should be in the clear.",
                            "score": 672,
                            "author": "Boner4Stoners",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Every us and in news organization is bought and owned, and multiple sites on the internet are disappearing. Its almost like there trying to control the flow of information.",
                                    "score": 223,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's almost as if allowing unlimited concentration of wealth can have negative repercussions.",
                                            "score": 86,
                                            "author": "robot_invader",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's right here. She did it on a talk show on national television in Argentina.\n\nNatasha Jaitt Discusses Pedophile Network: https://www.youtube.com/watch?v=6TgHxIdkZls\n\n(read the YouTube comments)",
                            "score": 478,
                            "author": "Aether-Ore",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow. I have never even heard about this. This is absolutely insane to me. The whole thing. Could you imagine if this was in the US? Whatever ends up happening with the Jerry Epstein thing, will be very telling of how corrupt and absolutely disgusting people with a lot of money can get away with anything. From pedophilia to murder and everything in between.",
                                    "score": 90,
                                    "author": "SlightlyTYPIC4L",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's pretty much no reporting on it in the English speaking world, but if you look for local Argentinian articles there's plenty. She got herself tangled up with pedophiles and sex traffickers, she testified against some of them around the time she made her tweet. A little after that she was drugged and raped, and then soon after that she was murdered. (Oh, sorry, i mean, allegedly, allegedly)  \n\nHere are some names of villains for you:  \n**Leonardo Cohen Arazi** and **Martín Bustos** - She testified against them for supporting a pedophile ring, they were acquitted of abuse charges but were found to be promoting prostitution of young boys.  \n**Pablo Yotich** and **Maximiliano Giusto** - These guys raped her, possibly motivated by revenge for her testimony.  \nYou can find this on Wikipedia, loosely described, you'll have to dig into the Spanish articles for details.\n\nMost likely more kids are being sold and raped in South America as we speak, while Natacha's body rots, forgotten.",
                            "score": 124,
                            "author": "Dreadgoat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 287,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It has also become very common for protesters in Hong Kong to yell \"I AM IN NO WAY SUICIDAL\" when being arrested, and to film others doing so. Because that has long been a way for the CCP to get rid of people, and [there have been a lot of suspicious suicides recently](https://www.theepochtimes.com/high-suicide-rate-of-hong-kong-protesters-points-to-chinese-regime_3116492.html)",
                    "score": 79,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Time to start wearing a small body cam that records to a cloud...",
            "score": 12509,
            "author": "hydr0n1um",
            "replies": [
                {
                    "level": 1,
                    "comment": "A perpetually recording body can that, if it doesn't sense a heart rate for longer than an hour, posts the last few hours of footage publicly.",
                    "score": 6307,
                    "author": "Embolisms",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The fact that your post isn’t a joke or just someone talking shit but an actual thing she should legit do is pretty insane.",
                            "score": 892,
                            "author": "WeedstocksAlt",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "There appears to be a growing market segment for such a product.\n\nAs far as implimentation, it'd have to be that it uploads live, and the cloud service sets the video to 'public' if the cam looses connectivity.. Makes it a little more tamper proof",
                            "score": 3481,
                            "author": "Special_KC",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1587,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "App that uploads to your Google Drive with a script that emails the video to a dozen news agencies if you die.\n\nGoogle wouldn't know to stop it in time before it gets out.",
                                            "score": 1039,
                                            "author": "MemLeakDetected",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They also, most likely, wouldnt even know about it until after it got to the news outlets",
                                                    "score": 613,
                                                    "author": "taintedcake",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You guys know that \"cloud\" just means connected to the internet, right?\n\nStash a few PCs in different places - a PI running a server and you don't have to rely on a company to send your data out for you - you can do it yourself.",
                                                    "score": 963,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Imagine dying by accident to a heart attack while masturbating. \n\nUploaded directly into the cloud and youtube.",
                            "score": 1193,
                            "author": "MaterTuaLupaEst",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And then someone else dies masturbating to your masturbatory death... and so on and so on",
                                    "score": 502,
                                    "author": "coreyisthename",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The Cock Ring.",
                                            "score": 955,
                                            "author": "Pezdrake",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Or a timer that posts footage unless the user puts in a code within the allotted time, they could just use someone else’s heartbeat if they knew about it",
                            "score": 113,
                            "author": "R-E-D-D-I-T-W-A-V-E",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Could just stream to twitch constantly",
                    "score": 183,
                    "author": "funkyb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just ~~Chatting~~ staying alive",
                            "score": 221,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m sure Ghislaine Maxwell’s forthcoming tell-all will clear all this up!",
            "score": 2402,
            "author": "PBowler48",
            "replies": [
                {
                    "level": 1,
                    "comment": "She might be suicidal..",
                    "score": 565,
                    "author": "DownvoteEvangelist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She's probably already dead.",
                            "score": 357,
                            "author": "Dragon_Small_Z",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My money is on recuperating from extensive facial reconstruction surgery.",
                                    "score": 315,
                                    "author": "_Diskreet_",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It was just locker room sex slavery. Nothing to see here folks.",
                    "score": 27,
                    "author": "radio555"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“She didn’t commit suicide, it was a car crash...”\n\nis my expectation for the ending to all of this",
            "score": 378,
            "author": "action_turtle",
            "replies": [
                {
                    "level": 1,
                    "comment": "My expectation is they just suicide her anyway. I mean the open display of power is half the point.",
                    "score": 100,
                    "author": "BreadandCocktails",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Watson! Retrieve my violin and cocaine, for I must apply all of my amazing deductive powers if I am to have even the slightest hope of deciphering this incredibly cryptic message.",
            "score": 21951,
            "author": "xmagusx",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 10205,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh god I hate how true this is.",
                            "score": 3753,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Breaking news: The team looking into the Epsteim suicide have all committed suicide. Tragic event. The mere fact that they were looking into a suicide made them all suicidal. I say we stop any further investigations into this matter before more people are pushed to off themselves. Just go watch [your favorite youtuber](https://www.youtube.com/watch?v=fdovlF9THg8&amp;list=UUlJJFaoPpGdM_xefdc6hcew) or something and forget all about this case before you get urges to suicide yourself too",
                                    "score": 806,
                                    "author": "BitcoinAddictSince09",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Those responsible for sacking the people who have just been sacked, have been sacked.",
                                            "score": 222,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\"Your Honor! We've had a doozy of a day. There we were minding our own business, just doing chores around the house when these suicide investigators started killing themselves all over my property.\"",
                                            "score": 70,
                                            "author": "theassassintherapist",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "“HEY COLLEGE KIDS!!!”",
                                                    "score": 29,
                                                    "author": "taatchle86",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 257,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My goodness, she must have been terribly depressed to have made the shot from 150 yards!",
                                            "score": 186,
                                            "author": "generic_tylenol",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah yes depression based super-positioning is a serious illness that results in conspiratorial suicides every year.\n\nIncidentally it only happens to people in places of power, or people with certain knowledge (such as [REDACTED]) of people in power.\n\nIt’s always a coincidence and never needs to be looked into, and there certainly isn’t anything weird about that.",
                                                    "score": 40,
                                                    "author": "Justintime4u2bu1",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Breaking news: The team looking into the Epsteim suicide have all committed suicide. Tragic event. The mere fact that they were looking into a suicide made them all suicidal. I say we stop any further investigations into this matter before more people are pushed to off themselves",
                                            "score": 100,
                                            "author": "BitcoinAddictSince09",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Suicidle? Thats a great new term. Having suicidal ideations, but hesitating to complete the act.",
                                                    "score": 70,
                                                    "author": "xelle3000",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "8/10 researchers agree!\n\n\n...\n\n...\n\n\n8/8 researchers agree!",
                                                    "score": 52,
                                                    "author": "PartiesLikeIts1999",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"It appears she used a hunting rifle to shoot herself in the back of the head Tom.\"",
                            "score": 828,
                            "author": "ToastyVoltage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes and she has appeared to fire the rifle from the 2nd floor balcony while she idles at a red traffic light Phil. We see these kinds of things all the time.",
                                    "score": 402,
                                    "author": "BadInterpretation",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Open and shut case Johnson, sprinkle some crack on her and let’s get out of here",
                                            "score": 237,
                                            "author": "teedub7588",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Media: “The first sign of being suicidal is denying being suicidal so clearly she was”",
                            "score": 368,
                            "author": "Lalai-Dama",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "...She even went through the trouble of tweeting about it!\n\nOuR tHouGhtS aNd pRaYers go out to her and her family.",
                            "score": 84,
                            "author": "sparcasm"
                        },
                        {
                            "level": 2,
                            "comment": "Accuser lied about not wanting to commit suicide before being found dead.",
                            "score": 49,
                            "author": "existentialdreadAMA",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Surprising Adventures of Sir Digby Chicken Caesar",
                    "score": 570,
                    "author": "XeBrr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dundaladundaladunaladundaladiddladiddladiddledeee",
                            "score": 249,
                            "author": "Jagernaughty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "On a lonely planet spinning its way toward damnation amid the fear and despair of a broken human race, who is left to fight for all that is good and pure and gets you smashed for under a fiver? Yes, it's the surprising adventures of me, Sir Digby Chicken-Caesar!",
                                    "score": 199,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 52,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Quick Ginger! We haven't a moment to lose!",
                            "score": 63,
                            "author": "bobtnelis99"
                        },
                        {
                            "level": 2,
                            "comment": "In a world spinning violently out of control....",
                            "score": 28,
                            "author": "DigbyCaesar"
                        },
                        {
                            "level": 2,
                            "comment": "That episode where Ginger sobers up but is lured back to the booze is heartbreaking.",
                            "score": 23,
                            "author": "JimHadar",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Coked out violinist. That actually sounds like something I’d pay money to see. Would they be excellent since cocaine can really zero you in? Or would they suck because they’re going too fast and they don’t realize it because they’re so confident in that moment?",
                    "score": 366,
                    "author": "AntonToniHafner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "have you read any sherlock holmes books? he would shoot up cocaine, play his violin, think about the crime, and solve it. high on coke.",
                            "score": 83,
                            "author": "antipho",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 25,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's not cryptic",
            "score": 48107,
            "author": "donewityoshit758",
            "replies": [
                {
                    "level": 1,
                    "comment": "HEY Y'ALL, I'M NOT TRYING TO KILL MYSELF.\n\nI wonder what they're talking about.\n\nPEOPLE, I AM ACCUSING EXTRAORDINARILY POWERFUL INDIVIDUALS OF FUCKED UP SHIT. THESE PEOPLE MIGHT TRY TO KILL ME.\n\nWhat could this all mean?",
                    "score": 18595,
                    "author": "Typical_Samaritan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*person dies under Incredibly suspicious circumstances*\n\nWhat a tragically misunderstood soul.",
                            "score": 2368,
                            "author": "Ghostbuster_119",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Reports say that she shot herself in the head.\nSeveral times.\nFrom behind.\nAnyway, thoughts and prayers go out to the family.",
                                    "score": 862,
                                    "author": "darthkrater",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "She was found with a note saying \"I commit Die\"\n\nPolice have ruled it a suicide.",
                                            "score": 666,
                                            "author": "Ghostbuster_119",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Probably all the video games she played.",
                                                    "score": 287,
                                                    "author": "My_hilarious_name",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Roblox must be stopped at all costs",
                                                            "score": 140,
                                                            "author": "ThaiJohnnyDepp",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Roblox is just the beginning. Studies are beginning to show that these tendencies trace all the way back to Nintendogs. Truly tragic times.",
                                                                    "score": 62,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "She was found in an open field, tied to a pole with gunshot wounds in the head, chest, and pelvic area. \nCoroner rules it natural cause via cardiac arrest. Nature can be very cruel.\n\nAlso, happy cake day and don't leave Ecto-1 to rust away in a barn!",
                                                    "score": 46,
                                                    "author": "theaviationhistorian",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2856,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A year from now:\n\nWow, I didn't know she would actually kill herself.  Now we'll never know the truth.",
                                    "score": 875,
                                    "author": "NRMusicProject",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Real rough turn of events.  I guess we will just have to stop investigations.",
                                            "score": 66,
                                            "author": "dgauss"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Right? I can't beleive she shot herself in the back of the head 17 times after pulling off all her finger nails and breaking all her fingers and then cut herself up until 17 peices and dumping each peice in a different body of water.\n\nSo sad.",
                                            "score": 53,
                                            "author": "Karjalan"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is too big a mystery for us. I think we'd better call in the Hardly Boys.",
                            "score": 563,
                            "author": "KindergartenRedditor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is giving me a raging clue",
                                    "score": 382,
                                    "author": "chronous3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My clues pointing to the left",
                                            "score": 121,
                                            "author": "LumberjackJack",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Reeeealllllly? Because my clue is pointing to the right",
                                                    "score": 69,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "mmmm i can smell all your clues",
                                                            "score": 26,
                                                            "author": "DreadCommander",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What's weird to me is that OP specifically chose to change the title from the original \"chilling tweet\" to \"cryptic tweet\". Kind of makes you wonder why they changed the title.",
                    "score": 1478,
                    "author": "iSeven",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The only cryptic thing in this thread is OP's decision to use the word cryptic.",
                            "score": 969,
                            "author": "Oblivion2104",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Why has no one else mentioned that it's OP that introduced the word \"cryptic\"? Wtf OP?\n\nEdit--other people mentioned it too, but I thought it would be like the top comment.",
                            "score": 481,
                            "author": "dk_lee_writing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because nobody reads the articles",
                                    "score": 112,
                                    "author": "SheeEttin",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 6855,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't think it is breaking down, but what is really happening is that it is being revealed there never was a rule of law for those living at the top.The laws only existed for us, never for them.",
                            "score": 7562,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The grand illusion is fading.\n\n\n\n\n\nThanks for the gold kind stranger.",
                                    "score": 5319,
                                    "author": "el_shiggs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 1105,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 809,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 715,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 222,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 57,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 113,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 83,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 18,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I feel it was a post WW2 image we all wanted to uphold, that now the world is finally a better place.\n\nBut as that generation twilights... So goes the illusion.\n\nAnd revealed to us now is humanity's darkness.\n\nHow foolish were we to believe the charade. Of course the elite will always protect the elite. The top must remain on top. They cannot suffer checks and balances from lesser creatures like us.\n\nChange will always... *HAS* always... come by the revolutionaries who fought the system, brave visionaries and dreamers who unite the people into a powerful and unrelenting force. \n\nI don't think many in the 99% realize just how despised they are by the 1%. To most of them we are producers, at best... dead weight, at worst.\n\nEDIT -  typo\n\nEDIT 2: The Sequel - thank you right-smart very kindly for the silver, Kind Stranger^TM\n\nEDIT 3 - holy shit, Platinum. Thank you, Kind Stranger^TM",
                                            "score": 1995,
                                            "author": "HawtchWatcher",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's insanely easy for a bit of propaganda, greed, or prejudice to turn even good men and women evil. And social media has become the most effective way of spreading greed, propaganda, and prejudice known to man.",
                                                    "score": 646,
                                                    "author": "NineteenSkylines",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "“Another threat, less overt but no less basic, confronts liberal democracy. More directly linked to the impact of technology, it involves the gradual appearance of a more controlled and directed society. Such a society would be dominated by an elite whose claim to political power would rest on allegedly superior scientific knowhow. Unhindered by the restraints of traditional liberal values, this elite would not hesitate to achieve its political ends by using the latest modern techniques for influencing public behavior and keeping society under close surveillance and control. Under such circumstances, the scientific and technological momentum of the country would not be reversed but would actually feed on the situation it exploits.\n\n… Persisting social crisis, the emergence of a charismatic personality, and the exploitation of mass media to obtain public confidence would be the steppingstones in the piecemeal transformation of the United States into a highly controlled society.”\n\n― Zbigniew Brzezinski",
                                                            "score": 311,
                                                            "author": "ShellOilNigeria",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "At the same time you could argue the opposite, that technology has allowed us to communicate individually on a massive scale in a way where the message couldn't be controlled by the elite. Prior to the internet, people got their news from a few sources. Now you can literally talk to anyone, anywhere.\n\nEdit: For those responses about controlling the internet, you are absolutely right, there are ways to control the internet. I see what is happening in Iran, HK and Egypt. I saw what happened in Iraq during the Arab Spring. Yes, it can and does happen. I can't really speak to countries that have a more authoritarian regime setup than the US. I can only speak from my experience in the US over the past 46 years. It hasn't happened in the US. The government does not CURRENTLY actively control our content like China. Yes they have the ability to monitor and probably do, although I doubt it's as actively as some people think. That's just that much of a reason to be vigilant and civically active.",
                                                                    "score": 163,
                                                                    "author": "mods_can_suck_a_dick",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 112,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 45,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"People said that there was one law for the rich and one law for the poor, but it wasn't true. There was no law for those who made the law, and no law for the incorrigibly lawless. All the laws and rules were for those people stupid enough to think like Cockbill Street people.\" - Terry Pratchett, Feet of Clay",
                                    "score": 152,
                                    "author": "joncard",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It's some of both, things that were easier to cover up are now easier to bring to light, however things that use to end political careers or put people in jail are now being shrugged off or openly defended for partisan reasons.",
                                    "score": 51,
                                    "author": "Rad_Spencer",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Rules for thee; but not for me.\"",
                                    "score": 114,
                                    "author": "natenedlog"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; I don't think it is breaking down, but what is really happening is that it is being revealed there never was a rule of law for those living at the top.The laws only existed for us, never for them.\n\nOnly thing rich people go to jail for is stealing from other rich people...",
                                    "score": 100,
                                    "author": "Ukatox",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I think the big win for evil in the last few centuries has been abstraction. Your little tyrant doesn't starve peasants directly anymore. Too dangerous. Better to stay in the shadows, keep it quiet and attribute any tilting of the odds in their favor to \"hard work\" or \"ingenuity\" or some other euphemism for theft.\n\nMy pet conspiracy theory is that the Business Plot didn't collapse after Smedley Butler exposed them. I think those corporate interests learned that they didn't need a parade to throw a coup. I think they did it quietly in the last generation. I think they might have won. The whole thing operates at the whims of the wealthiest capitalists, or at least it seems that way to them. They have their own society with their own laws and we don't get to see it. It can't exist in full sun or we would tear it and them apart.\n\nEdit fleshed out that last paragraph",
                                    "score": 188,
                                    "author": "fashbuster",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yep, the rise of social media has only made it more apparent. The wealthy live by a different set of rules than the rest of us - the same way they have throughout history. \n\nThe only way to ever get rid of the corruption is to limit wealth accumulation. I have no idea how that can be done.",
                                    "score": 256,
                                    "author": "grimbotronic",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&lt;Queen silently puts her handgun back into her purse...mutters \"fuck\".&gt;",
                            "score": 204,
                            "author": "what_u_want_2_hear",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I thought she had dynamite with a laser beam?!? Wtf, Freddy?",
                                    "score": 56,
                                    "author": "BeneathTheSassafras",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Breaking down? No. The lack of it is being exposed, or rather *flaunted*, now. That's all. \n\n&gt;I could shoot a man dead in 5th Avenue and not lose a single voter.\n\nHow... Just **HOW** is anyone OK with a presidential candidate saying something that insane???\n\nEDIT: thanks for the Kind Stranger^TM , silver!",
                            "score": 628,
                            "author": "HawtchWatcher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People would rather die on their hill than admit they are wrong",
                                    "score": 257,
                                    "author": "GriffsWorkComputer",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yikes. I really hope nothing happens to her. The truth really needs to come, with the Epstein stuff but not just that. There's a \"war on truth\" (god, I hate those phrases) in almost everything these days. Can't trust anything, especially from governments, just as it's always been since the beginning of time.\n\nEdit: Had to adjust wording for some assclown with no life.",
                    "score": 308,
                    "author": "5DollarHitJob",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "But what could it mean?!?",
                    "score": 243,
                    "author": "Verypoorman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“THE NUMBERS, MASON.”",
                            "score": 82,
                            "author": "plopseven"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "came here to say ‘it’s not that cryptic’\n\nglad it’s not that unique a perspective",
                    "score": 104,
                    "author": "alan-the-all-seeing",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Too bad she didn't mention her undiagnosed heart condition.",
            "score": 454,
            "author": "ahecht",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or her extreme fetishes like being handcuffed and set on fire.",
                    "score": 226,
                    "author": "TheWorldWeWillDieIn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's like the spy in the bag case here. \"Oh he had a fetish for confined spaces so zipped himself up in a bag, in the bath, padlocked it on the outside, then died.\" \nTotally believable. https://en.wikipedia.org/wiki/Death_of_Gareth_Williams",
                            "score": 83,
                            "author": "Terriberri877",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is basically the opposite of cryptic, she’s explicitly expressing that she feels under threat of being killed by powerful people and is attempting to protect herself.",
            "score": 17026,
            "author": "blitzwit143",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think cryptic is the right word either but she's actually expressing what you said implicitly, not explicitly.",
                    "score": 3483,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's because expressing that she fears for her life isn't the primary purpose of this tweet. The purpose of the tweet is protecting her life by making it impossible to make the murder look like a suicide.\n\n(of course /u/blitzwit143 is wrong in calling this \"explicitly expressing that she feels under threat\", we agree on that)",
                            "score": 1160,
                            "author": "kushangaza",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 746,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sometimes these things happen. Such a tragedy. It could happen to anyone really. One minute you're asleep in your own home, and the next your house is burning down and you're unable to act because you're totally not drugged. Just awful.",
                                            "score": 185,
                                            "author": "soulstonedomg",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Bingo",
                                            "score": 111,
                                            "author": "GetInTheFuckingVan",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This just means they have to go with a car accident instead.",
                                    "score": 136,
                                    "author": "jd_ekans",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This just means they'll have to make it look like an accident.",
                                    "score": 42,
                                    "author": "ashok36",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think they meant to use 'ominous' instead of 'cryptic'",
                            "score": 109,
                            "author": "UpDown",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The newspaper used chilling, OP decided to change it to cryptic. I wonder why OP did that?",
                                    "score": 126,
                                    "author": "iamnotcreative",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Truly a cryptic change.",
                                            "score": 55,
                                            "author": "LucyFair13"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Op changed the title from when it originally said “chilling” instead of cryptic. Why change it?",
                    "score": 204,
                    "author": "wineheda",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The article says “chilling” not cryptic",
                    "score": 84,
                    "author": "swanronson22",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Just what a suicidal person would say.\" - royal assassin",
            "score": 1535,
            "author": "Komikaze06",
            "replies": [
                {
                    "level": 1,
                    "comment": "She made explicit reference to suicide not long before she shot herself 4 times in the back of the head. Clearly suicidal",
                    "score": 151,
                    "author": "JustLetMePick69",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "“It’s so sad, to think that a person could go from not being suicidal to shooting themselves in the back of the head from a kneeling position so quickly.”",
                    "score": 324,
                    "author": "DeepHorse",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“... in the back of the head **twice** from a kneeling position...” \n\n“Truly heartbreaking”",
                            "score": 132,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "you don't have to be suicidal to get into an accident 🤔",
                    "score": 58,
                    "author": "wirewolf",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "There’s a woman who, along with hundreds (likely thousands) of other children were sex trafficked to rich and powerful people all over the world. People who have infiltrated our governments at every level. This woman is now making a public statement in an attempt to protect herself from being actually murdered by said powerful people. This is all real life. This is really happening and most of the top comments are about the word cryptic. Fuck, you guys, can we maybe talk about how it’s time to get our power back from the monsters running the show? They have bled us all dry. Literally taken all of the money. All of it. And then they prey on our children made vulnerable by a lack of resources. This evil is party blind and we need to figure out how to come together to fight this pathocracy. They are lying and brainwashing and manipulating us from the top down and if we cannot protect our children then no one is safe. With the surveillance state in full bloom we have little time to act.",
            "score": 1540,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! People would rather talk about grammar than the actual news.",
                    "score": 191,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "How is that cryptic in any way?\nAlso, whoever put that unnecessary apostrophe in there should be slapped.",
            "score": 5538,
            "author": "anarchy_distraction",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the actual headline\n\n&gt;Prince Andrew accuser's chilling tweet as Epstein's alleged 'pimp' reportedly prepares to give interview",
                    "score": 1699,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;'pimp'\n\nI'm sorry, but no. She wasn't a pimp she was a fucking child molester. There are multiple victims who claim that she not only tricked into sex with Epstein by her, but she also directly involved in the abuse itself.",
                            "score": 1239,
                            "author": "Taco_Dave",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "'Head of a child sex trafficking ring' would be more accurate.\n\nAs despicable as child molestation is, Maxwell is far worse than some kid who got sucked off by a 17 year old because he thought she was 18. She is also a lot worse (imo) than Prince Andrew or anyone else 'involved' as she was the one who facilitated it all, much like a pimp or ringleader, while also taking part herself. She is the closest thing to real life evil that I can imagine.",
                                    "score": 754,
                                    "author": "callisstaa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pretty much. Maxwell is almost weirdly under the radar in these discussions, but she was instrumental in Epstein's operation. The stories of  all the gaslighting she did to these young girls are fucking chilling.",
                                            "score": 266,
                                            "author": "Ghostiet",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Can’t call a non-sentenced child molester a child molester in a newpaper headline though. Like, by law.",
                                    "score": 145,
                                    "author": "hijinx1986",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well then how about \"close personal friend and confidant of convicted child molester Jeffery epstien\"",
                                            "score": 92,
                                            "author": "Arken411",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "it's OP... OP decided to change the headline and put a random apostrophe and S in a place where it didn't go.",
                    "score": 675,
                    "author": "PM_ME_A_PLANE_TICKET",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is the real conspiracy!",
                            "score": 125,
                            "author": "The-Go-Kid",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Op was also the one who added the completely incorrect \"cryptic\" instead of the headline's much more appropriate \"chilling.\"",
                            "score": 233,
                            "author": "Quazifuji",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "She's been threatened.",
            "score": 77,
            "author": "buttonmashed",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Epstein didn't kill himself.",
            "score": 9595,
            "author": "Jurisnoctis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can someone decode this cryptic message for me??",
                    "score": 6354,
                    "author": "ceege_egeec",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think he's saying 'I love lasagna'.",
                            "score": 1809,
                            "author": "OpTOMetrist1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He loves obama",
                                    "score": 543,
                                    "author": "realcommovet",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"Be sure to drink your Ovaltine\"",
                            "score": 175,
                            "author": "RG450",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A reminder Epstein's pimp is roaming about free.\n\nAlso, an Israeli called [Ben-Menshe](https://en.wikipedia.org/wiki/Ari_Ben-Menashe) claiming to be a former mossad operator,  [claimed he recruited Maxwell and Epstein](https://www.thesun.co.uk/news/10414087/ghislaine-maxwell-epstein-mossad-agents-politicians-sex-blackmail/)\n\nEdit: Israelis and Americans cooperate, don't think it's about a jewish world control, it's about intelligence agencies being worst beings on earth.\n\n\"The new book takes this further and claims Maxwell may have worked for other governments too as as a double or triple agent.\"",
            "score": 1121,
            "author": "yieldingTemporarily",
            "replies": [
                {
                    "level": 1,
                    "comment": "Clearly the defining quality of a Mossad operator is that he goes online telling people that he's a Mossad operator.",
                    "score": 296,
                    "author": "MyThickPenisInUranus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's all good if they add \"I mean not Mossad\".",
                            "score": 52,
                            "author": "tinkletwit",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;The tweet comes as British newspaper The Sun reports that Ghislaine Maxwell is set to do a US TV interview in order to defend Prince Andrew against the underage sex claims.\n\n&gt;Maxwell has not been seen in public since June and The Sun is offering a 10,000 pound ($A20,000) reward for information leading to her being found.\n\n&gt;\"Ghislaine is in hiding and knows the only way to stop being hunted is to speak on her own terms,\" an unnamed source told the paper.\n\n&gt;“She will do a sit-down interview with a big US network and defend the Duke.\n\n&gt;\"Apparently, she’ll say Virginia Giuffre is lying and Andrew never had sex with her,” the source said.\n\n\nSo someone extremely close to Epstein, and has been accused by many people of procuring and trafficking children for him is going to come out and say that one of the trafficked girls is lying about who she was forced to have sex with. \n\nSo is she planning on coming out and saying she setup the rapes and so knows exactly who was raping the kids? Is she planning on saying she had absolutely nothing to do with the rapes and didn't know any of it was happening BUT she also knows Prince Pedo didn't do any of it?\n\nWhy is this woman not locked in a jail cell rather than doing interviews with 'a major american news organization'?",
            "score": 59,
            "author": "LostWoodsInTheField",
            "replies": []
        },
        {
            "level": 0,
            "comment": "good for her. that was extremely smart.  and fucking sad that this is something she had to do.",
            "score": 777,
            "author": "that_random_Italian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sadly, even if something happens to her, I doubt justice will be served. Everyone will look the other way",
                    "score": 296,
                    "author": "starkrises",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 178,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sadly it doesnt mean her family and friends arent suicidal from all the stress she is enduring.",
                    "score": 70,
                    "author": "RhEEziE",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck area 51. Let's storm this mother fuckers mansion!  All of these elite even!",
            "score": 54,
            "author": "robfurious",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is the best tl;dr I could make, [original](https://7news.com.au/entertainment/prince-andrew-accusers-chilling-tweet-as-jeffrey-epsteins-alleged-pimp-prepares-to-emerge-from-hiding--c-600753) reduced by 74%. (I'm a bot)\n*****\n&gt; Former American Virginia Roberts Giuffre, who now lives in Queensland, says she was a teenager when she was trafficked by dead paedophile Jeffrey Epstein to have sex with Prince Andrew in 2001.Epstein died in a New York prison of an apparent suicide in August this year, about a month after his arrest on sex trafficking charges.\n\n&gt; Abuse allegations The 36-year-old recently gave an interview to the BBC program Panorama and alleged she had been forced to have sex with Prince Andrew three times - in New York, London and on Epstein&amp;#039;s private Caribbean island.\n\n&gt; The tweet comes as British newspaper The Sun reports that Ghislaine Maxwell is set to do a US TV interview in order to defend Prince Andrew against the underage sex claims.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/e97gxi/prince_andrew_accusers_sends_out_cryptic_tweet_i/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~448469 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **sex**^#1 **Andrew**^#2 **Prince**^#3 **Giuffre**^#4 **Epstein**^#5",
            "score": 91,
            "author": "autotldr",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Imagine being a rape victim of multiple powerful disgusting old men and this is the type of shit you have to think about just in accusing them. \n\nThere's a disgusting underbelly in our society we are all aware of but know little about and this woman has seen it. Hoping our justice system can do its job but it rarely does. Every one of these fuckers deserves a noose.",
            "score": 99,
            "author": "TheFloosh",
            "replies": []
        },
        {
            "level": 0,
            "comment": "how Is this cryptic ?",
            "score": 1091,
            "author": "balloon_prototype_14",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not cryptic, at all. \n\nOP for some reason seemed to have changed the headline to incorrectly use the apostrophe and swapped the word \"chilling\" with \"cryptic\".",
                    "score": 783,
                    "author": "BitingChaos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The apostrophe is there in the original headline but it's a different sentence - \"Prince Andrew accuser's chilling tweet\".  OP has somehow mangled the headline into an ungrammatical mess",
                            "score": 250,
                            "author": "ShelfordPrefect",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's the reddit way.",
                                    "score": 82,
                                    "author": "2bad2care",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "r/worldnews rules: No editorialized or misleading titles...\n\nSeems no one cares about the rules.",
                            "score": 127,
                            "author": "bukithd",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It sure is a shame she committed suicide by three gunshots to the back of the head tomorrow.",
            "score": 1663,
            "author": "_Hopped_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gareth Wyn Williams Welsh mathematician and employee of [GCHQ](https://en.wikipedia.org/wiki/Government_Communications_Headquarters) seconded to the [Secret Intelligence Service](https://en.wikipedia.org/wiki/Secret_Intelligence_Service) (SIS or MI6) who was found dead in suspicious circumstances at a Security Service [safe house](https://en.wikipedia.org/wiki/Safe_house) flat in [Pimlico](https://en.wikipedia.org/wiki/Pimlico), London, on 23 August 2010. His decomposing naked remains were found in a red North Face bag, padlocked from the outside, in the bath of the main bedroom's en-suite bathroom.\n\n\" A subsequent Metropolitan Police re-investigation\\[2\\] concluded that Williams's death was \"probably an accident\".\n\n[https://en.wikipedia.org/wiki/Death\\_of\\_Gareth\\_Williams](https://en.wikipedia.org/wiki/Death_of_Gareth_Williams)\n\nWhen she is discovered inside a trash compactor with her hands handcuffed behind her back and her tongue cut out this will also be determined to be an \"accident\".",
                    "score": 1111,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There was that guy that was attempting to expose the Fresno police for setting people up (especially the poor) that ended up dying in a really bizarre way and the police deemed it a house fire or something ridiculous like that.",
                            "score": 408,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "John Paul Lang. Final coroner's report claimed that he stabbed himself and set his house on fire which caused him to die from smoke inhalation. Supposedly the police have video evidence from inside his house (taken from his internal cams system) where he brandishes the knife and turns off the system just before the fire department arrives.\n\nhttps://abc30.com/news/final-coroners-report-on-the-suicide-of-john-lang-released/1355566/\n\nOK. Just seems weird and like he wouldn't do that but we'd need to see the \"footage\" and we never will.\n\nhttps://www.fresnobee.com/news/local/crime/article69339482.html",
                                    "score": 290,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have a buddy in Stockton (not too far from Fresno, relatively speaking) who got a ticket at 1:09am on December 26th for speaking out against the police department for how they handled a situation (I believe it was a bank robbery that got handled how the jewelry heist was handled in Florida recently). His car was ticketed for bad tags, but his car was backed in so the tags weren’t visible from the street. Not only that, but he lived in a cul de sac in the very back of a neighborhood very far away from the main road, you’d have to be looking for him specifically to find the house. Luckily the cop got fired but shit like that happens everywhere all the time, those in power have no qualms about scaring you into submission.",
                                            "score": 161,
                                            "author": "Secondary0965",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Man, don’t you hate it when you accidentally padlock yourself inside a duffel bag? If I had a nickel for every time...",
                            "score": 49,
                            "author": "combatcookies",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do guys remember, how there used to be this playground rumor that rich people herd poor people and hunt them for sport.\n\nIt's slowly becoming a frightening reality in my mind.",
            "score": 408,
            "author": "pandafromars",
            "replies": [
                {
                    "level": 1,
                    "comment": "there's also this case. sadly the investigation fell apart after one dodgy witness but everything about the other witnesses and evidence has gone cold too\n\n&gt;He told The Telegraph: “I was contacted by a young man who seemed to be in his 20s. He told me he believed Vishal may have been taken by paedophiles in the Elm Guest House near Barnes Common.\n\n&gt;“He said there were very highly placed people there. He talked about judges and politicians who were abusing little boys.” Mr Mehrotra, a solicitor who was a JP at Wimbledon magistrates’ court until retiring in 2006, claims the man said he had already informed police about activities at the guesthouse, but had received no response.\n\n&gt;He added: “I recorded the whole 15-minute conversation and took it to police. But instead of investigating it, they just pooh-poohed it and I never heard anything about the tape again. The whole thing went cold.\n\n&gt;In February 1982, part of Vishal’s skeleton was found in woodland in West Sussex. There was no trace of his legs, pelvis or lower spine, nor of his outer clothes, his sleeveless vest or his Superman underpants. At the inquest into his death, the West Sussex coroner Mark Calvert Lee recorded an open verdict but said “foul play” \nwas likely....In June 1982, four months after Vishal’s remains were found, police raided the Elm Guest House.\n\n&gt;Dozens of men were questioned, reportedly including at least 30 who were prominent in public life and business. It was widely reported at the time that the raids were linked to Vishal’s disappearance. The Times reported that the investigation had included the disappearance of another boy, Martin Allen, 15, missing since Guy Fawkes Night, 1979, whose body has never been discovered. The son of the chauffeur to the Australian High Commissioner, he was last seen waving goodbye to a school friend at King’s Cross Underground station.\n\n&gt;Police at the time dismissed the reports as “nonsense”. Soon afterwards, lawyers acting on behalf of the guesthouse threatened newspapers with legal action if they continued reporting on its alleged activities. Martin’s brother said on Tuesday that police should reopen the investigation into the teenager’s disappearance. Kevin Allen, 51, said he had always suspected a cover-up after police told him all the case files had been lost in a freak flood.\n\nhttps://www.telegraph.co.uk/news/uknews/crime/11239535/Father-claims-Scotland-Yard-covered-up-sons-murder-by-Westminster-paedophiles.html",
                    "score": 144,
                    "author": "apple_kicks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What the actual fuck. Dude this is down right scary.",
                            "score": 53,
                            "author": "pandafromars",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That was Lolita Island in many ways. Rich, old men using their dicks to hunt 15 year old girls.",
                    "score": 179,
                    "author": "what_u_want_2_hear",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The reality is every where in the world, doesn’t matter which country, there are people that are above the law and nothing happens to them no matter what they do. Hope the people involved get some punishment. Also what happens to the Florida AG that essentially let Epstein off the hook?",
            "score": 53,
            "author": "yalogin",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The modern rich people are the greatest enemy that humanity has ever known.",
            "score": 68,
            "author": "pendejosblancos",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That's not cryptic but it doesn't matter. I'm sure \"they\" have other ways of making someone go away.",
            "score": 293,
            "author": "plywooden",
            "replies": [
                {
                    "level": 1,
                    "comment": "She's still in the same amount of danger, but at least being this public with her fears means that people will notice if something happens to her.  And at this point, anything happening to her, even an actual accident, would be shady as fuck.",
                    "score": 28,
                    "author": "Delanium",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The suicide card is now impossible to trigger so either she tragically having an accident suddenly or she simple having a \"robbery\" and been killed then, suspects wouldn't be arrested besides if they are useful idiots who wouldn't be believed if they once telling the whole story.",
                    "score": 165,
                    "author": "Alfus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 122,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why did you change the headline and misuse the word cryptic? Just use the same headline.... ffs op.\n\nYou also put the apostrophe in the wrong place, as long as I'm criticizing you.",
            "score": 712,
            "author": "PM_ME_A_PLANE_TICKET",
            "replies": []
        }
    ]
}