{
    "id": "t1o8wq",
    "score": 171617,
    "title": "Rejecting US evacuation offer, Zelensky says I need anti-tank ammo, 'not a ride'",
    "author": "CyberArtillery",
    "date": 1645850441.0,
    "url": "https://www.reddit.com/r/worldnews/comments/t1o8wq",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "NATO is now reported seeking Ukranian membership.",
            "score": 6675,
            "author": "cloudposts",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, if we're ever dragged into war, I want Zelensky to have my back.",
                    "score": 2062,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No joke, the Ukrainian people should be proud to have the man as president. Unflinching in the face of possible annihilation, standing side by side with his people. The man is what the leader of every country should strive to be.\n\n\nEdit: I’d like to take the opportunity to say, as an American citizen, as much as I can, I stand with Zelensky and I stand with Ukraine 🇺🇦 \n\nLong live strength against tyranny and unprovoked aggression, Long live Ukraine\n\nTo those on the front lines, stay strong. \n\nTo the other leaders of the world, now is the time to step up for what is right.",
                            "score": 1137,
                            "author": "F-18Bro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It blows my mind that before this he was just a comedian who was famous for playing the piano with his dick.....",
                                    "score": 284,
                                    "author": "Ok_Improvement_5897",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s probably why he is acting like this, he hasn’t been “bred” to be a politician",
                                            "score": 220,
                                            "author": "dgrb93",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You know how so many politicians say they're \"an average joe, just like you\" But you see their family wealth and it's huge",
                                                    "score": 53,
                                                    "author": "Brawler6216",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 134,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Please! Can we join?!! I wanna be part of the UU (Ukrainian Union) 🇺🇦",
                    "score": 457,
                    "author": "mortendaehli",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "“I need anti-tank ammo, not a ride.” And “Russian warship, go fuck yourself.” Will go down in history",
            "score": 12417,
            "author": "absolute_zenologia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don't forget \"there is no purgatory for war criminals, they go straight to hell, Ambassador\".",
                    "score": 7001,
                    "author": "kittenandkettlebells",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "~~\"You don't know what your president thinks. Your words are as worthless as a hole in a pretzel.\"~~ [\"You have no idea what is on the mind of your president. Your words have less value than the hole in a New York pretzel.\"](https://mobile.twitter.com/Acyn/status/1497357669102882818) Also the Ukrainian ambassador\n\nEdit: I slightly misremembered the quote. I corrected it.",
                            "score": 3149,
                            "author": "Sir_Sid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“Put seeds in your pockets so flowers will grow where you fall”\n  \nUkrainian lady to passing Russian soldiers. \n   \n(I might not have quoted perfectly)",
                                    "score": 2965,
                                    "author": "SpongeBorgSqrPnts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1282,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "These Ukrainians, they have a way with words i like it",
                                                    "score": 315,
                                                    "author": "I_like_the_stock1",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "“Let me Put sunflower seeds in your pocket so at least when you die your body grows flowers”",
                                            "score": 221,
                                            "author": "Milam1996",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'd love to add \"put sunflower seeds in your pockets so they grow on Ukraine soil when you die\" and \"you'll see our faces, not our backs\". \n\nAll amazing quotes that should be memorialized.",
                            "score": 1264,
                            "author": "oienel",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Russia's problem here is that if he dies, he's a martyr.  If he lives, he's a hero.  They've failed to make him look weak and surrender. They'll never be able to hold an occupation of more than a few eastern territories. They won't be able to install a puppet government who can control the populace.",
            "score": 4104,
            "author": "zombieblackbird",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know if Ukraine can win but Putin has already lost.",
                    "score": 2273,
                    "author": "accountedly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1040,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We’ve seen how fiercely and how bravely Ukraine has fought to keep their home and their freedom. If Putin thinks they would just roll over and show their bellies under a puppet government, he is going to be sorely mistaken.",
                                    "score": 772,
                                    "author": "manditobandito",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This man is putting so many “world leaders” to shame. Freaking legend already.\n\nI’m from Mexico and I’m 100% certain our actual president would never behave this bravely, even if he was younger. Pretty certain that many people around the globe are wondering the same about their heads of State.",
            "score": 7857,
            "author": "MarvinTraveler",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aussie here- ours already fucked off to Hawai on holiday while the whole country was burning",
                    "score": 1572,
                    "author": "Kachana",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can’t even fathom that piece of shit scomo has the same basic job as zelensky.\nJust polar opposites. One is a leader, the other is a vacuous human marshmallow that shat himself at Maccas",
                            "score": 343,
                            "author": "ElkShot5082",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It boggles the mind that enough Aussies voted him in. We've lost the plot",
                                    "score": 118,
                                    "author": "doorbellrepairman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "All the scomo supporters I know have no idea about any of his policies- they just heard him say he’s a christian so they tick the box without looking any further. I tried to argue that he’s not good for the country and they were like “it’s a hard job being a politician. I’m sure he’s doing his best.” *facepalm* if you don’t give a shit enough to look into who you’re voting for then don’t even vote!",
                                            "score": 56,
                                            "author": "Kachana",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Absolutely. In most cases when a country gets invaded the politicians are the first to jump ship to a neutral or allied country.",
                    "score": 52,
                    "author": "RandomStranger62",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Ya I can’t think of any other world leader that would honestly.",
                    "score": 606,
                    "author": "Empty-Elderberry-73",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The amount of supplies going into Ukraine from the Polish border is increasing by the hour. Family\nMembers stationed on Ukrainian border have alleged that large quantities of javelins, stingers, and MANPAD systems are flowing into Ukrainian held areas.\n\nYou are not alone Ukraine! Polands borders are open to Ukraine in BOTH ways. To provide refuge and send arms and ammunition, just like our neighbor Lithuania has promised.\n\nSlava Ukraini!",
            "score": 6869,
            "author": "GoobleGobbl",
            "replies": [
                {
                    "level": 1,
                    "comment": "A Russia, Ukraine war is a war for against all former soviet countries. If Ukraine falls, the rest of the former soviet states are next. It's a fucking sad state of affairs, fucking putin. Prick",
                    "score": 1885,
                    "author": "theflyingkiwi00",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's a wartime one-liner right up there with Jean Danjou's \"We have munitions. We will not surrender.\"",
            "score": 13893,
            "author": "MasterThespian",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"We’re paratroopers, we’re supposed to be surrounded\"",
                    "score": 4820,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The enemy is in front of us, to the left, to the right, and behind us.  They can't get away this time.\n\nEdit: -Chesty Puller, may be a bit paraphrased.  He had a few interesting quotes.",
                            "score": 3248,
                            "author": "Boss_Boggs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"They've got us surrounded, the poor bastards.\"",
                                    "score": 2886,
                                    "author": "Idiot_Savant_Tinker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"We've been looking for the enemy for several days now and we've finally found them. We're surrounded. That simplifies our problem of getting to these people and killing them.\"",
                                            "score": 1194,
                                            "author": "Heroshade",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Hard pressed on my right. My center is yielding. Impossible to maneuver. Situation excellent. I attack.\"",
                                    "score": 603,
                                    "author": "Medic1642",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"Russian Warship, go fuck yourself.\"",
                    "score": 6378,
                    "author": "Wessssss21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those troops will literally go into History. Those are words for future history books. Balls bigger than the island they were defending \nBless Ukraine 🇺🇦",
                            "score": 3386,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lets be clear they were not regular military \"troops\", they were border guards and probably barely armed. They certainly didn't have the facilities, weapons and munition to take on a Russian Navy Warship. \n\nAt any point the Russians Warship could have disengaged and just left them there helpless. They could have been bypassed with little threat to the navy or effect on the outcome of the war. \n\n**They were all murdered for simply being defiant.**",
                                    "score": 3556,
                                    "author": "ExploreTrails",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you!! I'm glad I'm not the only one who feels like that was more murder than war.",
                                            "score": 713,
                                            "author": "canadianjumpingbean",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The part that really got me was when the other guy said “just in case.”\n\nLike, “just in case this IS the end, definitely tell them to go fuck themselves.”",
                                    "score": 1593,
                                    "author": "LosPesero",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same. It was a female agent who said “just in case” and appears to turn the volume dial up so the Russians would hear their reply. She has balls too.",
                                            "score": 1051,
                                            "author": "whoa_melly",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Steel Balls of gargantuan magnitude. I will forever respect those 13 brave soldiers.",
                                                    "score": 282,
                                                    "author": "LavaTacoBurrito",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Literally will be remembered along with “they’ve got us surrounded, the poor bastards,” and “damn the torpedoes, full steam ahead.”",
                                    "score": 297,
                                    "author": "Not_Henry_Winkler",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m already getting goosebumps over those words. We just witnessed a piece of history we will talk about decades from now.",
                                    "score": 623,
                                    "author": "a_blue_ducks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This event makes me want to throw up. I will never forget this.",
                                            "score": 214,
                                            "author": "badthrowaway098",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Kind of tangential, but I was reading an article about that, and they quoted the line as \"Russian Warship, [expletive]\". It made me so angry. Like, it's an article about 13 consciousnesses being snuffed out for no god damn reason in a pointless war, so it's clearly not an article for *kids*, but you won't do these guys the dignity of printing their (badass) last words because they *had a swear*? Journalistic conventions can fuck right off in this case, alongside that Russian warship.",
                            "score": 1880,
                            "author": "blorfie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Amazing how some people will blot out one tiny little obscenity inside a much, much bigger obscenity.",
                                    "score": 715,
                                    "author": "JonMW",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "13 people murdered: “Yeah, kids can read about this”\n\nThose people tell their murderer to go fuck themselves: “OmG rUdE WoRdS, tHinK oF tHe ChiLdReN”",
                                            "score": 172,
                                            "author": "Anony_mouse202",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They and the warship can go fuck each other",
                                    "score": 242,
                                    "author": "DarthCloakedGuy",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Funnily enough Jean Danjou also fought in Ukraine during the Crimean War.",
                    "score": 654,
                    "author": "The_Great_Sarcasmo",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "He keeps getting more badass every day.",
                    "score": 839,
                    "author": "watanabelover69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If they ever make a movie about him, I hope he plays himself in it.",
                            "score": 641,
                            "author": "Not_Your_Romeo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sacha Baron Cohen as Putin",
                                    "score": 337,
                                    "author": "mechwarrior719",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"Come on, you sons of bitches, do you want to live forever?\" - Daniel Daly",
                    "score": 264,
                    "author": "jeezebitz",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[What do I need?](https://c.tenor.com/eJEnnBN0-AYAAAAC/halo-master-chief.gif)\n\nIn all seriousness, Zelensky gets it.  If you're going to ask others to fight and die for your country, you have to be willing to put yourself in harms way just as much as they do.  Lead from the front, not the rear.\n\nLooking at you, Pussy Putin.",
            "score": 7377,
            "author": "BlackStrike7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Zelensky turned out to be the whole \"badass dude\" that Russian propaganda portrayed Putin as.",
                    "score": 3203,
                    "author": "LordOfPies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And then some",
                            "score": 705,
                            "author": "--redacted--",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 947,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly. He's the leader of the Ukranian people and this is what a true leader does. He's not *managing* the people from afar, he's *leading* them as one of their own. That's what they elected him to do and he has my utmost respect. Whatever happens, he is a hero who has stared tyranny in the face and stood firm.",
                    "score": 96,
                    "author": "BrewtalDoom",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is it exactly. It’s very rare to find leadership like that at the top.",
                    "score": 554,
                    "author": "underwaterpyrimids",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think he knows that even if he is killed, he will create a huge problem for Russia. He will be seen as a martyr and inspire resistance for years to come even if Russia succeeds. I think this makes Putin nervous. I think he calculated Zelensky would flee and Ukrainians would become deflated. Clearly the opposite is happening.",
            "score": 10253,
            "author": "knockinforthesugar",
            "replies": [
                {
                    "level": 1,
                    "comment": "A leader does what he sees his best for his people. Unlike a tyrant, who only does what's best for themselves. Tyrants must be disposed of",
                    "score": 3138,
                    "author": "Iamien",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly, the war criminal is hiding like a coward in Russia, he acts like a tough KGB , but in reality he has a thin skin , only a coward would hide behind  nuclear bombs.",
                            "score": 577,
                            "author": "ProtonPi314",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think this is the case, and I'm grateful Zelensky is willing to be a martyr if necessary. That's patriotism.",
                    "score": 2321,
                    "author": "Hold_the_gryffindor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's even more practical than martyrdom. Like, him, the Klitschko brothers, and other big names of their political and celebrity brigade give media a resource to build storylines upon and that matters in the long run. If they come out of this unscathed, which I doubt because Putin's a bitch, but if they do, Ukraine will get years of media coverage and that's as valuable as gold in history. Zelensky and others are going to stay viral and relevant for a long time by staying in the eye of the storm. He's really risen to be a great leader at a time of crisis.",
                            "score": 1587,
                            "author": "retrogradeanxiety",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It's more than patriotism. He is standing for more than his country. He is standing for his values. Values every human being with a shred of empathy should be able to stand up for as well. He isn't just an inspiration to his country. He's an inspiration to humanity.",
                            "score": 434,
                            "author": "JimJam28",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh yeah totally. Putin is turning Zelensky into the real-life action hero he so desperately portrays himself as.",
                    "score": 142,
                    "author": "TheBaddestPatsy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You might be right.\n\nStrategically, Putin probably thought his plan to attack from several fronts would overwhelm, perhaps lower moral too. Which is pretty much what you said. \n\nHe's getting a shit storm up his ass right now.",
                    "score": 543,
                    "author": "PixalPop",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Zelensky is a real ride or die motherfucker.",
            "score": 19002,
            "author": "fargenable",
            "replies": [
                {
                    "level": 1,
                    "comment": "He is what the country needs in such a tough time. The country deserves more support, but geo-politics requires such unique involvement that he gets so much less.\n\nI hope other leaders will see this and have more compassion than alliances.",
                    "score": 5075,
                    "author": "EastTexasAg",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lawyer --&gt; Comedian --&gt; Actor --&gt; President --&gt; Extreme Badass",
            "score": 1195,
            "author": "Seoniara",
            "replies": [
                {
                    "level": 1,
                    "comment": "What a strange fucking life it must have been. Ordinary person grows up to be a comedian. Not common, but nothing particularly special either. Then he becomes the president of his country, now he is unique. Then he becomes a fucking war hero and potentially, a martyr. I hope he lives, but if he dies, he died for the most valiant of causes.",
                    "score": 132,
                    "author": "Stercore_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I got to sleep last night imagining how some years later Ukraine joins EU and NATO and Zelenskyy is there as the guest of honor.",
                            "score": 55,
                            "author": "Twindlle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A fucking legend is being born before our eyes.",
            "score": 12617,
            "author": "Cheffie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope he lives to tell!",
                    "score": 3821,
                    "author": "TinyToodles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The internet never forgets",
                            "score": 1738,
                            "author": "FlyMyPig",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1578,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Every Ukrainian soldier deserves this title. Aswell as all Ukrainian citizens that are picking up arms and fighting back. All of them are fucking legends, don't just give the title to those who die. They're all risking their lifes.",
                            "score": 1113,
                            "author": "King_Moash",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I heard Zelensky once killed three Russian invaders, with a fucking pencil!",
                    "score": 1709,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I heard Zelensky told a joke and a hundred  Russians thanked him as they died from laughter.",
                            "score": 2254,
                            "author": "Pearlbarleywine",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Call the ambulance…but not for me”. \n\nThis man is a true leader.",
            "score": 1548,
            "author": "Snake_in_my_boots",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I love this guy. He better make it out alive.",
            "score": 1092,
            "author": "erinskull",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm hoping that Putin realizes it would be a suicide mission if they try to take Zelensky out. Whatever is happening now is terrible, but executing state leaders is next level insanity and he can forget about getting any cooperation from any other country after that. Not only that, I would not be surprised if that act leads to a civil war inside Russia itself given how much of the population does not support the war.",
                    "score": 72,
                    "author": "riricide",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so moved by this man's dedication to his country and his people. What a fucking hero. I know it's unlikely, but please, please let him make it out of this alive.",
            "score": 13549,
            "author": "uxxandromedas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why aren’t more of our countries leaders like him. Zelenesky is a great hero in his time. Hopefully he lasts to enjoy it. This world is riddled by evil.",
                    "score": 3717,
                    "author": "ConstaNople",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Funny thing is he used to be a comedian and actually was in a show where a teacher was elected President of Ukraine. The whole series is on Youtube with english subtitles https://youtu.be/GZ-3YwVQV0M",
                    "score": 563,
                    "author": "No_Entertainment_748",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "His political party is named after the show",
                            "score": 218,
                            "author": "yes_thats_right",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As an American I admittedly never knew much about how foreign leaders were, I just assumed they were like ours. Old, not much outside of political acumen, and out of touch with regular people.\n\nWhen I heard about Abdullah II of Jordan, for the first time I saw a real leader and knew I was ignorant. \n\nSeeing Volodymyr Zelenskyy lead his country in a way I never knew a politician could blows my mind. I have more respect for him than even our best politicians.",
                    "score": 761,
                    "author": "Scam_Time",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mostly they are same, some better, some worse, but once in a blue moon one gets someone like Zelenskyy. Unfortunately politics generally attracts bad people :(",
                            "score": 298,
                            "author": "CSI_Tech_Dept",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This man is a fucking hero.",
            "score": 2293,
            "author": "phuqo5",
            "replies": [
                {
                    "level": 1,
                    "comment": "All Ukrainians defending their country are heroes.",
                    "score": 2440,
                    "author": "brainwhatwhat",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What an incredible show of leadership under the most serious of conditions. The world is watching and I hope will act. We need countries like Ukraine and leaders like Zelensky. Truly humbled by their courage.",
            "score": 2297,
            "author": "Duke-of-Limbs",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's also intelligent. Zalensky clearly understands we live in a world of social media and fake news. That it has a real impact in war. He's going outside to also help dispel fake news about him. Fake claims he has fled and abandoned Ukraine, or told the military to surrender (which isn't true).\n\nAn example of how powerful social media is, was shown when the Taliban took over Afghanistan. They would record themselves accepting surrenders. When it was peaceful, they would share that on social media. They would also stage surrenders to be shared as well. Having seen such videos, it helped to encourage more places to surrender. Speeding up their take over.\n\nZalensky is trying to ensure that no one in Ukraine believes he is dead or abandoned the country. As then groups may start surrendering.",
                    "score": 133,
                    "author": "jl2352"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol damn we need to start calling Russia East Ukraine at this point. The balls on this guy.",
            "score": 7002,
            "author": "Top_Rekt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mongolia in sandwich between east Ukraine and West Taïwan lol",
                    "score": 474,
                    "author": "Choyo",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Idk why but I love this idea. \n\nLike it’s the most degrading thing you could probably say to Russia right now. \n\n“Russia? Huh? Oh you mean Eastern Ukraine”",
                    "score": 3836,
                    "author": "HomemadeSprite",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Know what lets get that mean rolling around",
                            "score": 728,
                            "author": "nonequation",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In 200 years history books will criticize Putin for his failures.\n\nIn 2000 years armies will quote Zelensky for his leadership and bravery in hell.\n\nThis is how you make a legacy.",
            "score": 5210,
            "author": "TheFukAmIDoing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please make it to next week.",
                    "score": 892,
                    "author": "jonny3jack",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is not brave....this is something else.\n\nNot many politicians would choose to stay and fight when a superior army is gaining towards their  position and they are the number 1 target of said army.\n\nHe was going to go down in history as the comedian who became a president. \n\nNow whether he makes it or not, he will go down as a president that looked death in the eye and did not flinch.",
            "score": 15994,
            "author": "shaainXoverlord",
            "replies": [
                {
                    "level": 1,
                    "comment": "He isn’t a politician, he’s a leader.",
                    "score": 14445,
                    "author": "BillyTheFridge2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It really should be mutually inclusive. He’s just the only one currently demonstrating it.",
                            "score": 2619,
                            "author": "Mister_Spacely",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2019,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because they have something he never will: the people’s respect.",
                                            "score": 1322,
                                            "author": "Bigblueforyou",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And courage. Putin sends conscripted teens to die on his behalf.",
                                                    "score": 717,
                                                    "author": "Username_Number_bot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 275,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "How are Russian troops watching a Ukrainian broadcast? Most of those caught/surrendering said they were never told why they were in Ukraine.",
                                                                    "score": 106,
                                                                    "author": "Username_Number_bot",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 108,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is a true patriot to his country. I've listened to him on NPR often and he had nothing but love for his people and his home. \n\nPutin is literally playing Risk and must be stopped. Charge him with war crimes immediately. Without a doubt this is a criminal act. \n\nRussians please revolt and drag his ass through the streets! STAND WITH UKRAINE, DON'T GIVE UP HOPE!!!!",
                    "score": 1808,
                    "author": "overlypositve",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "His grandfather fought back the nazi horde when it overran his homeland \n\nZelensky will be damned if he lets another fascist horde overrun it without putting up a fight",
                    "score": 402,
                    "author": "Haamboner",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "SEND HIM ALL THE JAVELINS! I want to see some Olympic caliber throws.",
            "score": 452,
            "author": "Daotar",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Isn't it kind of sad how a comedian makes a better politician than most of the people running the world right now?",
            "score": 4527,
            "author": "yospacemama",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn't that the punchline? \n\nPoliticians are jokes and comedians are statesmen.",
                    "score": 3570,
                    "author": "rustystainremover",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A beautiful joke",
                            "score": 344,
                            "author": "nonequation",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The best comedians have a wide capacity for empathy. I don’t find it that surprising actually.",
                    "score": 327,
                    "author": "bad_armenian_juju",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They are also smart people. You can't become a *good* comedian if you aren't sharp thinker.",
                            "score": 189,
                            "author": "KoeiNL"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Somebody please get this man some fucking anti tank ammo",
            "score": 417,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Give this man everything.",
            "score": 22870,
            "author": "Man_AMA",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; [US approves $600 million aid for Ukraine, including $350 million for the military.\n&gt; U.S. President Joe Biden signed a decree to provide immediate assistance to Ukraine, as the country is fighting off an all-out Russian invasion](https://twitter.com/KyivIndependent/status/1497445265992822788)\n\nFrom the *Kyiv Independent* just now. Zelensky asks for ammo and he gets it. \n\n[Confirmed by official White House statement.](https://www.whitehouse.gov/briefing-room/presidential-actions/2022/02/25/memorandum-on-the-delegation-of-authority-under-section-506a1-and-section-614a1-of-the-foreign-assistance-act-of-1961/) Biden has also requested an additional $6.4 billion for Ukraine, but that will require Congressional approval.",
                    "score": 4356,
                    "author": "Ganesha811",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Given there are 300 million Americans, that means approximately $3 of my tax dollar is going to Ukraine in the initial package.\n\n100% best $3 I’ve transitively spent this year. \n\nCongress better approve the additional funding and make that $3 into $23.\n\nI can handle some potholes in my roads, Ukrainians need weapons now.",
                            "score": 4830,
                            "author": "IMakeMediumSense",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Shit, man we could crowd-fund the defense of a nation at this point.",
                                    "score": 1182,
                                    "author": "carcar134134",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’d buy some missiles for Ukraine",
                                            "score": 588,
                                            "author": "__mr_snrub__",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You can: https://ukraine.ua/news/donate-to-the-nbu-fund/",
                                                    "score": 912,
                                                    "author": "JimJam28",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'll give a lot more than $3, potholes are annoying, but peoples lives are at stake",
                                    "score": 494,
                                    "author": "Clever_Word_Play",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "except a ride",
                    "score": 6927,
                    "author": "dyerej93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unless the ride is a tank with antitank ammo",
                            "score": 3928,
                            "author": "zacurtis3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " An apache might be nice",
                                    "score": 962,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How about a BRRRRRRRRTTT? Courtesy from the A10.",
                                            "score": 793,
                                            "author": "Crazian14",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nice lil' Warthog.",
                                                    "score": 296,
                                                    "author": "Inevitable_Chicken70",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I told you to stop making up animals",
                                                            "score": 230,
                                                            "author": "Frostsorrow",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hey Griff. Chupathingy.",
                                                                    "score": 99,
                                                                    "author": "SkyezOpen"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "pimp his ride with anti-tank ammo",
                            "score": 108,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Right?  This man is an absolut leader. \n\nHow is the world not rallying behind this man yet.\n\nFrance jumped on board first offering safety in their embassy in Kyiv.... the whole world really needs to do more... any little bit will help. But how can you let this brave president willing to die with his country men go out without the world's help.... I don't want to live in a world where this man is left to die without worldwide intervention. \n\nSave Zelensky \nSave Ukraine\nSave humanity",
                    "score": 2223,
                    "author": "L0ckeandDemosthenes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I want to live in a world where the hero lives.",
                            "score": 974,
                            "author": "Pearlbarleywine",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I want to believe in the Ghost of Kyiv!",
                                    "score": 441,
                                    "author": "DocFGeek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Plot twist: Zelensky *is* the Ghost of Kyiv.",
                                            "score": 392,
                                            "author": "MisterBlack8",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Me too, I'm staying up all night waiting to hear news that Zelenski made it today. I really hope he and his family are safe.",
                                    "score": 262,
                                    "author": "ellaC97",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I want to live in a world where we take Putin out and save the day.",
                                    "score": 157,
                                    "author": "Patient_Criticism231",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "MF’er isn’t going down without a fight",
                            "score": 108,
                            "author": "waterynike",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Putin: He's just a TV comedian, he can't lead a war\n\nZelenskyy lights another Molotov cocktail with his cigar and chucks it at Russian tanks.\n\nZelenskyy: Laugh at this, motherfucker.",
                                    "score": 374,
                                    "author": "ZigZagZedZod",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 141,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This man knows something Putin will never know… what it means to be a man.  Respect!",
            "score": 547,
            "author": "NCMorrisville",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As an American, Zelensky is more Bruce Willis than any man I've ever heard of.",
            "score": 75,
            "author": "MANDATORY_DEPRESSION",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Even just reading that line makes me want to run through a brick wall for him",
            "score": 227,
            "author": "TK_TK_",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 160,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Metal as fuck",
            "score": 1385,
            "author": "Eorel",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re not kidding.",
                    "score": 166,
                    "author": "ResponsibleContact39"
                },
                {
                    "level": 1,
                    "comment": "Big, brass, and they clang with each step.",
                    "score": 127,
                    "author": "oouncolaoo",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "He's in the streets, recording videos to let his people know he's right there with him. Can you imagine an American president doing that? My mind rejects even the image of that.",
            "score": 925,
            "author": "DontPeek",
            "replies": [
                {
                    "level": 1,
                    "comment": "Trump hid in a bunker when there was a protest outside of the White House gates then lied about it, compare it to this dude lol",
                    "score": 806,
                    "author": "accuracy_frosty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He had to riot-police-tear-gas a bunch of people with signs to go to a church across the street to take a picture with a book he's never read.  He's not worthy to lick Zelenskyy's boot.",
                            "score": 266,
                            "author": "omgitsjagen",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We need more guys like this in America",
            "score": 1693,
            "author": "No_Biscotti_7110",
            "replies": [
                {
                    "level": 1,
                    "comment": "Politicians under 60?",
                    "score": 2952,
                    "author": "btn1136",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, and politicians who will fight for their people",
                            "score": 1120,
                            "author": "No_Biscotti_7110",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Let’s just start with honest leadership under 70– don’t want to get greedy.",
                                    "score": 731,
                                    "author": "btn1136",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; honest\n\nalready reaching for the stars, ey",
                                            "score": 539,
                                            "author": "wheres_that_tack_ow",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Woah let’s not play pretend.",
                                            "score": 41,
                                            "author": "reddit-user28"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Goddamn. Juxtaposed against Putin’s whimpering about “no one being able to predict geopolitics” and that Russia was “forced to attack Ukraine” Putin couldn’t look like more of a little bitch.\n\nhttps://www.reddit.com/r/worldnews/comments/t1lsn6/putin_nervously_addresses_oligarchs_about_the/\n\nIf nothing else, Zelensky is showing that Putin’s tough guy act was just that, an act. Zelensky is showing what real toughness is. \n\nWho would’ve fucking thought, the former KGB agent is a cowardly little bitch, and the former standup comedian has become the bravest world leader of the past 100 years.",
            "score": 823,
            "author": "Olorin_in_the_West",
            "replies": [
                {
                    "level": 1,
                    "comment": "Guy literally signed off the EU meeting by telling them the next time they see him he'll likely be dead.",
                    "score": 447,
                    "author": "TheVengeful148320",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Zelensky is a true role model. Few people i know are this inspiring.",
                            "score": 113,
                            "author": "tau-tology",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope he has a message and plan of succession in case he gets clapped. But I think he knows what Ukrainians need, its Ukrainians, and he is striving to be a literal example. This is some JFK/Lincoln/Washington shit.",
            "score": 1391,
            "author": "Logical_Albatross_19",
            "replies": [
                {
                    "level": 1,
                    "comment": "He is just a man who loves his people",
                    "score": 307,
                    "author": "Haamboner",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is the stuff legends are made of. He will definitely be remembered as one of the greats decades into the future.",
                    "score": 236,
                    "author": "Corregidor",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm surprised the Russians haven't found him yet.  It should be easy to spot his balls from a satelite.",
            "score": 3621,
            "author": "Lokismoke",
            "replies": [
                {
                    "level": 1,
                    "comment": "They tried thermal satellites but it didn't work cause he has ice in his veins",
                    "score": 767,
                    "author": "FlyMyPig",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I mean jokes aside, can they even afford to kill him at this point?  If their plan to blitzkreig Ukraine, storm Kyiv and depose the \"\"\"crooked\"\"\" Ukrainian government, they might have gotten away with it fairly cleanly.\n\nAt this point how does killing this guy do anything but martyr him?",
                    "score": 340,
                    "author": "Halt-CatchFire",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;At this point how does killing this guy do anything but martyr him?\n\nThis is what I'm wondering, too. Putin cannot sustain this assault. Russian economy is in the shitter. Morale is low both at home and on the front lines. So the only possible play is to strike hard, take out Zelensky, install a puppet government, and fuck off back home and let the puppet do the rest.\n\nBut ... if they were to kill Zelensky, he'd become a martyr. And when people are given a martyr, they'd fucking die around that icon. There's no way they'd accept that.",
                            "score": 278,
                            "author": "Aconite_72",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "idk much of russia, but putin looked scared and unstable when he was starting all of this, he probably thinks he is about to be deposed and rushed all of this. or at least that's what im hoping.",
                                    "score": 72,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He may have rushed the start but he was preparing. Russia hasn't sold their grains to anyone over the past year. I'm afraid he's willing to hold on until the whole of Russia feeds on rations",
                                            "score": 46,
                                            "author": "Twindlle"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;At this point how does killing this guy do anything but martyr him?\n\nIf they do it, I think they'll use saboteurs posing as Ukrainians to try and make it look like he was overthrown and killed by his own people in disgrace, similar to Gadaffi.\n\nPutin has been calling on the Ukrainian military to seize power from Zelensky, we have reports of Russian military wearing Ukrainian uniforms, and they've been pushing propaganda about how Ukrainians are welcoming the Russians with open arms. It all seems to be pointing to an outcome like this.",
                            "score": 118,
                            "author": "wg1987",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If Putin is smart he'll let this guys live.\n\nGuys like this are something else. They're elevated past the status of man. They become folk heros and symbols to rally behind. Legends can inspire generations of people to fight tooth and nail against impossible odds. \n\nAnd this guy? If he falls in the fighting after demonstrating valor like this, he'll be a fucking matyr. Alive he'll be dangerous to Putin, but dead? Dead he'll be an absolute spectre that haunts him for the rest of his days in Ukrainian territory, driving his still living countrymen to fight in his name. If this guy dies, they'll write songs about him.",
            "score": 400,
            "author": "ProbablyNotAFurry",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can't kill a dead person. He is an idea.",
                    "score": 74,
                    "author": "IIllllIIllIIllIlIl",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Big swanging brass ones on this dude. Mad respect.",
            "score": 2014,
            "author": "Netminder10",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's one hell of a line. It could almost be an Arnold Schwarzenegger or Sylvester Stallone line from an 80s-90s action movie.",
                    "score": 474,
                    "author": "SPECTRE-Agent-No-13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s straight-up John McClane.",
                            "score": 165,
                            "author": "skeeter1234",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everything that comes out about Zelensky makes me respect the man more and more. This IS a leader. Don't think Ukraine could've asked for a better president during this most trying of circumstances. Hell, it seems like their entire top brass is standing with the people from what I've seen (Prime Minister etc., even an ex-president) Really pulling for Ukraine through all this. Whether or not Zelensky himself makes it through this, the man will certainly go down as a legend in Ukrainian history. \n\nSlava Ukraini!",
            "score": 261,
            "author": "ShadowMadness",
            "replies": []
        },
        {
            "level": 0,
            "comment": "America is already preparing and coordinating arms drops. Ukraine is going to have so many fucking weapons before this is over.",
            "score": 671,
            "author": "HotpieTargaryen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Got to plant those sunflowers somehow.",
                    "score": 692,
                    "author": "Farfener",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a Canadian with Ukranian ancestry I have doubts that many if any of our current mayor's or politicians would ever behave this admirably in the face of such brutality. I don't believe Zelensky is an outlier among his countrymen and women. He represents the bravery and hopes that all Ukranians deserve their sovereignty and freedom for their own destiny without little Hitler pulling the strings.",
            "score": 1554,
            "author": "TPOTK1NG",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd be surprised to hear my politicians make any announcement that we're under attack before the fact they're already in a bunker",
                    "score": 300,
                    "author": "MINIMAN10001",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This goes beyond bravery....this fucking mythic. \n\nPutin is gonna fuck around and make a national martyr out of this man, and the puppet govt will NEVER root. \n\nFUCK PUTIN!\nSLAVA UKRAINI!!",
            "score": 157,
            "author": "riedmae"
        },
        {
            "level": 0,
            "comment": "World leaders need to be like him. Be with your people, not against them. Fight with them, fight for them. Stand by their side and they will stand by yours. Im a nobody American watching the world unfold, rooting for Ukraine, hoping one day we have a strong, true, brave leader to step up to the plate. I know Zelensky must be terrified out of his mind, but to face that terror and protect your home and your people despite that is what a real human does.",
            "score": 54,
            "author": "Remnant1994",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Putin went into this war chasing some kind of vain glory and wound up putting the enemy leader on the path to lionization.",
            "score": 146,
            "author": "XLauncher",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That is one fucking badass line lol",
            "score": 490,
            "author": "Balls_of_Adamanthium",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Retreat, Hell! I just got here”\n\n-Zelensky",
                    "score": 277,
                    "author": "Apollospade",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“We're surrounded. That simplifies the problem.”",
                            "score": 175,
                            "author": "YNot1989",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Sir! The enemy outnumber us 10 to 1!\"\n\n\"Those poor bastards\"",
                                    "score": 120,
                                    "author": "BrofessorLongPhD",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"We're not surrounded. We're simply in a target-rich environment.\"",
                                            "score": 45,
                                            "author": "Aconite_72",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If this guy makes it out of this alive he will win every election in Ukraine for the rest of his life",
            "score": 278,
            "author": "IMovedYourCheese",
            "replies": [
                {
                    "level": 1,
                    "comment": "Due to constitutional limits, he can only have one more 5-year term in office. He could move on to some other position afterwards, though.",
                    "score": 126,
                    "author": "calbhollo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Retiring like a legend and just living a rad life. But hell probably just end up doing more for his country. True leadership for the people.",
                            "score": 37,
                            "author": "munk_e_man"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ukrainian leader too angry to die.",
            "score": 327,
            "author": "poundofbeef16",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don’t think people realize the amount of patriotism my people exhume. Since the 2014 bullshit, they’ve been fueled by anger by sadness, by betrayal from what suppose to have been our brother beside us. Nobody is going to leave, our military will not surrender to putins bullshit… it’s either we’re dying but surrendering is not an option. Fuck you again putin, and the people that support your bullshit war. \n And a ps : fuck you Americans who support putin, and anyone in the world who does. You are the problem as well, you are sick or uneducated about the problems in the world but you choose to give your input anyway so fuck you too. \n\nGlory to ukraine, Slava ukraine",
            "score": 385,
            "author": "joyrideboo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think a very tiny amount of people in the US support Putin. Ive never met anyone that supports this or him in general. If there’s a such thing as an antichrist he might be it.",
                    "score": 71,
                    "author": "duchessofsephora",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Liking Zelensky more and more. I didn’t realize Ukrainians were so brave.  Never under estimate the power of a willful native populace. Russia may be in trouble.\n\nGet these people more anti tank ammo, now!",
            "score": 43,
            "author": "DesertAlpine",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Everything that I've seen about Ukrainians since Russia invaded leads me to believe that every single one of them is FUCKING INSANE in the best way.",
            "score": 111,
            "author": "Nexus369",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This guy is a certified badass. That’s someone you can follow.",
            "score": 181,
            "author": "dr_funkenberry",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Truly inspiring to see real leadership, the kinda stuff so badass that if you saw it in a Hollywood film you'd say it was unrealistic.\n\nMr Zelensky, the world has your admiration.",
            "score": 292,
            "author": "lessthanmoreorless",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Another quote that will go down in history from one of the greatest leaders in history.",
            "score": 351,
            "author": "Operation_Smoothie",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Get this man a shield.",
            "score": 94,
            "author": "pureProduct",
            "replies": []
        }
    ]
}