{
    "id": "tgaiuk",
    "score": 118760,
    "title": "Fearing Poisoning, Vladimir Putin Replaces 1,000 of His Personal Staff",
    "author": "timmehx23",
    "date": 1647524509.0,
    "url": "https://www.reddit.com/r/worldnews/comments/tgaiuk",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5847,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cheaters thinks everyone is going to cheat on them.\n\nThieves think everyone is going to steal from them.\n\nPeople who use Polonium to assassinate rivals on a foreign nations soil think everyone is going to poison them.",
                    "score": 6468,
                    "author": "WintertimeFriends",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2256,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you the one that has been shitting on all the pigeons in the park?!",
                                    "score": 839,
                                    "author": "suugakusha",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He lies about everything, every step of the way.  He lies as a matter of course.  He probably lies about what he had for breakfast and if there's video proof of him eating eggs, he'll say it was a deepfake.  The man is constitutionally incapable of being anything but deceptive and it has served him very, very well. \n\nThat is, until a few weeks ago.  Fuck you, Vladimir Poutine.\n\n\n**edit: check out the (2 so far) people detracting from my comment.  Redditors for a year, both with ZERO karma.  Shit, even Russia's Reddit game is falling apart.**",
                    "score": 867,
                    "author": "The_0range_Menace",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Canadian here - please keep poutine out of this.",
                            "score": 613,
                            "author": "dexx4d",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Live by the polonium, die by the polonium.",
            "score": 20491,
            "author": "patricksaurus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ironic that Maria Skłodowska-Curie who discovered this element was Polish and named it after Poland",
                    "score": 5306,
                    "author": "tgromy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The real irony is she named it after Poland to immortalize a country twice partitioned, only to subsequently discover that it’s an extremely unstable element with a very short half-life.",
                            "score": 4189,
                            "author": "HiemalWinds",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe Poland has stable decay products",
                                    "score": 760,
                                    "author": "ScabiesShark",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 406,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So you're saying they spontaneously fuse with large agglomerations of organic material [in my belly]?",
                                                    "score": 66,
                                                    "author": "ScabiesShark",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A true patriot",
                            "score": 430,
                            "author": "DonDove",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Looking for volunteers to send as many envelopes full of talcum powder to the kremlin as we can.  Address them directly to Putin.\n\n&amp;#x200B;\n\nEdit-\n\nThis has been a fun little comment section.  You people are diabolical, and it turns me on!  I can't wait to see reports of glitter bombs in the Kremlin!",
                    "score": 617,
                    "author": "Shankar_0",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I guess he remembers his use of Polonium and Novichok really well.",
            "score": 5889,
            "author": "TsunamiBert",
            "replies": [
                {
                    "level": 1,
                    "comment": "Think of all the people he has poisoned that we don't know about!\n\nBut he knows! And it's clearly haunting him now.",
                    "score": 2107,
                    "author": "TheUltimatePoet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The ghosts of poisonings past.",
                            "score": 644,
                            "author": "Aspect-of-Death",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He's actually terrified to end up like Gadafi. He reportedly watched the tape of them pulling him out of that tunnel on repeat. It's why he has gotten paranoid with all of the color revolutions. He thinks it's a western plot for regime change. Absolutely no thought to the fact that maybe his people aren't all that in to him.\n\nEdit: @37:47. [link](https://youtu.be/b1HWNcLDK88)",
                    "score": 1035,
                    "author": "NumberOneGun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was discussing this with my wife last week.  She had no idea that he was knifed in the rectum repeatedly, tied to the hood of a truck, and then driven around until he bled to death (prior to getting to the destination where the real fun was going to start).\n\nEdit: Here’s an article describing the knifing along with an image:\n\nhttps://www.ibtimes.co.uk/gaddafi-killed-bayonet-stab-anus-libya-395224",
                            "score": 662,
                            "author": "Positronic_Matrix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yo me neither wtf",
                                    "score": 381,
                                    "author": "barberererer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, he wasn’t well liked.",
                                            "score": 351,
                                            "author": "Straxicus2",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wow. That simple statement was rather poignant and made me laugh.",
                                                    "score": 114,
                                                    "author": "rifraf2442",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imagine having wealth, power and health, only to use it to fuck up so much that you can't even eat in peace and in company.\n\nWonder if he's also had his sleep fucked up and has to take drugs to sleep... Maybe why he looks bloated.",
            "score": 8488,
            "author": "eldelshell",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some Russians jokingly call him \"the Botox dude\" for a reason.",
                    "score": 2836,
                    "author": "War4Lamey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They sanctioned botox in Russia recently.",
                            "score": 768,
                            "author": "Spacedude2187",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did he use as much as he could before stocks ran out?",
                                    "score": 328,
                                    "author": "Unit5945",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No. Must resort to Russian-made alternative cosmetic filler, Blyatox. Not quite as good as original, but works ok.",
                                            "score": 616,
                                            "author": "ColonelBelmont",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can't tell if your joking and I feel like if I google it you still win.",
                                                    "score": 223,
                                                    "author": "Chuckbro",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;blyat-ox\n\nIt’s a joke. My understanding is blyat is a multi-use swear akin to fuck, and it’s meaning can vary with context. That said, I don’t speak Russian or any Slavic languages. That’s just what I’ve read.",
                                                            "score": 193,
                                                            "author": "LegendofPisoMojado",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The best usage I ever saw of it was this little Russian toddler running around and falling over. She hits the ground and in the most deadpan voice she just goes \"oh, blyat\"",
                                                                    "score": 63,
                                                                    "author": "Hita-san-chan",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Putin looks like that plastic surgery cat lady from the 90s.",
                            "score": 410,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maureen Ponderosa?",
                                    "score": 249,
                                    "author": "crypt0jakd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's... Enhanced himself",
                                            "score": 100,
                                            "author": "WolfCola4",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The nipple placement is insane",
                                                    "score": 23,
                                                    "author": "flatspotting"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My brother used to work for a Russian in the UK, one of hundreds of staff he employed at a huge mansion - he was not exactly friends with Putin and was concerned about being poisoned.\n\nHe used to tell me that the guy not only had people tasting his food, but couldn't use things like shampoo or toothpaste that came in tubes or containers - through fear of contamination. He would also randomly select travel routes at the last minute, book multiple hotels when travelling and my brother had to sign an NDA saying he wouldn't say where he worked or who owned the place.\n\nWhat is the point in having all that money just to live in a constant state of anxiety?",
                    "score": 1556,
                    "author": "muggylittlec",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;What is the point in having all that money just to live in a constant state of anxiety?\n\nI'm convinced there are many seriously mentally ill old rich sociopaths who have no idea how to live w/o spite.  Spite, to me, is the only reason why these rich old fucks would rather fuck with society than live alone in peace. They'd rather flex power and control over others than help the needy or even try to find heaven on earth.  Simply Demons.",
                            "score": 796,
                            "author": "buchlabum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well they probably get majority of their wealth from screwing others over and being a giant asshat, so I see why they’re scared. Which I don’t mind fuck them hope they never shit in peace",
                                    "score": 240,
                                    "author": "innocentrrose",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah - it’s the only logical explanation for somebody like Putin, who was already wealthy beyond imagining, wanting to jeopardize it all by waging a stupid war. These people are pathologically addicted to power - that’s how they got to be powerful in the first place. They’ve got the same drive as a serial killer. The wiring in their brains rewards them on a primal, sexual level when they kill and steal and crush other people. And just like serial killers, they’ll keep going and going, escalating endlessly to chase greater thrills until finally somebody stops them.\n\n\nIf I had billions of dollars, I’d be content to hang out on my thousand-acre estate and eat grapes. Maybe I’d have a 5000 square foot workshop and play with power tools to keep my mind busy. But people like Putin can’t just enjoy their own lives - they have to steal the lives of others.",
                                    "score": 253,
                                    "author": "Waffle_bastard",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Where tf did his shampoo come in? Was it poured directly from the source?",
                            "score": 192,
                            "author": "KingKunter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Straight from the Sham’s butt.",
                                    "score": 779,
                                    "author": "Dodeejeroo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is henceforth going to be a part of my quiver of dad jokes.",
                                            "score": 68,
                                            "author": "NahthShawww",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's absolutely mind-boggling. The mega rich and powerful have the capability to do SO much good in the world. Or they have the capability to fuck off and enjoy life in leisure for the rest of their days.\n\nAnd this moron picked neither option. Instead, he opt for doing the worst thing he could've done for himself, his family, Russia, AND Ukraine. What a fucking cabbage.",
                    "score": 767,
                    "author": "SleepyReepies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don't get to be super rich if you just enjoy kicking back. You only gain that kind of wealth if you really, really have a passion for the game. That sort of acquisitiveness is a form of mental illness.",
                            "score": 350,
                            "author": "GetsMeEveryTimeBot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A dragon in a human suit seeking a horde\n\nThe level of unabashed greed that is needed to hit that point is mind-boggling",
                                    "score": 143,
                                    "author": "thegamenerd",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Right??? He just could have kept his dick in his pants and lived a long relaxing life of basically the king of Russia. But for power hunger megalomaniac enough is never enough. Womp womp",
                    "score": 495,
                    "author": "lobstarman23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd quit politics and live with my dick outside my pants. But that's just me.",
                            "score": 231,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because nothing screams safety like replacing everyone with *new* people.",
            "score": 56538,
            "author": "CanadianCrypto1967",
            "replies": [
                {
                    "level": 1,
                    "comment": "Best time to apply as cook",
                    "score": 20562,
                    "author": "xlazvegaz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 2956,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "His main courses are to die for!",
                                    "score": 1606,
                                    "author": "randynumbergenerator",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"I guarantee that you will never taste anything better for the rest of your life.\"",
                                            "score": 104,
                                            "author": "Zizhou"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This sounds like an Agent 47 line",
                                            "score": 431,
                                            "author": "jimmycarr1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Tobias Reiper",
                                                    "score": 44,
                                                    "author": "Evrytg",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Funny things that the \"last name\" is so close to this guy https://en.wikipedia.org/wiki/Jacek_Sasin\n\nHe is currently infamous in Poland for fucking up whatever he touches.",
                                    "score": 137,
                                    "author": "CSI_Tech_Dept",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Best time to apply for HR,  and hire some cooks.",
                            "score": 7213,
                            "author": "cyrusm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, Mr president sir, I've found you a great new personal masseuse, very vetted and trustworthy.\n\nHer name is Cia Fbirova",
                                    "score": 5165,
                                    "author": "Mini-Marine",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also, allow me to introduce your new personal chef: Bo Tulism.",
                                            "score": 446,
                                            "author": "The_Gutgrinder",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Being assisted by Cy Anide",
                                                    "score": 108,
                                                    "author": "In_memorium_BR",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Dr. Putin, I'm CIA",
                                            "score": 906,
                                            "author": "Gray_Havens",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "*Massages Putin*\n\nCIA massagent: \"So was getting caught in war and crashing the Russian stock market with no survivors part of your master plan?\"",
                                                    "score": 769,
                                                    "author": "zxc123zxc123",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "“You’re very tense…”",
                                                            "score": 373,
                                                            "author": "Alan_Smithee_",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And tight...",
                                                                    "score": 149,
                                                                    "author": "Force3vo",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Points for massagent",
                                                            "score": 201,
                                                            "author": "zerombr",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Needn’t be human, must be resourceful.",
                                    "score": 671,
                                    "author": "Leg_Named_Smith",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is that you Stalin?",
                                            "score": 231,
                                            "author": "drs43821",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Stalin was actually in charge of hiring for the Soviets. He used his position to put his own supporters in positions of power which is how he rose to power himself",
                                                    "score": 265,
                                                    "author": "flabeachbum",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Exactly how an HR manager stage a coup",
                                                            "score": 243,
                                                            "author": "drs43821",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well, he’s already got [Steven Seagal over there](https://youtu.be/A0gGIMaQZJs&amp;t=1m21s)",
                            "score": 629,
                            "author": "KRAKA-THOOOM",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seagal was hired to do \"poop-your-pants\" tests, make sure there's no underwear poison that gets activated when Putin poops thinking he's gunna poot. Seagal pre-poops Putin's pants prior to Pooty pootin in them thus activating the poison.",
                                    "score": 1638,
                                    "author": "RUN_MDB",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know a guy who did some work with Segal on set who said that one day Segal straight up pissed himself out of nowhere. I’m trying to figure out if you also heard something down the grapevine or not.",
                                            "score": 516,
                                            "author": "Zestyclose_Ad7206",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I heard a story where Segal bragged that he could escape any headlock so he stepped into the ring with some martial arts master who promptly put Segal into a headlock. Segal was able to shit his pants and then pass out, rather than escape the headlock.",
                                                    "score": 760,
                                                    "author": "helloitsme1011",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Best way to evacuate from a head lock is to evacuate one's bowels, but consciousness must be maintained. Like the fast and the furious, Seagal almost had him.",
                                                            "score": 575,
                                                            "author": "aShittierShitTier4u",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "He performed an advanced maneuver and excreted his consciousness into the poo, thus escaping the headlock.",
                                                                    "score": 355,
                                                                    "author": "Tack122",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Self defeces.",
                                                                            "score": 483,
                                                                            "author": "bacchus21",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Reading that almost made me shit myself from laughing so hard.",
                                                                                    "score": 50,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "_Evacuate your bowels and your body will follow_ - Ancient made up Chinese proverb",
                                                                            "score": 56,
                                                                            "author": "Lordfarquarant"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "He never had him, he never had his pants.",
                                                                    "score": 63,
                                                                    "author": "bowlsfordays",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Granny shitting, not double sharting like ya should.",
                                                                            "score": 42,
                                                                            "author": "GenerikDavis",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That was Gene LeBell. That old dude used to have a big throne inside of Valley Martial Arts Supply in Los Angeles that said something like, “This is Gene’s chair” with his picture above it, and that if you wanted to replace his picture with your own, you could have him try and choke you out. He’s pretty old today, and the last time I seen that chair, his picture was still above it lmfao.",
                                                            "score": 76,
                                                            "author": "StillPissed",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That story is in fact confirmed and properly sourced by Wikipedia, look at Steven Seagal's page under the section on sexual assaults.",
                                                            "score": 72,
                                                            "author": "teszes",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wasnt expecting to go to this link during my afternoon browse of the internet butI am going there...\n\nEDIT worth going for the image of seagal it has the 'hair' of John Travolta, the forehead is made from the backside of a rottweiler dog, and the bottom half looks like a soccer football with 4 caterpillers arranged on it",
                                                                    "score": 40,
                                                                    "author": "bad_pangolin",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "\"Judo\" Gene LeBell did that to him allegedly.",
                                                            "score": 93,
                                                            "author": "Mike7676",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 74,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Well now we know who the new lawman will be",
                                    "score": 80,
                                    "author": "SoyMurcielago",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just him in Russian riot gear fat breathing over towards you like a drunk walrus who sexually assaults girls. He then tries some bullshido on you as you both stand there confused. You as to why he is gently massaging your wrist and tricep and him as to why you haven't already thrown yourself across the room. You then offer him a carrot and a pair of yellow Oakley's and then he waddles off to the nearest temple to meditate with cocaine and insense",
                                            "score": 716,
                                            "author": "savageo6",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This got better on every sentence.",
                                                    "score": 140,
                                                    "author": "Lotkaasi",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'd take that life.\n\nNot the rapey part, just the cocaine and carrots.",
                                                    "score": 124,
                                                    "author": "bagofbuttholes",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My man is about to have great eyesight and unlimited energy",
                                                            "score": 129,
                                                            "author": "InQuintsWeTrust",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Shit man, are carrots that good?",
                                                            "score": 29,
                                                            "author": "Snotling_fondler",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\\*Points at hemlock* \"Is this black pepper?\"",
                            "score": 116,
                            "author": "alluballu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"He wants rice and chicken for dinner.\"  \n\n\"Ricin chicken, coming right up!\"",
                                    "score": 214,
                                    "author": "Bandin03",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, I don't get the logic. I get that \"old\" people might know better how to go around things, but I would be even more worried about some 1000 new people. Wtf?",
                    "score": 2919,
                    "author": "MissPandaSloth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The longer someone has worked that close to Putin's day to day, the longer they have been on an \"assets wishlist\" of every intelligence agency on the planet.  Some of the new hires MIGHT be spy's/ foreign agents.  Some of the old 1000 definitely were.",
                            "score": 3372,
                            "author": "Optimized_Orangutan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah, I see I see.",
                                    "score": 809,
                                    "author": "MissPandaSloth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And it takes time to develop an asset like that, it would be very difficult to quickly insert an asset into the hiring process (that is likely being scrutinized so closely that candidates are likely under 24/7 surveillance).  This basically wipes out years of investment into assets from foreign intelligence and resets the game.",
                                            "score": 992,
                                            "author": "Optimized_Orangutan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I could see how it would, perhaps, wipe out foreign assets, I just imagine it could bring in someone with a personal vendetta against him.  And honestly I'd be more worried about the latter if I were him.",
                                                    "score": 500,
                                                    "author": "jmcgit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm pretty sure you aren't even getting on the list to be considered if there is even a hint of disloyalty in your background or the background of people you associate with.  They are not pulling these new hires out of the general populace, all of them will be vetted and have a strong track record of loyalty and service to even be considered.  Will something slip through the cracks? Maybe.  Is someone on the old staff already through the cracks? Yes.  Maybe there is someone here spying on me is better than there are people here spying on me.",
                                                            "score": 372,
                                                            "author": "Optimized_Orangutan",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Or maybe you absolutely ARE getting on the list, given some of the dissent we've allegedly seen from the FSB",
                                                                    "score": 148,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Wipes out years of *foreign* Intel work yes; but I dont doubt for a second he isnt also concerned about domestic intel work.\n\nLet's not forget hes made billionaires into millionaires in russia recently, and those are the kind of people who hold the real keys to power in an autocracy.\n\nIf it wasnt for so many \"military elite\" getting wiped in ukraine from piss-poor operations, I'd have fully expected him to have done a Purge of the military already",
                                                    "score": 201,
                                                    "author": "Hekantonkheries",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This, plus the existing people were likely reasonably comfortable with their surroundings - they likely knew when they were/weren't being watched, etc.  New people are all going to be on edge for a while (just like anyone else with a new job), so even if they wanted to try something it'd take a while to understand what's what.",
                                    "score": 319,
                                    "author": "Ben2018",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Absolutely.  Not only did they get rid of the assets, they got rid of any \"infrastructure\" that those assets might have in place.  Things like a structure for smuggling  things in and out, connections to other assets and access that might be locked out to a new employee etc.  All of that would have to be rebuilt from scratch by new assets.",
                                            "score": 135,
                                            "author": "Optimized_Orangutan",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’d agree its more likely that the old hires were foreign assets. But its just as likely that the new hires are may pose a danger to him if they are influenced by people within Russia. Harder to develop an asset among a new higher, sure. But what about Russian oligarchs pissed at Putin for all the sanctions and hits to the economy?  \n\nTo me it seems like 6 of one, half a dozen of another.",
                                    "score": 89,
                                    "author": "AngelOmega7",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The logic might be that over time his enemies/potential enemies have placed potential operative(s) close to him.  If he gets new people then it would take a long time for his enemies to find new people willing to help, since it would presumably be a long, careful process because you never know if the person you approach might just report you.",
                            "score": 123,
                            "author": "weluckyfew",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "1000 new hires seems like the perfect opportunity to get one of your guys in if you couldn't get one through before.",
                                    "score": 111,
                                    "author": "Mr_Belch",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You’re in, Agent 47",
                    "score": 676,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your mission is simple Agent 47. Usually the security is impossible to breach. But the target got spooked and recently replaced every personnel, allowing you to slip through as a female secretary.",
                            "score": 210,
                            "author": "BeautifulType",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“God this game is so unrealistic, nobody would ever do that”",
                                    "score": 87,
                                    "author": "WhyShouldIListen"
                                },
                                {
                                    "level": 3,
                                    "comment": "\"You will now go undercover as a barber from India, Agent 47.\"",
                                    "score": 41,
                                    "author": "whoisfourthwall"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "'Welcome to Ural Mountains, 47. This time your mission is simple.'",
                            "score": 378,
                            "author": "Maaaf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mission plan:\n\n1. Steal Lenin's suit and tie off his corpse to blend in.\n2. ???\n3. Arrange Putin to have a fatal \"accident\" with the Tsar canon.",
                                    "score": 129,
                                    "author": "foxy_mountain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mission Active",
                                            "score": 21,
                                            "author": "dominolane",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 204,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Putin: This smells delicious.\n\n47: The goulash is to die for.",
                                    "score": 80,
                                    "author": "macetheface",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Bullshit. That would be dead giveaway. Regular people today would have qr code.",
                                    "score": 103,
                                    "author": "noximo",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I work at a defense contractor and their latest security brief is about how the risk of insider threats has skyrocketed with the increase in people cycling in and out of positions with the pandemic. Like they said the risk of a leak is no longer 'if', but 'when', and that if a company hasn't found any yet then they're not looking.\n\nThis scenario is definitely unsafe for Putin lmao. I can only imagine how much the risk for him has grown now",
                    "score": 580,
                    "author": "fuckincaillou",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I first read this I thought you meant people cycling to work and I couldn’t see how it would make you more of a threat than using a car.",
                            "score": 287,
                            "author": "pippinjack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The ones who unicycle to work are the ones you really need to keep a close eye on.",
                                    "score": 142,
                                    "author": "MrWhite",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They have the deadly combination of flawless balance and great glutes. They can’t be trusted.",
                                            "score": 77,
                                            "author": "Gizogin",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, that seems like a dumbass move, sure seems like the days of Putin are numbered when you start making these chaotic moves..",
                    "score": 335,
                    "author": "abrandis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Putin's bizarre speech I think reveals he's very vulnerable right now. Sure he uses tough words, but to me it comes off the same as Trump's bullshitting, projection and fake bravado. After 4 years of Trump this style of BS seems easily decoded. Putin's speech is basically an admission that he's totally fucked up, he's afraid of protesters, afraid of his KGB buddies, afraid of the oligarchs, afraid of losing a huge portion of his military in Ukraine.",
                            "score": 627,
                            "author": "bejammin075",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And he's also deeply afraid of attacking NATO, too - he may talk shit about the US et al all he wants, but I don't see him trying to provoke anything NATO related.",
                                    "score": 236,
                                    "author": "schiffb558",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There were a few Russian missiles that struck close to Poland, within a short range, like ~10 miles. A disturbing aspect of Putin's speech is he's framing it to Russians like this is a fight for their own country's existence. He's trying to mobilize the whole country, or at least prepping for that. But the message I heard is that Putin is fighting for his own existence. I predict things are going to get weird and wild in Russia.",
                                            "score": 251,
                                            "author": "bejammin075",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "When your govt is essentially a mafia project, expect some blood baths over power from time to time.  No honor among thieves.",
                                                    "score": 95,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The Russian government can best be summarized as fusing together a mafia crime organization with secret police, and rapacious billionaire thieves.",
                                                            "score": 71,
                                                            "author": "bejammin075",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 9992,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Putin: Everything is fine, Russia is still strong, the ineffectual Western measures haven't hurt a thing and in fact have made Russia stronger.\n\nAlso Putin: Everyone is trying to kill me, sanctions are war, everywhere I look I'm surrounded by traitors and scum!",
                    "score": 3696,
                    "author": "HagbardCelineHMSH",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He’s not wrong that a lot of people would love to kill him. What he’s wrong about is his belief that his life is worth preserving.",
                            "score": 1036,
                            "author": "SnowyLex",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think what he’s wrong about is that new people would be more trustworthy, or that replacing 1,000 existing staff with brand new hires makes him safer somehow.",
                                    "score": 343,
                                    "author": "sheiriny",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know, lol. Textbook paranoia combined with poor logic.  \n\n\nHe just created 1000 new potential security compromises.",
                                            "score": 133,
                                            "author": "Delicious_Orphan",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Can we skip to the part where he ends it all in a bunker with Eva Braun?",
                                    "score": 26,
                                    "author": "Holmes02",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Poots really going full method on the Joe Stalin emulation",
                    "score": 1040,
                    "author": "todellagi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He’s gonna grow out the stache next",
                            "score": 288,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If Putin could grow facial hair he would have in one of his myriad of trying to look rugged masculine photo ops. \n\nPutin probably can only grow a neck beard.",
                                    "score": 156,
                                    "author": "MaimedJester",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For a guy threatening nuclear escalation he sure does care a lot about being alive",
            "score": 2564,
            "author": "TheTruEZHarry",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1123,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; Vladimir Putin appeared on Russian state TV today to denounce Russians who opposed his war with Ukraine as “scum” and “traitors.”\n\n&gt; But behind the scenes, the dictator is increasingly paranoid and fears that someone in his inner circle will poison him, a new report says.\n\n&gt; Daily Beast contributing editor Craig Copetas says he’s been told that Putin has people tasting his food before he eats it and that last month, he replaced his entire personal staff of 1,000 people.\n\n&gt; “Laundresses, secretaries, cooks — to a whole new group of people. The assessment from the intelligence community is that he's scared,” Copetas said. \n\n&gt; Copetas says that the preferred method of assassination in Russia is poison. \n\n&gt; Putin should know — it's believed his agents killed outspoken critic Alexander Litvinenko by spiking a pot of tea with radioactive poison in 2006.\n\n&gt; And in 2018, authorities say Putin’s henchmen sprayed deadly poison on the front door of former spy Sergei Skripal. He and his daughter narrowly escaped death.\n\n&gt; Putin also allegedly ordered the poisoning of Russian opposition leader Alexei Navalny. He survived, but is now languishing in a Russian jail.",
            "score": 4922,
            "author": "timmehx23",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would be a fitting way for him to go.",
                    "score": 2350,
                    "author": "THETRILOBSTER",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 2452,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Polonium is a super rare radioactive element. Back when there was the famous Russian defector who was poisoned with polonium, it was estimated that the dose cost several million dollars. So polonium isn't laying around. Other poisons like arsenic though, cheap and probably not hard to find.",
                                    "score": 416,
                                    "author": "bejammin075",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 123,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "True, but the irony of him getting hit with his own calling card is a bit irresistible. But for all I care, they can grow some castor beans and use ricin.",
                                            "score": 308,
                                            "author": "OakenGreen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If someone takes out Putin, I doubt they are going to go for style points. I'd expect Putin has detectors for radioactivity too. The two Russian assassins who carried out the polonium poisoning left a trail everywhere, like everything they touched, every chair they sat in, every cup they sipped from, everything was tainted with polonium radioactivity. No way to detect arsenic though.",
                                                    "score": 181,
                                                    "author": "bejammin075",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds like a man who is confident in his position of power. Definitely not paranoid, and definitely loved by the people who totally voted him into office multiple times",
            "score": 473,
            "author": "ThisDichotomy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Better watch out for any loose windows. Russians have a serious problem with windows...",
                    "score": 44,
                    "author": "BrownSugarBare",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes.... hire all new staff.\n\nThere's nothing suspicious about the new applicants who seem very eager to serve you.",
            "score": 973,
            "author": "zombieblackbird",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ooh, ooh, don’t pick me!",
                    "score": 184,
                    "author": "momvetty",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "\"We hired this guy as your new Chef. We knew he'd be a good fit when he showed up to the interview with his own knives!\"",
                    "score": 55,
                    "author": "passwordisnotorange",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "He is scared.",
            "score": 13311,
            "author": "Sera0Sparrow",
            "replies": [
                {
                    "level": 1,
                    "comment": "If he’s unhappy, I’m happy.",
                    "score": 6791,
                    "author": "Butterball_Adderley",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im sure the new people are much more trustworthy than the ones working for him for years.",
            "score": 2948,
            "author": "LaNague",
            "replies": [
                {
                    "level": 1,
                    "comment": "u/Optimized_Orangutan\n\n\"The longer someone has worked that close to Putin's day to day, the longer they have been on an \"assets wishlist\" of every intelligence agency on the planet.  Some of the new hires MIGHT be spy's/ foreign agents.  Some of the old 1000 definitely were.\"\n\n\"And it takes time to develop an asset like that, it would be very difficult to quickly insert an asset into the hiring process (that is likely being scrutinized so closely that candidates are likely under 24/7 surveillance).  This basically wipes out years of investment into assets from foreign intelligence and resets the game.\"",
                    "score": 2100,
                    "author": "DarkStarStorm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Isn't the fear more of an \"internal\" assassination attempt? Everyone around him he's probably vetted for loyalty 10x over, how can he be sure the new group will be as loyal? \n\nAlso might be harder to create a new asset quickly to get into the new group, but also the situation in Russia gives foreign agencies waaayy more leverage on things they can offer to make a new asset. The worse the situation gets in Russia the more appealing foreign offers will be.",
                            "score": 294,
                            "author": "pastaandpizza",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "How do you scrutinize 1000 people in a month for any dissident behavior? And who's to say assets weren't developed in advance, just waiting to be onboarded? He's in for a rough ride.",
                            "score": 571,
                            "author": "--xra",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Strong Stalin vibes...",
            "score": 7031,
            "author": "ArmaTM",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is something I've been feeling also.  He's obviously paranoid and isolating himself, surrounded by people too frightened to tell him anything other than he wants to hear and that is likely why he was foolhardy enough to enter into a war that is going to break his nation.  We can only hope that when this sad, sorry chapter in Russia's history is done with that they emerge as a democratic society that shares values with their neighbours, not a paranoid kleptocracy where the mafia are in charge.",
                    "score": 3804,
                    "author": "MrSpindles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The book of Russian history is only sad sorry chapters.",
                            "score": 892,
                            "author": "snukebox_hero",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Russia is one if the greatest stories of a nation of enormous potential squandered by greed and corruption in history. The only thing that comes close is China during the 19th century. But that was just an embarrassing interlude. Russia always seems on the cusp of sorting things out, then it devolves.",
                                    "score": 482,
                                    "author": "Senior-Albatross",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Modern Mexico, India, and Brazil come to mind. So much beauty, so much culture, so many resources, so many smart people, such remarkable history — all held back by corruption, violence, grievances, brain drain, and other roadblocks. There’s no reason why those places shouldn’t be tourist, economic, industrial, resource, and education powerhouses beyond what they are.",
                                            "score": 86,
                                            "author": "giro_di_dante",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "India was that place for well over a 1000 years. There's a reason the Europeans tried so hard to conquer it and called the natives of America \"Indians\", it was a place much sought after because of its relative importance and progress. It had a decline and now we're seeing growth again, it's a cycle for sure.",
                                                    "score": 25,
                                                    "author": "your_dope_is_mine"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They'll emerge as a democratic society that shares the values with their neighbors, and it will be a long hard road to rebuilding over the next decade before they elect the next Putin or Stalin and the cycle starts anew",
                            "score": 1089,
                            "author": "jmcgit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So the 90’s?",
                                    "score": 561,
                                    "author": "Trip4Life",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The dream of the 90's is alive in Russia",
                                            "score": 542,
                                            "author": "Explorer200",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "History doesn't repeat, it rhymes they say.",
                    "score": 532,
                    "author": "BrokenBarbell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "First as tragedy, then as farce.  (Karl, not Groucho, Marx)",
                            "score": 193,
                            "author": "Accomplished_Water34"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a tale as old as time.\n\nThe Mad King is paranoid and continues to isolate themselves further and further.\n\nIt starts with a bunch of yes men so you end up in a position where everyone is gaslighting you for fear of plutonium poisoning. So you can't see truth in what anyone says.\n\nJust spirals from there.",
            "score": 2009,
            "author": "mtarascio",
            "replies": []
        },
        {
            "level": 0,
            "comment": "He really trusts new hires over existing relationships? Paranoia has set in DEEP",
            "score": 411,
            "author": "randomscribbles2",
            "replies": [
                {
                    "level": 1,
                    "comment": "He knows there are many reasons people want him dead. Theres people who dont want to send their kids to die, people who want to stop their economy from deteriorating, people who want to end a war etc. He cant trust anyone anymore tbh and probably is going to be living his days in fear from now on.",
                    "score": 217,
                    "author": "ChonkySpud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's also hit the finances of many of the oligarchs really fucking hard. I'd bet there's more than a few of those guys who'd be happy to see him dead at this point.",
                            "score": 182,
                            "author": "SpeedflyChris",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "As he should. The monster's made life hell for the rest of us, he should have to live in a hell of his own.",
                            "score": 62,
                            "author": "fuckincaillou"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How does anyone have 1000 personal staff?",
            "score": 383,
            "author": "ozirisno1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shit, even the Queen is said to have only about 400.",
                    "score": 175,
                    "author": "shuipz94",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Weirded out that I had to scroll this far down for someone to ask that question.\n\nThe Tsar of Russia needs a 1000-man strong entourage to cater to his every whim, apparently.",
                    "score": 199,
                    "author": "NestroyAM",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You know what would be funny, is if he doesn’t die of poison but of Covid from all these people tasting his food before hand.",
            "score": 206,
            "author": "Swimoach",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When a leader is fearful of poisoning, that’s when they realize they screwed up.",
            "score": 1227,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 443,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Completely, he is 100% devoid of something that makes most people human.",
                            "score": 115,
                            "author": "orevrev",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A thousand?!\n\nHot shit. I only have two staff members. They're both cats. \n\nTechnically, I am their staff member.",
            "score": 1233,
            "author": "Malnurtured_Snay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Best behave or they'll replace you",
                    "score": 290,
                    "author": "LTWestie275",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Do they want you dead?",
                    "score": 77,
                    "author": "Goodmorning111",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only when I’m late feeding them",
                            "score": 107,
                            "author": "Malnurtured_Snay",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sneaking in a killer within 1000 new people should be pretty easy...",
            "score": 1197,
            "author": "pistacchio",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was thinking the same thing.  1000 new people are going to be impossible for him to throughly vet.  Even if it could be done, how will Stallin 2.0 know he can trust the people doing the vetting?  Gonna be a vicious cycle for him of being unable to trust anyone.\n\nEdit:  spelling error corrected",
                    "score": 457,
                    "author": "WolfLaBella",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There will be eyes and ears everywhere. Things that would normally take 1 person to complete will now take 3 people so that nothing goes unnoticed. Multiple meals will be cooked so that there wouldn't be enough poison to dose every meal. The list goes on and on.",
                            "score": 193,
                            "author": "skrubrekka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don’t know about there not being enough poison, certain poisons require extremely small dosages to be lethal. Someone could easily sneak in a small bag of ricin powder with enough doses to kill all 1000 of those people.",
                                    "score": 169,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My mans Been watching breaking bad",
                                            "score": 110,
                                            "author": "OpPieMaker",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't use the stevia.",
                                                    "score": 50,
                                                    "author": "RedOctobyr",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; “I have heard it said that poison is a woman’s weapon.”\n\n&gt; Pycelle stroked his beard thoughtfully. “It is said. Women, cravens, eunuchs and Putin.”",
            "score": 102,
            "author": "Mnemosense",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is a man about to be killed. Nothing says I’ve lost control than firing the personal guards you know and randomly replacing them out of paranoia. This is not the way to assuage fears that you’ve lost it.",
            "score": 200,
            "author": "HotpieTargaryen",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Erm, am I the only one who wants a second source to back this up? Propaganda is a two-way street after all.",
            "score": 613,
            "author": "KamahlYrgybly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Whilst I really want this to be true, I'm with you.  I suspect it might not be 100%",
                    "score": 99,
                    "author": "tobybuk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, the only source I can see is \"some guy heard it\".",
                            "score": 49,
                            "author": "bgroins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So I looked it up on Google and I can't seem to find the original source of it. I googled the guy from whom the claims comes (Craig copetas) from but, while this guy apparently truly exists, I can't find the original article or the source of this claim. I only find articles who, sometimes, refer to him but nothing concrete like a link or a video.",
                                    "score": 23,
                                    "author": "Liteguy57"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No, this is an \"article\" from Inside Edition of all places. I can't believe how far I had to scroll to see anyone asking for a reputable source. All the screaming redditors do (justifiably) about idiot anti-vaxxers and right wing conspiracists (again, justifiably) and now because we like what's being said, it's crickets.\n\nDon't get me wrong, I'd love for this to be true. But come on people.",
                    "score": 268,
                    "author": "RockleyBob",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why doesn’t he just do what Trump does and eat at a different McDonald’s for every meal?\n\nWait,  never mind.",
            "score": 166,
            "author": "Phantom_61",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Source: trust me",
            "score": 27,
            "author": "CriticalThinking__"
        },
        {
            "level": 0,
            "comment": "Da Vlad it's me your new cook am.. Notana Merican. Enjoy the food.",
            "score": 402,
            "author": "Salud57",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sorry guys, but this need a source",
            "score": 23,
            "author": "robinkak"
        },
        {
            "level": 0,
            "comment": "Correct me if I’m wrong but doesn’t this raise his chances of being poisoned many times over?",
            "score": 67,
            "author": "onlefans",
            "replies": [
                {
                    "level": 1,
                    "comment": "Depends on how heavily vetted the new arrivals are, and how trustworthy the vetters are.\n\nThe thing is, someone in the thousand was almost certainly an asset for the CIA, MI6 or whoever else. They're pretty much the people spy agencies most want to have on the books. Long term this is probably worse, but short term it will root out any active assets.",
                    "score": 42,
                    "author": "Xenon009",
                    "replies": []
                }
            ]
        }
    ]
}