{
    "id": "1055i82",
    "score": 56,
    "title": "The Skip Dating | E4 | 230106",
    "author": "xiaopow",
    "date": 1673039134.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/1055i82",
    "media_urls": [],
    "other_urls": [
        "https://www.viu.com/ott/sg/en-us/vod/466850/The-Skip-Dating"
    ],
    "postText": "'Skip' is a speed dating reality program featuring 4 single males and 4 single females. Each person will be given a chance to talk and interact with one participant of the opposite sex at a time, and if they don't feel like the conversation is going well, they can press the \"skip\" button to instantly dismiss their conversation partner and move onto the next participant. \n\n**Hosts**\n\n* Yoo Jae Suk\n* Jeon So Min\n* Nucksal\n\nStream: https://www.viu.com/ott/sg/en-us/vod/466850/The-Skip-Dating",
    "comments": [
        {
            "level": 0,
            "comment": "SY personality definitely caught my attention. I really like her straightforwardness and her selfless act by being considerate to KM. Really really hope that she will meet a great man that will make her happy. \nEven thought it wasn't as dominant as the previous episodes, Somin, Jae Suk and Nucksal tiki taka are still enjoyable to watch. The editing was a bit choppy, but still okay. Lookin forward for the next eps, it seems to be even more chaotic than eps 1-4",
            "score": 21,
            "author": "raihankaskus"
        },
        {
            "level": 0,
            "comment": "I thought the first part was funny, but this second part was even more hilarious. I view this show more as a variety show than a dating show— *plus the whole thing happens only in a day*— so I don't really ship anyone and I don't really expect the final couples to start dating and last long. A part of that is that I'm also uncomfortable with some of the singles' \"skip details\" that list their ideal types. Sometimes for others, it seemed more like their own fetishes which irks me a bit. But then again, I can't judge them for what they show in a single day. \n\nAnyway, I'd say the events that occurred here were more interesting here than the first one: the pairings, rooms, lunch boxes, and final choices. I initially thought the singles who got their rooms destroyed would get bothered by it for the entirety of the show, but they just laughed it out. The reasons behind the \"skip\" were also kinda convincing and I found myself nodding throughout their thought processes. \n\nEvery single in the first part got a lunch box, and I felt relieved. In this part, though, almost &gt;!every lunch box went to Ano and YJ!&lt;. I was internally screaming and my reactions matched with the hosts and I got a good laugh. &gt;!MN saying she wanted to go home and that she missed her mom every time she didn't get a lunch box was hilarious!&lt; as well as the hosts' reactions. I didn't really notice SY at first,&gt;! but after realizing it was KM for her, dang she got my attention on how straightforward she became. !&lt;",
            "score": 15,
            "author": "ysalright",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; like their own fetishes\n\nmaybe if you didnt focus on sexualization, you would actually understand the types is mere preference aka 'people i attracted to'. Yoo Jin decision would teach you that reality anything could change even ideal types.",
                    "score": 1,
                    "author": "st_arch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had to go back to the episode to recall who Yoojin was, and I recalled that I liked her decisions in this. Anyway, the fetish thing I was referring to does not apply to this episode only, nor did I focus on sexualization. We all have preferences, maybe sometimes too specific, and that's okay. However, what I was referring to was there were a few (maybe including the latest eps) who expected their pairs to act like how they imagined them to be. First impressions, for example. When they didn't act as expected, they got disappointed and unconsciously showed their dissatisfaction towards the other person. Expectations are not always fulfilled, but at least try to act decent.\n\n&gt;But then again, I can't judge them for what they show in a single day.\n\nCould be editing, but these participants could also be acting without thinking much about their actions. So in the end, I just don't think much about their actions as well, just a few noticeable icks and that's it.",
                            "score": 1,
                            "author": "ysalright"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The female supermodel was so mature and considerate. Truly impressive, whoever ends up with her will be lucky. \n\nI liked MinA the best, her personality was just so casual and funny. I also liked her casual look/outfit. She was just chilling. Same with HyeJin, but I completely understand her not seeing someone 6 years younger as a man. Especially at their age. I'm 29, and anyone under 25 is a baby to me. \n\nI also think the girls really only chose based on charms and the person who seemed the kindest (two people said he was a good listener), and the men basically chose the shy and quiet youngest cute girl. Kind of expected this tbh. The dentist's decision in the end did not make sense to me, like at all. I've seen enough Korean media and know enough dudes in my life to know men rarely go for women with strong personalities who are fun, funny, energetic and opinionated. It's too much to handle. 😁 (Not all men of course, Asian men more so though) especially if there is a woman who is young and innocent; Toni literally mentioned that. It sounded kind of odd, but there was another dude the last round who also said something like this to the youngest female skipper. \n\nBasically, women care about how a man makes them feel and men care about how a woman naked them look; if that makes sense.",
            "score": 13,
            "author": "Ancient_Reply4583"
        },
        {
            "level": 0,
            "comment": "The best part of this show has been the meal exchange for both sets of participants lol",
            "score": 10,
            "author": "_denton"
        },
        {
            "level": 0,
            "comment": "I loved the plus size model. How she made the lunch boxes was really A+. She was also assertive, gracious, sexy etc. I wish more of her bodytype could be added in dating shows. Come to think about it - the ratio men beeing thick compared to women is kind of absurd.",
            "score": 11,
            "author": "Secure-Ad4436"
        },
        {
            "level": 0,
            "comment": "Dang kinda sad HJ and KM didn’t choose each other. Was shipping them hard lol. Not surprised about all the others choices though. Did they just cut out the showcasing charm section or does it not exist anymore.",
            "score": 23,
            "author": "Xeian",
            "replies": [
                {
                    "level": 1,
                    "comment": "90% of them will sing probably, so I guess the Pd thought it might get too repetitive.",
                    "score": 14,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "There was a flashback that seemed to show victoriano singing, maybe they cut it out bc of other footage. \n\nThe preview for next week also seems to showcase the talent portion again.",
                    "score": 13,
                    "author": "xiaopow"
                },
                {
                    "level": 1,
                    "comment": "I'm kinda invested in them lol their missed opportunity really gets me 😭\nBut no wonder their 5 min interaction gets chopped, I think somewhere in that convo alr showcase the decisive stance of KM",
                    "score": 6,
                    "author": "Vreiya"
                },
                {
                    "level": 1,
                    "comment": "Yea I think they cut out the showcasing charm section :( I remember from episode 2 or 3 ending (?), they showed a short preview of it. Perhaps it was too 'hot' of a content to air fully so they just cut the whole thing out? 😂 I hate it whenever this happens though\n\nI was really shipping &gt;!Hye Jin and Kang Min!&lt; as well (the marketer and the dentist). But damn the misunderstandings... I think that led to &gt;!KM!&lt; 'giving up' and instead focused on the other popular girl. Such a waste on a potentially good relationship!",
                    "score": 7,
                    "author": "CyberMew"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been enjoying the show but I dislike how they try to make it seem like the \"obvious\" couples had some kind of last minute argument when nothing actually happened",
            "score": 7,
            "author": "banethor88"
        },
        {
            "level": 0,
            "comment": "That model guy, what he said to Yoojin was rude. I get that he didn’t like her but he should have basic human decency. I am glad she was turned off by that. \n\nI thought Yoojin and Victoriano were cute. \n\nAlso liked SY’s attitude.",
            "score": 17,
            "author": "Icy_Revolution_5200",
            "replies": [
                {
                    "level": 1,
                    "comment": "That model guy seems like a cool guys at first but i noticed, during his conversation, he always said something that kill the conversation. I think he the types of person who \"talk without thinking\".",
                    "score": 10,
                    "author": "popoapoooo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly, glad that he showed his other side pretty quickly lol, I already knew it since they showed his room.. kinda shady",
                            "score": 1,
                            "author": "mstfa23x",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think he is the type of guy who have certain image of woman in his mind. So, if a woman do something different or said something different, he instantly change. Like, i think he expect Yoojin to said more. When she doesn't, he instantly become rude. And make that situations awkward.\n\nI had bad feeling about him when he gives answers what he will do/say when he interested in someone.",
                                    "score": 5,
                                    "author": "popoapoooo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That model guy honestly just gave off experienced flirty vibes. No idea why hes even on the show, he already mentioned he has many female friends and with his looks theres no way he cant find a gf in real life.",
                    "score": 7,
                    "author": "Spartandemon88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "IMO, you can get exposure in the show, you can even guess he was all about showing off and perhaps oso to just have more friends, like lit he said, \"we can meet after all of this\" to HJ, ty God, them pure Yoojin didnt choose him, cus there was like something goin n",
                            "score": 3,
                            "author": "mstfa23x"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The show got soo lucky with how great the first group was! I mean this group was okay but first group having 3/4 couples probably gonna be the best they do on this show 😂  but I loved the “plus sized” model and she was right ; no guy there could handle her. \nI mean it’s clear they brought her for the guy (model)who said girls like her was his type but like? See how men just lie🤣😭 someone tell me What about the woman he wanted (host lady) was “tall and curvy” so he meant he just wanted someone taller than him and not as skinny as him?🤣🤣😭 boy bye",
            "score": 16,
            "author": "zimzimit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sometimes i forget \"tall and curvy\" by east asian standards just means over 5'3 and has boobs 🥲\n\nJust like how above size medium = plus sized apparently 💀",
                    "score": 8,
                    "author": "xiaopow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "😂😭😭yeah damn, seems like the producers forgot too because.. 😂",
                            "score": 3,
                            "author": "zimzimit"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The plus size model is a queen! And the way she explained pressing skip at the end? the other seung yeon (love catcher in Bali) and the people from singles inferno could really take notes lol",
                    "score": 6,
                    "author": "temptressmoon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "After this episode it feels like they should each have 10 mins rotation instead, because from what I see in the past 4 episodes, just from exposure it could change the dynamics/feelings differently. And imagine just being able to talk to 1-2 person all day, but only 5 mins at the end when the feelings is already 'secured'. It would be harder to build up a relationship (?) in that 5 mins since everything has already happened (the talent show, the food exchange, etc) and people mostly made up their minds. Furthermore it seems like some would want to talk to different people at the start as well.. (and this caused the misunderstandings with Hye Jin and Kang Min ugh)",
            "score": 7,
            "author": "CyberMew"
        },
        {
            "level": 0,
            "comment": "I don't feel the butterflies compared to the initial 1st group\nIs just fast and furious \nTheir ig shows their more of friendship together rather than getting the lovers feel",
            "score": 13,
            "author": "shems-2383",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you referring to the date video we saw at the end or do you mean their actual IG?",
                    "score": 1,
                    "author": "xiaopow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i mean their actual ig\n\nthey had a gathering to watch the 2nd segments recently",
                            "score": 1,
                            "author": "shems-2383",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "how did you know their ig?\n\nhow many of them gathered together to watch it? cant say im surprised they gave each other their phone numbers anyway (or at least their socials) right after the filming",
                                    "score": 2,
                                    "author": "CyberMew",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "once managed to find 1...the rest they tagged in their ig story",
                                            "score": 2,
                                            "author": "shems-2383"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Does it not seem like anchor and marketer are still dating?",
                                    "score": 1,
                                    "author": "xiaopow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "from their ig is seem individualistic which i dont think so\n\non the other hand the 1st skipped couple they really are dating till now\n\n&amp;#x200B;\n\nedit: wording",
                                            "score": 1,
                                            "author": "shems-2383",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The episode just came out right? Is there no cooling down period before they can post stuff",
                                                    "score": 1,
                                                    "author": "Spartandemon88",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "most of them actually post on the actual airing and/or after that",
                                                            "score": 1,
                                                            "author": "shems-2383",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Where can we find their IGs? Curious to see how they felt after the shoot and what happened after",
                                                                    "score": 1,
                                                                    "author": "CyberMew",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "i post it on the previous ep thread. you can find it there",
                                                                            "score": 3,
                                                                            "author": "shems-2383",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "yo\\~ I'm curious about ||ano and YJ|| kinda wanna follow their ig lol",
                                                                                    "score": 3,
                                                                                    "author": "mstfa23x"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Which 1st skipped couple? 👀",
                                                    "score": 1,
                                                    "author": "prvt09"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The ep 1-2 skipped couple\nThe engineer guy",
                                                    "score": 1,
                                                    "author": "shems-2383"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damnnnnn girl model (SY) is straightforward! I like her! \n\nSo interesting to see when two people can perceive the same situation so differently, like with &gt;!singer songwriter and victoriano.!&lt;\n\nI thought dentist would &gt;!also get 2 lunchboxes!!&lt; And yoojin/plastic surgery marketer will get more than one for sure. \n\nNot the department store guy writing how many grams of protein salmon has in his lunchbox card 🙈\n\n&gt;!HJ!&lt; should have picked the dentist for the lunchbox! She gave up too quickly.\n\nVictoriano is so good at guessing the survey answers. Must be his news bg.\n\nOmg SY is such a girl crush lol she was thoughtful by &gt;!not choosing KM in the end to not burden him!&lt; but was also like... i'm still a queen 👸🏻\n\nWow victoriano fell in love, judging by what he said abt her \n\nOmg the end was a mess 😂 but i did like how &gt;!the dentist made his choice despite her already picking someone else!&lt; \n\nThe &gt;!follow up vids!&lt; were cute!",
            "score": 11,
            "author": "xiaopow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Victoriano is very good at talking. And yea I think &gt;!Hye Jin !&lt;regretted randomly choosing the other guy she haven't talked to, like she said in the show, and I thought it was a waste as well\n\n  \nWhere can we see the &gt;!follow up vids!&lt;?",
                    "score": 2,
                    "author": "CyberMew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah Ano was such a good talk and sincere, that model guy was also good talker but kinda show his other side pretty quickly lol",
                            "score": 2,
                            "author": "mstfa23x"
                        },
                        {
                            "level": 2,
                            "comment": "I just meant the self-submitted date videos at the end of the ep.",
                            "score": 1,
                            "author": "xiaopow"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The other side feels like something is budding and the other feels like \"meh\". It really do portray how we approach first date...sometimes I cringe because it reminds me how misled we are 😂\nLuckily because it's so fast, I'm not getting invested as much as We Got Married 😭",
                    "score": 2,
                    "author": "Vreiya",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's definitely easy to misinterpret politeness/courtesy/friendly vibes for mutual interest",
                            "score": 3,
                            "author": "xiaopow"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I am still curious as to whether they really pick on the spot because there was a segment whereby the staff member asked the dentist to make his choice in 1 minute and he was thinking hard. Was that not the final choice?",
                    "score": 1,
                    "author": "Spartandemon88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They have to tell PDs their choice so that PDs can determine a reveal order that is entertaining/suspenseful.",
                            "score": 1,
                            "author": "xiaopow"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does anyone know the ratings for this and the past episodes?",
            "score": 3,
            "author": "lurker_gal1999"
        },
        {
            "level": 0,
            "comment": "VICTORIANO AND YOOJIN ARE SO CUTE TOGETHER I NEED AN UPDATE 😭😭😭",
            "score": 4,
            "author": "prvt09"
        },
        {
            "level": 0,
            "comment": "This show really emphasises how these quick shitty pickup attempts just don't work and I keep getting sour taste in my mouth because the men's side. They all seem like players.\n\nKinda felt bad for Myung Hwan, he didn't really have much to show for himself outside of his whole persona being about working out.\n\nJong Seok tried to win them over with his wealth and being a model, but sincerely couldn't stand watching him fetishise women. Also that negging attempt was just poor taste and I'm glad Yoo Jin caught it and discarded him.\n\nFeel like the 5 minute rotation would be better to have somewhere in the beginning of the show. I don't understand why they keep on insisting of having 3/4 of both episodes with people who didn't even share a single word with each other. What's the point of giving someone your meal in hopes that you'll get to talk with them, if you will get to talk to them anyways during the last 5 minutes. At least let them chat for a bit, if they gave them their lunch.\n\nIt seems it's done intentionally to make for more awkward situations, but after \"2\" episodes of this, I'm just getting a bit tired of it. Hope they make some changes with how segments are formatted.",
            "score": 20,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I kinda agree that this show seems less abt helping people make connections and more abt creating awk situations for the MCs to comment on. The dating part feels secondary sometimes.\n\nI was shocked the model guy told YJ \"this is why people say you're no fun\" 😳 like... most people who go on these shows whether for exposure or for actual connection have the common sense/courtesy to try to look good for the camera. \n\nI like the idea of using the lunchbox to gain convo time with the person you gave it to. I wonder if they will make any changes to the show format as they go along.",
                    "score": 17,
                    "author": "xiaopow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So agree about ur comment on the show, feeding the MC. The dating is just like, \"hopefully things go well\". Omg, exactly! jeeez, wanna slap that model!",
                            "score": 1,
                            "author": "mstfa23x"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kang Min is obviously not a player. He is a nerd. Just like the first group, he is indecisive. Studious individual prone to overthinking. He could pick the obvious and make it work but he wont.",
                    "score": 1,
                    "author": "st_arch"
                },
                {
                    "level": 1,
                    "comment": "I'm ok with their awkward situations, all I care and my hope is that they keep bringing ulzang and are able to show some sparkling sensation lovey-dovey thingy like the 1st tall couple and Ano n Yj.. I watched the sneak peek of the next eps, I think I will skip it \\*pun intended, them ppl dont look that pretty for my taste..",
                    "score": 0,
                    "author": "mstfa23x"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This kinda shows the Korean ideal type for both males and females I guess.. omg from the getgo, I chose Yoo Jin as well, she's too cute and very understanding, and she looks like Yoo Jimin! aespa!, no?.. Victoriano also seems mature enough, the model  Jong Seok seems not sincere enough IMO and black shirt Myung Iwan guy, yeah like the girls said, is like a younger bro, who just wanna play. Same as for the girl, Hye Jin is... hmmm, tho other I feel them sincere",
            "score": 1,
            "author": "mstfa23x",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yoojin kinda look like Park Bo Young to me.",
                    "score": 2,
                    "author": "popoapoooo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "SY was really attractive - anyone have he insta?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Aw I really liked Victoriano and Yoo Jin. They’re both so considerate as shown by their lunch boxes. I’m so glad they’re still dating.",
            "score": 1,
            "author": "zaichii"
        },
        {
            "level": 0,
            "comment": "I might be judgemental but I think a shows poster is the concept. The poster is on the hosts looking like a 90's family movie like Jumanjii, Home alone or something. And the dating show is indeed more a fast variety form of dating show. They are instructed to do things at a certain time. \n\nI just don't understand the point. What is the point? According to the poster it's giving the hosts screen time.",
            "score": 0,
            "author": "Secure-Ad4436",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah jae suk and Somin are the highlight of the show, and the contestants are just supporting",
                    "score": 4,
                    "author": "temptressmoon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Am I the only one hate that model? Her face is plastic. Even if it is not, she is really forcing herself not to smile or laugh properly. I felt Diva vibe from her. There is huge wall on her personality which shown in interview with pd. The only thing great about her is that she lowers her ego to be upfront with her feeling.",
            "score": 0,
            "author": "st_arch"
        }
    ]
}