{
    "id": "10gcibi",
    "score": 25,
    "title": "You Quiz on the Block",
    "author": "SentenceMelodic88",
    "date": 1674160651.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/10gcibi",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm so glad VIU decided to take up You Quiz on the Block. Have been enjoying it so far. It managed to be funny, touching and informative at the same time, even if you don't know the guests that well. Basically all the qualities that got me interested in korean varieties in the first place. Hope they will also sub the older episode!",
    "comments": [
        {
            "level": 0,
            "comment": "Same. I wish they'll sub those old episodes",
            "score": 8,
            "author": "No-Significance-7898"
        },
        {
            "level": 0,
            "comment": "Ugh it’s not available on Viu PH 😭",
            "score": 6,
            "author": "fauvevivre",
            "replies": [
                {
                    "level": 1,
                    "comment": "was excited to go check ughh hopefully it will be available too",
                    "score": 2,
                    "author": "jiseulseyoung"
                },
                {
                    "level": 1,
                    "comment": "I was about to check :( wala nga",
                    "score": 1,
                    "author": "eatsburrito",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've been checking every week. :(",
                            "score": 1,
                            "author": "elaineandbiting"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm just glad someone finally bought the rights to sub YQOTB! It may have taken too long but well, at least going forward episodes will be subbed. Too bad it's not yet available in our country, but at the very least, it's available on the high seas to search for now.",
            "score": 3,
            "author": "aeramarot"
        },
        {
            "level": 0,
            "comment": "i like this week episode too, so far been enjoying it",
            "score": 3,
            "author": "shems-2383"
        },
        {
            "level": 0,
            "comment": "Can you guys give a brief summary of what the show is about? I usually watch a majority of YJS's shows but could not find subs when it initially aired so I just gave up.",
            "score": 2,
            "author": "Paincoil",
            "replies": [
                {
                    "level": 1,
                    "comment": "This shows's format first appear in Mudo's segment after their hiatus where YJS interview people on the street about their life and then continue on the members. Basically this show replace his Happy Together as talk show program. It start slow but pandemic made this show big because they aren't just interview random people anymore but manage to invited big star to talk indoors.",
                    "score": 4,
                    "author": "kripkrip"
                },
                {
                    "level": 1,
                    "comment": "From wiki \n\nThe show is about Yoo Jae-suk and Jo Se-ho who enter ordinary people's everyday lives, chat with them, and give them surprise quizzes. The talk and quiz show program will spotlight these people's lives and aims to gift them a refreshing, different kind of day.[9]",
                    "score": 3,
                    "author": "shems-2383"
                }
            ]
        }
    ]
}