{
    "id": "10ozx5k",
    "score": 12,
    "title": "People who actively lurking on Korean's Forum, MUD related question.",
    "author": "hopeurfutureshine",
    "date": 1675078951.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/10ozx5k",
    "media_urls": [],
    "other_urls": [],
    "postText": "For people who actively going in and out Korean Forum, I wanna ask some question about My Ugly Duckling that still actively bringing up \"president and the underling organization hierarchy election\".\n\nAre there any discussion, news or anything related to that topic? Are Korean GP actually like that \" Topic/content\"? It's make me really curious about after month and month or maybe year, they still bringing up the topic almost every week here and then. So do they like it and find it entertaining? \n\nI mean, just last week they touch the topic and this week they also bring that topic again in the first segment. \n\nOfc, the fact production team still bringing up the topic and airing it means it should be they like it, but I refuse to believe the fact and want to challenge it by looking for various opinion especially from the MAIN target of Korea Variety Show which is Korean GP. I'm learning the language but still sucks so it's better for people who know and actively navigate on the site to help me. \n\nMany thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "Not directly related to the \"MUD politics\" discussion but during last week's episode, they briefly talk about how Sangmin and Junho have been dominating screentime. Most of the members seem to not mind with one of the members (maybe Jong Min?) saying \"it's good because we don't have to do as much\" (paraphrasing) - so yeah I think the show does deserve some blame for focusing so much on these topics but IMO it's caused by complacency of the members and laziness(?) of not having to create new scenarios from scratch every week to fill up episodes.\n\nI do get why you are asking this but I feel like this week's episode was fairly justified since it only involved Jong Min and Kyung Hwan who have never really been directly involved in the politics and have never had exclusive screentime by themselves on the show so it was a good excuse to try and create new \"pairs\" of characters for future episodes.\n\nI think both the writers and the members fall back on the MUD politics talk a lot because it's an easy (some might say cheap) way to bring out the characters that all of the members are playing on the show and maximize those characters' TV personalities. It's easier to build up characters and personalities when you have a common topic across everyone and keeps the continuity of the \"MUD Universe\"\n\nLast two weeks it was super nice to see some episodes featuring Won Hee and Suk Yong since they have great chemistry and it actually feels like we are seeing a day of their lives instead of a setup but we need to understand even these \"natural settings\" have a story outline that writers / PD's work together to try and make Won Hee's character even more lonely than he is lol. \n\nIf you think about it, I'm sure they spend a full day to set up props, stories, a loose script to follow, only to get 20-30 minutes of footage (maybe one of the 3 \"mini episodes\" per MUD episode). Difficult to do this every week from the producers side and also frustrating for members to feel like they have no privacy (cameras all over their place) just for a little screentime - as opposed to letting the members gather together to play up their characters and talk shit together for a day to get 3-4 weeks worth of footage.\n\n\nI didn't mean to rant this much but tldr of my opinion is that the \"politics\" discussion may be annoying but I don't focus on the literal sense of hierarchies but understand that it's a (cheap) tool to build up characters, storylines, and the \"reality universe\" of MUD.",
            "score": 10,
            "author": "Tobias_Funke"
        },
        {
            "level": 0,
            "comment": "I don't lurk on any korean forums, but they did talk about the lower ratings when Sangmin, Junho and Jaehoon appear on the show in last weeks episode. Based on that I'm assuming that Koreans are also tired of election talk lol \n\nIt did increase the ratings in the beginning IIRC, but they talk about it way too often now that it's not fun anymore.",
            "score": 5,
            "author": "BlissRain",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, but they didn't specify the topic are the source of lower ratings. And they did a lot of segment beside the election talk, so I didn't think that they keep appearing is the same as election talk keep appearing. Although the main culprit is there too.",
                    "score": 3,
                    "author": "hopeurfutureshine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes of course, it's not that Sangmin, Junho and Jaehoon only appear together, but viewers felt like they appear too much on the show - whether it's when they're together or seperate is not clear.",
                            "score": 4,
                            "author": "BlissRain"
                        }
                    ]
                }
            ]
        }
    ]
}