{
    "id": "10ydjyj",
    "score": 11,
    "title": "Should Hangout with Yoo hold a massive concert?",
    "author": "Gotchapawn",
    "date": 1675995387.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/10ydjyj",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/poll/10ydjyj)"
    ],
    "postText": "I was binge watching Hangout With Yoo and we cant deny, the special projects, Ssak3, Refund Sisters and MSG/WSG Wannabe were all successful. They can also include Yoo San Seul and Yoo Go Star. They can also bring Toyote(whatever happened to that project, felt like they want to do something then stopped and didnt bring it up again, covid related?)\n\nDue to Covid, Hangout with Yoo needs to change its approach, have to end or not proceed to intended plan. Although MSG/WSG performed, the other groups cant or did not. \n\nShould MBC try to hold one? or its too early?(early because they probably thinking of making another one?)\n\n[View Poll](https://www.reddit.com/poll/10ydjyj)",
    "comments": [
        {
            "level": 0,
            "comment": "I've been honestly watching out of obligation, outside of the projects, the show is kinda mid",
            "score": 16,
            "author": "banethor88",
            "replies": [
                {
                    "level": 1,
                    "comment": "the restoration episodes were good though but the RM like ones are like... yeah 😅",
                    "score": 4,
                    "author": "Gotchapawn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They need to sort out the members chemistry first. And the only one that stand out during individual mission is still YJS.",
            "score": 7,
            "author": "kripkrip",
            "replies": [
                {
                    "level": 1,
                    "comment": "YJS is YJS though. There are times he let them try and be chaotic but without him helming, they felt flat. \n\nI also think YJS and the show is doing their best to have that natural chemistry on screen. Hope everyone figure that out.\n*(Younger ones too need to stop being awkward to Jun Ha hyung)*",
                    "score": 9,
                    "author": "Gotchapawn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "unrelated but i stopped watching HDYP when the new cast started :( don't like this format, feels like a mish mash of FO/IC/RM etc, i miss YJS learning and doing things with a different bunch of people every few episodes. guess it's more work on his part, but that's what the show was originally meant to be about. not doing skits with a fixed cast every week",
            "score": 15,
            "author": "animemachinex3"
        },
        {
            "level": 0,
            "comment": "They should include everyone in the concert and fit everyone’s schedule",
            "score": 4,
            "author": "Henrysgae"
        },
        {
            "level": 0,
            "comment": "yes, i only watch hangout with yoo for their concerts/singing arc soo i dont mind :)",
            "score": 7,
            "author": "thefaptard",
            "replies": [
                {
                    "level": 1,
                    "comment": "i dont mind too ...at least MOM still produce more songs &amp; coming gaya-g too",
                    "score": 6,
                    "author": "shems-2383"
                },
                {
                    "level": 1,
                    "comment": "True. its Yu San Seuls fault 😅😁",
                    "score": 4,
                    "author": "Gotchapawn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty hard to gather everybody now that covid protocols are lifted and all the singers are busy trying to earn money from touring.",
            "score": 3,
            "author": "Spartandemon88"
        },
        {
            "level": 0,
            "comment": "Yes, I would love to see a HDYP Concert with all the music projects. I'd love to see the Refund Sisters in concert &amp; their final performance was endearing. Although I was kinda annoyed with WSG Wannabe dragging things at first, but rewatching the project....it was fine. \n\nSide note, I still have my WSG Wannabe album factory sealed.\n\nI did take a break from HDYP, but watched episodes 155-160 the past few days. I have to watch 161 - 171 still.",
            "score": 1,
            "author": "ScrewySiu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Refund Sisters did have an awesome ending, emotional too but they do deserve a stage full of people.\n\n\n*drooling on that sealed cd box though hahah.*",
                    "score": 2,
                    "author": "Gotchapawn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The group I bought it from had one available the other week. I think I paid $120 for it, but that was during COVID and shipping was the majority of the price. Album sold at cost to us fans.",
                            "score": 2,
                            "author": "ScrewySiu"
                        }
                    ]
                }
            ]
        }
    ]
}