{
    "id": "112f09f",
    "score": 2,
    "title": "what do you think of the newest running man pd?",
    "author": "FletchTheBitch",
    "date": 1676405833.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/112f09f",
    "media_urls": [],
    "other_urls": [],
    "postText": "I didn't watch rm for a few weeks and now randomly catching up with episodes. It's not that i was losing interest just fell out of things. I tried watching this week's episode and stumbled on to this comment somewhere which was interesting. I can't post links so just copied it all. so what do you think? I think she's been here for a few months now.\n\n&gt;**fruitpunch123** **a day ago**  \n&gt;  \n&gt;To each their own, **but I find recent episodes by this Hyung In PD have been rather boring and stagnant. I think there have been already 2 episodes of same cooking concept at different locations that reminded me of Family Outing** (looks like next episode is possibly involve cooking again). **This, plus those long random sit-conversation shoots (should just be a talk show then), lack of innovative games (indoors and outdoors), missing comedy antics of Gwangsoo (which SeChan fails to step up), the recent feeling of heavy dependence on Jaesuk and Sukjin combi to carry the show**; it doesnt scream Running Man vibes anymore, **I thought its just another typical variety TV show programme (you can paste another title on it). Neither funny (maybe a couple of chuckles) nor exciting. I would be distracted on other things from watching the full episode. Even the previous PDs are more creative than the current.** Fanboys and fangirls can rage all they want, but I have been watching RM from the very beginning. **It has been a humble but steady declin**e. Though I hope this PD to improve and do well with the given new timeslot.\n\na reply:\n\n&gt;**yjs** **fruitpunch12316 hours ago** **edited**  \n&gt;  \n&gt;jihyo's participation in the second half heavily relied on haha and sechan trying to steal her card in the room and the freeze game, without them initiating the drama jihyo would not have been that active except for her young comment. sechan is one of the few cast members who can get jihyo to participate and loosen up, that's miracle worker level. kwangsoo in his last year was not as fun as he was before, at some point he was burnt out, he was not as crazy as he used to be, he calmed down a lot. **i do agree this pd is relying too much on the cast chemistry, the games are not are fun or entertaining as before, the talk segments can get redundant, but also there's cast injuries they can't play physical games that were exciting 10 years ago.**\n\nand another:\n\n&gt;**fruitpunch123** **yjs14 hours ago**  \n&gt;  \n&gt;I agree with your constructive comments except the Sechan part, rather than some delusionals accusing I expected RM to do running or crazy physical activities. About JiHyo: She has been getting more passive and 'hidden' ever since Gwangsoo has left the team. GS has the ability to pull others out of their shell esp Jihyo with GS taking the limelight as the 'villain' or 'idiot one'. It wasnt that bad after GS left, she had banters with Jae Suk, SukJin and KJK. But I think somehow their love-line was banned/'cancelled' and now reverted back to her new low (since there are no other lines involving her). Currently the same, recurring attempts are SeChan, Haha, Jaesuk will try to get her participate by complimenting her fashion, looks or whatever one or two words she spoke out. **Sechan is a comedian, so I would expect him to do more after GS left, more than just getting Jihyo to participate. I**n fact I see Jaesuk is the main guy who repeatedly attempting to tease or be the fuse to trigger banters between her and KJK. **SC chemistry with Somin also kind of like fizzled out, IMO. I am not sure what is SC role in the show now.** He was doing great with GS before that. **And yes this PD rely too much on talk or \"chill\" segments which gotten redundant...** what I implying is there are many previously non-physical games that she can get inspired from. My easy examples are the indoors stock market game, or the gambling poker games. Those are innovative and entertaining, not even 10 years ago.\n\nim copy and pasting all the comments, but highlighting the interesting parts that I kind of agree with or think they make sense. im adding my thoughts in the comments.",
    "comments": [
        {
            "level": 0,
            "comment": "The show simply isn't as focused on being a gameshow anymore. Like the latest episode for instance, there was no game until 1h 15m in. They played two games that day and one was completely edited out. The other was \\~7m of tag lmao. It's ironic, but the staff simply cater to what the majority of Running Man viewers enjoy. It's up to you whether you enjoy that or not. To me, it still feels like Running Man. If anything is missing from the so-called \"Running Man vibes\" I think its the guests. Signs of a changing industry, but I really miss the random gem guests, usually actors, like Ryu Seungsoo, Park Boyoung, Choi Minsoo, Go Ara. Some of the recent actresses have been in that vein.",
            "score": 75,
            "author": "dm-ur-titties-please",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "but there have been many guests. maybe it's because I binge watched the last few episodes I missed (like 6-7 or more) but I feel like they mostly had guests.",
                            "score": 3,
                            "author": "FletchTheBitch"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i actually dont realy care for grand-scaled games and such and found most of the nametag games not to my liking tbh. So, I like the talk-show aspect lol.\n\noooh I agree about the recent actress guests.",
                    "score": 6,
                    "author": "FletchTheBitch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think Running Man is at the stage in it's life where the producer's objectives are to bring in new viewers.\n\nI think the goal is to keep its viewership and stall it's inevitable ending, at least until YJS is done with it.\n\nSo the show as a whole, even with the obvious setback of having aging members, doesn't have room for reinvention.\n\nAt this point the show is really riding on its legacy, and I think Hyung In is doing just fine.",
            "score": 48,
            "author": "small_root",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;even with the obvious setback of having aging members\n\nidk if ppl recognize this but they are OLD. Like actually old. It's insane that their guests can actually be their children, and that their guests watched Running Man growing up.\n\nAnd because they're so old, they're bad at games now. Old Running Man would do games, pull of crazy challenges, and be quick-witted. And they could do it because the cast was in their 20s to 30s - Kwang soo was 24 when the show started and YJS was 37.\n\nNow you watch them struggle to understand the basic principle of even splitting up in freeze tag. You watch them struggle to think on their feet for verbal games like the car \"Strawberry\" type games. All the young guests and Sechan + Somin do well in these verbal games, but the older members just can't think as fast as they used to so they're almost always the ones making mistakes.",
                    "score": 31,
                    "author": "inspcs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "this is silly, they are not elderly lol. They make mistakes to make the show funny that's all.\n\nThey have characters they stick to, like YJS is known for fumbling games because he gets 'nervous', and JSJ purposely says words wrong. He even admitted to making mistakes so the editors had more clips for a youtube compilation \n\nYes they cant be as physical in games and that is do with their age, but mentally they are doing just fine. YJS/JSJ/KJK they're all very smart and know how to make things entertaining.",
                            "score": 16,
                            "author": "pagethirteen"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;as a whole, even with the obvious setback of having aging members, doesn't have room for reinvention.\n\nu clearly dont understand how the shows work.",
                            "score": 1,
                            "author": "Which_League_3977"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm fine with her. Most people watch the show for different reasons and will remember only the good or the bad of what they like/dislike. There's no PD that has only good or bad episodes.",
            "score": 31,
            "author": "kale__chips"
        },
        {
            "level": 0,
            "comment": "This sort of thread kept appearing in the RM sub a few times earlier on. \n\nI've held off on saying much on those because I thought it was too early. I think it's fair to judge now. 😁\n\n- I think she's doing just fine. \n\nI agree with the person that said RM isn't looking to attract new viewers. I myself don't watch the show for games. Much in the same way as you mentioned in a comment, I am not a fan of the nametag ripping segments. Not because I find them uninteresting, but because I think they are seriously unfair and offer nothing exciting. I pretty much know what is going to happen: KJK will overpower everyone, JSJ and JSM will get eliminated immediately. 🤷‍♀️ But I do miss the themed episodes where it would eventually end in a building with them looking for hints and solving for mysteries. Not necessarily a spy mission, because I think the cast finds it too burdensome. \n\n- Episodes are forgettable, as in: nothing stands out. \n\nThese past few episodes with HyungIn have one thing in common: they're forgettable. Usually, I can quickly remember why episode followed another and what the theme was and at least one major thing from the episode. I can't really say the same about HyungIn episodes. They sort of blend into eachother and it's hard to remember which followed which. They're very forgettable too. \n\n- Backlash for 628 that messed up their plans \n\nI think the backlash for episode 628 hit them hard. I believe they filmed another episode that must have been very similar to 628, and after 628 was aired and the backlash - they had to scrape that entire episode they shot. We never saw it. This meant they had to somehow come up with a new episode very soon! I think this threw them off course a little, which is why I think some episodes feel rushed and messy. \n\n\nI must say, I do think she is capable and doing a good enough job and has a great cast to rely on. I also really liked how she used a sweet concerned tone with JSM in the last episode after their talk. It was so heartwarming. So, I do like that she's the PD. She's also funny, which is a plus. 😁",
            "score": 10,
            "author": "Ancient_Reply4583"
        },
        {
            "level": 0,
            "comment": "I do think this new PD to reliant on member conversation but it would be better if they(pd team) can provided entertaining game/activities. The most obvious one was when they need to travel to a location without gps(forgot which episode). People were mad at Jaesuk for not listening to other members but i think he was just trying to drag the \"conversation scene\" while reaching to the destination. It was obvious the member conversation is the main focus on the episode because the games was simple and other scenes was short.",
            "score": 13,
            "author": "Songs4BlackParade",
            "replies": [
                {
                    "level": 1,
                    "comment": "i know which episode you mean, I don't remember anything from it though!!! did anything even happen? lol",
                    "score": 5,
                    "author": "FletchTheBitch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "nothing happen on that episode. I found it, it was Ep 628.",
                            "score": 2,
                            "author": "Songs4BlackParade"
                        },
                        {
                            "level": 2,
                            "comment": "i think OP might be confused with Hangout with Yoo????",
                            "score": 1,
                            "author": "Raynx3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, this one where ppl criticize yjs and kjk for bullying jsj to much, in the car.",
                                    "score": 7,
                                    "author": "kripkrip",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I also remember other members were frustrated because Jaesuk keep ignoring them. That episode post are full with people criticizing Jae Suk.",
                                            "score": 3,
                                            "author": "Songs4BlackParade"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "nah. i'm not. i didnt even watch Hang out Yoo.. it was Ep 628",
                                    "score": 5,
                                    "author": "Songs4BlackParade"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think Hyung In is still unable to put her 'own mark' in these past months, feels like RM is on autopilot mode. I still enjoy the episodes weekly, but can't help notice lack of direction of the show.\n\nside note : \nUsed to dislike couple episode , but now we don't get it anymore , i miss couple episode tbh. Hoping for some actress couple episode.",
            "score": 13,
            "author": "Moonz92"
        },
        {
            "level": 0,
            "comment": "i don' think it's the pd, but because the members' are now losing creativity on this show. And I don't mean this in a bad way, but rather, I understand it. \n\nI don't know how to say it, but you can see that the members are losing the sparks to run the show. And I think it's because now they got too adapted to the show. Having a spy used to get them on their feet, but now, they don't even get excited over the spy because they've known each other for way too long, so they found the spy in an instant. It used to be confusing, nerve-wrecking and get the audience intrigued to find out who's the spy, but these days, you can see that they just act like they don't know who the spy is to carry on with the show. \n\nThey used to get excited over guests especially actress/idols that is not close with them, but as they have been running in the industry for years, now all the guests are like friends coming over and they don't get excited or give big reactions anymore. Most of the members are now married/have a partner, so they can't use the loveline tactics with the guest. Even for the single members like KJK, YSC, and SJH, they don't like playing the 'love maniac' role like Kwangsoo, Gary and Haha used to play. Now we only have JSM to play that role. \n\nSo I feel like at one point, it's not that they don't want to do things like old days, but it's just that it won't feel the same anymore and they have no choice but to depend on their talks and chemistry. If they play spy, the members are too good, it won't be funny or natural. If they play name tags among members, KJK will dominate 90% of the time. If they play tag among guests, 95% possibility is RM members winning. Everything was expected and have no surprise.\n\nSo they have to depend on small but funny games like debate (that highlights their funny banter), quizzes (highlighting dumb characters), word game (highlight members with bad wits) because those created the funny scenes. \n\nI personally believe that what makes a funny reality show is when the members are left flustered and their reactions are what making it funny. I mean, just look at HDYP/HWY, they climbed in ratings when Kim Tae Ho PD did projects that left YJS flustered. All the activities was random, and YJS's reaction was what making it funny. Now that HYDP are turning into similar game show, the ratings are declining.\n\nSimilarly, RM Chul Min's PD second era was one of the best because his punishments are brutal and left members speechless. Crocodiles, some crazy rides, flying on air. The members gave an honest flustered reaction and that's what making it fun. Now, they don't even get scared of penalties because they are very used to it.\n\nI would say one of the best ep is the one with IVE recently. I'm not even their fan, but you can see the members are genuinely being excited to meet these girls. They were all paying attention, and have full interest on what is going on. All of them play an active role, and their reactions are genuine. \n\nSimply said, the members no longer get excited because everything is now no longer felt new. So they definitely need some fresh ideas, but that's the problem. After 12 years, what fresh ideas can you have? The only thing I can think of rn is probably having New Jeans over, because they have been mentioning NJ, and Ik the members will be very excited and active on that episode. \n\nSo I definitely do not blame the members because they have been running hard for 12 years.",
            "score": 12,
            "author": "nfpapers"
        },
        {
            "level": 0,
            "comment": "Assuming people here are able to talk candidly about the subject: My super TLDR on Hyung In's era is that she is extremely reliant on the cast being self-sufficient in producing content rather than creating situations that make it easier on them. \n\nPeople have been crediting her for things that are entirely out of her control. If you separate the Running Man cast from the content, then the content would be lackluster. She has done an ok job working with the cast thus far, but so far she has no unique flair of her own. Most of her 'good' episodes are because she lets the cast roam freely and do all the work (IMO obviously). Based on Pinggyego, the RM cast can easily talk for hours and still be entertaining, but is that 'Running Man.'\n\nSome things that can be attributed to her:\n\n* Reusing the multi-week sticker board (618 - 622) that happened multiple times in Cheol Min's era.\n\nBetween just having random amounts of stickers being handed out each episode and leading to a situation where Jae Seok actually had a 0% chance of getting the punishment, it was just poorly executed. Compare this to episode 351 where So Min and Jae Seok went all out and were able to give people the punishment even though some had 0 stickers at the start. \n\n* Being strict when it's unnecessary and not having enough control when she should. \n\nIn the Jae Seok sleigh Christmas episode, she was unnecessarily strict to one of the citizens when he gave an answer to the quiz. The entire point of the episode was to ***give gifts*** out to ***random citizens*** and she wouldn't let his answer slide. In another episode (Too lazy to look up the exact number): Haha was able to give out 2 completely different answers to a quiz because she wasn't able to stop his turn after giving out 1. This resulted in many members of the cast being frustrated with her. \n\n* Thoughts on Jihyo\n\nEpisode 641: The way she talks is very much a conversation stopper. Many members rarely bounce / riff off of whatever she is saying. When they were doing the Senior / Junior talk, she seemed genuinely angry with Se Chan for saying \"Ya\" even though that was the entire point of the segment. If Jae Seok and Jong Kook didn't reroute the conversation, then it would have stayed uncomfortable. (I'm also pretty sure she didn't take part in conversation after this part. She didn't take part when So Min was talking about her problems or Jong Kook doing everything alone). I also saw a good amount of hate from Jihyo stans towards Se Chan for taking her card. I feel bad for the members for having to walk on eggshells around a member of a ***variety show.*** She does not even receive 1/10th of the 'abuse' that Seok Jin and So Min get from the other members, but she gets overly emotional. (She was even angry during the dog debate in the IVE episode). \n\nJihyo is a ***12 year veteran*** of a variety show, but her stans protect her more than most idols. After Jae Seok stopped pushing the SpartAce ship, she lost most of her character because she does not take any initiative on her own. She still gets paid thousands of dollars per episode to work with 6 talented people who make her job easy because under normal circumstances, they can make entertainment out of nothing.",
            "score": 46,
            "author": "areyousrs111",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jihyo is actually just there for the sake of being there, sorry on her stans but I really don't see the drive on her now. You can see others still trying to do something to be entertaining but you really can't see it on her now. Most of time in episode she's spaced out.",
                    "score": 50,
                    "author": "whitefang0824",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most of you would get downvoted to oblivion for saying this on the running man sub. 😂 \n\nI've been accused of being a hater for saying far less. So I won't even say anything, except, THANK YOU for being brave and saying it. 😂",
                            "score": 12,
                            "author": "Ancient_Reply4583",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are supposed to like every episode of RM and every members on that sub. Constructive criticism are not allowed there lol. Not just Jihyo, if you said anything negative there you would get downvoted. A simple dislike on some parts of an episode, actions of members, some guests would get you downvoted there lol.",
                                    "score": 14,
                                    "author": "whitefang0824"
                                },
                                {
                                    "level": 3,
                                    "comment": "Not really lol. People have been criticizing SJH for a few years on that subreddit. But I notice you keep bringing it up when it's unnecessary which is why you get downvoted.",
                                    "score": 9,
                                    "author": "Zarkuine"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I completely agree about Jihyo. I'm not trying to hate on her, because she has been with them for a decade plus and is genuinely part of the family, but she needs to be more relaxed. \n\nI'm not saying that she has to act crazy (like Somin) or do gag comedy (like Haha or Sechan) but just *expressing* herself more would be enough. I know she's quiet, her initial character was literally the \"quiet genius\" type, but she hasn't been able to express that lately. \n\nWhich gets me to my second point: we need more complex games/games in general. I'm not saying to do crazy stuff like the name tag games (the cast is already old and injured anyways) but even smaller stuff like figuring out riddles, playing a guessing game with citizens, or playing a life sized board game would be more engaging than just 90 min of talking.",
                    "score": 28,
                    "author": "l33d0ngw00k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She is definitely just there for old times sake and the fact that her fans would raise hell if she was removed. However the fact is she has regressed to a shell of her former self, she was way more active and chatty during the early years but she is just a background char nowadays. I cant remember whens the last time I thought she was the star of an episode.",
                            "score": 26,
                            "author": "Spartandemon88"
                        },
                        {
                            "level": 2,
                            "comment": "I wish they do food bingo again like in the past. Simple and nothing physical for the casts and they were able to make it fun back then.",
                            "score": 5,
                            "author": "cuplik"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;When they were doing the Senior / Junior talk, she seemed genuinely angry with Se Chan for saying \"Ya\" even though that was the entire point of the segment.\n\nto be fair... she shouldn't have even been sitting with the juniors. debuted the same year as haha and they're basically the same age. having her sit with the juniors is kind of a diss more than anything...like her career isn't as successful so she isn't considered a senior with 23 years in the business and 7 more years on running man? lmao\n\nshe's been on this show for 13 years... which is even worse. and I so agree with all your points about her fans ugh.\n\nwas I the only one who actually cringed and felt second hand embarrassment from her arguing with jongkook during the footvolley ball in front of a foreign guest? But then I swear I saw her fans saying it was the cutest spartace moment ever. lol\n\nand having sechan be there to help her gain screentime is just wrong!",
                    "score": 8,
                    "author": "FletchTheBitch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Isn't they let her sit there because in the previous segment they talk about \"Youngster line\" and Jihyo make a remark about her belong to youngster?",
                            "score": 6,
                            "author": "hopeurfutureshine"
                        },
                        {
                            "level": 2,
                            "comment": "So tired of people forcing that loveline, even somin and kjk have better chemistry.",
                            "score": 11,
                            "author": "HuntMore9217"
                        },
                        {
                            "level": 2,
                            "comment": "Spartace love line is the most awkward love line on rm ever but her fans love spartace cus they know it's the only way jihyo can somewhat get screen time. I feel bad for jong kook cus it's obvious he's awkward with the whole loveline thing and I wouldn't blame him if he felt like he's just a substitute after the Monday couple loveline ended. He has gotten a lot of hate from her fans too especially when he doesn't reciprocate the love line.",
                            "score": 3,
                            "author": "Ok_Reflection_1849"
                        },
                        {
                            "level": 2,
                            "comment": "I have seen her fans continuously try to shove her into the makane line. I don't even understand why they do it. Do they think it makes her young if she's in the maknae line? \n\nShe literally isn't. The show doesn't even consider her in that line. (Official SBS YouTube channel has two videos of the maknae line for running man. They introduce the maknae line as SoMin and SeChan. Which is correct.) Even KwangSoo wasn't in the maknae line. How on earth can SJH be in this line when she's closer in age to the Hyung line's KJK than she is to SeChan? 😁 and if she's in this line, so is Haha. \n\nMaknae doesn't mean younger. That's donsaeng. Maknae means youngest. As in, there is nobody else that is younger. If someone calls her Nuna and someone calls her unnie - then she's not the youngest. \n\nAnywho... Yeah, Haha shouldn't be a senior if she's a junior. They should be sitting on the same side. But I think they just did that as a joke.",
                            "score": 8,
                            "author": "Ancient_Reply4583"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I said exactly alsmost the same thing as the first one. It hasn't been that long and then another outdoor cooking concept. The first few weeks was great with the active games coming back and finally getting hope that the real running man is back again, but the last few episodes is going back the talkshow route which isn't to my taste. I love the banter but only if it's mixed with actual games.",
            "score": 3,
            "author": "HuntMore9217"
        },
        {
            "level": 0,
            "comment": "Although the show has a dedicated fanbase, it's quality can't hold a candle to IC. When people say that \"Oh RM has had a lot of episodes, it's fine if they just talk now\", that just sounds like an weak excuse to me. Sure IC fell off towards the end too, but just look at how much Taeho PD did, even until the end. The RM PDs are just too comfortable (or maybe just forced by the execs, since RM brings in a *lot* of money) to change things around, and I doubt adding a new person will change that. \n\nI haven't watched RM since the Global Random Tour because the quality has just decreased. Each episode has an hour plus of just *talking*, like isn't this supposed to be \"Running\" Man? And sure, you can say the cast is older, etc, etc, but (for me, at least) it's been like 4 years of lower quality episodes. Sure, they don't have to run around, but is it *so* hard to create games where they can sit, like puzzles, or do things that don't involve a lot of physical activity, like talking to citizens? Even people who *didn't* like the current PD enjoyed the gambling game so they clearly have something going there, but they just aren't embracing it. \n\nI don't think RM will end anytime soon (maybe in the next 3-4 years though) but it's purely because of the dedicated fanbase. The PDs aren't putting in quality ideas and the cast is comfortable when they're at. I doubt things will change anytime soon.",
            "score": 16,
            "author": "l33d0ngw00k",
            "replies": [
                {
                    "level": 1,
                    "comment": "Running Man is a show created by Family Outing's PDs, and that's why KJK &amp; YJS were involved in the initial cast. Those PDs left in 2016 (same year KG left), after which SBS wanted to create RM S2 by adding JHD and pulling KJK &amp; SJH from the cast, and when the fans were against that, planned to end the show in 2017 after members' weeks.\n\nThe Global Random Tour you mentioned is produced by the PD (Cheolmin) that took over after the original PDs, who also added 2 members (which was an insanely controversial decision at the time), and stayed with RM until 2020. If it were Taeho, he would've ended the show the same way he ended IC and left HDYP.\n\nIf you enjoyed the Random Tour, you might like the new traveling shows SBS produced, or NJtTW from Na PD. Or TH's new show, Seoul Check-in and its sibling show Canada Check-in.",
                    "score": 7,
                    "author": "kbbooo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; by adding JHD and pulling KJK &amp; SJH from the cast\n\nThat would have been a great change if they only didn't do it so poorly",
                            "score": 2,
                            "author": "HuntMore9217"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;If you enjoyed the Random Tour, you might like the new traveling shows SBS produced, or NJtTW from Na PD. Or TH's new show, Seoul Check-in and its sibling show Canada Check-in.\n\nHaha I definitely do. If you can see my flair, you know I'm a huge Na PD fan (although even he still has his own faults with being too comfortable, the saving grace is that his shows are seasonal, not regular).",
                            "score": 2,
                            "author": "l33d0ngw00k"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've been watching Running Man since the first episodes (having come over from Family Outing), and I agree that they've all just gotten too comfortable and have been for about 4 years. They've become reliant on the fanbase and on Running Man having that kind of seniority that allows them to not have to worry about when the show will get axed. You can really see it when you watch the other shows the members are on and see basically a completely different personality and actual effort again on their parts.",
                    "score": 2,
                    "author": "ACEwriter12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think it's ysc's fault and lots of commenters had an issue with him stealing the card but whatever, those people are always around. but i think they need someone to replace lks and the only one willing or able or chosen for whatever reason is ysc and he just can't pull it off. but then it's the pd's responsibility to find another character and role. watch them drop the old lady character for sjh in 2 episodes. lol I think maybe a more consistent flow is needed. episodes felt unplanned like they were picking random activities out of a hat and doing them. idk exactly what the issue is but that humble but steady decline line is the perfect way to describe it.\n\nstill, I think this show makes me laugh always. It's very unfortunate and this is not criticism on the pd and writers because i can't imagine how hard her and their job must be coming up with new games and themes and episode ideas. but I do think they can do better than this. Specially because they have so many things they havent tried still like nwe groups between the cast or some role plays and some talent show stuff idk just some ideas.",
            "score": 12,
            "author": "FletchTheBitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sechan actually does pull off the betraying role well when he does do it but I don't think he likes the betraying aspect as much as LKS does. As for the hate comments he received for stealing the card, commentators will always be biased against him since he's a new member. If haha was the one who had the card at the end, I bet he wouldn't face that much hate as sechan did from the particular member's fans.",
                    "score": 3,
                    "author": "Ok_Reflection_1849",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "its been 6 years now why are we still calling them new members? lol\n\ni dont think he pulls it off as well as lks, jsm and haha. he does it with intent to win, not to betray and that's why it doesn't land for me. when it gets too serious (he's playing for hte win) I find it boring/uninteresting. with LKS, JSM and HAHA they do it to be funny and make the show entertaining. they don't care that they're not gonna win (or that they'll lose). in fact, almost every time they've betrayed (especially lks and jsm) they ended up getting the penalty. which breaks it even and makes their betrayals pointless..... except that was the point. but ysc does it to win, and personally id rather not see them being so competitive. it's not a competition show, they need to put aside hteir own personal stuff. He should stop caring about losing. sometimes when the guest try giving him the penalty he starts acting like a kid throwing tantrums like \"you don't even know me!!!!!\" I dislike that a lot. he just takes the winning/losing too seriously, so if he betrays it's only to win. LKS and jsm betray to stir the pot and make it more interesting",
                            "score": 1,
                            "author": "FletchTheBitch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mentioned new members becus there are still rm fans who still hate somin and sechan even though they have been on the show for 6 years and hence why I said if haha was the one who had the card at the end, he wouldnt get as much hate as sechan. Personally I don't care if sechan does it to win. I don't see a need for him to follow the footsteps of kwangsoo or somin and somin have taken up kwangsoo's role anyway. Kwangsoo and somin have betrayed many times to win too but they have some of the worst luck on rm and combined with their reckless character of gambling with their luck , they end up getting a penalty which makes it seems like they just betrayed for fun. As for him whining, its not like the other members didnt whine too.",
                                    "score": 1,
                                    "author": "Ok_Reflection_1849"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "All the PDs have been guilty of overdoing things that get good responses. That first family outing style episode was the first RM episode after they changed their broadcast time and they did better than expected in the ratings. So the PD repeated the concept to try and get that rating boost / positive response again.\n\nAs for the point of being reliant on the members. I thought it was worse during Bopil PD's time lol. Near the end of Bopil's tenure as main PD, he had whole segments where the members had to come up with their own games with no direction from the PDs. MC Jaesuk in the sauna for example. Or that MT episode where YJS was so restless after lunchtime because he had to make enough content out of nothing. I honestly don't mind having episodes being mainly driven by the members' conversations, but they do better when given direction or a topic. One good example that I liked is the episode where the members had to come up with pickup lines or kkondae lines and be voted on by the public. \n\nAs for SJH lol. I feel a lot has already been said. But in the latest episode, I thought it was funny that she suddenly declared herself leader of the maknaes and that her fans are happy to group her with members they themselves hated from the beginning just because it might give SJH a new character.",
            "score": 9,
            "author": "SpeakableOmen",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; her fans are happy to group her with the members they themselves hated form the beginning just because it might give SJH a new character. \n\nI'm surprised I didn't even realize this! You're absolutely right here. I just thought they were trying so hard to shove her into this line in order to make her sound/look/feel younger? Because I think it's weird how they treat her. Her fans are actually like idol fans, babying their favorites. It's odd to see it happening with a middle aged person as I've never really ever seen it. \n\nBack to the point: Even KwangSoo wasn't a maknae member. Like I said in another comment, that word means youngest not younger. The only reason there is a line is because the youngest just happen to be two people born in the same year. They can even make a distinction and say YSC is the only Maknae. They don't because Koreans (and most people really) consider people born in the same year as same age. \n\nA person only belongs to the maknae line if they are actually a maknae, individually. The unofficial title of the leader went to KwangSoo because of episode 441, which is the honeybee episode. SeChan and SoMin were relatively new still (only one year on the show), and were the spies. It was the maknae line against their seniors. However, it wouldn't be a fair fight, would it? \n\nNot only are the two of them the youngest, they're also the newest members and lack significant experience. So to help them out - the former maknae memebr was called in. KwangSoo actually protested saying he wasn't a maknae anymore, so he wasn't part of the maknae line and that he was\nconfused as to why he was there. He actually didn't want to be there. \n\nWhen Haha found the hint, they were confused about KwangSoo too until someone said \"he was the maknae before SeChan and SoMin\". \n\nSeChan and SoMin asked him to help them in exchange for being their leader. Which he accepted. That's how the title came about. It isn't\nactually a thing. They were bribing KwangSoo to get him to help. 😂",
                    "score": 7,
                    "author": "Ancient_Reply4583"
                },
                {
                    "level": 1,
                    "comment": "I think leader of the maknaes bit was just a joke. For me the leader of the maknaes has to have the same (or more) energy as the maknaes. This made Kwangsoo the perfect leader. The only other member left who fits that description now is HaHa. Recently the maknaes collaborated with HaHa on his Twitch. It showcased how perfect he is as their leader. They all carry a natural youthful energy, are great at dancing, keep up with the trends and are thick skinned enough to take a savage roasting from members and sometimes guests also. \nFor all of the above reasons I consider HaHa as the leader of the Maknaes.\n\nEdit:\nI have no major issues or complaints about the pd or Sechan. I think people are being unfairly harsh.",
                    "score": 7,
                    "author": "Mission-Loquat9290"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think not replacing Kwang Soo was the biggest mistake.",
            "score": 4,
            "author": "Ktk_reddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think having Woo Jae would help quite a lot.",
                            "score": 2,
                            "author": "Ktk_reddit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can't expect someone to just fill up a 10 years position instantly though.",
                                            "score": 3,
                                            "author": "Ktk_reddit"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think she hasnt found here \"flow\" yet. Shes trying out different concepts.\n\nJust give her some time...I think shes trying lately more the bo pil style where there are no guests and the members chemistry is the sole focus.",
            "score": 3,
            "author": "boxich"
        },
        {
            "level": 0,
            "comment": "I don't know man, Haven't watch RM for a few months now. Ever since LKS left my interest with watching RM suddenly faded. I'm not sure why, but the feeling I had before waiting for every new episode of RM before suddenly went away.  \n\n\nBut tbf I still love RM and will still support all of them.",
            "score": 5,
            "author": "True-Philosopher8378",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here and now im on dating show run.",
                    "score": 0,
                    "author": "garbuja"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I do think she's doing well. \n\nI mean, there's nothing wrong with squeeze the towel till the last drop after getting a good response for member talking time. Isn't the \"talking time\" first getting attention in Bopil era and still getting a good response in Hyung In era? The fact that Korean GP which is their primary target like it means things work and personally there's nothing wrong with that. \n\nAlso I do like \"talking time\" segment because it's fun to see they talking about anything and they have the ability to make it fun too. Playing big game (ripping name tag &amp; spy game) is fun too but how member act is like having a pattern and it's kinda repetitive for me. \n\nDoing work for a show that's been running for more than decade that having no constant concept for every week sure it's hard (look at IC, although RM not in extreme side like IC). You gonna stumble into idea block or used idea.\n\nI do hope RM with Hyung In and her vision can go into higher state and make it big. Also hope RM can get a stable rating since it's bouncing on 4% and 5% and can broke through stable 6% and broke their last year record which is 7.2%.",
            "score": 2,
            "author": "hopeurfutureshine"
        },
        {
            "level": 0,
            "comment": "BoPil PD also had one episode where all the cast did was just sit and talk. \n\nI think Hyung In PD is doing fine. She's trying very hard, and bringing in lots of big name guests the past few weeks. I personally do not like big name guests bcos I feel like the cast restrain themselves in those episodes and don't go all out but if it helps with the numbers then it should be a good thing? \n\nI personally find Se Chan extremely annoying. He's on par with Jo Se Ho for me, where they're both comedians who are grating, but are well taken care of by YJS. So Min isn't a comedienne but I feel she creates more organic and funnier moments in RM and Sixth Sense that are memorable. The show feels lacking without her. \n\nOfc this is just my opinion. Se Chan is well loved by the RM cast and they spoke constantly about him when he was down with covid. But he constantly does irritating things that doesn't make the show any more humorous. Like stealing JiHyo's card and then getting one extra through the lucky draw. Like, dude, just give the original one back to her. But, in line with Se Chan's type of comedy, he wouldn't. \n\nI do think that the show could do with some fresh or younger blood, to replace Kwang Soo. Having YSC (despite my dislike for him) and So Min, somewhat revived RM. Look at 1N2D after Seon Ho joined, it became better too. But it won't be easy to find someone who can fit into the RM cast dynamic - unless Kim YeonKoung decides to join them hahhahaa",
            "score": 5,
            "author": "meddkiks"
        },
        {
            "level": 0,
            "comment": "I came to the point now that I only watch Running Man if I thinkits episode would be enjoyable, not like before that every episode is a must watch. Just like the 2 Family Outing concept episodes, I skip it cause I'm not a fan of it.\n\nNew PD have some ok episodes, got a good start but becoming boring nowadays.",
            "score": 3,
            "author": "whitefang0824"
        },
        {
            "level": 0,
            "comment": "The producers will never be able satisfy everyone as RM continues to grow. There was a previous thread where people said similar things about Bo Pil. I think Hyung In is doing a great job. The cast chemistry has been great and I love the new dynamics that they've been trying (ex. Somin and HaHa). I personally like the 'boring and stagnant' aspects of the show sometimes and the 'family outing -esque feel, feels nostalgic. \n\nWe as audience members need to let Kwang So go. Please! He was great and I loved him but he's gone and doing others shows. Se Chan was never brought onto the show to be similar to Kwang So (though I will admit I did not like him in the beginning but he's grown on me). Also, it's not Se Chans duty to get Ji Hyo to participate, she's been doing great on her own! I love her one-liners, how lucky and sometimes unlucky she is, also her hairstyles and fashion choices have been amazing! But tbh Ji Hyo being quiet isn't something new...\n\nAnyway, I will continue to support running man until the very end!",
            "score": 2,
            "author": "tea_n_lemon"
        },
        {
            "level": 0,
            "comment": "i think there are doing fine , long time fan will love this ,",
            "score": 2,
            "author": "Deep-Requirement3073"
        },
        {
            "level": 0,
            "comment": "Iirc the pd was a writer before, joined RM 2 years ago. So her most influential people that taught her was bopil and during pandemic. I can get why the theme were like these. If you want something bold, sbs need to pick someone with experience in outdoor variety.",
            "score": 2,
            "author": "kripkrip"
        },
        {
            "level": 0,
            "comment": "I think she's doing good. I like the episodes now more than bopil's episodes.",
            "score": 1,
            "author": "_denton"
        },
        {
            "level": 0,
            "comment": "So many Genius PD's in this sub..",
            "score": 1,
            "author": "SurveyBright3406"
        },
        {
            "level": 0,
            "comment": "Honestly, the new PD is doing the best she can, but sometimes it can get tiring with repetition of activities like foot volleyball. I wish there was more activities and games that involve including everyone, not excluding someone (Jeon So min) due to lack of physical capabilities. I miss having skits done by the cast members as it includes everyone and it's funny. I wish that the show wouldn't cut out so many scenes we have with cast members, especially when it comes to JSM and SJH as we don't really see them do activities and hear some talk as often as other members now.",
            "score": 1,
            "author": "Potawnd"
        },
        {
            "level": 0,
            "comment": "There are reason why creative director and writers are leaving the shows. Its simply means the shows at the end of their life. Hyung in is just there to fill the slot. She's not up to standard in my opinion.",
            "score": 1,
            "author": "Which_League_3977"
        }
    ]
}