{
    "id": "1167v1g",
    "score": 100,
    "title": "Running Man E642 &lt;Winter Festival&gt; | 230219",
    "author": "angellove_rm",
    "date": 1676804559.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/1167v1g",
    "media_urls": [],
    "other_urls": [
        "https://torrentsee151.com/topic/258752)",
        "https://torrentsee151.com/topic/258755)",
        "https://torrentsee151.com/topic/258754)",
        "https://www.kocowa.com/en_us/media/72783511/running-man-episode-642)",
        "https://anonymfile.com/j0rdO/en-running-man-episode-642-downsubcom.srt)"
    ],
    "postText": "&gt;Running Man was classified as an \"urban action variety\"; a genre of variety shows in an urban environment.The MCs and guests were to complete missions at a landmark to win the race. The show has since shifted to a more familiar reality-variety show concept focused on games.\n\n**Members**\n\n* Yoo Jae Suk\n* Kim Jong Kook\n* HaHa\n* Song Ji Hyo\n* Ji Suk Jin\n* Yang Se Chan\n* Jeon So Min\n\n**Guest**\n\n* &gt;!Byul!&lt;\n* &gt;!Heo Kyung-hwan!&lt;\n* &gt;!Seogy!&lt;\n\n**RAW**\n\n|Quality|Release|Magnet|\n|:-|:-|:-|\n|720p NEXT|[Here](https://torrentsee151.com/topic/258752)|magnet:?xt=urn:btih:ec33909d3fa3225dfde07fb2ccb1cb1336409fb4|\n|720p NICE|Here||\n|720p BULU|Here||\n|720p XTX|Here||\n|720p H1RST F1RST|Here||\n|1080P NEXT|Here||\n|1080 XTX|[Here](https://torrentsee151.com/topic/258755)|magnet:?xt=urn:btih:a786e5fe0167fd123d5ec9dc38d7baa71142724f|\n|1080 NICE|Here||\n|1080 H1RST F1RST|[Here](https://torrentsee151.com/topic/258754)|magnet:?xt=urn:btih:5f4fc10f85c06b2461e8d5182cc6e831ad1222af|\n\n**Subbed/Streaming**\n\n|Status|Stream|Subtitles|\n|:-|:-|:-|\n|Subbed|[Kocowa](https://www.kocowa.com/en_us/media/72783511/running-man-episode-642)|[Here](https://anonymfile.com/j0rdO/en-running-man-episode-642-downsubcom.srt)|\n|Subbed|VIU|Here|\n\nPreview:\n\n**Licensed streaming sites**\n\n**KOCOWA** is a licensed free to stream website. KOCOWA subscription is available in North America and South America. KOCOWAtv is a worldwide content streaming website where people discover, watch and fall in love with K-contents. We provide the greatest amount of K-drama, K-variety and K-pop show on demand with professional subtitles for international ‘Hallyu’ fans in response to the increase in global popularity of Korean culture. They release some of their content for free both on their own, and on their partner platform Viki 2-3 weeks after it aired\n\n**VIU** is a licensed free-to-stream website, which locks their newest content for 72 hours for premium users. All their content is available for free after 72 hours. VIU is available in Singapore, with some of its content also available in Malaysia, Indonesia, Philippines, Hong Kong &amp; India, Bahrain, Egypt, Jordan, Kuwait, Oman, Qatar &amp; Saudi Arabia.",
    "comments": [
        {
            "level": 0,
            "comment": "eng .ass synced to 런닝맨.E642.230219.720p-NEXT\n\n[https://pastebin.com/7mBAqeMR](https://pastebin.com/7mBAqeMR)\n\neng .srt synced to 런닝맨.E642.230219.720p-NEXT\n\n[https://pastebin.com/S24dnJZV](https://pastebin.com/S24dnJZV)",
            "score": 49,
            "author": "dramajoe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. We are very grateful that you took the time to share the sub for everybody to enjoy. I must say the captions in the .ass file really made the difference in adding nuances to members interactions.",
                    "score": 4,
                    "author": "obscur56"
                },
                {
                    "level": 1,
                    "comment": "Thank you, that was super fast!",
                    "score": 5,
                    "author": "Apprehensive-Stage-2"
                },
                {
                    "level": 1,
                    "comment": "thank you as always",
                    "score": 1,
                    "author": "henrikoez"
                },
                {
                    "level": 1,
                    "comment": "Thankyou so much JoeeeeE🐱‍🏍",
                    "score": 1,
                    "author": "alfredtambora"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I cracked up so freaking hard when Byul was singing and JK told Haha \"I wonder who she's singing about\". So adorable to see Haha in number 1 fan mode",
            "score": 20,
            "author": "astradexa"
        },
        {
            "level": 0,
            "comment": "Looool they brought back the swans for them to play with",
            "score": 16,
            "author": "_denton"
        },
        {
            "level": 0,
            "comment": "I'm only twenty min in but Byul is so cute, and she did a good job with the Hybe Boy dance. The forced 10man hybe boy dance was so cringey but so funny. Gave me family outing vibes when they had to do sing/dance something embarrassing",
            "score": 15,
            "author": "meddkiks"
        },
        {
            "level": 0,
            "comment": "High bitrate encode by SNIPER (런닝맨.E642.230219.720p-Sniper.mp4) [2.62 GB]\n\nmagnet link : magnet:?xt=urn:btih:76ada7d2f845944c1bac256952ed893a4ecad5e4",
            "score": 12,
            "author": "duipen",
            "replies": [
                {
                    "level": 1,
                    "comment": ":O this is the good stuff!\n\nThanks for sharing!\n\nEdit: This torrent is nearly identical in length to NEXT version, so subtitles should be compatible with this one as well! only need to add +1 second (+1000ms) of subtitle delay in your video player.\n\nNEXT: 1h32m52s\n\nSNIPER: 1h32m51s",
                    "score": 7,
                    "author": "Atsukoi9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "my apologies, i just going to post the SNIPER magnet under your NEXT ones.",
                            "score": 1,
                            "author": "duipen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "???\n\nThis one is better than NEXT version, that's why I didn't post anything after seeing your comment xD\n\nbut it seems this sniper one is on a torrent site that has limited access (idk which country) and I don't use any VPN to enter these sites so idk how you get them, but I'm grateful anyway.",
                                    "score": 1,
                                    "author": "Atsukoi9",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i also really appreciate all of your NEXT posts, as for SNIPER torrents, they are sometimes really hard to come by so i post when i can. i checked both sniper and next for this week the runtime is basically the same with NEXT coming to 01:32:53 and SNiPER's 01:32:52",
                                            "score": 3,
                                            "author": "duipen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's why it's better than NEXT or F1RST/XTX/ETC versions. \n\nI already downloaded SNIPER one instead of NEXT one so, to anyone else, you should do the same!",
                                                    "score": 1,
                                                    "author": "Atsukoi9",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thank you both for all your work 💕",
                                                            "score": 1,
                                                            "author": "MontGenevieve"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Be aware that the volume in the SNIPER version is very low.",
                                            "score": 2,
                                            "author": "rok10001",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Tbh I can't justify keeping the SNIPER version when it's just very identical to NEXT but with lower volume and 500MB larger.\n\nIf only there's readily available subs for XTX lol",
                                                    "score": 1,
                                                    "author": "EpikMint"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This magnet is not working for me. Anyone got this problem?",
                    "score": 1,
                    "author": "ChessBooger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;magnet:?xt=urn:btih:76ada7d2f845944c1bac256952ed893a4ecad5e4\n\njust copy this part.You must be copying magnet link statement too.",
                            "score": 1,
                            "author": "Previous_Vast_5620",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope I copied the link correct. Did you managed to download the entire video?",
                                    "score": 1,
                                    "author": "ChessBooger",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "idk if this link is allowed but try this ddl website https://www.filemail.com/d/lnbnoiehyncupxv",
                                            "score": 1,
                                            "author": "duipen"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;magnet:?xt=urn:btih:76ada7d2f845944c1bac256952ed893a4ecad5e4\n\nyes i manage to download the entire video,use the link that i gave you",
                                            "score": 1,
                                            "author": "Previous_Vast_5620"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "hi i just checked again with a new client and the torrent link is working for me , you can also try the below text and paste it \n\nmagnet:?xt=urn:btih:76ada7d2f845944c1bac256952ed893a4ecad5e4&amp;dn=%EB%9F%B0%EB%8B%9D%EB%A7%A8.E642.230219.720p-Sniper.mp4&amp;tr=udp://tracker.openbittorrent.com:80&amp;tr=udp://tracker.opentrackr.org:1337/announce",
                            "score": 1,
                            "author": "duipen"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yess!! &gt;!Seogi!&lt; on Running Man!! I will not rest until every &gt;!Shooting Stars/Kick a Goal!&lt; member appears on this show!!",
            "score": 13,
            "author": "pondthebrave",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe not &gt;!HH's ex gf Ahn Hye Kyung &amp; KJK's ex gf Chae Rina. edit:words!&lt;",
                    "score": 7,
                    "author": "jhdnhc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Haha is seriously the best variety wing-man, the guy just supports everyone. &gt;!That scene with Sukjin at the end with the awkward silence was so freaking funny! !&lt;He and Byul are one of the sweetest and funniest couple 🥰",
            "score": 15,
            "author": "moretoachieve"
        },
        {
            "level": 0,
            "comment": "Haha and Byul are serious couple goals.",
            "score": 16,
            "author": "HorseRadishDX",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm surprised they don't have a couple’s show together. They seem to be cut out for stuff like that even the PDs of Jessi’s Showterview recognizes that.",
                    "score": 1,
                    "author": "Few-Particular1780"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Our watermark-free English hardsubbed video for episode 642 is now available: https://www.myrunningman.com/ep/642\n\nIt will be livestreamed at https://www.twitch.tv/myrunningman in 2h51m!\n\nMagnet link: magnet:?xt=urn:btih:183d77a5b296c74981f236ad7ed87b7403f58b5e&amp;tr=udp://tracker.opentrackr.org:1337/announce\n\n*(note: we recommend [Brave Browser](https://laptop-updates.brave.com/download/MYR379) or uBlock Origin ([Chrome](https://chrome.google.com/webstore/detail/ublock-origin/cjpalhdlnbpafiamejdnhcphjbkeiagm) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/ublock-origin/)) to protect against ads)*",
            "score": 4,
            "author": "myrunningman"
        },
        {
            "level": 0,
            "comment": "Byul just seems super excited to be getting back into the entertainment industry. She pulled off Hype Boy and looks cute like she could fit in with NewJeans in the beanie. Leave it to Jae Seok to randomly criticize her performance in a variety show from over a decade ago.\n\nI'm also just going to say I think it's hilarious with how much hate Se Chan got in episode 641 for taking Jihyo's penalty card that most of Jihyo's screen time in this episode comes from standing in between Se Chan and whoever he was talking to.",
            "score": 25,
            "author": "areyousrs111",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rating 4.2%, best minute peak 6.6% at &gt;!YJS dissing KJK during smelt fishing, competitors Masked Singer 5.4% &amp; 1N2D 10.2%. Enjoyed the outdoor scenery views &amp; foods shown, Byul was a stand out guest again, her energy, playfulness &amp; dancing, HH's reactions &amp; YJS teasing Byul were hilarious. Most viewed Naver video is Byul's Hype Boy dance 49k views.!&lt;",
            "score": 7,
            "author": "jhdnhc",
            "replies": [
                {
                    "level": 1,
                    "comment": "if there's one thing KJK can't do it's definitely ice fishing \n\nfrom family outing [82](https://youtu.be/vUQsZWRvdQM?t=496)",
                    "score": 5,
                    "author": "jumpybouncinglad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really fun episode! Byul shined like a star. &gt;!Yoo Jae Suk getting passionate about drilling and holes almost made me cry from laughter.!&lt;\n\nI am STOKED for next week's episode. &gt;!Cha Tae Hyun ALWAYS knows how to bring chaos.!&lt;",
            "score": 8,
            "author": "PendulaPendula"
        },
        {
            "level": 0,
            "comment": "Members look like they have so much fun doing outdoor episodes. 🤣\n\n&gt;!Casting director/Goalkeeper Jeon So Min worked hard today!&lt;\n\n&gt;!\"I will kick his balls\". Whose balls, JSJ?!&lt;",
            "score": 14,
            "author": "PotatoBulletGun"
        },
        {
            "level": 0,
            "comment": "Good one. \n\nByul was so funny, with YJS pickering on her and Haha resisting the impulse to give her a bear hug. \n\nGot to see So Min getting tough as well. That was surprising there, as well as her goalkeeping skills (yay, we found her sport!)",
            "score": 11,
            "author": "whataterriblefailure"
        },
        {
            "level": 0,
            "comment": "SBS clearly dont have any choice if they want to remove jihyo from the cast. Most likely all of them will choose to end the program instead. She is basically a standing tree there for the past few years.",
            "score": 16,
            "author": "Which_League_3977",
            "replies": [
                {
                    "level": 1,
                    "comment": "SBS really miss the chance way back then. It's kinda hard to do it now, especially after starting last year where they really push the \"member chemistry\". It's weird to kick someone when they pushing that kind of concept and since SJH sometimes contributes when they brought up the \"talking segment\" which need member chemistry, it's still okay. Ofc it's different if she choose to leave on her own, but not with \"pushing to resign\".\n\nBut after all these year, are they (people from production staff atleast writer or YJS) really not try to talk to SJH it's something I'm curious about. \n\nStill Runningman now is Runningman because the member who been together for decade and I love that then I don't really want somebody to leave again. \n\nSome other show can still striving after changing the member, but some show just straight to road of destruction after changing the member. The fact there's a path aside a lot of other path that lead to RM stop airing is something that the least I want to see.",
                    "score": 6,
                    "author": "hopeurfutureshine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "SBS already did that on dec 2016, at that time i understand why they want to remove jihyo, but suprisingly even kim jong kook is included. Probably since his role gonna overlapped with kang ho dong which the board want him to join running man.\n\nAnd u know what happen, massive anger from audience, especially international one until they need to apologize and members decide to just end the show on feb 2017. March 2017, the team decided to continue the show with 2 new casting. Anyway even back then, its impossible for SBS to remove jihyo. The only way for it to happen is voluntarily dimissal like gary and kwang soo. \n\nTalking about jihyo i think members already give up to get her old cheerful side. 2-3 years ago jaesuk and suk jin keep helping jihyo getting screentime and asking her to participate more, but i rarely seen it now. Even for the past year.\n\n&amp;#x200B;\n\n1. She never good at talking, even in early running man time, jihyo always act as a side character. Her main role is always a loveline with gary, love hate relationship with kjk, fighting with kwangsoo + other members. Early days mission is always a physical game which she's good at, since 2015 they become more invested in talking rather than playing since the members are getting old.\n2. Running man from 2010 - 2016, she is the centre of attention due to her being only female, so every single screentime and members attention will only go to her. Somin join the cast create a huge contrast between them, she is freaking humorous, so good at talking and witty. She know how to control the situation well, create scenes, lead a conversation, so most of screentime always go to her. \n3. Gary leaving made the worst of all since she lose a good connection in the program. Until then LKS is the one who always lead her to participate, but as i said jeon so min presence is just that good. Another reason why she had so many haters in early of her time (mostly from jihyo fans). And we all know LKS left the show in 2021 made it worst.\n4. In conclusion, she is just not that good in talk-variety.",
                            "score": 14,
                            "author": "Which_League_3977",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "SBS sure mess it up, If they not mess it up and handle it properly, even there's a backlash they still can move forward with the remove. Backlash is normal after all from the fans of respective figure. \n\nI mean from what I see and what I read, she sure improve a lot from the past but the problem is she not making an impact regularly in 1 eps. \n\nIf I'm not wrong in some \"large number cast variety show\", there always such a case where compare to other member, they rarely get screen time but when they talking they make 1-3 impact per episode and it's can be considered as work done. . \n\nI mean people who can't singing can improve to some extent level if they try and learn, what about decade worth of time. But since they only editing the entertaining part, I just hope that at least she's trying and participate actively in talking but it's just it's not entertaining so it's doesn't get out to viewer. \n\nWhat's worst than having a bad season? It's not even trying after all. Ah, I just recently start watching over a famous show and I found the new enlightenment on the cast that people find annoying and don't like it, they atleast working hard and even have more impact on the show although it's not much. (Although sometimes it's not funny and sometimes it's only a reaction but even when the screen show other people).",
                                    "score": 4,
                                    "author": "hopeurfutureshine"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For a long time now, Jihyo hasn't contributed much to the show but she would at least laugh or make an effort to react to jokes and comments. She doesn't even do that anymore. I'm perplexed by her behavior. I don't mind her being on the show because she's an OG member and she has a right to stay. But it's disappointing that even the minimal effort she used to give has been decreasing as well. I suppose, like you said, she knows no one can remove her from the show so she's content.",
                    "score": 11,
                    "author": "magablossom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most of the time she looks bored, tired, or has a sour look on her face. But her crazy fans lap it up and somehow turn that into a positive (\"so funny!!!\"). Notice how she's literally the only one not smiling and laughing. What a buzzkill. \n\nhttps://www.reddit.com/r/runningman/comments/10z27xd/jihyos_stare_kills_me_so_funny_ahhh_i_love_her/",
                            "score": 9,
                            "author": "merchseller"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I find it hilarious that her diehard fans seem to come up with stuff to make her look funny and active. She is a problem, sure, but the real problem is her fans. There was an actual post on the running man subreddit about her dosing off in the bus ride (falling asleep while others where talking and laughing - [here](https://www.reddit.com/r/runningman/comments/10w7mgu/mongji_is_struggling_so_hard_to_stay_awake_in_the/?utm_source=share&amp;utm_medium=mweb)and they said it was so cute and funny. There was another from the IVE episode [here](https://www.reddit.com/r/runningman/comments/10z27xd/jihyos_stare_kills_me_so_funny_ahhh_i_love_her/?utm_source=share&amp;utm_medium=mweb)of her looking at one of the IVE girls with an odd look (disgust?) and they're saying she's so funny and real for that. 🤦‍♀️\n\nYeah... SBS doesn't have a choice. These people will bring their whole building down if they even tried.",
                    "score": 4,
                    "author": "Ancient_Reply4583",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think the only person that can take Ji hyo out of the show is Jihyo herself. If she leaves like Kwangsoo left. I do agree she doesn't add much to the show but as you said she's an OG member and RM is a stable income for her. She has to support her self, so she's probably not going to leave. \n\nInstead of replacing her, I’d have suggested they add two new members but I guess SBS won't want to do that especially since they don't know how much longer RM would last.",
                            "score": 8,
                            "author": "Few-Particular1780",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah; as much as I sound critical of her - I don't actually think her leaving would solve anything. She's basically not there at the moment. So it wouldn't be any different. She isn't actively hurting the show. My point is that she is occupying a space that can and should be used a lot better. An unnie-donseang dynamic with SoMin can be fun and cute. (Lee Da Hee, Jin Seo Yeon, Oh Na Ra, Kim Shin Rok, etc) a woman closer in age to the men so she is a peer to them at the very least is a new dynamic (She's the same age as YJS's wife, only 2 years younger than Haha and closer in age to Jongkook than to YSC). They usually have very young female guests. So that dynamic we see many other places as well as RM when those guests are around. So it's important and new to have that on the cast. \n\nShe holds a great spot - she's just not doing anything with it. So, yes, I'm all for replacing her if it means someone else who can do those things is joining. If SJH stays and that person is added, that's fine too. But don't just get rid of her and that's that. That won't solve anything.",
                                    "score": 2,
                                    "author": "Ancient_Reply4583"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello guys, Is there any NEXT version released?",
            "score": 4,
            "author": "star_1993",
            "replies": [
                {
                    "level": 1,
                    "comment": "[NEXT 720p](https://torrentsee151.com/topic/258752)",
                    "score": 6,
                    "author": "comdis"
                },
                {
                    "level": 1,
                    "comment": "Yes, would still be great if someone could post the NEXT version magnet too please.",
                    "score": 1,
                    "author": "JimmyAji",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "NEXT 720p\n\nmagnet:?xt=urn:btih:ec33909d3fa3225dfde07fb2ccb1cb1336409fb4",
                            "score": 4,
                            "author": "dakhoa"
                        },
                        {
                            "level": 2,
                            "comment": "download SNIPER one its compatible with next sub!",
                            "score": -3,
                            "author": "TheMace96"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tbh it's debatable. Downloaded both for this episode and played it simultaneously. While the Sniper one has slightly better video quality/higher bitrate, it's barely noticeable for most people who just want to watch Running Man + NEXT's audio is better/louder and 500MB smaller.",
                            "score": 2,
                            "author": "EpikMint"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i hope those source need to start releasing x265 code.",
            "score": 1,
            "author": "GreenPineFruit"
        },
        {
            "level": 0,
            "comment": "Haha and Byul were the definite highlights of this episode. You can tell Haha dotes on her so much. Like how anxious he was when she was there at the beginning, then freaking out when she does something very \"showy\" like dancing. And then he did try to tease her a bit but overall he was really nice to Byul and listened to pretty much anything she said and asked for. He easily gave up his fishing spot for her. I really love their relationship, it's so adorable!",
            "score": 1,
            "author": "ArchadianJudge"
        },
        {
            "level": 0,
            "comment": "This episode why subtitle English not show full?",
            "score": 1,
            "author": "Classic_Prune_2688"
        }
    ]
}