{
    "id": "11ji06y",
    "score": 85,
    "title": "Unexpected Business season 3",
    "author": "ememberremember",
    "date": 1678060085.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/11ji06y",
    "media_urls": [
        "https://www.reddit.com/r/koreanvariety/comments/11ji06y/unexpected_business_season_3/"
    ],
    "other_urls": [
        "https://www.instagram.com/p/CpZtv6KBw1n/?igshid=OTJlNzQ0NWM=)"
    ],
    "postText": "Just wanted to let all of you know that Yoo Hojin PD replies to fans in his Instagram account. He is now in Australia shooting a new show, but he also let fans know that if everything will go fine, Unexpected Business might be returned with Season 3 in upcoming autumn. \n\nAs a fan of the show hope to see Cha Tae Hyun and Zo In Sung back soon. \n\nLink to the mentioned post is [here](https://www.instagram.com/p/CpZtv6KBw1n/?igshid=OTJlNzQ0NWM=)",
    "comments": [
        {
            "level": 0,
            "comment": "For a moment I thought s3 was going to be in Australia and I got so excited. But so happy to hear it’ll be back, one of my fav variety show",
            "score": 10,
            "author": "kitcatsky"
        },
        {
            "level": 0,
            "comment": "Oh yay! I love Unexpected Business.",
            "score": 8,
            "author": "fauvevivre",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is such a healing variety",
                    "score": 3,
                    "author": "shems-2383"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Autumn can't come soon enough :) Seeing CTH on RM this past two weeks reminds me of how wonderful he is on variety shows.",
            "score": 6,
            "author": "cookietango",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh damn!  I'll have to watch.  So weird since he was on 2d1n.",
                    "score": 1,
                    "author": "lasVegasharold"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hope he gets back with original concept he had in season 1..small, cozy and organic….there was something about S1, I couldn’t get into S2 as the store was huge and lost cozy feel..",
            "score": 25,
            "author": "joy4hummy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you end up finishing it? I would say S2 is overwhelming at first but by the 2nd half it's pretty cozy and chill, thought not as much as S1",
                    "score": 14,
                    "author": "WakiLover",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I tried Kim hye soo segment as well , couldn’t continue..  too chaotic for me to focus for a healing show…May be the reason I didn’t like is too much emphasis on part timers rather than getting to know more about village.",
                            "score": 3,
                            "author": "joy4hummy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn't watch season 1 too much but it seemed like VILLAGE VILLAGE while season 2 was small agricultural town. I agree that season 1 setting is probably better in terms of calm/good vibes/healing",
                                    "score": 3,
                                    "author": "WakiLover",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The scenery in S1 was so good with snow and weather …something you want to watch snuggling to a good cup of coffee!",
                                            "score": 5,
                                            "author": "joy4hummy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m guessing you also watch house on wheels? If not I highly recommend it to you if you like nature sceneries and a calm vibe.",
                                                    "score": 2,
                                                    "author": "MC_earthquake"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I agree on you with this.. they kinda have a more close relationship with the s1 community",
                                    "score": 3,
                                    "author": "Free-West-2437"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m the exact opposite 😅 I loved the chaos in the beginning, and the interactions between the workers and the costumers by the middle. My favourite moments were kwang soo mistaking the granny costumer for another one, and chasing her outside the store. The rapper highschool kid was also pretty iconic, he was so good 😂",
                    "score": 3,
                    "author": "MC_earthquake"
                },
                {
                    "level": 1,
                    "comment": "I agree. I feel like they didn’t really get any time to understand the town. They didn’t really explore because they were too busy. Although it was nice to see them opening up the other business and buying stuff from other vendors in town/at the wholesale market. \n\nI don’t know if they can go back to season 1 vibes though. IMO the whole draw of this show is them learning something new and share that experience with locals. I don’t know, maybe there is some other type of business they can run?\n\nOn a tangential note, there is a british TV show very similar to unexpected business that I highly recommend watching. Its called Clarkson’s Farm and it follows a famous tv presenter as he learns how to work on a farm that he bought for his retirement. Its not as cozy because there is some issues with karens not liking what his farm is doing, but the wonderful thing about the show is not only is it entertaining but it really highlights the struggles that farms go through to proving our countries with food. Its really a thankless job.",
                    "score": 3,
                    "author": "AjBlue7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh wow .. Jeremy Clarkson?.. I heard of him when I read about his writeup as I am follower of BRF,  heard he is now being cancelled, though saw many comments that he is too good to rise above ..your comment is making curious to watch his show!",
                            "score": 1,
                            "author": "joy4hummy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea, part of Clarkson’s charm is that he is unfiltered, and unfortunately that means he is pretty good at pissing people off for no good reason. \n\nThe hilarious thing is that Amazon said they cancelled him but in reality they didn’t. Like the cancelling happen around the same time as when Season 2 of Clarkson’s farm came out so Amazon could of pulled the plug on Season 3 but they are still going to film and publish season 3 and 4 more grand tour episodes purely because they have already ordered them. \n\nSo basically, by the time those shows air the storm will have passed and Amazon will probably forget that they cancelled him.",
                                    "score": 1,
                                    "author": "AjBlue7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hello, it looks like you've made a mistake.\n\nIt's supposed to be could've, should've, would've (short for could have, would have, should have), never could of, would of, should of.\n\nOr you misspelled something, I ain't checking everything.\n\nBeep boop - yes, I am a bot, don't botcriminate me.",
                                            "score": 2,
                                            "author": "of_patrol_bot"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh that’s good to know! Thank you!",
                                            "score": 1,
                                            "author": "joy4hummy"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "🙌🙌🙌 I miss Tae Hyun and In Sung combo.",
            "score": 3,
            "author": "lasVegasharold"
        },
        {
            "level": 0,
            "comment": "Yey! I know the main point is that cha tae hyun and in sung work with new guests, but I really want kwang soo to be a guest again 😅",
            "score": 5,
            "author": "MC_earthquake"
        },
        {
            "level": 0,
            "comment": "This is good news! Thank you so much for this!",
            "score": 3,
            "author": "-perpetuallytired-"
        },
        {
            "level": 0,
            "comment": "Woo!",
            "score": 3,
            "author": "PowerfulTelevision"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've never mentioned that the post is about Unexpected Business. I emphasized the comments to the post mentioning news on the show.",
                    "score": 1,
                    "author": "ememberremember",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I get it, I misunderstood your post. Apologies about that.\n\nEdit: spellcheck",
                            "score": 1,
                            "author": "speedthief1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No worries. Also sorry for not wording the post better.",
                                    "score": 1,
                                    "author": "ememberremember"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh do you know who the 4 celebrities are?",
                    "score": 1,
                    "author": "zaichii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Heo Sung Tae, Lee Si Eon, Ahn Bo Hyun and travel Youtuber KWAKTUBE\n\nEDIT: My deleted comment was actually a misunderstanding of OP's intention",
                            "score": 2,
                            "author": "speedthief1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I guess he gave up on \"Hometown Flex\"",
            "score": 2,
            "author": "LupinX96"
        },
        {
            "level": 0,
            "comment": "Time to rewatch this again 😊",
            "score": 1,
            "author": "BusinessStress5056"
        },
        {
            "level": 0,
            "comment": "Yayy i miss this show!",
            "score": 1,
            "author": "arsonousbag"
        }
    ]
}