{
    "id": "11lkjxv",
    "score": 11,
    "title": "Let's play soccer 2 players",
    "author": "mynameiseya",
    "date": 1678245134.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/11lkjxv",
    "media_urls": [],
    "other_urls": [],
    "postText": "I started watching let's play soccer 2 again I noticed some are missing like Park Tae Hwan and Kim Yo Han did they leave the show? Does anyone know what happened?  \n\n\nI'm just curious because I do like the season 1 members and I want to see them play again even if they're not as good as the current lineup.",
    "comments": [
        {
            "level": 0,
            "comment": "What episode are you in? Because at some point both of them are gone due to injury.",
            "score": 8,
            "author": "-perpetuallytired-",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just got caught up in the recent episode and I saw the one they are visiting other teams. it's not on Netflix yet I think.",
                    "score": 1,
                    "author": "mynameiseya",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh the current one where they're having another round of auditions? Then Taehwan have injury and as for Yohan, recently he comes and goes. Maybe there's a conflict of schedule?",
                            "score": 1,
                            "author": "-perpetuallytired-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m guessing you’re on the episodes that they are injured in.",
            "score": 5,
            "author": "Odd_Vegetable_9362"
        },
        {
            "level": 0,
            "comment": "Tae Hwan is gone due to a ligament tear(possibly ACL), it happened in a tune-up game before the title match too. Yo Han just returned in the most recent Netflix episode.",
            "score": 3,
            "author": "vannthedawn",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see it's hard to play soccer I did see him sit out some matches. I hope that it's not like Dong sik nim because he never returned in the later episodes",
                    "score": 1,
                    "author": "mynameiseya",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wondered if Dong sik would ever come back. What exactly was his injury?",
                            "score": 1,
                            "author": "BuilderIllustrious90"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just finished episode 84 but Kim Yo Han was not in last few episodes. Is there any news available on what happened to him?",
                    "score": 1,
                    "author": "SquareArm2249"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Members (both from season 1 or 2) are absent in some episodes due to injury or other scheduled games (esp if they are active athletes)",
            "score": 2,
            "author": "EducationalCandy596"
        },
        {
            "level": 0,
            "comment": "they both got injured taehwan especially injured the one he got with the first season… i hope he gets back before the show ends i miss my taetae line",
            "score": 1,
            "author": "sanhabuubuu"
        },
        {
            "level": 0,
            "comment": "Kim Yo Han has not been appearing for the recent episodes on YouTube for the auditions. \n\nHope Tae Hwan reappears again.",
            "score": 1,
            "author": "yummybeefwellington"
        }
    ]
}