{
    "id": "121zu86",
    "score": 109,
    "title": "Song Mino enlists in the military",
    "author": "ememberremember",
    "date": 1679779788.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/121zu86",
    "media_urls": [
        "https://www.reddit.com/r/koreanvariety/comments/121zu86/song_mino_enlists_in_the_military/"
    ],
    "other_urls": [
        "https://www.soompi.com/article/1574915wpp/winners-song-mino-enlists-in-the-military-shares-heartfelt-letter-to-fans):"
    ],
    "postText": "Sharing since many people like me were awaiting news on new season of NJTTW. I guess we will have to wait long for a new season or we will never get one if the rumors about TVN not allowing more than 3 seasons per show are true. \n\nAnyway, I will miss Mino's antics in varieties, especially in Chanel Shiboya shows. Hopefully we will see reunion with other NJTTW members in 2 years. \n\nSource: [Soompi article](https://www.soompi.com/article/1574915wpp/winners-song-mino-enlists-in-the-military-shares-heartfelt-letter-to-fans):",
    "comments": [
        {
            "level": 0,
            "comment": "I was super late onto the NJTTW train but I started watching it from the early seasons over the past couple months and it has been such a breath of fresh air from the vibe of variety shows nowadays. Really going to miss the cast and their chemistry together if this is truly the end. 😢",
            "score": 33,
            "author": "WaffleWafers",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am not sure if you are aware of the YouTube Channel Shiboya from Na PD. If not then I strongly recommend to watch all shows with members, starting with Sugeun and Jiwon's travel to Iceland for which that channel was created in the first place. \nAlso if you want to see more of their chemistry check out Kang's kitchen and 2D1N season 1.",
                    "score": 17,
                    "author": "ememberremember",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I actually found NJTTW through going down the Na PD rabbit hole starting from Earth Arcade first, then all the Channel Shiboya videos! Going through season 2 of Kang's Kitchen right now so I've definitely scoured through as much of their content as possible as this point. There's just something about Na PD's shows that bring out the best of the cast haha",
                            "score": 8,
                            "author": "WaffleWafers"
                        },
                        {
                            "level": 2,
                            "comment": "I LOVE the 십오야 channel",
                            "score": 3,
                            "author": "Maetamongy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it was kinda clear that they moved on from NJTTW for now after NaPD started doing earth arcade and more game caterers stuff.  But hopefully they do another season once he comes back",
            "score": 23,
            "author": "I_AmPotatoGirl"
        },
        {
            "level": 0,
            "comment": "He was trying to talk na pd into a mapo hipster europe season the last time they had a livestream last new year's. I hope it happens when he gets out.\n\nNa pd still owes some of the njttw cast a kenya trip (based on that live, the hotel with giraffes had a two year waitlist for bookings if the translations are accurate) so i hope it pushes through.",
            "score": 11,
            "author": "pokpokishification"
        },
        {
            "level": 0,
            "comment": "P.O about to come back now then here comes Mino who would just enlist.\n\nNJTTW new season starting to look impossible now.",
            "score": 9,
            "author": "whitefang0824"
        },
        {
            "level": 0,
            "comment": "I had been waiting for NJTTW for almost 2 years? Am I right? It's one of the best variety shows, in my opinion. The chemistry is great! It helped us during the grieving season. It made us smile and laugh a bit. For now that we're still waiting,  we'll just have to watch NA PD's YT Channel. We'll patiently wait",
            "score": 4,
            "author": "Joyful_Sunny"
        },
        {
            "level": 0,
            "comment": "they can always film a season with a new member like they did with P.O. while Kyu-Hyun was servicing his duties",
            "score": 9,
            "author": "chutoro_y_moi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Imo, that’s only possible because their number was still small back then. Won’t it be too crowded to add another member? Like when everyone is around.",
                    "score": 6,
                    "author": "YoshidaKyo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plus it's an old show. A final farewell season is what I am expecting. Hopefully not set in korea and all 7 (8) members appearing.",
                            "score": 7,
                            "author": "Kokomban07"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I miss NJTTW 😩",
            "score": 3,
            "author": "chasetagz"
        },
        {
            "level": 0,
            "comment": "They can just do it with original members",
            "score": 1,
            "author": "jendeukxx"
        }
    ]
}