{
    "id": "12flacr",
    "score": 50,
    "title": "Blood Game Season 2 Trailer",
    "author": "roryn58",
    "date": 1680958713.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/12flacr",
    "media_urls": [
        "https://www.reddit.com/r/koreanvariety/comments/12flacr/blood_game_season_2_trailer/"
    ],
    "other_urls": [
        "https://www.youtube.com/watch?v=SebN1In-3d8&amp;ab_channel=%EC%97%A0%EB%9A%9C%EB%A3%A8%EB%A7%88%EB%9A%9C%EB%A3%A8%3AMBC%EA%B3%B5%EC%8B%9D%EC%A2%85%ED%95%A9%EC%B1%84%EB%84%90"
    ],
    "postText": "https://www.youtube.com/watch?v=SebN1In-3d8&amp;ab_channel=%EC%97%A0%EB%9A%9C%EB%A3%A8%EB%A7%88%EB%9A%9C%EB%A3%A8%3AMBC%EA%B3%B5%EC%8B%9D%EC%A2%85%ED%95%A9%EC%B1%84%EB%84%90\n\nobservations:\n\n- it's set in Bali\n\n- Hong Jin Ho is a participant this time (!!)\n\n- Dex is back\n\n- seems like there'll be physical fights",
    "comments": [
        {
            "level": 0,
            "comment": "I'm beyond shocked that Jinho the master is here. And DEX and Jimin returning?? I can't wait.",
            "score": 16,
            "author": "gazeintotheiris",
            "replies": [
                {
                    "level": 1,
                    "comment": "Man disappeared for a bit to play poker and now hes in two shows this month. We love to see it.",
                    "score": 1,
                    "author": "SpCommander",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What's the other show?",
                            "score": 2,
                            "author": "gazeintotheiris",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Time hotel, starts today.",
                                    "score": 2,
                                    "author": "SpCommander"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope I am wrong but the trailer makes me think that Jinho got eliminated very early in the game. I practically did not see him interacting with other players.",
            "score": 13,
            "author": "acetronautt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sadly it only makes sense for the other competitors to get him out as soon as possible.\n\nThey would need to do something like a third season of society game for him to have a chance at making a long run in a competitive show.",
                    "score": 8,
                    "author": "Nagasshi"
                },
                {
                    "level": 1,
                    "comment": "Yeah given how everyone was so quick to vote off Yeonseung in S1, I won’t be surprised if they did the same to Jinho right off the bat. But I’m hoping there’s a twist &gt;!that will bring the eliminated players back just like in S1!&lt;",
                    "score": 7,
                    "author": "michielim"
                },
                {
                    "level": 1,
                    "comment": "I have the same hunch that he will probably be eliminated early and it's already making me so saddddd. I wish to see more genius plays from him huuuu",
                    "score": 3,
                    "author": "moretoachieve"
                },
                {
                    "level": 1,
                    "comment": "We can only hope that \"the basement\" makes a return in some fashion",
                    "score": 2,
                    "author": "gazeintotheiris"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hmm thats why in the latest vlog of dex he stated that he is close with jimin even after their bloody game since they are both returning for s2 so communicating would be inevitable",
            "score": 9,
            "author": "Gor-U",
            "replies": [
                {
                    "level": 1,
                    "comment": "A Dex/Jimin alliance in S2 could be a real power house.",
                    "score": 6,
                    "author": "SpCommander"
                },
                {
                    "level": 1,
                    "comment": "are they like dating or something?",
                    "score": 1,
                    "author": "HuntMore9217",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "no just a close friend. you can see it on dex vlog with eng subs on youtube",
                            "score": 5,
                            "author": "Gor-U",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "maybe they are not making it public, can still remember them flirting during s1. jimin was obviously so thirsty",
                                    "score": -1,
                                    "author": "HuntMore9217"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The youtube comment mentioned someone call pie? And he/she caused some controversy last time?\n\nWhen will the show be broadcast?",
            "score": 4,
            "author": "rainbow1112",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh god. THAT's who Pie is? I had heard there was an issue with her but not what it was...\n\nWell this should liven up proceedings, no doubt.",
                            "score": 5,
                            "author": "SpCommander"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "4/28",
                    "score": 2,
                    "author": "roryn58"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really excited, the first season was so much fun! Hope they figure out a more satisfying final mission though. Looking forward to seeing Jinho in this, he's capable but such a lone wolf and has a slightly helpless charm? Can't imagine him having influence over the clique and relationship drama lol. Or even playing the helpful uncle role like Yeon Seung.",
            "score": 4,
            "author": "penguinn117"
        },
        {
            "level": 0,
            "comment": "Holy Shit the legendary genius is here! And fuck yeah Jimin is back, it's gonna be like jinho vs sangmin all over again. Unfortunately it seems like people ganged up against him since I don't see him in a lot of scenes. Hopefully it's just editing, but anyone who wants to win would know to eliminate him first.\n\nAnd are there really physical altercations now? Guess we're gonna see actual blood in bloody game!",
            "score": 3,
            "author": "HuntMore9217"
        },
        {
            "level": 0,
            "comment": "Got to know the show after seeing the trailer in Jinho's Instagram. Where to watch the first season? I want to watch the first season and then to watch second. Excited to see Kong after so many years.",
            "score": 2,
            "author": "ememberremember",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kocowa used to have it then they just removed it suddenly back in October or so. I was sad because I wanted a rewatch there, but alas.",
                            "score": 3,
                            "author": "SpCommander"
                        },
                        {
                            "level": 2,
                            "comment": "Thank you. Found the first season in one of \"dodgy\" sites. The show somehow has not been in my radar. Now I see that there are Jang Dongmin and Park Jiyoon too. So excited because I know what to watch next.",
                            "score": 1,
                            "author": "ememberremember"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "here, just search the sub for bloody game",
                    "score": 1,
                    "author": "HuntMore9217"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does anyone know if Game of Blood will be on platforms that have english subs like season 1 was on Kocowa? Maybe it'll be on Kocowa again",
            "score": 2,
            "author": "hl2828282"
        },
        {
            "level": 0,
            "comment": "I wonder why they flew all the way out to Bali, hmm\n\nSUPER hyped that jinho is appearing!! Not sure if they improved the games since last season, but I’m still holding on to hope that we get another legendary Jinho moment from this.\n\nAlso not super surprised that Dex and Jimin is back (esp since Dex’s popularity skyrocketed after Single’s Inferno). Very curious to see how the dynamics will be now that everyone’s probably very much aware of how crafty Jimin can be.\n\nAnd omg KNUCKS from Prime Kingz!!!",
            "score": 2,
            "author": "michielim",
            "replies": [
                {
                    "level": 1,
                    "comment": "I almost wonder if Bali threw a bunch of money for filming at various PDs. Love Catcher 4, Earth Arcade's current season, this, and a few other shows have all recently been filmed there.",
                    "score": 2,
                    "author": "SpCommander"
                },
                {
                    "level": 1,
                    "comment": "right? I might watch just to see Knucks but it sucks that he'll be in this type of mean-spirited environment",
                    "score": 1,
                    "author": "Naanaaah"
                },
                {
                    "level": 1,
                    "comment": "I think dex is also doing k drama soon.",
                    "score": 1,
                    "author": "garbuja"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great to see that Bloody Game is back, I am always happy to watch more of these psychological games!  \n\nJimin's gonna be scheming again I bet, she's smart and knows how to manipulate.  \n\nCurious to see if Dex will continue to play with loyalty in mind, as expected he will always do well in physicals.  \n\nAnd Jinho is here, really missed his presence in the variety sphere! Last I watched of him is his own Hongbo22 team on YT and the WCG one with woo!ah.  \n\nI am wondering what's the twist for this season since the first was Parasite themed.",
            "score": 1,
            "author": "Jynch",
            "replies": [
                {
                    "level": 1,
                    "comment": "now jimin knows what she did.. sold very very well :p .. no one can threaten her the way baseball guy was trying to domineer",
                    "score": 1,
                    "author": "enigmatic_zephy"
                }
            ]
        }
    ]
}