{
    "id": "12mnfwa",
    "score": 15,
    "title": "No Math School Trip",
    "author": "CornerPrevious2162",
    "date": 1681527231.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/12mnfwa",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone knows the ratings to this show? Kind of enjoying it right now and it’s from SBS, a major broadcasting company. So ratings do really matter for this show. Can’t seem to see any articles about its ratings tho? Thanks a lot!",
    "comments": [
        {
            "level": 0,
            "comment": "Same here,don't care about the ratings though,but as per new shows are concerned, I am really enjoying this show,and especially the chemistry between the cast and everything.",
            "score": 11,
            "author": "atanu77",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, same here. Though the ratings are not that good and I don't know what will be in the future for Choi Bopil and others but so far I loved the show. It was difficult setting with the combination of casts and snowy environment but after each episode I can see the increased bonding between members. \n\nIn this particular episode, I loved the \"telapathy\" game so much. So far I haven't this game with my limited interest in Kvariety shows, so it was a new to me and I totally loved, especially when everyone were getting greedy.",
                    "score": 3,
                    "author": "kkang_kkang"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is a travel entertainment show, usually those are one long trip,so chances of a second tour was very unlikely.All of them have regular schedules and all,but if the cast is up for it, fingers crossed 🤞 for any hope of future trips.",
            "score": 7,
            "author": "atanu77"
        },
        {
            "level": 0,
            "comment": "The rating for recent eps are as followed\n\n(https://imgur.com/a/bKz9B0K)",
            "score": 3,
            "author": "sophia8012",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is this consider good for the time slot?",
                    "score": 4,
                    "author": "FlimsyCartographer2"
                },
                {
                    "level": 1,
                    "comment": "Thanks! These ratings are not that good considering its from SBS right? :/ Nevertheless, I’ll just enjoy all its remaining episodes! Still hoping there’d be a second season though.",
                    "score": 3,
                    "author": "CornerPrevious2162"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.allkpop.com/article/2023/05/no-school-math-trip-ends-broadcast-with-the-cast-and-fans-hoping-for-a-season-2",
            "score": 1,
            "author": "grossqqq"
        }
    ]
}