{
    "id": "13dewvd",
    "score": 31,
    "title": "What are your \"essential\" K-Reality shows?",
    "author": "ina_waka",
    "date": 1683688999.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/13dewvd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Little to no experience watching any Korean reality shows. My only exposure would probably be through K-Pop (Idol) focused shows or interview-esque clips on YouTube. Any manageable/digestable shows that are easy to get into? Would be helpful if available on Netflix/Viki.",
    "comments": [
        {
            "level": 0,
            "comment": "If you're new to Korean variety shows and looking for a guide to get started, here are some popular shows to check out:\n\n1. Running Man\n\n\\- Recommended Episode: 209 (Great for idol fans, although you may not know the idols if you're new to K-pop)\n\n2. Knowing Bros\n\n\\- Start with the Red Velvet episode\n\n3. 2 Days 1 Night\n\n\\- Season 4 is great for first-timer and easier to get into (Note: You may end up disliking some members from the previous seasons, even this one...)\n\n4. Infinite Challenge\n\n\\- Features famous Korean figures and unforgettable projects\n\n5. New Journey to the West\n\n\\- Produced by Na PD (Start with Season 4)\n\n6. Earth Arcade\n\n\\- A new variety show and a personal favorite\n\n7. Game Caterers with Starship\n\n\\- Specifically the episode with Starship as most Na PD shows follow a similar format\n\nIf you want a more structured path into the world of Korean variety shows, here are some recommended paths:\n\n**The Yoo Jae-Suk Path:**\n\nX-Man (Optional, unnecessary) -&gt; Family Outing -&gt; Infinite Challenge or Running Man -&gt; Sixth Sense -&gt; Hangout with Yoo or Yoo Quiz on the Block\n\n**The Na PD Path:**\n\n2 Days 1 Night Season 1 -&gt; New Journey to the West -&gt; Kang's Kitchen -&gt; Game Caterers or Earth Arcade\n\n**The Jung Jong-Yeon Path (Game Show):**\n\nThe Genius -&gt; Society Game -&gt; Great Escape -&gt; Girls' High Mystery Class\n\nAdditionally, here are some other fun shows you might enjoy, although they may not be for everyone:\n\n\\- I Live Alone\n\n\\- Hyori’s Bed and Breakfast (A lot of people start with this one, idk why)\n\n\\- My Little Old Boy\n\n\\- All the Butlers\n\n\\- Busted, The Zone (YJS Show)\n\n\\- Return of Superman\n\n\\- Dating Shows (Heart Signal)\n\n\\- Idol-Specific Shows",
            "score": 42,
            "author": "Kitchen-Dependent-39",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice list, OP! I also recommend these shows with a few K-variety additions:\n\n\\- Star Golden Bell\n\n\\- Strong Heart\n\n\\- Invincible Youth\n\n\\- Happy Together",
                    "score": 4,
                    "author": "Alpharius02"
                },
                {
                    "level": 1,
                    "comment": "I agree with your philosophy. To get into kvariety you really need to follow the personalities as there is too much content to binge. It’d be crazy to start from the beginning and be committed to watching like 1,000hours to catch up. Also since these shows have been going on for sometimes over a decade, these shows often dip in quality. So its better to just start in the middle following entertainers/idols you like.\n\nThe only thing I disagree with is the Jung Jong-Yeon path. His work after The Genius is very different and I personally don’t like them in comparison to The Genius. To me that is a path of disappointment. I’m not saying that those shows after The Genius are bad but maybe its best to watch them before you watch The Genius because the lack of strategy or increased amount of scripted parts really ruined those shows for me because I watched The Genius first. \n\nInstead I would submit The Genius spiritual successors as the preferred path. Going from The Genius&gt;Time Hotel&gt;BloodyGame&gt;Physical100. I think each of these shows added a twist to The Genius format that keeps them fresh and gives them their own identity.",
                    "score": 2,
                    "author": "AjBlue7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I’m not saying that those shows after The Genius are bad but maybe its best to watch them before you watch The Genius because the lack of strategy or increased amount of scripted parts really ruined those shows for me because I watched The Genius first.\n\nAgreed. I recommend this being the way as well if you're new to game/brain korean shows.",
                            "score": 1,
                            "author": "vNoblesse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Personally, I still think it is better to start with the Genius, since his other shows ('Society Game' and 'the Great Escape') might spoil the results of the Genius, due to some returning contestants.",
                                    "score": 2,
                                    "author": "T3tr4d5",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hmm, good point. It's situational but you right, some instances, viewers will watch what's new/the latest and watch backwards after gaining enough understanding of the characters and etc. It's like seeing/hearing Jinho (Yellow) being a great contestant and looking back to The Genius where it all began.",
                                            "score": 2,
                                            "author": "vNoblesse"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;The Yoo Jae-Suk Path:  \n&gt;  \n&gt;X-Man (Optional, unnecessary) -&gt; Family Outing -&gt; Infinite Challenge or Running Man -&gt; Sixth Sense -&gt; Hangout with Yoo or Yoo Quiz on the Block\n\nAdding in [Village Survival, the Eight](https://www.soompi.com/article/1264985wpp/former-running-man-pd-talks-new-show-starring-yoo-jae-suk-blackpinks-jennie)",
                    "score": 1,
                    "author": "07-19-30-04-03-08"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alot. 2D1N  original season to see how the godfather of outdoor variety started and how brutal it actually was. There's also Infinite Challenge similar to 2D1N but different. New Journey to The West is great as well. 3 Meals a day is a good show but much more laid back. There's Youn's Kitchen, Korean Hostel in Spain. The main denominator is PD Na(not for Infinite Challenge though). He has a youtube channel,Full Moon where he plays games with tv show and movie casts as well as k-pop groups and it's english subbed too. I live alone, How do you play are great shows.",
            "score": 12,
            "author": "cicakoki",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn’t 2D1N season1 really hard to find though? Do you know where I could look for it. I think one of the problems with its rebroadcast was that most of the cast ended up having controversies, and since it was the first season and kvariety wasn’t popular yet, it wasn’t saved.",
                    "score": 2,
                    "author": "AjBlue7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "2D1N season 1 used to be available in KBS official youtube with eng sub. I just realized now the video has been removed, now I should consider to download other old show like invincible youth in case they are removed.",
                            "score": 5,
                            "author": "ebzer"
                        },
                        {
                            "level": 2,
                            "comment": "It was easier when KBS World You Tube channel showed the shows in full with subs. That's where I watched 2D1N,  Return OF Superman etc. It seems that channel only has clips now. \n\nIt seems to still be here. https://www.youtube.com/watch?v=B8QCSWENzzc&amp;list=PLMf7VY8La5RGj\\_0-W6g0-b9mNqmTtFDtN",
                            "score": 4,
                            "author": "eiko85",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m pretty sure that is Season 2 that you linked. \n\nSeason 1 has 232 episodes and goes from 2007 to 2012\n\nFrom what I can tell KBS Entertain has the episodes up on youtube but they have no translations. You can find it if you search 1박2일 시즌 1, and its the playlist made by user NecromancerSupreme007. The other playlist is random episodes out of order and at one point only has 10min long episodes.",
                                    "score": 4,
                                    "author": "AjBlue7"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On Netflix, I'll go with \"Busted\" (You should start with that. It got the korean type of editing but more open to international fans)\n\n  \nThe \"classic\" that I still watch : Running man, 2 days 1 Night.  \nFor those 2, I recommend to start with RM. If you can go from the first episode you'll see the developement of each cast members, there role in the show and how there relation develop along the years. Be warn : there is more than 650 episodes. But still recommend it.\n\nAmong the new show, Earth Arcade (2022) should be fun to watch. The Second Season will come at the end of the year I think.\n\nIf you want an order : \"Busted\" (Netflix) → Earth Arcade → Running Man  \n\n\n2 Days 1 Night, I want to recommend the third season but amongst the member there was (and still) a trash, and the new season, the beginning was really hard for them and us. I don't recommend to watch it, not now at least. Still classic tho.  \n\n\nThe list is not big list but It should be a good starting point, in my opinion.  \nAnd there will be other people that will said there \"essential\".",
            "score": 8,
            "author": "Torea987",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are in for a surprise, earth arcade season 2 is out this Friday!",
                    "score": 8,
                    "author": "the-xyz-plane",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "...well, good for us then ! 💪😎",
                            "score": 2,
                            "author": "Torea987"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you're interested in Kpop then I would look up whichever Running Man episodes have idols that you are interested in and start with those episodes. The Running Man episodes don't have to be watched in order.\n\nFrom there you'll probably be exposed to other guests that you are interested in and you can look up other variety shows they have been on. That's how I started... I would just look up actors that I liked and if they had been on Running Man and watched random episodes. I eventually got to Song Joong Ki and from there on started watching RM from the beginning.",
            "score": 8,
            "author": "ME_B"
        },
        {
            "level": 0,
            "comment": "Classics:\n\nFamily Outing S1 : It was when the industry started to realize the highlight really are the members/cast chemistry rather than the activities they were doing. \n\n1 Night 2 Days S3 : 1N2D is a must for understanding K-variety shows. And S3 is the best season of them all. \n\nThough the real classic for Koreans is X-Man, it's not actually objectively good and is just nicely nostalgic for Koreans. And back then the Korean industry haven't really made a style of its own, so X-Man feels much more like Japanese variety show (which was leading back then).\n\nOther genres:\n\nThe Genius (all 4 seasons have totally different charms): It made its own genre of survival show and birthed several legends/legendary moments. Well crafted. \n\nAbnormal Summit: Cable shows started to takeover and this show showed why. A bunch of foreigners interested in Korea talking about differences in culture. This show is a really good introduction to K-variety.\n\nFinally:\n\nAll Na PD shows: from 1 Night 2 Days until Jinnie's Kitchen, Na PD went though the different changes in Korean Entertainment and reflected it in his work. He's not just essential but quintessential to K-variety. Amongst his show I'd pick an underrated one he dropped, The Human Condition. I'd say Na PD went from being maximalist to minimalist in his approach, and Human Condition was in between. \n\nHis maximalist approach was channeled through Kang Hodong, his in betweens by Lee Seunggi, and finally his minimalist approach by Lee Seojin. They were all great evolutions lol.",
            "score": 4,
            "author": "yellowbat30"
        },
        {
            "level": 0,
            "comment": "I live alone and new journey to the west and great escape are such great shows",
            "score": 3,
            "author": "Easy_Tension8229"
        },
        {
            "level": 0,
            "comment": "One thing that is not mentioned yet is that if you enjoy food related shows, you can consider watching some of Baek Jong-Won shows.\n\nSome that I enjoy are, Baek Jong-Won Alley Restaurant, The Backpacker Chef, Business Genius (ongoing).\n\nHe also has a YouTube channel.",
            "score": 4,
            "author": "the-xyz-plane"
        },
        {
            "level": 0,
            "comment": "Hyori’s Bed and Breakfast (Netflix)\nCamping Vibes (viki)\nBloody Game 2 (viki, currently airing. First season is also great but not available on Viki)\n\nHeart Signal seasons 2 and 3. Chinese version seasons 2 and 5 are also good. (viki)\n\nFriends (viki, watch this after watching the Heart Signal Korean seasons, you need the context because this show invited the popular cast members back from HeartSignal to make a spinoff show)\n\nThese are all shows that I love which are relatively short and easy to binge. There are quite a few really popular Variety shows that have 500+ 1hour 30minute episodes that would be hard to catch up on because typical these shows have a lot of filler.\n\nI am hesitant to recommend any of the most popular shows that have like 500+ episodes because you can’t find any of them on netflix or viki or the streaming site only has like the 50 latest episodes, but for the most part there is a concern about quality with these long running shows. Most of the cast has been shaken up multiple times due to cast members getting cancelled, different PDs changing the direction of the show, and the simple fact that after 500+ hours of content they start running out of new ideas. If there is one that you try to get into it should probably be Running Man since that is the most popular show.\n\nThe way I like to watch these variety shows is by looking up some of my favorite Idol personalities or comedians on mydramalist and then looking at their tv appearances to see what episodes they made guest appearances on. Shows like, I live alone, The Manager, 2days1night, How do you play. Then typically the show will hook me in and I’ll want to keep watching more episodes of the show until I get bored of it and drop it. \n\nHere are some of my alltime favorite shows that might be harder for you to find sources to watch from.\n\nThe Genius (subreddit - best thing korean entertainment industry has ever made, and is the main inspiration behind the shows Time Hotel and Bloody Game)\n\nTime Hotel (currently airing)\n\nSixth Sense\n\nEarth Arcade\n\nShanghai Share House (subreddit -chinese)\n\nAll that PingPong!\n\nPs. If you haven’t watched the drama Hospital Playlist you have to watch it. Best korean drama ever made. Also, they did a youtube camping show that was amazing, as well as the special variety season of Three Meals a Day: Doctors.",
            "score": 3,
            "author": "AjBlue7"
        },
        {
            "level": 0,
            "comment": "I'd recommend Na PD's The Game Caterers, which is on YouTube. It features a variety of groups (from drama casts, idols, musicians at the same agency, etc) playing mainstay variety show games that are a big part of Na PD's other shows. The biggest benefits are that the show is easily accessible (Na PD's other shows aren't on any US streaming platforms), ever ep is short (usually 30 min or less), and you can jump around to ones that features casts you're interested in.\n\nfan-made playlist of most of the eps in order: [https://www.youtube.com/playlist?list=PLOWEiAdkgeJAWiVHlQD79sLgJz4PZNsyI](https://www.youtube.com/playlist?list=PLOWEiAdkgeJAWiVHlQD79sLgJz4PZNsyI)",
            "score": 3,
            "author": "pondthebrave"
        },
        {
            "level": 0,
            "comment": "New Journey to the West - easier to get into as there are idols among the cast. Most games and format probably familiar to the person who have watched them playing games. Most of the games derive from NJTTW and then utilize in other shows. It is easy, fun, with great cast and chemistry and short",
            "score": 4,
            "author": "ememberremember"
        },
        {
            "level": 0,
            "comment": "For me it’s,\n1)I live alone\n2)Running man\n3)Amazing Saturday \n4)The manager\n5)My little old boy",
            "score": 2,
            "author": "Humble-Effect2316"
        },
        {
            "level": 0,
            "comment": "I only watch these regularly\n\n1. Running Man\n\n2. Knowing Bros. (Only if female idols are the guests)\n\n3. HyeMiLeeYeChaePa - this show is super funny!\n\n4. Earth Arcade 2 (not on yet but will be watching again weekly.)",
            "score": 1,
            "author": "OhmaDecade"
        },
        {
            "level": 0,
            "comment": "Let's Play Soccer\n\nClean Sweep\n\nLove Naggers\n\nI AM Solo\n\nKnowing Bros",
            "score": 1,
            "author": "Educational-Glass-63"
        },
        {
            "level": 0,
            "comment": "if you’re a new viewer, i’d recommend amazing saturday or its spinoff, idol dictation contest. it’s what got me interested in kvariety and it’s more familiar to kpop fans since it has a lot of idol guests, or in idol dictation contest’s case, the idols are the main cast.",
            "score": 1,
            "author": "felixinseoul"
        },
        {
            "level": 0,
            "comment": "Everyone has already listed majority of the shows I watch.\n\nOn Viki:\nRunning Man - is more of a talk show with games as of the past 50 episodes but if you like activities watch before ep 606\n\nHow do you play\n\nI am Solo - if you like dating shows without celebrities\n\nLove Naggers - they give dating advice and reenact relationships to give advice.\n\nHome Alone\n\nHYEMILEEYECHAEPA - this is my current favorite (if you like girl idols and entertainers)\n\nYoung Actors retreat - Actors from hit dramas play games and become closer through activities.\n\nMaster in the house\n\nNetflix:\n\nBusted \n\nKorea no.1\n\nNew World\n\nPhysical 100 - if you like competitions\n\nI would recommend getting Kocowa it has more episodes available then Viki and more variety shows to look through I think",
            "score": 1,
            "author": "Odd_Vegetable_9362"
        },
        {
            "level": 0,
            "comment": "We Got Married",
            "score": 1,
            "author": "Brockevil"
        },
        {
            "level": 0,
            "comment": "The first variety show that got me hooked was I Live Alone—still am a fan up to now and it’s been a regular part of my weekend. It has its ups and downs, normal for shows that span for years, but imo this year they’re getting back there. Probably difficult to find older episodes (you can try the kisstvshow etc), but I recommend the 2018-2020 eps as they were the best years of the show. \n\nThen I became a fan of Amazing Saturday and The Manager: shows with good vibes! Amazing Saturday particularly has great cast chemistry—really feels like they’re close in person.\n\nI also like Na PD’s shows, New Journey to the West, and their spinoff—Spring Camp and Kang’s Kitchen. Too bad tho that they don’t seem like they’ll produce more seasons for NJTTW, i don’t care so much for Na’s current Youtube shows. \n\nI don’t have access to Viki so Idk if they’re on there, but I Live Alone, Amasat and The Manager are in Viu. Earlier episodes of Amasat can be found on dareumi1 twitter account—she was subbing the show before Viu picked it up around 2021-ish.",
            "score": 1,
            "author": "fritterest"
        },
        {
            "level": 0,
            "comment": "I'm a relative newcomer to Korean variety shows, only starting to watch them on a regular basis since 2016. I think that your personal profile is going to be extremely important to what you could start watching.\n\nAs someone who watches nothing but Korean variety shows and a couple of Taiwanese variety shows, here's what I watch right now, in order of day of the week:\n\n**Radio Star** (talk show, you'll probably only like it when familiar guests are on the show)  \n**Shooting Star** (ladies football (futsal) show, very popular and if you like football)  \n**Yoo Quiz on the Block** (talk show but less formal and and focused on current affairs/social themes instead of guests)  \n**Beat Coin** (fixed cast sometimes with guests that have to go through tough challenges based on the flip of a coin)  \n**No Math Trip** (fixed cast on a trip overseas where they play games and challenges to see who gets to eat and sleep well, with punishments for losers, ending soon)  \n**I Live Alone** (reality everyday life observation show, I live alone too so I enjoy it a lot and can relate to it)  \n**Bloody Game 2** (survival reality show)  \n**Earth Arcade 2** (fixed cast on a mission overseas who have to play many mini games to be able to enjoy their trip, can watch the Earth Arcade 1 as well)  \n**How Do You Play** (fixed cast doing random things, not always fixed)  \n**Knowing Bros** (fixed cast with guests that go through interviews and later play games for fun to promote their new work)  \n**Amazing Saturday** (fixed cast with guests who have to guess lyrics of Kpop songs and challenges to win the right to have food)  \n**Let's Play Soccer 2** (fixed cast of Korean sportsmen and celebrities who formed a football team)  \n**Running Man** (fixed cast sometimes with guests who go through different themed challenges with prizes for winners and punishments at the end for the losers)  \n**1 Night 2 Days** (fixed cast who go through different themed challenges to showcase different parts of Korea with signature punishments for losers)  \n**My Ugly Duckling** (reality everyday life observation show of unmarried celebrities who make their mothers worried that I can 100% identify with)  \n**The Genius Paik** (celebrity chef and celebrities facing the challenge of setting up restaurants in different countries to promote Korean cuisine)\n\nSome variety shows that have ended and I enjoyed are the **New Journey to the West series, 3 Meals a Day series, The Great Escape series, The Genius series, Society Game 1 and 2, Busted series (Netflix), Crime Scene series** and quite a few of **Baek (Paik) Jong Won's variety shows** because I like food and cooking.",
            "score": 1,
            "author": "kapo37ljh"
        }
    ]
}