{
    "id": "13hzxqb",
    "score": 5,
    "title": "Lets Play Soccer 2 - episode 92",
    "author": "One_Bet_7940",
    "date": 1684132216.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/13hzxqb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Opponent: Jeonbuk Asia Pacific FC 전북 아태 FC - jeollado\n\nThis is a revenge match already. Eojjeoda lost to Jeonbuk Asia Pacific in ep 33 with score of 1 to 3.\n\nFor the starting line up, the members are the following:\n\n&amp;#x200B;\n\n|GOALKEEPER         Han Gun Kyu|DEFENDERS            LEE Jang KunJIN COQUILLARD Andre PARK Je eon           KIM Jun Hyun|MIDFIELDERS       HEO Min Ho             IM Nam-Gyu           RYU Eunkyu            LEE Daehoon         Lee Jun Yi|FORWARD              Kim Yong Sik|\n|:-|:-|:-|:-|\n|SUBSTITUTE       KANG Chilgu         Jang Jeong Min         JO Won-woo           KIM Hyun woo       LEE Hyungtaek|RESERVE                 KIM Donghyun     Park Jun Yong         LEE Jihwan             KIM Tae Sul            MO Tae Bum         KIM Junho|||\n\nSUBSTITUTIONS made\n\n1. out - kim jun hyun     in - kang chilgu\n2. out - kim yong sik     out - kim hyun woo\n\n&amp;#x200B;\n\nBefore the end of first half, Manager AJW, made some switching among the midfielders:\n\nHEO Min Ho - same - centerback\n\nIM Nam-Gyu - Lee Jun Yi\n\nRYU Eunkyu - Lee Dae Hoon\n\nLEE Daehoon - Ryu Eun Gyu\n\nLee Jun Yi - Im Nam Gyu\n\n&amp;#x200B;\n\nFew minutes after second half started, AJW brought out Kim Jun Hyun and replaced him with Kang Chilgu. With Kang Chilgu around, Heo Min Ho and Kang Chilgu assumed their usual positions.\n\nThis match is thrilling as they are against a team that is the one of the best. Throughout the match, the opponent gave Eojjeoda Avengers a hard time to the point that they risk injuries. Heo Min Ho, Im Nam Gyu and Ryu Eun Gyu gave the best of themselves in the game and almost suffered injuries.\n\ngoals made by:\n\nEOJJEODA - 2      JEONBUK - 1\n\n&amp;#x200B;\n\n|GOAL\tIM Nam-Gyu\t    ASSIST\tLEE Daehoon|10 mins 1st half|Opponent score               player # 13                                  20 mins in 2nd half|\n|:-|:-|:-|\n|GOAL\tLEE Daehoon    ASSIST\tRYU Eunkyu|22 mins 2nd half||\n\nEojjeoda goals did not come easy for the team.\n\nfirst goal was done 10 mins into the first half.\n\nthen Jeonbuk scored a tie 20 mins into the second half, which affected Lee Jangkun so much.\n\nLee Jang Kun made a number of wrong moves and decisions throughout the game. When Jeonbuk scored a goal,he was disappointed with himself, after a few minutes of wallowing, his teammates said, \"장건아 괜찮아\", he got up and resume the game.\n\nChilgu was the first to console jangkun. second, andre and third AJW.\n\nShortly after the score became tie, Dae Hoon scored a tie breaker goal 2 mins after the equalizer goal. Lee Jangkun cried so much for joy that the team broke the tie.\n\nJeonbuk gave the eojjeoda avengers a hard time. Based on my tally on attempts on trying to score a goal, Jeonbuk made more tries than Eojjeoda. Reason could be, Jeonbuk's defense and ball handling techniques are more efficient than Eojjeoda or Eojjeoda made numerous errors during passes that they gave Jeonbuk the chance to score a goal.\n\nJeonbuk 12 tries - 1 goal\n\nEojjeoda 10 tries - 2 goal\n\nHats off to Eojjeoda Avenger's goalkeeper Han Gun Kyu. He made various super save and if he missed those, Eojjeoda would have lost the match.  Total of 8 saves.\n\nI know the team members are still adjusting with the new members and I hope that in the upcoming match, they will have a better game play and will emerge victorious.\n\nEojjeoda avengers fighting.",
    "comments": [
        {
            "level": 0,
            "comment": "This game was so thrilling as well as dramatic 😂 I'm so proud of them ♥️\n\nThe opposing team gave Ryu Eun Gyu a hard time that I often see him falling down.\n\nAnd also goalkeeper Han Gun Kyu was just amazing with his supersaves in this game. Especially on the long shot from the half line. It's really different if you have a reliable goalkeeper in the field (no offense to the past GKs)",
            "score": 3,
            "author": "prettysavagerun"
        }
    ]
}