{
    "id": "13jo40c",
    "score": 69,
    "title": "Heart Signal 4 - Episode 1 - 230517",
    "author": "MNLYYZYEG",
    "date": 1684288751.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/13jo40c",
    "media_urls": [
        "https://www.reddit.com/r/koreanvariety/comments/13jo40c/heart_signal_4_episode_1_230517/"
    ],
    "other_urls": [
        "https://www.viki.com/tv/39844c-heart-signal-4)",
        "https://www.kocowa.com/en_us/season/77851672/heart-signal-4)",
        "https://www.reddit.com/r/koreanvariety/comments/13jo40c/heart_signal_4_episode_1_230517/jklqta2/),",
        "https://subscene.com/subtitles/heart-signal-4-4/english/3092753",
        "https://www.youtube.com/@channelA-heartsignal/videos",
        "https://www.youtube.com/watch?v=95SLY5leyZE",
        "https://www.youtube.com/watch?v=naY8aypAjbo",
        "https://www.youtube.com/playlist?list=PLFIYUdSkjiCAuWe006VqSTFfaE7rgIHNy",
        "https://www.youtube.com/watch?v=46UmvFNwi9Q",
        "https://www.youtube.com/watch?v=JRuQmQUKLvQ",
        "https://www.youtube.com/watch?v=86F9hZ-7nxc",
        "https://www.youtube.com/watch?v=EAcupLirqOk",
        "https://www.youtube.com/watch?v=8djlZk6ZeM0",
        "https://www.reddit.com/r/koreanvariety/comments/12ccjku/can_someone_give_me_a_list_of_korean_variety/jf16a56/)",
        "https://www.youtube.com/watch?v=Qc7_zRjH808)",
        "https://www.youtube.com/watch?v=Os_heh8vPfs)"
    ],
    "postText": "**Heart Signal 4 (하트시그널4)** is finally here after 3 years.\n\n---\n\nSynopsis:\n\n&gt; Cupid returns for a fresh assault on the hearts of a new group of romance-ready singletons. The group has never met before, but must live together in Signal House. The house rules encourage flirty behavior, but forbid housemates from directly telling anyone that they like them. Instead, they must express their feelings via text message. But there’s a twist: All texts to housemates are anonymous – meaning recipients have to guess who is trying to make a love connection with them.\n\n&gt; Watching events unfurl in the house is a celebrity panel of love experts. These include returning romance fans Yoon Jong Shin, Kim Ea Na, and Lee Sang Min, all veterans of previous “Heart Signal” seasons. And joining this trio this time around is a fresh crop of star pundits, including OH MY GIRL member Mimi, Kang Seung Yoon of WINNER, and leading psychiatrist Kim Chong Gi.\n\n&gt; This variety TV show series is the follow-up to 2017’s “Heart Signal.” A second series was released in 2018. And this was followed up with Season 3 in 2020.\n\n&gt; “Heart Signal 4” is a 2023 South Korean reality TV/variety show that was produced by Park Cheol Hwan.\n\n---\n\n#Cast\n\nLee Jumi (이 주미)\n\nKim Jiyoung (김 지영)\n\nKim Jimin (김 지민)\n\n\\-\n\nShin Mingyu (신 민규)\n\nHan Gyeore (한 겨레)\n\nYoo Jiwon (유 지원)\n\n---\n\n#Panelists\n\nKim Eana\n\nLee Sangmin\n\nYoon Jongshin\n\nKang Seungyoon (from WINNER group)\n\nKim Mihyun or Mimi/미미 (from OMG group)\n\nKim Chonggi (psychiatrist)\n\n---\n\n#Subtitles\n\nSubtitles | | \n---------|----------|\nStream | [Viki](https://www.viki.com/tv/39844c-heart-signal-4)\nStream | [KOCOWA](https://www.kocowa.com/en_us/season/77851672/heart-signal-4)\n\nFrom [vodizt](https://www.reddit.com/r/koreanvariety/comments/13jo40c/heart_signal_4_episode_1_230517/jklqta2/), English subtitles for Viki (resync for 1:51:11): https://subscene.com/subtitles/heart-signal-4-4/english/3092753\n\n---\n\n**Heart Signal Youtube channel or 하트시그널 라비티비 channel**: https://www.youtube.com/@channelA-heartsignal/videos\n\nHeart Signal 4 teaser videos: https://www.youtube.com/watch?v=95SLY5leyZE and https://www.youtube.com/watch?v=naY8aypAjbo\n\nHeart Signal 4 teasers playlist: https://www.youtube.com/playlist?list=PLFIYUdSkjiCAuWe006VqSTFfaE7rgIHNy\n\nHeart Signal 4 production stream: https://www.youtube.com/watch?v=46UmvFNwi9Q\n\n---\n\n**Heart Signal 4 commentary with Heart Signal 2 Jaeho and some other people**: https://www.youtube.com/watch?v=JRuQmQUKLvQ\n\nGaheun (Heart Signal 3 and Friends) and Jaeho with the Heart Signal 4 house: https://www.youtube.com/watch?v=86F9hZ-7nxc\n\nJangmi (Heart Signal 2 and Friends) and Jaeho with the Heart Signal 4 house: https://www.youtube.com/watch?v=EAcupLirqOk\n\nHeart Signal 4 Official BGM Playlist: https://www.youtube.com/watch?v=8djlZk6ZeM0\n\n---\n\nIs anybody gonna do the discussion threads for Heart Signal 4? Putting this thread up just in case.\n\nBy the way fam, there's the **Chinese version of Heart Signal (心动的信号)**. Due to certain pairings, ships, situations, et cetera, Season 2 and the recently completed Season 5 are preferred by some people over the other Korean/Japanese/etc. dating shows. They're preparing for Season 6 of the Chinese version of Heart Signal now.\n\nFor Heart Signal, the original Korean version and some seasons of the Chinese version should be on Viki. For the first season of the Korean version, it's on OnDemandKorea.\n\nWith the Chinese version of Heart Signal, it's available on the WeTV/Tencent Video website (has English subs), and also their WeTV/Tencent Video channels on Youtube for free but without proper English subs.\n\nThrough the Tencent Video Youtube channel you'll have to use auto-translate from Chinese/Mandarin or maybe say Thai, Vietnamese, etc. So for English subs you have to check their own WeTV/Tencent Video/etc. website.\n\n---\n\nThere's like 12 hours left for Heart Signal 4's release. It's possible to [rewatch](https://www.reddit.com/r/koreanvariety/comments/12ccjku/can_someone_give_me_a_list_of_korean_variety/jf16a56/) Season 2 of both the Korean and Chinese version of Heart Signal during that time as the subtitles will probably take another 12 hours to 24/36+ hours.\n\nOn Viki, somebody presumably from the Cupid Returns Team (FIFTY FIFTY - Cupid: https://www.youtube.com/watch?v=Qc7_zRjH808) said that this will be around 70 minutes per episode and that the subtitled episodes will release every Wednesday (so like 24 hours after it airs in Korea). \n\nBack then some of us would watch the episodes with partial English/Spanish/etc. subs even if it didn't say it's 100% complete yet, lmao.\n\nSo apparently **Heart Signal 4 may have 14 episodes** (each episode about ~70 minutes long), and so with one episode per week (hopefully no major [spicy](https://www.youtube.com/watch?v=Os_heh8vPfs) controversies/et cetera affecting the schedule or production), that's 14 weeks of Heart Signal 4, lol. Get ready for the constant cliffhangers and tension.",
    "comments": [
        {
            "level": 0,
            "comment": "I think the one I support this season is min gyu because out of the three he is the calmest person of them",
            "score": 32,
            "author": "Murky-Poetry-7488",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's clearly the Eui-Dong/Do-Gyun character of the season. Rooting for him too!",
                    "score": 18,
                    "author": "AwkwardDisplayy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow all the men are tripping over themselves for kim ji young. \n\nMin kyu reminds me of a cat lol. Kinda awk and introverted.\n\nThe men's rooms look so much nicer. Not a fan of bunkbeds/sharing a room w that many people. But it def looks like 1 more man and woman are coming in.\n\nDammmn was not expecting joo mi to get 2 votes. That was misleading editing. Also jimin is def getting the villain edit already. The way the panel made such a big deal over her saying \"okay\" 😂\n\nI have never seen a 20-something year old not know how to chop an onion. \n\nJoo mi asking jimin if she was just gonna stand there was also unexpectedly aggressive.\n\nThe music and the panel are making the women seem so calculative! This feels very biased. I can see Jimin making some comments on purpose to be flirtacious (like the one about becoming quiet when drinking if she's around someone she likes) but this whole women competing for attention and keeping each other in check thing feels icky. It's not that deep. \n\nOmgggggg i forgot how lee sang min would say each character of each person's name so slowly before revealing who they texted 😂 so dramatic\n\nHmmmmmm i will def keep watching, i think i like jimin, GR, and jiwon so far. Next ep w the first dates and job/age info should be interesting.",
            "score": 25,
            "author": "xiaopow",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also noticed that when I watch Korean dating shows and I get so confused when they cook. like do they not know how to chop up vegetables?",
                    "score": 7,
                    "author": "anonnomel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even if she lived at home w her family it's pretty shocking that no one ever showed her how to safely cut something. I took food &amp; nutrition classes in high school starting at 13 so even if my chopping skills suck I am at least probably not going to hurt myself. I remember when I went to uni at 18 and there were lots of people who had never cooked a meal for themselves before, but this girl has to be at least early 20s right? The lack of basic life skills is unattractive to me but for her, the \"omg what do i do help me\" energy seems to be working.",
                            "score": 5,
                            "author": "xiaopow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ya it’s proper pick-me energy. Most guys dig being the knight in armour",
                                    "score": 7,
                                    "author": "Keymera94",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lmao not Minkyu just staring at her like \"...you good?\"",
                                            "score": 3,
                                            "author": "ElectricalBaseball50"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "jimin? who u talking abt",
                                            "score": 2,
                                            "author": "misty_bellina"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This 💯 they really seem clueless about basic cooking skills 😂",
                            "score": 2,
                            "author": "pinkyypink"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "hahahaha! \n\nsame, i really laughed at the onion scene and how min kyu was just wafching letting her be tbh.",
                    "score": 2,
                    "author": "yay_yen"
                },
                {
                    "level": 1,
                    "comment": "I don't think Jimin is getting an evil edit though? They very clearly actually like Jimin the most, if anything the other two women seem to be getting a more aggressive edit with Joomi giving Jimin passive aggressive comments twice, Jiyoung having all the guys falling at her feet and them both seeming to ice Jimin off a bit in the edit. \n\n&amp;#x200B;\n\nI agree though that they are focusing a lot on the women's actions. I don' think they're exaggerating though but they should also show and comment on what the men are doing.",
                    "score": 0,
                    "author": "ElectricalBaseball50",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Theres nothing to show though because the men just arent doing anything. Min kyu has been quiet throughout, gr is happy with ji young, only jiwon looks a bit jealous.",
                            "score": 1,
                            "author": "Spartandemon88"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I missed HS so much!! The episode wasn’t amazing, but overall I was entertained. \n\nLiked Joomi and Ji Young, don’t know how I feel about Jimin (did that wineglass scene cringe anybody else out? bc I had a visceral reaction to it). Felt bad for Joomi, she seemed to struggle in the latter half of the episode, hopefully she takes it in stride and isn’t deterred by it! \n\nThe guys are kinda just there, but I enjoyed them having absolutely no poker face when a girl they liked was in the room! \n\nThe previews showed dates between Jimin and Min Kyu (should be interesting as that man is so obviously into her), Ji Young and Gyeo Re (wonder if they are going to be the couple that sticks together the whole season, don’t really love that bc I’m a sucker for drama), and Joo Mi and Ji Won (curious to see if Joo Mi will become more proactive bc of the no text thing).",
            "score": 15,
            "author": "Illustrious-Insect26"
        },
        {
            "level": 0,
            "comment": "That first episode was 🔥 \nHS is usually a slow burn until episode 3. A couple of thoughts: \n1. Jimin is getting evil edits. She has plenty of charms and has been sweet of the two other girls, but panelist keep painting her as the vixen/fox where JY gets the sweet innocent image and constantly gets complimented on how sweet and innocent she is. Just like Jimin she knows her charms how to play it, but Jimin gets called out for it when she does it? JY also played super helpless during the cooking scene like Jimin. I like JY she’s got rizz, but I just hate it that Jimin is hated for having rizz game too. \n2. I liked Jumi at first, she was bit catty during the cooking scene. It rubbed me off the wrong way. I hope this changed later. \n3. For the boys, MK is my personal fave. \nMy prediction for the next episodes: \nJW —-&gt; JY and vice Versa \nMK —-&gt; and Jimin and vice versa \nJumi will still go for MK and GY for Jimin.",
            "score": 14,
            "author": "Lululuna321",
            "replies": [
                {
                    "level": 1,
                    "comment": "i don't think jumi was catty lol i think that was an evil edit tbh, she kept calling jimin cute for being awkward cause she seemed the youngest, so when she was watching her cut veggies i think she just meant for it to be a harmless jest at her awkwardness, not like a \"can you go somewhere else\" type rude remark. the only one not getting an evil edit it seems is jy lol which is sigh typical for this kinda show",
                    "score": 7,
                    "author": "PuzzledWarning",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Def could be evil editing.",
                            "score": 1,
                            "author": "Lululuna321"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Feels like a little bit of both. Let’s be honest, each season they have their favorite that they overly dote on and the girl who some how becomes her foil. S3 it was Park Jihyun vs Ga Heun.",
                            "score": 2,
                            "author": "Lululuna321",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The panel clearly like Jimin the most though?",
                                    "score": 0,
                                    "author": "ElectricalBaseball50",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They were a bit kinder in the second episode, but the first one, they made her sound calculating.",
                                            "score": 1,
                                            "author": "Lululuna321"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Watched it without subs and understood most of it since they didn't really talk too much out of context. So far, not really impressed by anyone but not because of their appearances or anything, more so that they all seem...predictably boring.  I found myself actually just looking forward to the panelists cuz there was not much else going on.\n\nOn my first impressions of the girls, ***Jiyoung*** stands out because she is cute and knows it. She's got her preferences and is not afraid to go for it which is why she's top in votes as expected. Not much to say other than that she's a natural at striking the balance b/w being innocent and showing enough experience to not be underestimated. ***Jimin*** makes me uncomfortable with how proactive she is but she does feel the youngest of the bunch and seems to genuinely be uncomfortable when attention is not on her so it makes sense. With how readily she accepts praise and how much she tries to get attention, she defo feels like a c-list celeb or someone who has to constantly vie for the spotlight. It may work in the short term but unless she shows us growth or a reversal, I don't see anyone really choosing her in the end. ***Joomi*** feels the oldest or at least the most mature. She's the one that I would choose if I was a guy there since she's nice to people, helps out others without hesitation, and seems to be independent. I dislike it when someone unironically acts helpless and needs others to do something simple for you so she's got top marks from me for forging her own path. She doesn't seem the type to proactively ask out others first or feel the need to heavily appeal herself which will work against her but I'm hoping she'll get through that hurdle and even if she ends up with nobody here, she should be better for it.\n\nThe guys are a lot less exciting than expected. They seem kind of nice but also don't seem able to lead the group or give us anything to work with. ***Gyore? Gyole?*** is straightforward and while I get not wanting to mislead others, his one track mind this early on has already closed off all the other girls which means if he does get a date with them, it's gonna be super uncomfortable. This would be fine 2-3 eps in if he's gotten to know the others and decided on Jinyoung but his one pick at first sight is not the most exciting thing to watch. ***Jiwon*** feels the most experienced but also gives off this air of being manly. However, as the ep progresses, he seems to be a lot more mild than expected so like a mix between how Mingyu and Gyole came off. He also seems to like Jiyoung but is receptive of Jimin's advances so he will likely be a central character in the upcoming eps. ***Mingyu*** interests me the most, but only because I can't really tell what's going on in his mind. He doesn't care much for screentime (he doesn't act out or show reactions) which means he's likely not in Heart Signal for blatant promotional purposes so if it's love, him choosing Joomi then Jimin threw me for a loop. The only explanation for having such different preferences is if he gave a pity vote to Joomi for being nice and then chose Jimin who paid attention to him. Either way, he seems like he'll either turn out to be a sleeper hit or become a hopeless Jimin chaser.\n\ntldr; Never know if I should put this before the wall of text or after but as it is, my final thoughts on ep 1 is meh. Hopefully I'm proven wrong and the 2 members they add will spice things up so we can get a bit of that S2 magic because as it is, I don't really feel too invested in any of these casts. Also knowing Mimi, I can't wait for her to come out swinging with some super hilarious out of the left field comment after the psych professor's insightful and erudite-sounding one.",
            "score": 26,
            "author": "mcsavatar",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought it was an adequate start.\n\n* HS 2 and 3 started slow to me, until the catfish came, so taking a wait and see approach.\n* Guys just seem eh ok, could be better, could be worse I guess.\n* Two of the ladies were really good looking, felt bad about the other one. The panel seemed to think so and immediately took her side as the underdog. A bit too much imo. Like, don't pity her or something too much, that's weird.\n* I forgot how much the panel loves to talk. I like them, but skipped through almost all their commentary.\n* Already curious about the catfish.",
                    "score": 13,
                    "author": "AwkwardDisplayy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's interesting cuz to me while I can say Jiyoung and Jimin are conventionally pretty, Jumi stands out not because I feel bad for her not getting attention but she gives off an understated air of competence, which is personally a bigger draw for me. Although, I'd be dumb if I believed appearances didn't matter. Unless you get a cast like Love Catcher's Bali ver where every single girl was gorgeous and only differed in styles and personality, it's kinda understandable the prettier ones stand out at first. Can't wait for catfishes so the fully assembled cast is here and we can finally get the ball properly rolling.",
                            "score": 24,
                            "author": "mcsavatar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hmm honestly all 3 women seem competent/confident to me which is great. Well except the onion slicing scene. Holy shit I could tell that guy wanted to intervene immediately after she almost sliced off her own fingers numerous times.\n\nAnd agree, Love Catcher in Bali was off the charts in terms of looks and personality. \n\nIt's just weird how suddenly the entire panel was on Jumi's side. Like she's a grown adult, you don't have to suddenly pity her, that's disrespectful to her in  a way.\n\nAnd agree, waiting for the catfish too!",
                                    "score": 16,
                                    "author": "AwkwardDisplayy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I also disliked it when they suddenly felt bad for her and continued to remark on rooting for her. While I understand there's a reason why underdogs are so compelling, labeling one in a budding relationship makes it feel like there has to be a victor and subsequently a loser, which just makes the whole thing feel wrong.\n\nAlso speaking on the topic of confidence, you're right that all 3 girls are definitely confident in their own way. You can be confident about your looks, your ability to flirt, etc. but Jumi's confidence is more about how she comes off as not needing to engage in stuff like Jiyoung's admittedly cute nose wrinkle whenever she smiles or Jimin's calculated flirting attempts. It's also an impression I've gathered from edited scenes in the 1st ep so she could turn out to be completely different irl or likely as the season progresses.\n\nedit: went off topic. edited to cut that down.",
                                            "score": 8,
                                            "author": "mcsavatar"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "great points! it does seem a bit meh? maybe cause i have high expectations due to the past seasons. i'm more looking forward to the 2 catfish members they'll add later on",
                    "score": 9,
                    "author": "spellbinded"
                },
                {
                    "level": 1,
                    "comment": "Women fans support Ju Mi. And I agree she has that mature and air of competence. \n\nAnd we girls are going to get our hearts broken again.",
                    "score": 7,
                    "author": "Emotional-Ad6489"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The boys of this show - ALWAYS picks the innocent looking and acting girl or the flirty girl. As a female fan of this show, it makes my skin crawl, it is so cringy when girls forcefully make those cute faces and soft, whisper like voice. \n\nThe women fans tend to like the mature and competent girls. And that is Ju Mi in this season. GAH!! We are in for another heartbreak?!?",
            "score": 26,
            "author": "Emotional-Ad6489",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well we already used by it serin,youngjo,gaheun...wish good luck for jumin.. hopefully she can break this curse..",
                    "score": 10,
                    "author": "Remote-Guarantee-644",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I really hope so! \nI want to enjoy this season without any heartache at the end.",
                            "score": 1,
                            "author": "Emotional-Ad6489"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "it's the same story line everytime sigh i just hope ming kyu surprises me this szn unlike the quiet boys in the other szns",
                    "score": 1,
                    "author": "PuzzledWarning"
                },
                {
                    "level": 1,
                    "comment": "looks like we are in for a heartbreak. lol. \n\nnah, hopefully this season goes differently.",
                    "score": 1,
                    "author": "yay_yen"
                },
                {
                    "level": 1,
                    "comment": "I'm ready for heartbreak! 😭😭 But i still support Ju mi even after this show. I hope she get some tv projects. i really like her. Smart and strong independent woman.",
                    "score": 1,
                    "author": "Infjgirlph",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wanna see her on I Live Alone. \n❤️❤️❤️",
                            "score": 1,
                            "author": "Emotional-Ad6489",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Me too 😊😍",
                                    "score": 1,
                                    "author": "Infjgirlph"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Men like hopeless women who they can protect 🥺🤡",
                    "score": 1,
                    "author": "ayokonanyeta"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i just upload eng sub here  \n[https://subscene.com/subtitles/heart-signal-4-4/english/3092753](https://subscene.com/subtitles/heart-signal-4-4/english/3092753)  \n\n\nresync for 1:51:11   \nsub by viki",
            "score": 8,
            "author": "vodizt"
        },
        {
            "level": 0,
            "comment": "I can only stand Min Kyu for the boys and Ju Min for the girls. \n\nand there is that soft, whisper like voice again. Gaaahhhh",
            "score": 8,
            "author": "PinayNomad_"
        },
        {
            "level": 0,
            "comment": "Guys, let's gather &amp; comment on Heart Signal's subreddit here:\n\n[https://www.reddit.com/r/heartsignal/](https://www.reddit.com/r/heartsignal/)",
            "score": 8,
            "author": "Sza_Azs"
        },
        {
            "level": 0,
            "comment": "Ji Young really reminds me of actress Shen Yue, she's really pretty. But so far I'm rooting for Jumi, I like her vibes.\n\nI'm really am not fond of the dramatic tone so far, wish they chilled it down because I prefer seeing the friendships bonded over the Heart Signal series haha. Will need time to warm up to the cast members, as they're kind of not really distinctively as interesting or intriguing?",
            "score": 8,
            "author": "Bluesrepair"
        },
        {
            "level": 0,
            "comment": "wow, it is already here?\nWhat are the initial reviews like?\n\nLet's start yet another journey of all guys falling for one girl... and audience favourite being rejected by her choice!! ( ha ha they literally follow this pattern every single season)",
            "score": 29,
            "author": "enigmatic_zephy",
            "replies": [
                {
                    "level": 1,
                    "comment": "~~Not yet, OP is excited. It will premiere in about 10 hours from now. Subs will be out tomorrow at the earliest.~~ (UPDATE: Subbed episode now available in VIKI, KOCOWA and VIU SG).\n\nIt is also important to note that the episode that will be streamed in International OTTs will be different from what was broadcast in SK due to copyright licensing restrictions (the songs used might be replaced).",
                    "score": 13,
                    "author": "Driz_12"
                },
                {
                    "level": 1,
                    "comment": "Okay, so it's 10PM (New York Time) at the moment and I just woke up, Viki has the English subs now (Viki might've uploaded it a few hours ago). \n\nSo that means Viki volunteers/subbers took ~12 hours to sub/release the episode. This timeframe will sometimes vary, and as such don't be surprised in the future if they take ~24 hours to sub an episode that has more dialogue/conversation/etc. between the cast and also panelists.\n\n**Heart Signal 4 Episode 1 on Viki with English/etc. subtitles: https://www.viki.com/videos/1230170v-heart-signal-4-episode-1**\n\n**Heart Signal 4 Episode 1 on KOCOWA: https://www.kocowa.com/en_us/media/78044416/heart-signal-4-episode-1**\n\nFor VIU (Singapore/Malaysia/Philippines/etc.), somebody should get the direct link for it (if you live outside (Southeast Asia) and visit the VIU website, it will say \"No Service\" or something like that, so need to use VPN/etc. to even just easily navigate the site) or I'll find it later. I'm going back to sleep, lol.\n\nAs it's been for years now, for those that need access to these Korean variety shows, Kdramas, et cetera, there's still ArmsAsuncion's website for redditors, I linked it earlier in some of the thread links I posted before.\n\n---\n\nAs for the initial reviews, this 4th season is a bit unexpected. It opens with the visuals guy and his dirtied shoes, and then he's like hiding his coat on the floor between or behind couches. Kinda unconventionial, even the panelists were baffled, rofl.\n\nThe female housemate favored by the audience or livestream chat from the Heart Signal (하트시그널 라비티비) channel is said to be realistic instead of playing it up for attention. Like some people say the scenes are a bit too contrived/setup/etc. but that female housemate remains pretty resolute with her own personality, as in like it seems she's not overly adjusting/changing her personality to perform for the show.\n\nThen for the other two female housemates, the vocal commenters have more of the usual misogynistic/troll/etc. stuff and so it's somewhat hard to get a read on what people really think as they figure that this 4th season is more scripted or produced like a drama, lmao.\n\nFor the male housemates, one of them is also just like the female housemate favored by some of the audience. Like they're focused on being somewhat cold or not as easygoing.\n\nAnd then the other two male housemates are kinda opposite. One of them will probably be considered way too laid back (he fades in the background), though that's probably because he had no sleep before this first introduction day. And then the other is more of like a moodmaker or life of the party as he tries to make more of an effort with breaking the ice or getting people to somewhat talk/interact with each other.\n\nSome people said there's nothing really standing out with this new 4th season of Heart Signal and so that's why people in the chat/comments/etc. were saying to bring out the catfishes already to spice things up, rofl.",
                    "score": 0,
                    "author": "MNLYYZYEG"
                },
                {
                    "level": 1,
                    "comment": "Heart Signal 4 will release in like 3 hours, it should be available on Viki, VIU, et cetera. Some people might need to use VPNs and so on to access the episodes due to region locks/etc.\n\nIf they don't simulcast (release at the same time) with the Korean release, Viki/VIU/etc. should have the subs within 24 hours or so.\n\n**Where to watch Kdramas, Korean variety shows, and so on (basically Viki, VIU, Disney+, Netflix, etc.)**: https://www.reddit.com/r/koreanvariety/comments/10fpzhx/overall_thoughts_on_love_catcher_in_bali/j5cmhaw/ and https://www.reddit.com/r/koreanvariety/comments/13bmtin/anyone_know_where_can_i_watch_the_below_korean/jjbtnuz/\n\nAnd yup, sometimes for these streamed shows they will change the audio/music or like edit a few scenes compared to the original Korean/etc. release. Though for the most part, nearly all of us will be experiencing the same episodes/show.",
                    "score": -1,
                    "author": "MNLYYZYEG"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I get bit disappointed in teaser n cast because they're looking too young, teaser looks too drama-like and kinda hard to identify who's who still. But hopefully I'm wrong\n\nPrayge for Season 2 magic comes back. Hyunwoo x Hyunjoo x Youngjoo character please coming back,",
            "score": 17,
            "author": "Sunasoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "That Hyunwoo and Hyunjoo date at the end was my favorite moment of all dating shows.",
                    "score": 12,
                    "author": "larry_the_loner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, that date are dramatic af. That whole S2 are amazing tbh\n\n\n gladly after a while hate on hyunjoo have decreases and watcher  even begun to appreciate/love her actions now.",
                            "score": 6,
                            "author": "Sunasoo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "HW too. He was blasted to the high heavens for switching from YJ to HJ.\n\nIf only he had stuck to his original choice, he'd still be in mens fashion commercials right now.",
                                    "score": 3,
                                    "author": "AwkwardDisplayy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;If only he had stuck to his original choice, he'd still be in mens fashion commercials right now.\n\nNot really, he really never jumped on to advertise any product after the show plus he had his fair share of mess with his 2 DUI history",
                                            "score": 3,
                                            "author": "Sunasoo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sorry, I mean if he had picked YJ, he would be in so many commercials.\n\nBut he didn't and was hated, so no commercial for him.",
                                                    "score": 2,
                                                    "author": "AwkwardDisplayy"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Man I'm so out of touch/Twitch with the memes, all I remember is Sadge, lol. Miss those wild early streaming/meme years.\n\nAnyway, apparently at least one of the guys is like 30 years old and then one of the girls is like way younger, wait let me check nahonjaboda's Twitter.\n\n**Do not click or read below unless you want the possible name (and Instagram/social media), age, and occupation of the cast/housemates spoiled/revealed/et cetera**. \n\nUh, apparently years later for some mobile users (with the official app and third party apps for reddit) the spoiler tags and such don't work. So that's out of my control, sorry team, it works on desktop/PC and Old Reddit though.\n\n---\n\nShort-haired girl (getting her makeup done in a different channel: https://www.youtube.com/watch?v=SE-KcfRgpbs) featured a lot in the teasers: &gt;!Kim Jiyoung (born 1995): Model, former flight attendant for Korean Air. Instagram: _diyom_!&lt;\n\nGirl that sorta looks like (https://www.youtube.com/watch?v=95SLY5leyZE&amp;t=67s) WJSN (THE BLACK)/Cosmic Girls SeolA: &gt;!Lee Jumi (born 1994): Lawyer. Instagram: 2dumi!&lt;\n\nVisuals girl (https://www.youtube.com/watch?v=naY8aypAjbo&amp;t=56s), she looks like a Kdrama actress or Kpop idol: &gt;!Kim Jimin (born 2000): Influencer/model. Instagram: loeweruby!&lt;\n\nVisuals boy (https://www.youtube.com/watch?v=95SLY5leyZE&amp;t=70s), he looks like an idol with his hairstyle and fashion: &gt;!Shin Mingyu (apparently around 30/31) - Strategy Consultant, fellow étudiant/révolutionnaire, Instagram: Mingingyo. Youtube: 고대로 (https://www.youtube.com/@user-oy4yb8lz1d/videos)!&lt;\n\n---\n\nSo they are actually &gt;!on the older side!&lt; even though they look kinda young, lol. Remember usually in these dating/cohabitation shows, sometimes there's mainly 18-24 years old housemates/contestants. The mid-late 20s or 30s housemates often get ignored unless the other people are of similar age.\n\nPersonally with Heart Signal 4, I was disappointed because of the lack of visuals (lol wtf). This may change after the first episode releases, though I doubt it as I'm pretty accurate with my preferences.\n\n---\n\nLike after watching the trailer (https://www.youtube.com/watch?v=0isy6O5UcNo) for **Love Catcher in Bali (러브캐처 인 발리)**, the bar was just set so high, to outer space/interdimensional (UAP/USO/etc.) territory, for the visuals of Heart Signal/Single's Inferno/EXchange or Transit Love (환승연애)/other Korean dating shows.\n\nLove Catcher in Bali (러브캐처 인 발리) has unparalleled (female) visuals and so on compared to other dating shows, and as some /r/noveltranslations and /r/ProgressionFantasy (Chinese/Korean/Japanese/East Asian/etc.) web novels will say, it's like the difference between heaven and earth.\n\nBelow are the direct links to TVING/Love Catcher in Bali clips, don't worry it's not really spoilers as they're just chilling.\n\nThese are the female housemates of Love Catcher in Bali: https://www.youtube.com/watch?v=cpPl9mP35ik\n\nThese are the male housemates of Love Catcher in Bali: https://www.youtube.com/watch?v=VawZKpDWIY4\n\nKorean/Chinese/etc. dating show visuals: https://www.reddit.com/r/koreanvariety/comments/12ijnjc/dating_shows/jfve2v6/\n\nSome new Chinese dating shows have really nice visuals too, like Sun Xiu and Wu Shuyang (Little Wu or 小吴) from **Twinkle Love Season 2 (怦然心动20岁 第二季)**: https://www.youtube.com/watch?v=DFBC-aR2tmk&amp;t=1324s\n\nAnd right now for **Yes, I Do Season 4 (喜欢你我也是4)**, there's Xu Zihan (Aria Xu): https://www.youtube.com/watch?v=GqkOGp2dQqw&amp;t=2504s\n\n---\n\nOh and as for the love triangles or interesting catfishes and so on. Supposedly the visuals guy will end up with, hold on, it's just probably rumors but sometimes people be leaking the whole plot (this is more so for the Chinese dating shows, not as much with Korean shows, avoid the Youtube comments and social media comments as in do not Google Translate/etc. the text), so let's not even bother guessing and enjoy the show blind, rofl.",
                    "score": 2,
                    "author": "MNLYYZYEG",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your visual standard is quite similar to mine. I also think these girls from 怦然心动 2 were super pretty",
                            "score": 4,
                            "author": "Leading_Aardvark_180"
                        },
                        {
                            "level": 2,
                            "comment": "Here's a sneak peek of /r/noveltranslations using the [top posts](https://np.reddit.com/r/noveltranslations/top/?sort=top&amp;t=year) of the year!\n\n\\#1: [Ohh Noo💀](https://i.redd.it/t9qctk5wujna1.jpg) | [65 comments](https://np.reddit.com/r/noveltranslations/comments/11q9q80/ohh_noo/)  \n\\#2: [I'll just leave this here](https://i.redd.it/b8od5jvqx7ia1.jpg) | [88 comments](https://np.reddit.com/r/noveltranslations/comments/1128x7f/ill_just_leave_this_here/)  \n\\#3: [Everytime](https://i.redd.it/wskiace1i6891.png) | [81 comments](https://np.reddit.com/r/noveltranslations/comments/vlxjjh/everytime/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
                            "score": 0,
                            "author": "sneakpeekbot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ji Young has massive aespa Winter vibes. Their eyes are very similar + the short hair.",
            "score": 7,
            "author": "Expensive_Chef1633"
        },
        {
            "level": 0,
            "comment": "The new housemates didn't give much impressions yet. However, the new female host annoys the hell out of me. The two new guys, especially the Psychologist, were pretty chill though. I like them.\n\nEdit: I did not expect to see some onion smelling in Heart Signal. Yuudai, is that you? Hahaha",
            "score": 6,
            "author": "rent-boy-renton",
            "replies": [
                {
                    "level": 1,
                    "comment": "New female host: Do you mean the one from the K-pop girl group?",
                    "score": 2,
                    "author": "KoalasAreKuddly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes. Idk, but I couldn't stand her cutesy voice and over the top reactions. Why is she even there????? Argh.",
                            "score": 5,
                            "author": "rent-boy-renton",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mimi is hilarious.. give her some time",
                                    "score": 6,
                                    "author": "temptressmoon"
                                },
                                {
                                    "level": 3,
                                    "comment": "Misogynist",
                                    "score": 0,
                                    "author": "ElectricalBaseball50",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lmao. Learn the definition of that word before you use it.",
                                            "score": 1,
                                            "author": "rent-boy-renton"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We sht talking the hosts now??? They were fine I don't know what do you mean. She literally is there to make \"over the top reactions\". Just skip it if you don't like it. it's that simple. I can't stand people who complain about the hosts. Obviously a newbie in dating show.",
                                    "score": 1,
                                    "author": "VioletCrush_168"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So I stalked Lee Joomi and found the other show where she had appeared in. \nSadly no eng sub. \nShe looks lovely in her short hair and she's very calm. I LOVE HER already!",
            "score": 6,
            "author": "Emotional-Ad6489",
            "replies": [
                {
                    "level": 1,
                    "comment": "What show is it cause she seemed so familiar to me",
                    "score": 2,
                    "author": "Complete_Olive_6989",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's Good People. Also from Channel A. I can't find any sub though.",
                            "score": 2,
                            "author": "Emotional-Ad6489"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "sooo we got kang dong won and park so jin this season... oh and jun ji hyun",
            "score": 6,
            "author": "thefaptard"
        },
        {
            "level": 0,
            "comment": "Mingyu looks like kim young dae and kang dongwon",
            "score": 5,
            "author": "christopherzkz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought he looked like Min Kyung Hoon 🤣",
                    "score": 3,
                    "author": "Kim87e"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree that Jimin looked a little... desperate?\n\nI **did not** like Joomi's comment to Jimin in the kitchen. Why did she have to be bitchy? They've just met! I don't know, I feel like she is capable of even more bitchiness in the future if this is how it starts. I get that Jimin was trying to get attention, but don't be rude.\n\nLooking forward for the catfishes!  😆\n\nBtw, does anyone know why it's called catfish?",
            "score": 12,
            "author": "natalie-anne",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think Ju Min was bitchy and it's just the editing as if the girls are out to fight it out. LOL. \nShe also teased Ji Min earlier that she looks like she didnt know what to do as she was only standing there. I think she was just encouraging Jimin to find something to work on. Jumin is obviously the oldest of the girls. She also supported short haired girl with mentioning to the guy that the food was passed on from JY.",
                    "score": 16,
                    "author": "Emotional-Ad6489"
                },
                {
                    "level": 1,
                    "comment": "i think it was just the editing lol + the panelist remarks that are meant to pretend as if things are more srs than it is, she's been the kindest to everyone and she seems very professional and cordial, i think it'll take time for her to get comfortable tbh",
                    "score": 2,
                    "author": "PuzzledWarning",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it could be the editing… It’s either that or passive aggressiveness",
                            "score": 1,
                            "author": "natalie-anne"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Your question has its own post:\n\nhttps://www.reddit.com/r/koreanvariety/comments/z4fcar/what_is_the_meaning_of_catfish_in_kdating_shows/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button\n\nBasically the catfish comes in later with the purpose of shaking things up/changing the environment for the existing fish lol. The history of the term is explained in the post (inspired by actual fish behaviour).",
                    "score": 1,
                    "author": "xiaopow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I understand the purpose, I just don’t understand why it’s called cat+fish.\n\nI will read through the post and see if I can find the answer there",
                            "score": 1,
                            "author": "natalie-anne",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's there. It's named after an actual catfish (a type of fish) bc of their impact on other fish.",
                                    "score": 2,
                                    "author": "xiaopow"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm sorry but how did it become Jumi who is rude??? Jimin and mingyu literally supposed to cook that night.\n\n1. They literally go on a date instead of quickly buying groceries as they were supposed to come home cook. What happen to \"Sorry we're late\" and \"Do you want to join us eat\". She was happy cooking for two.\n2. They cooked instant food while knowing they were supposed to cook dinner. Even gyorae cooked proper meal the night before.\n3. Jimin KNEW Jumi was not in a good mood and STILL, choose to brag about her \"date\" with mingyu. Jumi changed subjects 5 times to change the topic but Jimin repeatedly talked about how she got picked up by mingyu. Mingyu was making excuse and comforting Jumi but Jimin still keep going. Plus it's not like Jimin liked Mingyu I really don't understand her at all.\n4. Jimin literally asked \"Why unnie did something happened?\" sarcastically to Jumi after Jumi asked \"Are you feeling good?\"\n\nMind you, Jumi is 7 years older than Jimin. Idk how it is in your culture but the way she talk is quite rude to me. It's not what she said it's the intonation while grinning and side eyeing. Idk how would you call Jimin behaviour and that's up to you but if there's one person that's rude, it's definitely not Jumi.\n\nBruh, she literally did most of the house chores. Her being mad about dinner is realistic. No, honestly if they apologize if would've been sooo much better. I would've been worse than Jumi tbh.",
                    "score": 1,
                    "author": "VioletCrush_168",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is the Episode 1 discussion thread and I think you are talking about episode 3.\n\nI have nothing against Jumi, I just didn't like the one comment she did because I would've been upset if someone said it to me. I think that the way the show is edited could've skewed her attitude and maybe in reality it wasn't that bad, and I'm totally aware of that - I am just basing it off what I interpreted it as back then.\n\nYou can comment your thoughts about episode 3 [here](https://www.reddit.com/r/koreanvariety/comments/13y551s/heart_signal_4_episode_3_230602/)",
                            "score": 1,
                            "author": "natalie-anne"
                        },
                        {
                            "level": 2,
                            "comment": "I think u misunderstood the comment. It was related to the kitchen scene from episode 1",
                            "score": 1,
                            "author": "Plus-Calligrapher303",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I'm sorry but how did it become Jumi who is rude??? Jimin and mingyu literally supposed to cook that night.They literally go on a date instead of quickly buying groceries as they were supposed to come home cook. What happen to \"Sorry we're late\" and \"Do you want to join us eat\". She was happy cooking for two.\n\nThis happened in episode 3 (but the rest of the comment is also based on episode 3).\n\nIn episode 1 Jumi says something like \"are you just going to stand there?\" to Jimin. That's it. There's no date happening in episode 1",
                                    "score": 1,
                                    "author": "natalie-anne",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Me personally I didn't find it rude I think they edited it to look that way. The cooking issue in episode 3 I really disliked.Let's see the next episodes how it will be",
                                            "score": 0,
                                            "author": "Plus-Calligrapher303"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Contradictory to the female casts, the guys seemed ...meh. But it's still only first ep so I will give them the benefit of the doubt. I like all of the girls so far.\n\nHopefully the catfish come soon and spice things up.",
            "score": 11,
            "author": "hwudin",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;JW seems a bit creepy though.\n\nHow do you find him creepy? i think it's still early to say",
                            "score": 3,
                            "author": "hwudin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I shouldn't say that. Deleting.",
                                    "score": 1,
                                    "author": "AwkwardDisplayy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Happy Heart Signal is back! Am I the only one who actually guesses along with the panelists in each epislde? \n\nAnyway, here are my thoughts:\n\n- Everyone is sooo good-looking but Ji Young just blew my mind. Like, surely God plays favorites among humans!\n\n- The women have very different looks and personalities which is obvious on episode 1 while the men seem to like the same fashion styles and appear to be all observant and thoughtful. I like them all! ♡ \n\n- I am glad there is no overly giddy girl among the women. How I hope no one turns out to be like that. Please, don't. \n\n-  My first impression favorites are Ju Mi and Ji Won. \n\nJu Mi is the independent  girl type who also looks out for other people. She just makes me wanna root for her, especially after the guys' reaction to Ji Young. \n\nJi Won's smile is ♡ omg. I can already sense he would be a favorite. \n\n- There seems to be a really good mix of characters in this season. May the editing be fair and may they all find love. lol. ♡",
            "score": 5,
            "author": "yay_yen"
        },
        {
            "level": 0,
            "comment": "I think heart signal just follows same story throughout a cutsy girl all male participants falling for her like the story keeps on repeating I've watched season 2 and 3 and I think I can find similarities in situations.",
            "score": 4,
            "author": "IcyCheek7250"
        },
        {
            "level": 0,
            "comment": "Ji Min reminds me of a “Pick Me” girl. She acts like a damsel in distress at times to get the guys’ attention (the “No hot water!” Thing) and did not seem authentic. I feel like she wasn’t being herself and when someone else was getting attention, she had major RBF. I think if she would just be herself and cut the act, the guys would fall for her instantly. She reminds me of a girl a work with who is exactly the same. When she acts like a damsel the guys she date think it’s cute the first couple times but then get put off not too long after. However when she is just being herself, it’s a happier ending for her.",
            "score": 21,
            "author": "Educational_Grass_10",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kinda felt the same, I don’t want to make snap judgements, but I found her to be pretty overwhelming and inauthentic during this ep! I\n\nI feel bad for women who feel like the need to put on a show just to get a guy’s attention. It ends up with the woman getting hurt and the guy not even knowing who she really is bc she constantly playing this role. I’m going to attribute her behavior to her being young, but I hope she starts to mellow out and realize that she’s doing a disservice to herself. \n\n(And I’m side eyeing any men who find this behavior attractive)",
                    "score": 15,
                    "author": "Illustrious-Insect26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She definitely gives the “young one” mentality.  She thinks she has to act a certain way and people will see it as charming. Whereas  Ji Young and Jumi are just being themselves and  are charming by being themselves and not screaming for attention. I feel like it’s going to wear on Ji Young and Jumi nerves (if it already hasn’t. I saw some side eye going on lol). Maybe it will get better as the season goes and she doesn’t start to act too thirsty.",
                            "score": 9,
                            "author": "Educational_Grass_10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jiyoung is being herself, really? I watched full ep1 and I feel three girls all are not simple. Knets found out JY had boyfriend, she and her bf traveled tgt in February while this show recorded in March. She lied everyone, that's so baf",
                                    "score": 9,
                                    "author": "Sad_Neighborhood6934",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 0,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "With her image getting release early people do search her because this are HS and fans are really active to do background check, saying that the PD of HS deny it already, i think",
                                                    "score": 5,
                                                    "author": "Sunasoo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Her bf is doctor and they dated tgt over 500days. After Knets found out, she changed her avatar. Some people asked it on her youtub and Knets said she had bf. That's all i know",
                                                            "score": 3,
                                                            "author": "Sad_Neighborhood6934"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "was she supposed to sit back, and \"know her place\" and play politics with the other girls while getting no votes? The other guys weren't even noticing her because they were more familiar with the other girls having spoken to them way longer before she arrived, just sit there and be the odd one out? What about the mean girl words the other girls said to her, or the looks and smirks they gave when she got no votes? but because you like them thats OK, we wont talk about that...",
                            "score": 10,
                            "author": "NoviDon07",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, I didn’t expect her to sit back, and I actually enjoy women being proactive on dating shows. However, the way that Jimin went about it didn’t really feel authentic to me. \n\nThe way she acted felt super male gazy (like she was acting a certain way because she thinks men will find her behavior attractive, not her just trying to be herself and letting that shine). It’s not wrong to do things to with motive to attract men, but it felt constant throughout the episode. I feel like her real personality is someone who is headstrong and cool (how she composed herself after getting 0 votes and picked herself back up), so to see such an opposite personality and act in front of the men was really jarring and didn’t feel honest to who she really is (which is someone who I think I’d actually really like!)",
                                    "score": 7,
                                    "author": "Illustrious-Insect26",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I get what your saying, she changed and got more assertive after she got zero votes. She started approaching it like a challenge to get the attention of the guy(s) she was interested in. If I was in her shoes in that place tho I would probably do something really similar personally. Im not there to make friends im trying to get a boo thang. I have enough friends. Im going to be as confident and the best version of myself as possible and make the best first impression possible. Because after seeing so many dating shows people really fall in love with the first impression and it goes a long way.\n\nAlso I don't think we know who she is off of one episode, to say that she is not being authentic. also people have different sides to them, is it possible she can be headstrong and cool, but also cute and ditsy depending on the environment? I don't act the same way around my crushes as I do around a bunch of dudes. I agree she was playing it up and trying to capture attention, but all the girls were doing that, all the girls were competing, why is she being singled out, because she was a little more bold with it?\n\nEdit: Im open to being wrong, maybe i'm biased because I kinda fell in love when she walked up to the house so confidently with the pink jacket so It's possible im seeing her with rose tinted glasses.",
                                            "score": 10,
                                            "author": "NoviDon07",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "When she first came in, I liked her the most out of the three. Maybe nerves got the best of her or maybe we didn’t get to see everything (it is the first episode after all). As far as a villain (I have seen some people say she will painted as a villain) I don’t see her as a villain at all. However, the way she was in the kitchen was off putting, mainly because I work with someone who is literally like that 90%  so it’s off putting. On the other hand I can see how her getting no votes made her want to be more assertive and straight forward. Maybe she will find a happy medium, maybe she won’t, we won’t know unless we keep watching. \nAnd quite honestly, I think they zoom in on certain things people do and everyone’s facial expression to make it more dramatic. Either way, I have my favorites and my not so favorites. Future episodes will tell whether my favorites change or not.",
                                                    "score": 4,
                                                    "author": "Educational_Grass_10"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Edit wrong person",
                    "score": 1,
                    "author": "AwkwardDisplayy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think ur talking about Ji Young and not Jimin (bc she’s the one who almost chopped her finger off lol)",
                            "score": 3,
                            "author": "Illustrious-Insect26",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah ur right thank you. Edited",
                                    "score": 3,
                                    "author": "AwkwardDisplayy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let's go Lee Jumi!!! \n\nbtw, it's a shame her IG cannot be accessed. I think it's going to be back when HS4 ends. She definitely has a pretty side and a few look-a-likes. She looks more mature with longer hair, it is not just because she is literally older.\n\nHer career may or may not be a dealbreaker for the guys.",
            "score": 9,
            "author": "Icy_Revolution_5200",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Her career may or may not be a dealbreaker for the guys.\n\n?? what's her career?",
                    "score": 2,
                    "author": "adailymishmash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;! Lawyer? Someone said, she was in another reality show about law students competing for an internship slot in a top law firm. !&lt;\n\nPossible spoiler so, I'm covering it.",
                            "score": 7,
                            "author": "rent-boy-renton"
                        },
                        {
                            "level": 2,
                            "comment": "I don’t think I am allowed to spoil it though. I imagine the guys would be sort of blown away or shocked when she reveals her job because she may not seem like it. She seems unassuming but I gather she would be able to handle the competition or the fact that she did not receive any text at the end of the first episode. \n\nShe is tougher than she looks. ig one of the reasons would be her career because it requires toughness especially mentally.\n\nGiven the jobs the other ladies have, Jumi’s is not an influencer or a model. I said “dealbreaker” because the guys may or may not be intimidated by it. And some guys just don’t go for someone who they are intimidated by.",
                            "score": 7,
                            "author": "Icy_Revolution_5200",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hmm intriguing! My ears did perk up when one of the panelists asked the others if they really didn’t recognize her so I figured she must be some kind of public figure",
                                    "score": 4,
                                    "author": "adailymishmash",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, glad you noticed that. When I heard it, I thought they would add more to it...\n\nBut if you really want to know her job or career, I suggest you watch the Heart Signal 4 YouTube channel because they uploaded one with clips of Jumi from the first episode and towards the end of the video, you would know the answer because they added something there. \n\nOr you can just search for her Korean name on YouTube and you would see some search results with hundreds of thousands of views.\n\nAnd she has some sort of following after it because they like her personality.\n\nShe is not a tv personality, but she did appear on tv for a show before (4 yrs ago) and it has something to do with her professional job.",
                                            "score": 6,
                                            "author": "Icy_Revolution_5200"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I knew Lee Ju Mi's career, too, but I'm not going to spoil it either.",
                                    "score": 1,
                                    "author": "Sza_Azs"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like people aren’t liking jumi because of the kitchen scene but I kinda understand where she’s coming from. I wouldn’t like someone just towering over me as I cook / chop onions and I’m sure she just wanted her own space! It’s also a small nudge to the girl to help out instead of watching them! \n\nI’m not liking anyone this season personally which is a shame cause I usually do! \n\nJimin knows she’s pretty and I feel like she’s going towards the jeonjihyun persona and she’s turning me off so far. \n\nThere’s always that one cute bright girl in these things and jiyoung just happens to be that girl again. \n\nI’ll just have to keep watching to see if I’ll change my mind but so far not a fan of the guys either….",
            "score": 7,
            "author": "dumplingkisses",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree. I would have reacted the same as Jumi, I really dislike people (that i'm not close with) watching me do stuff like that, it just makes me feel uncomfortable/watched. She was politely nudging her to find something else to do.",
                    "score": 0,
                    "author": "jxyzhu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Am I the only one who thinks this? But Lee Jumi reminds me a whole lot of Joo E from Momoland. Both their names are so similar too. Maybe it's the eyes and smile?? Honestly, when she walked into Signal House, I literally thought Lee Jumi looked so familiar like I'd seen her before somewhere. I just want to know if anyone else thought they resemble each other?? Am I crazy? haha",
            "score": 3,
            "author": "KoalasAreKuddly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jumi looks so familiar but I can’t put my mind to it.",
                    "score": 4,
                    "author": "ttam23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sojin from Girls Day?",
                            "score": 5,
                            "author": "almondmilkeu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sojin is the first person that came to mind when I saw Jumi. They're soooo alike! Especially their mouth areas",
                                    "score": 4,
                                    "author": "Kim87e",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "u/Kim87e oh my gosh, you are right! I wonder if she is related to any kpop idols haha",
                                            "score": 2,
                                            "author": "KoalasAreKuddly"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As for me, she also looked just a little bit as girl from Kara, but I dpn't remember her name.",
                            "score": 1,
                            "author": "Kimtaesty94"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "she looks like a mix of han ji min(her eyes mainly) and jooe and a little bit of sojin",
                    "score": 3,
                    "author": "PuzzledWarning"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mingyu is so my style. He reminds me of a main lead in a japanese drama lol",
            "score": 3,
            "author": "ayokonanyeta"
        },
        {
            "level": 0,
            "comment": "very underwhelming cast compared to season 2 and 3. I guess i will drop the show for now",
            "score": 8,
            "author": "MastaKilla_88"
        },
        {
            "level": 0,
            "comment": "After the first episode Min Kyu and Joo Mi are my favorites. They’re both really calm. Hope they end up together.",
            "score": 4,
            "author": "Seiiiainee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too. I like Joo Mi. Min Kyu is like a mysterious type of guy.",
                    "score": 1,
                    "author": "Infjgirlph"
                }
            ]
        },
        {
            "level": 0,
            "comment": "0.5% rating?\n\nWhat happened?",
            "score": 2,
            "author": "Sunasoo"
        },
        {
            "level": 0,
            "comment": "I’m halfway through episode 1 but why is Min kyu smelling everything now lol the onion now too I can’t! He just smelled the onion and bolted. 😂",
            "score": 2,
            "author": "linguistca"
        },
        {
            "level": 0,
            "comment": "Anyone know where in Korea are they shooting? I saw a few shots of the hanok village that they mentioned. I'm curious about the area...",
            "score": 2,
            "author": "wunderkidchaos"
        },
        {
            "level": 0,
            "comment": "Guys, let me know if you want to ask around for the Korean release and also the Viki/VIU/etc. release in case the audio (and maybe scenes) are different. Heart Signal 4 will finally release in just a few hours.\n\nHopefully if the bounty/etc. is set, the people that are getting it are able to stick with Heart Signal 4's release schedule, so like early morning or just before noon (New York Time) of Wednesdays. Or for the English/etc. subtitles if it's not simulcast, then 6/12/24 hours later.\n\nSome people will probably post the links and so on later though, so it's just for those of us that are in certain groups or communities and want a clean and fast schedule. \n\nBecause sometimes people will spoil the whole episode before the subtitles are up, lol. And so the faster we get it, the less chance of being spoiled if we somehow can't avoid the discussion threads and like social media posts about Heart Signal 4, lmao.",
            "score": 1,
            "author": "MNLYYZYEG"
        },
        {
            "level": 0,
            "comment": "im sorry but jimin is such an attention seeker what. is it just the editing or is she making this out to be a competition of who can get the most attention from the guys.\n\nanyways love jiyoung and joomi",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "what are you talking about? all the girls were tense and competing, why do you single her out? she came in the latest an only had a little time to get to know the guys, when the other girls were there an hour plus. watch the show back they were waiting for hours thats why one of them said when the last person comes we should make dinner right away. She had to cover ground and get the guys familiar with her and interested otherwise she would be the odd one out. I respect that she was strong willed and a go getter she could have crumbled when she got no votes but instead decided to give 110 percent effort. I hope she doesn't get bullied online because people need a villain to hate.",
                    "score": 20,
                    "author": "NoviDon07",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I strongly agree with all your points.",
                            "score": 6,
                            "author": "Sza_Azs"
                        },
                        {
                            "level": 2,
                            "comment": "100%. Each of the girls are competitive in their own way, it’s just that she’s the most blatant about it. And as you say — why shouldn’t she? She’s not throwing anyone under the bus and she’s had the least time to make an impact. Just because her facial expressions are a tell-all and she’s more overt doesn’t mean she needs to be singled out — Jiyoung’s nose scrunch and Jumi’s poised long looks are just as much of a weapon.",
                            "score": 11,
                            "author": "wishawisha"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Okay, so 1 more hour (actually 40 minutes now) until Heart Signal 4 release!\n\n**It looks like the Heart Signal (하트시그널 라비티비) channel is releasing Episode 1 in full (part of the title says \"Full vod\" but it will probably have no English subtitles) on Youtube, there's a wait for a livestream right now: https://www.youtube.com/watch?v=7N1wIfMvg_o**\n\nThere's also some wait for a commentary stream here too: https://www.youtube.com/watch?v=JRuQmQUKLvQ\n\nFor those that are economically/regionally/et cetera restricted, just wait several hours after every Wednesday morning for the next 14 weeks or so and Heart Signal 4 should be available. This is a highly anticipated show, so it'll probably be everywhere.\n\nUsually for the Korean and Japanese dating shows, they only release the 1st episode or so on Youtube for free (almost always without English/etc. subtitles). \n\nCheck the ABEMA channel (ABEMA 恋愛【公式】, https://www.youtube.com/@Love_ABEMA/videos) on Youtube for the Japanese dating shows like Heart Signal Japan, Romance Before Debut (ロマンスは、デビュー前に。), Shuffle Island (シャッフルアイランド), et cetera. \n\nUnfortunately Viki/VIU/etc. never pick those Japanese shows up, like in general nobody really subtitles the Jdoramas and Japanese variety shows, so it's hard to access the content.\n\nHeart Signal Japan from the ABEMA Youtube channel: https://www.youtube.com/watch?v=u2DWOkvRPRQ\n\nBut for the Chinese dating shows from YOUKU, iQIYI, WeTV/Tencent Video, etc. they will often have the whole season for free on Youtube but with decent enough or often machine-translated English subtitles. Or sometimes they won't have English subs and so you have to use Youtube auto-translate from Mandarin/Vietnamese/etc. to English/your desired language.",
            "score": 0,
            "author": "MNLYYZYEG"
        },
        {
            "level": 0,
            "comment": "Lmao Jiwon being like fromis_9 Megan with the ease.\n\nFlovers, we only need to wait 3 more weeks for the delayed Unlock My World album.\n\nAnd now the featured short-haired girl arrives, Jiyoung.\n\n10 000 people in the livestream right now.\n\n---\n\nJimin after the votes for initial texts: okay. Rofl, 13 000 people in chat lost it, crazy.\n\n---\n\nHoly shit, the OTP couple (&gt;!https://www.youtube.com/watch?v=95SLY5leyZE&amp;t=69s!&lt;) with the feeding. So that's how it happened, she kept meeting his eyes in the beginning, wow.\n\nCalled it two weeks ago, OMG: https://www.reddit.com/r/koreanvariety/comments/139bd4a/heart_signal_4_second_teaser_video/jj1upfq/\n\n---\n\nThe fire made them call Jun Ji-hyun. Is this the Kingdom of Ashin of the North. Nae style.",
            "score": 1,
            "author": "MNLYYZYEG"
        },
        {
            "level": 0,
            "comment": "Okay, Episode 1 is finally finished, there were like 15 500 to 16 000 people in the Youtube livestream/premiere from the Heart Signal (하트시그널 라비티비) channel. People kept asking for Heart Signal 2 Hyunwoo, Heart Signal 3 Euidong, and like Single's Inferno 2 Dex/Jinyoung, rofl.\n\nWow, so that wasn't what I expected. Like the girls were more proactive and it was much more jovial compared to Season 3's beginning and overall atmosphere. The girls this season also got some of that somewhat direct tension/conflict between each other already.\n\nI actually preferred the slow burn of Season 3 instead of this somewhat fast-paced Season 4. But this is going to be a hit for those that like that type of sorta hurried tempo. Gonna miss that more slice of life or idyllic cinematography and such elements though.\n\n---\n\nKim Eana is consistently the best visual in the Korean version of Heart Signal. Kinda wild how that's the case still, Kim Eana needs to write a song about Heart Signal. Like I said a few times before, imagine if Hyojin, Taeeun, Suji/etc. from Love Catcher in Bali (러브캐처 인 발리) were cast for Heart Signal 4 instead, just wow.\n\nAnd then if Jeonghyeon was competing with Mingyu and Jiwon of Heart Signal 4. That would've been undoubtedly the best initial housemates.\n\nAnd fam, why didn't the PDnims ask Karina to be part of the panelist team. Karina is literally ulzzang with Jimin, wtf. Imagine if SM didn't have that HYBE/Kakao/Lee Sooman/etc. struggle and delayed the comeback of their artists, aespa would've actually had their first full album instead of just another mini album and Karina would've had free time to be on Heart Signal 4.\n\nKarina is mad chaotic sometimes (https://www.youtube.com/watch?v=GDJgn7A7SRs&amp;t=323s), like Jimin, lol. They the same name. \n\nThe OTP couple seems locked right in the beginning, that's kind of wild since it's the girl that took the initiative. Usually it takes a few more episodes before it materializes, but yup, those two are going to continue with their constant skinship and flirting. Even if they are still entertaining other options. It could be a red herring though, you never know how the catfishes will display themselves.",
            "score": -2,
            "author": "MNLYYZYEG"
        },
        {
            "level": 0,
            "comment": "Is it out on VIU?",
            "score": 1,
            "author": "Spartandemon88"
        },
        {
            "level": 0,
            "comment": "I just watched episode 1 and looked for comments. There's a lot in myasiantv and a lot of disqusers in the comment section is not very fond of Kim Jiyoung. She knows she's cute and pretty and it's the truth, there's nothing wrong with that. Honestly, I like the three women participants, they make a good dating show, being proactive in the beginning. Among the guys, I have to give it to Gyeo Rye for being proactive. (There's nothing wrong with taking time too.) The first episode is quite intense already, the kitchen psychological battle was brutal. \n\nI know Heart Signal has this competition among the panel but I do not like how they overthink every move of the participant, it's like watching shipping videos on YouTube.😆 Anyway, KSY is one of the panel, he did well in Sum+fing. He was hilarious in that one. \n\n&gt; [*spicy*](https://www.youtube.com/watch?v=Os_heh8vPfs) controversies/et cetera\n\nBTW I love how you incorporated that link!",
            "score": 1,
            "author": "gCellAtWork"
        },
        {
            "level": 0,
            "comment": "**In the meantime maybe watch other Chinese/Japanese/Korean cohabitation/dating/romance/slice of life/etc. reality shows and Kdramas, East Asian films, et cetera**: https://www.reddit.com/r/terracehouse/comments/13dfyum/bring_them_back_please/jjlijqw/ and https://www.reddit.com/r/koreanvariety/comments/12qlu3e/its_just_my_impression_or_the_are_really_few/jgqusuv/ and https://www.reddit.com/r/koreanvariety/comments/12ccjku/can_someone_give_me_a_list_of_korean_variety/jf16a56/\n\nMore direct link and overview of the shows similar to Single's Inferno (Heart Signal needs to be in international Netflix instead of just Netflix Korea for more discussion, lol): https://www.reddit.com/r/koreanvariety/comments/102skks/nineteen_to_twenty_1920_a_new_netflix_youth/j2vkckf/ and https://www.reddit.com/r/koreanvariety/comments/13fm7qu/shows_similar_to_singles_inferno/jjx8kgv/\n\nThe wait for this new Heart Signal season is crazy. So much time passed.\n\nBy the way, Jaejae (재재) from 문명특급 - MMTG is hosting the production livestream right now with the panelists (and PD Park Cheol Hwan) of Heart Signal 4: https://www.youtube.com/watch?v=46UmvFNwi9Q",
            "score": -11,
            "author": "MNLYYZYEG"
        },
        {
            "level": 0,
            "comment": "Does anyone else think Ji Young and Hui-hyeon (from Change Days 2) seem similar? Like in the way they look at and “gently stare” at the guys. I’m getting that kind of vibe and I don’t know why. Maybe I’ve been watching way too many K dating shows. Lol",
            "score": 1,
            "author": "Educational_Grass_10"
        },
        {
            "level": 0,
            "comment": "I support Yoo Jiwon. Funny fact: I have already seen him on Instagram in running crew, but I don't remember which team. I want to find all those pictures...",
            "score": 1,
            "author": "Kimtaesty94"
        },
        {
            "level": 0,
            "comment": "If someone knows Yoo Jiwon's instagram, please give a hint. I want to find hisr running crew team. I definitely saw him somewhere. I want to check whether I am right or not...",
            "score": 1,
            "author": "Kimtaesty94"
        },
        {
            "level": 0,
            "comment": "Does anyone here rooting for Lee Joo Mi? I really like her but I feel like no guys will choose her. I don't know I hope I am wrong.. She seem a strong independent woman , like career-oriented.",
            "score": 1,
            "author": "Infjgirlph"
        },
        {
            "level": 0,
            "comment": "They always have that one cute/ “bright” girl who all the guys are head over heels over at first (the first love style) - seo jihye (s1), im hyunjoo (s2), park jihyun (s3), and now park jiyoung. Kinda tired of that trope now",
            "score": 1,
            "author": "Triggered-Snail"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha sorry, got carried away there since it was a livestream. Okay, cleaned it up a bit and joined comments together.",
                    "score": -6,
                    "author": "MNLYYZYEG"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wierd question here. I wonder if there is a fanfic about heart signal but with completly made up carachters?",
            "score": 0,
            "author": "Secure-Ad4436"
        },
        {
            "level": 0,
            "comment": "S\nMmm",
            "score": 0,
            "author": "Forsaken_Ground_1955"
        }
    ]
}