{
    "id": "13ktgh2",
    "score": 58,
    "title": "The Time Hotel - S01E10 [FINALE] (ENG SUB)",
    "author": "SharpShark222",
    "date": 1684401104.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/13ktgh2",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/koreanvariety/comments/12mw631/the_time_hotel_s01e014_eng_sub/),",
        "https://www.reddit.com/r/koreanvariety/comments/12sr84k/the_time_hotel_s01e056_eng_sub/),",
        "https://www.reddit.com/r/koreanvariety/comments/130f2xr/the_time_hotel_s01e07_eng_sub/),",
        "https://www.reddit.com/r/koreanvariety/comments/137f948/the_time_hotel_s01e08_eng_sub/),",
        "https://www.reddit.com/r/koreanvariety/comments/13eio99/the_time_hotel_s01e09_eng_sub/))",
        "https://old.reddit.com/r/koreanvariety/comments/723mtd/deleted_by_user/iajxd9k/?context=3)",
        "https://discord.gg/yY2P3DQR8S)",
        "https://files.catbox.moe/ophxsp.torrent](https://files.catbox.moe/ophxsp.torrent)",
        "https://files.catbox.moe/hqmb96.srt](https://files.catbox.moe/hqmb96.srt)",
        "https://baechusquad.download/other/"
    ],
    "postText": "The previous episodes: ([E1-4](https://www.reddit.com/r/koreanvariety/comments/12mw631/the_time_hotel_s01e014_eng_sub/), [E5-6](https://www.reddit.com/r/koreanvariety/comments/12sr84k/the_time_hotel_s01e056_eng_sub/), [E7](https://www.reddit.com/r/koreanvariety/comments/130f2xr/the_time_hotel_s01e07_eng_sub/), [E8](https://www.reddit.com/r/koreanvariety/comments/137f948/the_time_hotel_s01e08_eng_sub/), [E9](https://www.reddit.com/r/koreanvariety/comments/13eio99/the_time_hotel_s01e09_eng_sub/))\n\n# Streaming\n\nYou can view the episode on viu.com for free. If VIU is not available in your region you can use a VPN. Consider doing this to support legal streaming sites. If VIU is not available in your region and you can't use a VPN, you can use GoPlay. For VIU content, you will need to install a chrome extension, but you will get full quality ad-free streaming. View their [info post](https://old.reddit.com/r/koreanvariety/comments/723mtd/deleted_by_user/iajxd9k/?context=3) or join [their discord](https://discord.gg/yY2P3DQR8S) for more details.\n\n# Episode\n\n* Episode 10\n   * Magnet: magnet:?xt=urn:btih:b523d29f9ebd2ce24e88cb9f46c6625559281b2f\n   * Torrent File: [https://files.catbox.moe/ophxsp.torrent](https://files.catbox.moe/ophxsp.torrent)\n   * Subtitles: [https://files.catbox.moe/hqmb96.srt](https://files.catbox.moe/hqmb96.srt)\n* Episodes 1-9\n   * If you don't feel like going through the old reddit posts, all our resources are on [our site](https://baechusquad.download/other/#the-time-hotel).\n\n# Synopsis\n\nThe Time Hotel is a novel survival program where 10 guests must survive in a hotel in which they must buy everything with time instead of money. The moment they run out of time, they are checked out.\n\n# Cast\n\n* Chloe (Idol, Member of 'cignature')\n* Hong Jinho (Former Pro Gamer, Poker Player, Winner of 'The Genius')\n* Hwang Jeseong (Comedian)\n* John Park (Singer, Dreamboat)\n* Joo Eonkyu (YouTuber, Creator of 'Sinsaimdang')\n* Kim Hyunkyu (Actor)\n* Kim Namhee (Announcer)\n* Layone (Rapper)\n* Monika (Dancer, Leader of 'PROWDMON')\n* Shin Jiyeon (Student, Cast Member from 'Single's Inferno')",
    "comments": [
        {
            "level": 0,
            "comment": "I really enjoyed the ending snippets especially with the hotel manager 🤣🤣",
            "score": 31,
            "author": "Substantial-Rich1981",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can't believe he actually quoted Jang Dongmin 😆😆",
                    "score": 7,
                    "author": "hasajang"
                },
                {
                    "level": 1,
                    "comment": "Loved the snippets! I was cringing-laughing with the hotel manager LOL",
                    "score": 4,
                    "author": "moretoachieve"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't like the idea of having arithmetic games back to back especially the one that was reused. \n\nA deserving winner, indeed.",
            "score": 23,
            "author": "pantamy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't get how so many people in this thread are acting like number 3 is an arithmetic game and not a memory game with a tiny arithmetic component\n\nYou don't have to calculate anything at all, you just grab the biggest number, it's not like game 4, the whole point is that you need to remember that to win. there's arguably more mental arithmetic required in Gold Silver Bronze but you wouldn't call that an arithmetic game",
                    "score": 10,
                    "author": "Alex_Rose"
                },
                {
                    "level": 1,
                    "comment": "Exactly my thought, if they already had some games ideas from the genius, they could have done more.",
                    "score": 1,
                    "author": "hwudin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which game can they use from The Genius? I've watched 3 episodes and the games are bad.",
                            "score": 1,
                            "author": "st_arch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you keep watching the genius, there are games that's not dependent on alliances but individual skills. Especially the main games, mostly of those are really good.\n\nThe time hotel have some games pretty similar to The Genius like the first game of the final, the first kairos game,... They also took some ideas from existed game with minor changes like the drug king game, they had a board game for deathmatch too",
                                    "score": 1,
                                    "author": "hwudin"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;A deserving winner\n\nAgree on the winner, just poor planning on the games for a \"finals\" episode.",
                    "score": 2,
                    "author": "moretoachieve"
                }
            ]
        },
        {
            "level": 0,
            "comment": "damn, what a deserved win, WP",
            "score": 16,
            "author": "jasontang69"
        },
        {
            "level": 0,
            "comment": "Not surprised by the winner, he did consistently well throughout the show, and the final game was definitely up his alley. Well deserved win indeed. Like many others have commented, I’m not a fan of repetitive games and the emphasis on arithmetic skills in the finale - but all-in-all the Time Hotel has been an incredibly fun watch.\n\nThat ending with &gt;!Kim Junghyun!!!&lt; Hoping they return bigger and better with improved games in S2 (if it happens)!\n\nEdit: also, Jinho &gt;!saying he was used to losing in the finals!&lt; took me out HAHAHA",
            "score": 15,
            "author": "michielim",
            "replies": [
                {
                    "level": 1,
                    "comment": "HAHA yes, forever &gt;!Number 2! Jinho is usually not great at math/aritmetic games, so I didn't expect him to win anyway, once the games began.!&lt;",
                    "score": 11,
                    "author": "haveninmuse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ok.. Genius manager lady OR time hotel Manager gentleman?\n\n:D \n\nsometimes side characters also become such important main character",
            "score": 13,
            "author": "enigmatic_zephy",
            "replies": [
                {
                    "level": 1,
                    "comment": "hands down Manager Lady",
                    "score": 17,
                    "author": "kazuyoswitch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes yes yes",
                            "score": 1,
                            "author": "enigmatic_zephy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "**CHINGU-YAHHHHHHHH!!!**\nHong Dealer is the best hahaha.",
                    "score": 12,
                    "author": "ronnietp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "agree agree",
                            "score": 1,
                            "author": "enigmatic_zephy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No one can beat the 1972 Miss Changwon-do Runner up Hong Jiyeon-nim!",
                    "score": 5,
                    "author": "sirpeepojr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "WAIT.. She was in a beauty pageant???.. super cool",
                            "score": 1,
                            "author": "enigmatic_zephy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yeah, but seems like not in the national level https://www.youtube.com/watch?v=R3DuTfevZ\\_0&amp;list=PLu2ktPP9TN3Hm8PI3gcdwE3bF8uwCjgVo&amp;index=21",
                                    "score": 1,
                                    "author": "sirpeepojr"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "also rabbit or bandage man?\n\nquestion as well. when the rabbit says \"GUN LOOOR\" and the subtitles read \"good luck\", is that just the hangul approximation for  \"good luck\" as an english loanword, or is it a completely different word that just happens to start with G and L? I don't get how a language that has d, k and u in it can end up with \"good luck\" becoming \"gun lore\"",
                    "score": -2,
                    "author": "Alex_Rose",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i LOVE THE RABBIT :D\n\nits like alice in wonderland for me!\n\non korean word, lol.. didn't even think about it",
                            "score": 3,
                            "author": "enigmatic_zephy"
                        },
                        {
                            "level": 2,
                            "comment": "i love the rabbit :)",
                            "score": 2,
                            "author": "enigmatic_zephy"
                        },
                        {
                            "level": 2,
                            "comment": "it's \"good luck\", written in hangul 굿럭 - however with hangul pronunciation rules kicked in\n\nnot sure the exact rule explanation but the process goes something like:\n\nㅅ(s) -&gt; ㄷ(d)\n\nㄷ(d) + ㄹ(l) -&gt; ㄴ(n) + ㄹ(l)\n\nㄴ(n) + ㄹ(l) -&gt; ㄹ(l)\n\n(please correct me if i'm wrong)\n\nso you end up with something that sounds like 'goonnuck' or 'goolluck'",
                            "score": 2,
                            "author": "whatdoyoumeanwhy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thanks a lot for responding to me instead of downvoting, I wasn't trying to diss hangeul, I am genuinely linguistically interested\n\n&gt;it's \"good luck\", written in hangul 굿럭\n\nthe first thing I don't get is why it's \"s\" instead of \"d\" at the bottom of the first jamo. when you said \"ㅅ(s) -&gt; ㄷ(d)\" do you mean that there's a rule where ds in loanwords just become ss? (but they're assumed to be pronounced like d nonetheless unless combined with things like ㄹ?)\n\n&gt;ㄷ(d) + ㄹ(l) -&gt; ㄴ(n) + ㄹ(l)\n\nthat part makes a lot of sense to me why the gudl becomes gunl\n\nalthough I still can't hear a \"k\" at the end, it sounds like \"gunloh\" to me rather than log/lok. maybe just my ear isn't good at picking up those subtle sounds though, it sounds a bit like an \"ng\" rather than a hard k/g, is that another pronunciation rule when you end with ᆨ?\n\nthankyou!",
                                    "score": 1,
                                    "author": "Alex_Rose",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah i'm not sure about the downvotes either - for this particular word there are multiple pronunciation rules happening at the same time so it's definitely more confusing than usual.\n\n&amp;#x200B;\n\n&gt;the first thing I don't get is why it's \"s\" instead of \"d\" at the bottom of the first jamo.\n\nIt's just the rule when english words get written in hangul that only certain characters can be used as the ending consonant. so in this case it's written as ㅅ/s instead of ㄷ/d or ㅌ/t. another example is 인터**넷** / inter**net**\n\nI think it has to do with how the pronunciation rules get applied to the hangul word afterwards. If you're only pronouncing this word alone, the ending consonant ㄷ ㅅ ㅌ ㅊ etc (there's a whole list) just all get pronounced ㄷ. however, this can change depending on the following word's starting consonant.\n\nfor example:  \n'것' -&gt; '걷' \n\n'것은' -&gt; 거슨 (you can see the ㅅ is not changed to ㄷ but instead takes the place of the ㅇ )\n\nthere are definitely more comprehensive websites which better explain these rules, although for me as a Korean language learner I find that through exposure you kind of just pick up/memorise certain patterns over time (another example: 꽃잎 -&gt; 꼰닙)\n\n&amp;#x200B;\n\n&gt;although I still can't hear a \"k\" at the end, it sounds like \"gunloh\" to me rather than log/lok. maybe just my ear isn't good at picking up those subtle sounds though, it sounds a bit like an \"ng\" rather than a hard k/g, is that another pronunciation rule when you end with ᆨ?\n\ni had to go back and listen to it again but the ㄱ in 럭 does get pronounced! just softer as opposed to a hard k/g.",
                                            "score": 1,
                                            "author": "whatdoyoumeanwhy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "thanks so much! I really appreciate the response, makes a lot more sense to me now. I didn't really think so much of it until Chloe who speaks perfect english joined in in the finale (start of e9) and said it the korean way, and then I was like.. wait so is this actually a loanword or a different word entirely. because often when bilinguals say loanwords they say it the english way. like john often drops an american accent in between korean words or says \"let's get it\"",
                                                    "score": 1,
                                                    "author": "Alex_Rose"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;!Congrats to John, absolutely the right strongest this season for this set of games, called it ages ago.!&lt;\n\n&gt;!I dislike the finale, a let down to have 2 arithmetic games back to back (and one of them being a dupe no less). I do think game 3 was made to bait 2 people into attacking each other, which was a smart move on producers' part since they'd obviously want to drag into round 4. Though if any of them had photographic memory it would not have worked.!&lt;\n\nBut the concept of this show was fun, the cast made it interesting, the set and props contributed to the luxurious/creepy atmosphere well, and I think it's a good show to start someone new to korean survival game shows with. The time as currency system was implemented well, as was the VIP suite. None of the games were as dismal as the early Genius S1 episodes' rock paper scissors deathmatch, for which I am grateful.\n\nA few iffy games however (didn't like the changes to Avalon, didn't like how physical the pins game was and to have them play it twice, didn't like that they had to bid for the right to decide order in the light switching game as it made it unfair, didn't love the auction game). I sound like I'm complaining, though I actually really enjoyed the show. I'm starting my sister off on this show, because it's an enjoyable and easy watch for someone newer to games and survival show mechanics.\nAs a Jinho fan, he was entertaining as usual. Looks like he was having fun. Living in the jungle has higher stakes I think, and he is more intense in the other show 😂 The JJJ trio were a ton of fun and them going against Eonkyu stirring drama was great to see. I'm glad season 2 is happening.",
            "score": 12,
            "author": "penguinn117",
            "replies": [
                {
                    "level": 1,
                    "comment": "hi which ep did they play avalon? :)",
                    "score": 1,
                    "author": "shibainuuuuu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "episode 5. they also played it in the genius season 3 episode 2",
                            "score": 1,
                            "author": "Alex_Rose"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Avalon change is actually rather common. Secret Hitler, Bang - just from the top of my head are board games that use that format.",
                    "score": 1,
                    "author": "Horium",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like those games on their own. It's the tiny change of needing 2 players to fail the quest in round 5 that seemed skewed.",
                            "score": 1,
                            "author": "penguinn117"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There will be s2? There is a teaser for s2 in the last few sec. Not sure who the guest is.. \n\nHopefully the game will get better with more variety in s2 with less repeating games.",
            "score": 8,
            "author": "rainbow1112",
            "replies": [
                {
                    "level": 1,
                    "comment": "That was Kim Jung-hyun!!! He played Seungjun in Crash Landing on You and the King in Mr. Queen!!! 😍",
                    "score": 7,
                    "author": "897687543217",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i'm stunned when see the ending...",
                            "score": 2,
                            "author": "shems-2383"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "With that teaser at the end, it means they planned to have multiple seasons from the beginning?",
            "score": 7,
            "author": "Hykha",
            "replies": [
                {
                    "level": 1,
                    "comment": "They literally redesigned the whole hotel/building just for this, may as well use it more. I had been expecting multiple seasons like The Genius from the start.",
                    "score": 16,
                    "author": "hwudin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh I didn't know, I thought they redecorated some building. Thanks for the info",
                            "score": 4,
                            "author": "Hykha",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "also, we have no idea when that teaser was filmed. It could've been filmed last week. If the show did good numbers after the first couple of episodes they would have had a good 8 weeks to get 1 person on board for season 2 and film a teaser even if it hasn't even begun filming yet",
                                    "score": 1,
                                    "author": "Alex_Rose"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mehhh the games were disappointing. I was reading the Korean comments yesterday when the ep came out and this was the consensus. Seems like the producers dumped loads of money for the hotel part but didn’t care to plan out the games. Bloody Game 2 and even the YouTube series Accomplice are better.\n\nMy positives were seeing Jinho and John Park play",
            "score": 23,
            "author": "roryn58",
            "replies": [
                {
                    "level": 1,
                    "comment": "I kinda expect they would do that &gt;!arithmetic games at final thus the ending was already anticlimactic for me.!&lt;\n\nMaybe if they play the third game first &gt;!it could be a better final or maybe they plan to play that last but John already took one win so they change the order around idk.!&lt;\n\nAnyway, bloody game 1 games were bad too, but this season so far is quite entertaining! So I still hope they make s2 and improve the games.",
                    "score": 8,
                    "author": "Yosu_92",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True, compare to BG2 seemed a bit unfair because the first season was bad. I hope they can learn from the mistake and make ss2. But I doubt that, BG is on MBC, they have the budget, even for low rating show, while this show is on TVING",
                            "score": 1,
                            "author": "cherry_pham"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I thought the games were okay. I always prefer the main games to death matches but this finale was way better than The Genius where they play Quattro or some rng bullshit. I like that they played 4 games and it was a good idea to put the memory game as game 3, since it was the easiest game to directly attack your opponents, and therefore it became really likely that the underdog would win because the two people with 1 point would mutually sabotage. well planned out imo",
                    "score": 4,
                    "author": "Alex_Rose"
                },
                {
                    "level": 1,
                    "comment": "Yeah, I was quite disappointed by the games, especially how repetitive they were. The players definitely played a big part in making the show entertaining, I'd say.\n\nBut then again I'm just happy to see Jinho so I'll take anything lol.",
                    "score": 5,
                    "author": "dearpacific"
                },
                {
                    "level": 1,
                    "comment": "What is Accomplice? Can you link it please",
                    "score": 1,
                    "author": "gazeintotheiris",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://youtu.be/c5JQp6xafqc",
                            "score": 2,
                            "author": "roryn58",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Appreciate that",
                                    "score": 1,
                                    "author": "gazeintotheiris"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "**Under the English common law, an accomplice is a person who actively participates in the commission of a crime, even if they do not carry out the actual criminal offense. For example, in a bank robbery, the person who points the gun at the teller and demands the money is guilty of armed robbery.**\n\nMore details here: &lt;https://en.wikipedia.org/wiki/Accomplice&gt; \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(delete)](https://www.reddit.com/r/wikipedia_answer_bot/comments/q79g2t/delete_feature_added/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot) ^(|) [^(GitHub)](https://github.com/TheBugYouCantFix/wiki-reddit-bot)",
                            "score": -1,
                            "author": "wikipedia_answer_bot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"It's not over until it's over\" - it was so cringe everyone can't hold their laugh",
            "score": 7,
            "author": "Fun_Design_7269"
        },
        {
            "level": 0,
            "comment": "Ep.10\n&gt;! If 2nd game is “Jinho Masterclass” then the final game is obviously “John Park Masterclass”. Pretty anticlimactic but it can’t be helped when you have one player who clearly excels in calculation compared to other two. I also don’t think there is anyone who can challenge John in this game (except probably Chloe and Namhee?) Still I’m pretty sure producers switch the game around to make the final more exciting. If Jinho wins Karma Nine, there is a high chance GSB rabbits game gets pushed to the final game instead. Well, I’m pretty glad John take the W here in the end as he clearly dominates the game since Ep.2 onwards. Put him in the new spotlight for me because his previous variety appearance like in Running Man makes him look a bit of a dumb character lmao. !&lt;\n\nI think people seems to not like how final games include games from previous rounds but I think it’s fine since in Genius finals every season also had a previously played game included into the mix too. \n\nFor the choice of the game, I agree a bit about having 2 arithmetic games back-to-back which clearly favors contestants with math skills to excel in this game more. (John could easily win the 3rd game if he didn’t get a miscalculation by choosing positive number instead of negative number.)\n\nThe main problem is the game designs. \n- Playing Avalon is fine but having only 7 people instead of 8-10 players with unbalanced role isn’t it. Unless the dealer gang is stupid, the cop team will lose probably 7-8 out of 10 times they played.\n- Having repetitive game again like Time is gold in the late stage of the game isn’t good especially involving strangers who can help or doom your game completely. Why should my game have to be destroyed by someone else not in the game instead of myself?\n- On-off game is fine to play but having a person to completely arrange the order of guessing makes the game being too lopsided. They should also have items for players in the beginning to sabotage the light on again during the round to make the game more interesting or a sabotage to hide the result of players if it’s success or failed to make later players more clueless in guessing. \n\nThere is also very little checkout games. With an opportunity to have 8 checkout games, there are only 4 of them (Ep.2,3,5,6) with 1 repeated game (GSB rabbit). So a clear target can be set on one person with no chance to redeem themselves or get revenge on some players on the opposing team. (Jiyeon/Chloe/Hyunkyu could choose 1 of JJJ alliance to give them some challenges.) \n\nAnyway, still pretty enjoyable show with clearly deserved winner who was on my radar since the 2nd episode as a dark horse but become a clear frontrunner after finishing first 4 episodes. I hope with Season 2, there would be multiple seasons and previous contestants get to join the game again. (As far as I know, Jinho/Jeseong/John should have some mileages in staying the hotel till the end so if they returned, they could use these mileages to their advantages.)\n\nThought it was over then I see Kim Jung Hyun and I go &amp;;!382’&amp;$;d!…not in a good way though. As a Sone, I clearly have a grudge against him. Hope he learns his lesson and sheds some new positive light. \n\nVery pleasure to have more shows like this and get to discuss with some people again after the ending of Genius. Jinho makes a comeback in this program and Bloody Game 2, having new interesting players coming into the scene. Hope Season 2 will be better with game designs because this concept have so much good potential.",
            "score": 5,
            "author": "ronnietp",
            "replies": [
                {
                    "level": 1,
                    "comment": "hi which ep did they play avalon? :)",
                    "score": 1,
                    "author": "shibainuuuuu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s Ep.5 the drug dealer game. Even though the characters are different, the setting is similar as same as the ability of special roles.",
                            "score": 2,
                            "author": "ronnietp"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;!John won fair and square, he had the most time too, totally deserved!&lt;. But the final was a bit disappointing, maybe it's because of &gt;!John's domination!&lt; in the final game, but for me the games themselves are not very entertaining.\n\nThe ending bonus scenes was a nice touch.\n\nI'm really excited for the next season, even more after &gt;!Kim Jung Hyun!&lt; reveal. But i had to say although the concept of this show is wonderful, the games are so unoriginal, repetitive and not that exciting, they need to change this really important aspect in the next season.",
            "score": 15,
            "author": "hwudin"
        },
        {
            "level": 0,
            "comment": "It's been so long watching this kind of game survival show again. In short, it's &gt;!decent, and cant wait to see the (possible) sequel. It's nice to see other fierce competitive women like Kim Namhee and Shin Jiyeon, and glad the PD cast them; fun to see Jeseong could share his comedic repertoire and went to the final with his 3-man alliance; fascinated to see John Park's new side; glad to see the man the legend 2nd placer Hong Jinho, might be a little bit rusty but still could maintain his places in games.!&lt;\n\nThe time currency might be the best part of the show. &gt;!I didn't expect John's careful spending, money-saving in the Bank and him winning games could affect his position a lot in the finals (game 3 and 4 are the proof). And vice versa, Jinho and Jeseong can only do a little with their limited time. AFAIK, The Genius' Garnet use only stops before the final. And this is why the Time is superior (in the currency context) because you have to play to win in the Time Hotel to sustain your advantages (besides the total pool prize) until the final.!&lt;",
            "score": 6,
            "author": "sirpeepojr"
        },
        {
            "level": 0,
            "comment": "Congrats to &gt;!John, it was a well deserved victory. Except for the first day, John was easily always the best player in the matches. Jinho made a valiant effort, but honestly he wasn't impressive in the show, other than dominating in that one final match game. Jeseong is objectively the worst player of the three, but he was still entertaining to watch.!&lt;\n\nTime Hotel has some good ideas compared to The Genius. I like how the player's time is used as a life bar, currency and prize money at the same time. I laughed when the players started hoarding all the water as well as Eonkyu's failure to keep track of his time. I think the Bank is a good idea, but most of the players didn't leverage it well.\n\nI also like the hotel format, it gives players a lot more opportunities to separate from others  and introduces games that require more running around. I do think they should at minimum provide water for free next time.\n\nThe biggest weakpoint is the inconsistency of the deathmatches. On paper I get the appeal, it introduces uncertainty and prevents players from intentionally losing (see Eonkyu). But I don't think it played out well, because of how the JJJ alliance dominated the show.\n\nAlso the final match was &gt;!a bit lame. Would have appreciated more variety and not so focused on arithmetic, maybe one that includes the guests like the first final game.!&lt;",
            "score": 5,
            "author": "Jwang19"
        },
        {
            "level": 0,
            "comment": "Okay wow, what a finale. I was pretty happy that the game design seemed pretty fair/skill-based to the end, I was worried things would get really weird and unbalanced, but &gt;!luckily it seems like the winner won because they were just so good at the games they won!&lt;.\n\nFor each of the finalists:\n\n* Jinho: &gt;!I was really happy to see him back in his element in a show like this after such a long break. I know some people will probably say Jinho just got lucky and played lamely, but I think his misfortune and fortune roughly balanced out and he proved that he still has that spark in him. It's unfortunate that he couldn't bring it home again, but he was probably the 2nd best in all of the games he didn't win, which is a testament to how reliable and varied his skillset is, he just couldn't beat John's analytical skills (if the final game was Otrio instead of the Lotto, I think there are good odds Jinho could've won). Personally I feel like Jinho's gameplay this season cemented him as one of the strongest players in these shows, with one of his biggest strengths being his social game. It's crazy how Jinho can come into a show as the clear favourite to win, almost never get targeted in the games (aside from one weirdo with odd priorities), and was consistently getting help from people with huge incentive to screw him over. Even in the first final game where he's such a favourite to win, people are so chill with him that they'll penalise his opponents despite his reputation.!&lt;\n* John: &gt;!Not much to say really, John was just a really impressive analytical player all around. He probably fumbled the social game a bit, but he was so calm and rational despite all his hurdles and that's quite an impressive trait in this game. I'd love to see him in other shows, since he seems like someone who would've been willing to make big moves under different circumstances and he's probably capable of tackling almost any type of game/format with his brain and maturity/attitude.!&lt;\n* Jeseong: &gt;!I was a little skeptical that Jeseong would be able to perform well, given how he kinda got lucky and had some big blunders at the start of the season, but I think Jeseong proved himself quite a bit with his performance towards the end, in how he seemed to really understand Time Is Gold, very niftily used his money in On And Off to protect his alliance, and his strategy in the 3rd memory game (even though his memory ended up failing him towards the end).!&lt;\n\nAll in all, very happy with this show.",
            "score": 14,
            "author": "SharpShark222",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know if it's luck or not, god saved Jin Ho from the death twice just to put him back to 2nd once again.",
                    "score": 9,
                    "author": "hwudin"
                },
                {
                    "level": 1,
                    "comment": "lady luck left jeseong despite his desperate attempt to turn the game for the last game",
                    "score": 5,
                    "author": "shems-2383"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats to John for winning, he deserved it being the only that's been consistently good throughout the show and made the biggest contribution in their alliance. Highlight of the show was jeseong's triple same cards. Overall the games were a bit underwhelming for a finals but it's not that bad.\n\nIs a new season confirmed with that ending? Anyone knows who that guy is?",
            "score": 5,
            "author": "Fun_Design_7269",
            "replies": [
                {
                    "level": 1,
                    "comment": "The guy is an actor! Kim Jung Hyun. Hes super famous for the kdrama Mr. Queen and Welcome to Waikiki. I have no idea if hes a genius or famous for games though.",
                    "score": 2,
                    "author": "haveninmuse",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it confirmed if he's a contestant for season 2 or is this like some kind of promotion only?",
                            "score": 2,
                            "author": "Fun_Design_7269"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lmao at &gt;!Jinho stealing the money at the end, extreme ways moment right there!&lt;",
            "score": 14,
            "author": "SharpShark222"
        },
        {
            "level": 0,
            "comment": "Unpopular opinion. After Eonkyu got eliminated, I feel like the show is not that excited anymore. It was pretty predictable that the 3-guys alliance will just keep advancing easily. Eonkyu gave a good fight, giving more dynamics to the story.",
            "score": 3,
            "author": "Superheadache",
            "replies": [
                {
                    "level": 1,
                    "comment": "Little bit late to the party but I agree. I didn't understand when I was reading episode 6 (I think) comments where people called him villain. Like what? I didn't see that much of this type of gameshow, but most of what I saw feature some kind of alliance. Which is logical when it comes to game tactics, but as a viewer it kind of gets boring as instead of free for all you are watching an episode hoping enough people will team up and risk betrayal just to beat the alliance.\n\nEon kyu was able to disrupt alliance when he singled out one person when it was 4 man alliance (I think it was Hyun Kyu) and making the game 4v3 in their favor and then was able to go 2v4 in that auction game. He then gave up because he had opportunity to fight HJH. And people act like he is villain when other 4 people grouped up and he was only one competent enough to do something and not just hope that he will be lucky not to be knocked out.\n\nHe was called villain. But why? Sure he lied, but it's not like this is real life. It's only and game. And if people make quick alliances because they were grouped in rooms better and one person is someone everyone wants to team up with, then what can you do?",
                    "score": 1,
                    "author": "TheNoFrame"
                }
            ]
        },
        {
            "level": 0,
            "comment": "and the whole design , rabbit.. different doors.. it was so alice's wonderland!",
            "score": 2,
            "author": "enigmatic_zephy"
        },
        {
            "level": 0,
            "comment": "this show is so fun to watch. Hwang Je Seong is blessed by the god of variety.",
            "score": 2,
            "author": "Sgrewrite"
        },
        {
            "level": 0,
            "comment": "The third game is really unfair. No tension at all and boring. Of course two previous winners will attack each other. Looks like they really made the players to  go for the 4th game.  \n\n\nThe fourth game is terrible. A reused-game without any modification at all. LOL  \nAt least they should increase  the difficulty, such as:  \n\\- No notes allowed, use brain only  \n\\- More difficult target numbers  \n\\- And so on\n\nAlso 2 arithmetic games of 4 games are poorly arranged and unfair since that benefits John. At least  they should include 1 physical game to make the genre difference between the games.\n\nConclusion, the final is not satisfying.",
            "score": 3,
            "author": "authrone",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even with no notes allowed, I think John can calculate all possible arithmetic in his head and still clearly edges out other two. That’s how good he is.\n\nAlso Jinho and Jeseong would probably be doomed more by having no notes for them at all.\n\nI kinda agree about having more than 6 target numbers but I think even with that John would still easily win. Anyway, I still think they should reset cards every single round to give players with bad cards more chance. I know Jeseong still wouldn’t have much chance but him having bad cards clearly eliminated him from contention.\n\nAgree that 3rd game is pretty boring and once Jeseong gets 90 and other two got 0. It’s almost over at that point and not much can be done. Should have played at least 3 big rounds with probably 9 rounds each and calculate a final sum score to make it more interesting.",
                    "score": 6,
                    "author": "ronnietp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Believe the final 3 players deserved their spots but I can't help thinking what if Chloe reached the finals. She would've been strong in all the 4 games and would've gave &gt;! John Park !&lt; a run for his money. If she was able to survive till the finals she'd have a good chance of winning it all. Anyway, if there's a second season I hope Chloe returns",
            "score": 4,
            "author": "chiarathepenguin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not sure why you think Chloe would've had a good chance of beating the winner in the games he won, those were some crushing performances and I don't think Chloe showed particularly strong skills in those areas lol\n\nEdit: I don't think Chloe was bad, but I have a very hard time picturing her being good enough to perform as well as the finalists lol",
                    "score": 0,
                    "author": "SharpShark222",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I disagree, I think she would have performed better than Jeseong in that Gyul Hap-like game. While speaking to the other guests, I think she mentioned she would be good at that game.\n\nI also wouldn't imagine her carelessly spending 6 hours.\n\nWith that said, I still think &gt;!John Park!&lt; would have still won the entire thing.",
                            "score": 1,
                            "author": "Jwang19",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well sure I can imagine her doing better than Jeseong at Gyul Hap and maybe the last game, but I wouldn't consider that as her having a good chance of winning it all",
                                    "score": 0,
                                    "author": "SharpShark222"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm mainly a fan of Hong Jin Ho, but hes notoriously not great at arithmetic games, so I'm not surprised at the ending.\n\nI enjoyed the show, despite the low quality games and looked forward to each ep. I hope the producers do better for S2!",
            "score": 1,
            "author": "haveninmuse",
            "replies": [
                {
                    "level": 1,
                    "comment": "the metagame was really good in this game, much more fun than the genius\n\nbut bloody game 2 has been having way better main games and death games than this. this one has had better death games than the first couple seasons of the genius, probably on par with s3+4, but the main games were worse. some of them were ass, actually. the gimmicky running game they played twice was ass. they played a badly rigged version of Resistance, ass, invent something new\n\nthe first game looked fun to play but didn't make good tv because the point scoring was constant and we didn't have access to the information so we couldn't observe any strategy going on, it was literally just an episode of \"now this person gets a point. now this person gets a point\". episode 2's game was tanked by the triple betrayal but wasn't great\n\nep 4 (the rps group game) was by far the best episode of the run, because of the metagame, but the game itself was heavily rigged towards a large team. bidding auction was kinda fun but not as good as the cube auctions in the genius\n\nbedroom game was complete fucking bullshit, just a game where alliances can just vote out who they want for free\n\nthey need to start planning games with the principle in mind that people will form alliances. break the teams up a bit more or divide them into teams, make things more individual or whatever, because watching people just pick a loser is really boring",
                    "score": 0,
                    "author": "Alex_Rose"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Such a boring game to end the season and another recycled game from The Genius. They should probably switch that betting game to be the last one. It doesn't stop the fact that it's another embarrassing level of play. JeSeong was completely clueless for the entire final. It tilts me so hard when Je Song and previously Eon Kyu blamed \"luck\" when they're just bad. &gt;!JinHo is pretty meh throughout the season. John Parkis well deserved though. It's so obvious that he's superior from the beginning of the show. !&lt;\n\nMy early judgement for the shows still holds. The lack of creativity from production and spectacular player who is capable of making big plays. Still, I quite enjoy this show and it's probably the closest show in quality to The Genius across the years. Up until Bloody Game 2 outclass it. Would love to see if they switch things up like Bloody Game if having another season",
            "score": 0,
            "author": "hourhandqq",
            "replies": [
                {
                    "level": 1,
                    "comment": "When you don't have a variety of numbers to make combination and your opponent does, and then you spend time to change to useful numbers and you get given the same number again, that is absolutely down to luck. Eon Kyu wasn't bad, he literally won the game, he lost the metagame, he beat jinho\n\nI agree JeSong had cards several times that could've won that he didn't use, but there were at least two occasions when Jinho straight up had 0 valid combinations, if he would've spent time he might've been able to win those rounds. But likewise he might've just received a bunch of dud cards. That is called bad luck\n\nJohn Park changing 2 cards and getting 2 cards including the exact 1/6 chance card he needed in the last round is good luck. I'm not saying he wouldn't have won anyway, obviously he played sick and would've won regardless of what happened, but pretending there isn't a luck component, especially in the case of EK who clearly had a significantly repeatedly worse draw than jinho and still won nonetheless is nonsense",
                    "score": 1,
                    "author": "Alex_Rose",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, I guess you are terrible at Maths if you have a slight thought of Eon Kyu wasn't bad.\n\nAlso, 5-1\\*6-3=43. It literally took 0 seconds for any normal people figure out, not even counting that 15 extra seconds. And JeSeong game could have completely saved by swapping new 4 cards\n\nAnd then, 5/5+6-1=6. To get rid of the big numbers. Even a secondary school kid can figure out all these within 15 seconds. He did it all wrong and slow. That's what you called BAD.\n\nThen 4\\*3x3-6=43. Final round 5\\^5/5-4=21. Only two rounds that JeSeong can't finish when his opponents can. And everything could have prevented if he and Jinho did previous rounds correctly. It doesn't took an Olympiad champ to easily figure out all these rounds faster than John. So yes, JeSeong is BAD. And it's embarrassing to blame LUCK.",
                            "score": 3,
                            "author": "hourhandqq",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have a physics degree. and yes I also saw the answer he needed when he tapped out after the time limit, but I'm not in a high stress situation. I didn't say they played optimally or didn't fuck up, I just said that luck obviously played a huge part considering EK was able to win when he had similar cards to jinho but ended up getting eliminated because it took him 10 exchanges to get non repeating cards. That's called bad luck. If he didn't repeatedly draw into the same card, objectively jinho would've been eliminated since he had the final expression and lost on time. Time he would've had if he didn't have bad luck. That is a matter of absolute objective truth, if you argue with that you are braindead\n\n&gt;So yes, JeSeong is BAD. And it's embarrassing to blame LUCK.\n\nI never said JeSeong wasn't bad, I was talking about EK",
                                    "score": -1,
                                    "author": "Alex_Rose",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now I know you are also BAD. No wonder you think EK is good lmao\n\n6-3\\*6x1=36   6/3+4-3=4. He missed 2 rounds which can finish within 10 seconds\n\n3-3+6=6. He couldn't even get the answer for the easiest question of all time, two fucking times in a row\n\n4x4+5-3=18 or 5x4+4-3=19.... He couldn't even fucking figure it out when had no time limit\n\n3x3+6+4=19 or 6x5+3+3=36...Again not hit the bell for a super easy question\n\nThe next question instead of getting rid of bigger number by 4x1\\*6-5=41 etc, he used small numbers to get an easier answer 19\n\n1+1+3+6/6=6. He couldn't figure out the answer and wasting the time to swap cards for no fucking reason again\n\n6-3\\*5+1=36 or 5+2-3\\*1=41. He is slow as fuck and didn't hit the bell\n\nThe next round he wasted time to swap cards like an idiot for no reason again. Cause no matter what numbers he got, there's no way he can get 41.\n\nSo there's at least 5 fucking rounds that he could EASILY score but didn't. No even counting another 100 mistakes. If that isn't BAD, I don't know what is. It's a straightup fact that EK is an EMBARASSMENT\n\nAlso, cut the bullshit of pressure and stuff. He had well sufficient time for every single round because Jinho was weak and slow as fuck",
                                            "score": 2,
                                            "author": "hourhandqq",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I lecture dynamics at the university of applied science vienna and you are trying to impress me with your ability to do primary school maths. All you've shown about your intellect is you actually think being able to do arithmetic with numbers below 7 is notable, and care so little about your own time that you spent 10 minutes rewinding vlc to re answer keystage 1 maths questions. I can only assume you have never achieved anything in your life if this is a source of pride for you\n\n&gt;Also, cut the bullshit of pressure and stuff. He had well sufficient time for every single round because Jinho was weak and slow as fuck\n\nyes, okay, midwit redditor, you are so superior to a top professional poker player, rts gamer and genius winner. once you enter secondary school, maybe you will discover probability and understand that it clearly factored into both games. No one said \"they had impossible numbers\" or that they are gods at the game, just that luck demonstrably changed the outcome of the game",
                                                    "score": 1,
                                                    "author": "Alex_Rose",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "lmao, someone is malding because losing an argument. Literally as embarrassing as Eon Kyu. No one give a fuck who u are btw. You are an insufferable idiot who can't think and incapable to give any counter argument of how Eon Kyu wasn't bad. That's all we care",
                                                            "score": 1,
                                                            "author": "hourhandqq",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "are you still here?",
                                                                    "score": 1,
                                                                    "author": "Alex_Rose"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I dont mind repetitive games but the final could use rules change. Maybe, the numbers for last game will be reshuffle every 2/3 rounds. All 3 stucked a few times. Item price can cost 1h.",
            "score": 1,
            "author": "st_arch"
        },
        {
            "level": 0,
            "comment": "So happy with the winner, congrats!! 🥳🥳🥳",
            "score": 1,
            "author": "jellybeans6173"
        },
        {
            "level": 0,
            "comment": "A deserving winner indeed. But I do not like how they recycle the same games over and over.",
            "score": 1,
            "author": "blackandwhite22"
        }
    ]
}