{
    "id": "13pfr9b",
    "score": 14,
    "title": "[Bloody Game 2] Division in the Wild Team! Ep 9 &amp; 10 preview",
    "author": "sera27272",
    "date": 1684821788.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/13pfr9b",
    "media_urls": [
        "https://www.reddit.com/r/koreanvariety/comments/13pfr9b/bloody_game_2_division_in_the_wild_team_ep_9_10/"
    ],
    "other_urls": [
        "https://www.youtube.com/watch?v=lel5yWU8kaw&amp;ab\\_channel=%EC%97%A0%EB%9A%9C%EB%A3%A8%EB%A7%88%EB%9A%9C%EB%A3%A8%3AMBC%EA%B3%B5%EC%8B%9D%EC%A2%85%ED%95%A9%EC%B1%84%EB%84%90"
    ],
    "postText": "**What happened between Dex and Xitsuh?** \n\nhttps://www.youtube.com/watch?v=lel5yWU8kaw&amp;ab\\_channel=%EC%97%A0%EB%9A%9C%EB%A3%A8%EB%A7%88%EB%9A%9C%EB%A3%A8%3AMBC%EA%B3%B5%EC%8B%9D%EC%A2%85%ED%95%A9%EC%B1%84%EB%84%90",
    "comments": [
        {
            "level": 0,
            "comment": "Papago translations:\n\nDex: Are you serious? That's what you’re going to do? To be honest, it's natural for someone to sacrifice and someone to benefit from team play.\n\nXitsuh: While playing the game, I felt a bit disappointed with the Jungle team. I’m here to play a survival game, I’m not here to protect them.\n\nDex to Yunbi: the atmosphere is a little weird.\n\nYunbi: He's not a sacrificial team player. It's a team play disguised as an individual play.\n\nYunbi interview: I intend to ignite the embers of the conflict between XS and Dex.\n\nHyunji: I want to make XS and Jinho drop out today\n\nJinho: I got so mad watching them. Today, Dex and HJ... were upsetting. I’m just going to work hard. Ah, it’s really hard today.\n\n&amp;#x200B;\n\nThey literally captioned Yunbi with: the **devil’s whisper** that incites division LOL. I know it was bound to happen but I wasn't expecting it to happen this soon. I was looking forward to more team plays and I was hoping for a similar outcome like in Time Hotel where the alliance went until the finals but I guess there's nothing that can be done if the game is an individual one.",
            "score": 12,
            "author": "moretoachieve",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let’s hope the trailer is a misleading one and we see a totally diff outcome lol",
                    "score": 8,
                    "author": "Keymera94"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dex said in an interview, this season alliance keeps changing. This is going to be fun, but also sad.",
            "score": 10,
            "author": "sera27272",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably realised he's going to be targetted a lot more as a weak link and if he isn't more proactive, he's going to keep going up for eliminations.",
                    "score": 6,
                    "author": "tinhtinh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Knucks also had a reaction for ep. 7-8 with Jinho, Xitsuh and Yunbi:\n\nhttps://www.youtube.com/watch?v=U9LpaOR5sZk\n\nAlso someone made a montage of Bloody Mansion cats :\n\nhttps://www.youtube.com/watch?v=yW2LaCnbfc4",
            "score": 11,
            "author": "azekeP"
        },
        {
            "level": 0,
            "comment": "Def some kind of falling out has happened judging by the promos. I knew this day would come but sadddd. Hope no one’s eliminated from this group coz there are other less deserving ppl in the house.",
            "score": 8,
            "author": "Keymera94"
        },
        {
            "level": 0,
            "comment": "Has anyone done the thing where they pick through the scenes for the next episodes to figure out who gets eliminated in them? I remember people being pretty accurate with those.\n\nAnyways, everyone is wearing different outfits between the first and second part of the preview. I didn't see Pi in the second part of it, though. Hopefully she's eliminated... I feel like she has the potential to get far with the \"anyone but me\" strategy.",
            "score": 5,
            "author": "profdietcola12",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's some more indepth analysis that's been done to predict future eliminations/twists, the main big spoiler we can deduce is that &gt;!Knucks, Yurisa, and (I think) Jimin return to the house at some point, which seems to probably indicate some kind of \"Phantom Player guest game.\" This is going to happen in one of the next 2 episodes based on the clothes seen in the recent trailer!&lt;.\n\nOn a more surface level, I believe we know that &gt;!either Seungjin or YunB is eliminated next. Everyone else can be seen in at least 2 more outfits that we haven't seen yet!&lt;. Unless someone can correct me. However, it is important to note that the first spoiler would &gt;!make analysing outfits not very helpful, since hypothetically someone could get eliminated then come back again another/the next day in a new thing. So that might throw a lot of deductions out the window!&lt;.",
                    "score": 7,
                    "author": "SharpShark222",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am fine with any of these potential eliminations and twists. They sound great.",
                            "score": 3,
                            "author": "profdietcola12"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My (could be totally offff) prediciton based on the previews and their personality/gameplay:\n\nIn ep 9 \n\nChulgu probably started making decisions for his own benefit in the main match instead of taking a risky move for the team (In the video Dex argued to Chulgu that it's natural to take risk/sacrifice in teamplays while Chulgu think it's natural to break apart now since it's an individual survival match now not the wild)\nHong Jinho seems to be neutral. But then leaned more towards Chulgu since he understands the nature of such shows and is perplexed as to why Dex is mad over such a thing.\n\nThis started the split probably.\n\nIn ep 10 \n\nHyunji starts planning to play individually too and sets out the day targeting Chulgu and Jinho, well she's got enough reasons to do so. I think Hyunji's motive is more broad including them being a threat in general. Dex's reason for following along is probably somewhere along the line of LOYALTY BETRAYYY WHY. \nJinho is probably disappointed/sad that Dex and Hyunji is targeting him (&amp;Chulgu) since he doesn't consider what Chulgu (w his support) has done to be betrayal. \n\n\n\nI could be totally off and they just straight up betrayed each other like savages but oh well.\n\nMy thoughts: I'm just hoping Kong survive another week lol. Half of the time he also seems to be just confused by the 'kids' antics and it's funny haha.",
            "score": 7,
            "author": "yellowbat30"
        },
        {
            "level": 0,
            "comment": "can anyone who understands it give some context or quick summary?",
            "score": 2,
            "author": "Fun_Design_7269"
        },
        {
            "level": 0,
            "comment": "Noooooooo",
            "score": 1,
            "author": "meemeemeemeep"
        }
    ]
}