{
    "id": "141010z",
    "score": 11,
    "title": "The games of Bloody Game/ Game of Blood",
    "author": "Crazy_Albatross8317",
    "date": 1685934022.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/141010z",
    "media_urls": [],
    "other_urls": [],
    "postText": "\\*\\*This is something that I could have just commented on the most recent episodes but I think spoiler-free discussions about the actual games deserve their own thread\\*\\*  \nI think the PD had a great concept to work with but they didn't really implement it in their games (betrayals and backstabs is the opening intro for this show, at least for season 1). I understand that it is hard to design games but they should look back to The Genius games where the games are designed to be played in teams BUT there are loopholes for an individual to win by sacrificing the team to the other team or individual games where having partners give you an advantage (I think for the most of season 2 these are the majority of games).  Honestly they should just ripoff Liar Game games or get permission or something lol.  \n\n\nI guess I'm just disappointed that there aren't a lot of twists or sabotage and betrayals as advertised compared to season 1. Everyone was so focused on Wild Team vs Mansion Team",
    "comments": [
        {
            "level": 0,
            "comment": "The repeat games are bad, but I also agree the games themselves leave you wanting more. All of the games so far have required politicking and creating an alliance. It's the same format every time where it's just one team vs another. There's not much room for standout individual play. The cast also gets way too butthurt about betrayals of any sort so they target people who try to play the game in a unique way. Most of the interesting people have been eliminated at this point. Boring cast + boring games = boring show at this point. There's no more mystery but a lot of unanswered questions like wtf was the point of the dungeon, what's the point for phantom players to even compete",
            "score": 3,
            "author": "merchseller",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;told \n\nTrue I think the wild cards Yurisa and Jimin got kicked out too quickly. I also agree with you that after they released all their hidden mechanics and twists too early in the season (ep 4 revealing hidden team and mansion takeover, ep 5 the dungeon twist + phantom player twist, etc.) all the excitement fades and everyone focuses on the main games and that is when people realized the games were crap.",
                    "score": 4,
                    "author": "Crazy_Albatross8317"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The repeated games are a big misstep imo. Original black and white was a fine game; the repeat game was a majority rule game with gray dominating. There seems to be a real lack of game loopholes that allow betrayers/schemers to make flashy individual plays because so much of the game control relies on alliance numbers and manpower. \n\nI'm willing to forgive the repeat games if this was purely done because of &gt;!Jinho's accident!&lt; but it seems unlikely.",
            "score": 6,
            "author": "gazeintotheiris"
        },
        {
            "level": 0,
            "comment": "Agreed something I’m missing from this show is that they aren’t forced to be working with others. Like they aren’t given roles/divided in teams in the games where they have no choice but to abandon their alliance. Instead, they just make their own teams and can stick to their alliance till the end.",
            "score": 4,
            "author": "charrrlychee"
        },
        {
            "level": 0,
            "comment": "Bloody Game isn't the genius, they are not focused on the games but a good mix of games and social and psychological plays. They are more focused on creating drama and betrayals which has worked for them so far.",
            "score": 2,
            "author": "HuntMore9217",
            "replies": [
                {
                    "level": 1,
                    "comment": "First of all thanks for stating the obvious, but if they are advertising their show as full of backstabs, twists, and drama it would work better if their games also took advantage of that. I said they need to look for inspiration at past work I didn't say they have to recreate the genius.  \n\n\nFocused on what betrayals? All the drama is just them targeting each other before the game even starts. Season 1 was better in terms of social and psychological warfare because initially there were 3 teams and the betrayal went back and forth the three teams.",
                    "score": 3,
                    "author": "Crazy_Albatross8317",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Focused on what betrayals?\n\nAre we even watching the same show? jinhyeong just betrayed yunbi and eliminated him lasst week\n\n\nAnd you want\n\n&gt; The Genius games where the games are designed to be played in teams BUT there are loopholes for an individual to win\n\nBut wants them to just rip off liar game which is contradictory cause anyone who actually read the manga knows you needed allies in liar game.",
                            "score": 1,
                            "author": "HuntMore9217",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How can you call that betrayal when YunBi literally told him that he is suspicious midgame and half way thru the game Jinho told him that they'll stop playing with him cause he keep talking to both teams. Thats not betraying anything that was just plain dum\n\nNo the games in Liar Games were designed the opposite way (Games were meant to be played solo but if everyone works together everyone wins). I don't remember the exact chapter but it was explained that if everyone just worked together, everyone in the team can move forward or they can pay for whoever gets eliminated, but since everyone in LG (besides the main girl/guy) is greedy it was hard to pull off.\n\nSo how was that contradictory though? I meant what I meant, to have games that are more twisted. Ripping off liar game would mean better games. And you know there were a lot of betrayals in liar games with alliances too so exactly my point so I really don't see your point that makes it contradictory.\n\nYou don't have to agree with  me dude, if that level of games and twist satisfy you then thats you. Games these season are literal crap I still like the show but unlike you I think the mediocrity can do a little better.",
                                    "score": 2,
                                    "author": "Crazy_Albatross8317",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; How can you call that betrayal\n\n&gt; YunBi literally told him that he is suspicious midgame\n\nMake up your mind. \n\n&gt;  Liar Games were designed the opposite way \n\n&gt;  if everyone just worked together, everyone in the team can move forward \n\nLMAO  I don't even need to counter your arguments cause you're doing that just fine by yourself. Thanks",
                                            "score": 1,
                                            "author": "HuntMore9217",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nice comebacks! 100% productive discussion with you thank you. I'm literally here complaining and wanting better games for a better season 3 cause I love the show and you're going off-topic taking shots of what I said to prove a point and somehow you STILL MISS THE POINT.  So I checked you out and then I realized ah kaya pala, pinoy kasi haha jk.",
                                                    "score": 2,
                                                    "author": "Crazy_Albatross8317"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Its hard to betray when you can literally see the people talk behind your back and make plans to backstab you, right in front of you. There is no big benefit to betrayal because even if you survive that game, the next game the rest of them will target you.  \nThis season there was only 2 teams and a few on the fence. Yeah its lukewarm when they promise you betrayals at the start and not much happens.",
                            "score": 1,
                            "author": "DeadToy"
                        }
                    ]
                }
            ]
        }
    ]
}