{
    "id": "145p5x6",
    "score": 19,
    "title": "Discussion for Mission CodeRed (생존게임 코드레드) Episode 1",
    "author": "mcsavatar",
    "date": 1686367323.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/145p5x6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Didn't hear anything about this and only found it by accident. It's a 6 member survival show where they throw the 6 survivors in disastrous situations that could happen in real life. The 6 members consist of Mo Tae Bum, Bakgoon, Cho Jun Ho, Jjang jae, Kwak Beom, and Moon Su In. The panel is made up of Bae Seong Jae (freelancer, I know him from Shooting Stars), Jung Eun Hye, Lee Seung Kook, and Hong Beom Seok (707/firefighter guy). \n\nI wasn't sure if anybody heard about this show before and only bring it up because I realized I hadn't seen Bakgoon and Moon Su In in forever (my heart still holds onto the hope Handsome Tigers will make a return one day). I also vaguely remember Junho from Dream Team but I don't know the rest. Having checked out the first episode, it reminds me of a tougher, more hardcore version of I'm a Survivor except since all the guys have experience, they don't hold your hands like the experts did in IaS.\n\nNot gonna keep up with these discussion threads but just curious in case anybody might want to check it out. So far only 1 episode is out and I can only find it on Viki but if anybody else knows where else to find it, it'd be cool if ya share it for the others who don't have a Viki pass.",
    "comments": [
        {
            "level": 0,
            "comment": "Found the first two episodes with eng subs on GoPlay for anyone interested!",
            "score": 5,
            "author": "saramarketta",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh thank god, I wasn't sure if mentioning GP was okay but that's where I got the subs too. I only found Viki for official sources and couldn't find the Kocowa source so was hesitant in sharing this.",
                    "score": 1,
                    "author": "mcsavatar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Moon Suin?? Did I read that right?? I had the biggest crush on him during HT LOL It's a pity the show suffered during the pandemic because I'm sure they would have played better with a live audience. I'm also still holding on to a second season but they really need to get more amateur players because without Julien and Suin, they suck real bad. Anyway, thanks for posting, I'll be trying this out later!\n\nEdit:\n\n|720p-NEXT|magnet:?xt=urn:btih:b31680d392d8027395ebc941d596cb587214c45b|\n|:-|:-|",
            "score": 3,
            "author": "moretoachieve"
        },
        {
            "level": 0,
            "comment": "Saw Moon Su In in the description and decided to check it out. It was funnier than I actually thought and enjoyed watching the first episode. My brain keep saying this situation is not real, and Bak Goon got too immersed but his teammates just didn’t take anything seriously. I feel like it supposed to be more informational and mimics real situation but the casts and editing makes the situation lighter.",
            "score": 3,
            "author": "siparipari",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, that's my thought too. The Judo athlete has worked as a semi-comedian for a while after doing judo and Kwak Beom is just a comedian so him working with two comedians who aren't super fit is hard. Not to mention Bakgoon is still considered new in variety and is pretty fresh off his marriage so I could see him taking this show more seriously and thus pushing the other two to try to win/escape.\n\nI reckon the next ep will determine if those two will more or less stay the same or whether them splitting up into different teams means there's less chance of them riffing off each other. I don't mind it for the first ep since Jjangjae's team is obv the more serious of the two and they edited that way to likely lessen the severity. Maybe a change in theme and more experience will allow the members to banter occasionally but still be serious enough for the survival part.",
                    "score": 2,
                    "author": "mcsavatar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Second episode is out on Viki but not subbed yet. About to watch it and should be interesting",
            "score": 1,
            "author": "Educational_Grass_10"
        },
        {
            "level": 0,
            "comment": "anyone knows the female mc name?",
            "score": 1,
            "author": "BRabbit-9406"
        },
        {
            "level": 0,
            "comment": "Thank you for putting me on. Gonna check it out!",
            "score": 1,
            "author": "Papercrane4"
        }
    ]
}