{
    "id": "79mm9t",
    "score": 456,
    "title": "Actor Kim Joohyuk dies in car accident",
    "author": "jegvilhais",
    "date": 1509355612.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/79mm9t",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I was convinced it wasn't the same person until I clicked on the link. This is just too sad. Such a talented actor. ",
            "score": 122,
            "author": "tyrian_purple",
            "replies": [
                {
                    "level": 1,
                    "comment": "I still can't believe it right now. It's going to probably hit me later\n",
                    "score": 51,
                    "author": "IndignantDuck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Devastating. Knew about him through 1N2D and thought he was such a charming guy. Actually he was the reason I got back into watching the show after the main cast changed. ",
                            "score": 50,
                            "author": "tyrian_purple",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "and he is really close to marriage :(",
                                    "score": 13,
                                    "author": "LagSeeing112"
                                },
                                {
                                    "level": 3,
                                    "comment": "He was my favorite on 1N2D and I stopped watching after he left.  Just loved him on the show.  Such a generous, decent guy.  This is so heartbreakingly sad.",
                                    "score": 10,
                                    "author": "evixir",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pretty much the same with me. He was apart of so many memorable moments on the show. I know that he used to feel that he didn't bring as much as the other cast members but I watched the show for him. ",
                                            "score": 7,
                                            "author": "tyrian_purple",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I know, I think he felt like he was bringing the show down and that's part of the reason he left, but he was a mature and stable influence on them and a funny foil for a lot of their stunts.  Also, he was pretty much always up for whatever they were doing (maybe with the exception of anything to do with sailing!) and always tried his best.  He made the show worth watching for me.  Really going to miss this guy.",
                                                    "score": 8,
                                                    "author": "evixir"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had the same thought - didn’t want to believe until I saw his face. Damn! And he was such a lovable person - as an entertainer and actor. Damn. I just can’t cope. 😭😭😭",
                    "score": 17,
                    "author": "MGGMMGGM"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As expected, Running Man filming has come to a complete halt. Lee Yoo Young was notified in the middle of filming.\n\nSource: https://twitter.com/OH_mes/status/924940208881242113",
            "score": 84,
            "author": "angellove_rm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Holy fuck. That must be absolutely devastating for her, to all of a sudden hear that your SO has passed away. I wonder if this will be addressed in RM. \nThis is really sad, RIP.",
                    "score": 59,
                    "author": "PandaSwears",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I remember he was along side KJK and Haha (if I'm correct) when they went to China about 5-6 years ago.",
                            "score": 20,
                            "author": "0914566079",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think I remember after that film of RM.  Kim Joohyuk have been like by int/local fan of RM to be the 8th member of RM. \n\nI remember they make it a joke of that after he comes back again to the show after that china epeisode.  :(",
                                    "score": 13,
                                    "author": "Deathzthe"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oof that's heartbreaking. The worst time of getting such kind of news, while filming a comedic show. RM will probably scrap the episode, right? Even if it's at near the end of the filming, it'd be super weird to air it.",
                    "score": 26,
                    "author": "ginastringr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It happened at early night , so it would be quite close to the end of filming. If they air the ep it would be so sad to see one person's being happy not knowing their life tragedy was about to happen. \n\nI am actually wondering how they gonna handle this episode. I guess the decent thing is to ask and then follow her wish. \n\nP.S I think Kim Joohyuk was in the same agency with SJH before she changed to CJES.\nAlso, I don't think I can finish watching the last 2 eps of Argon. \n",
                            "score": 30,
                            "author": "stella0606"
                        },
                        {
                            "level": 2,
                            "comment": "Filming budget aside, would it better if they just re-shoot the episode with different guests?\n\nI mean, whatever jokes she did or get during the filming whether it touched her personal life or not, it would be inappropriate to air it at all.\n\nOr worse, the Korean and international viewers might see that it as SBS and the RM crews are being insensitive about the accident that involves LYY's boyfriend. ",
                            "score": 18,
                            "author": "Isketam",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jokes can be edited out. But worse case, SBS and RM will be deemed as insensitive like you said. I just can't imagine watching I was doing a fun, lol stuff on TV at the same day someone very important to me died if I were LYY.",
                                    "score": 9,
                                    "author": "polidarida",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;I just can't imagine watching I was doing a fun, lol stuff on TV at the same day someone very important to me died if I were LYY.\n\nYeah, it would awful watching the episode and realizing that these were the last carefree, happy moments she's going to experience for quite awhile. ",
                                            "score": 3,
                                            "author": "BashfulHandful"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I imagine the outcome will be footage held (perhaps indefinitely) and a reshoot of a new episode would take place",
                            "score": 2,
                            "author": "Lextube"
                        },
                        {
                            "level": 2,
                            "comment": "Why scrap it? I think the best case scenario is admit it that 1 of there guess need to stop filming because of this incident and make a condolences to the family involve. ",
                            "score": -19,
                            "author": "Deathzthe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Depends on what kind of jokes they made at the intro. If a center piece of it was poking fun at Lee Yo Young getting married soon, her relationship, etc... I can see it being scrapped since it would be a painful memory for the person involved.",
                                    "score": 36,
                                    "author": "ajaya399"
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't know, I feel like it's going to be really weird for me to watch his girlfriend laughs, dances, etc. on the day he died. But yeah, scraping the episode would be a huge loss of time and money, it makes sense not to do it.",
                                    "score": 13,
                                    "author": "ginastringr"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why was RM halted?",
                    "score": 2,
                    "author": "Bancai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because Lee Yoo Young is his girlfriend she was in the middle of filming RM when she heard the news.",
                            "score": 26,
                            "author": "reVivexD"
                        },
                        {
                            "level": 2,
                            "comment": "Filming was halted because Lee Yoo Young, a guest for an upcoming episode, was the late Kim Joo Hyuk's girlfriend. It'd be hard and insensitive to continue filming and downright disrespectful to the grieving if they carried on filming a comedy/variety or any TV show for that matter.",
                            "score": 18,
                            "author": "Mootwafel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ow, that is so sad for her and the rm crew, everyone must have felt awful for her :(",
                                    "score": 4,
                                    "author": "Bancai"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "His fiance was guesting. ",
                            "score": 9,
                            "author": "Lunakitten"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Update**\nOnce Lee Yoo Young heard the news, she headed right back to Seoul, ending RM filming. She kept asking if it really was Kim Joo Hyuk was died\n\nSource: https://twitter.com/OH_mes/status/924958758249299968\n\nPoor Lee Yoo Young T.T",
            "score": 45,
            "author": "angellove_rm",
            "replies": [
                {
                    "level": 1,
                    "comment": "This entire situation is terrible, but this image of her disbelief is the first thing that's made me cry. ",
                    "score": 11,
                    "author": "QueenDido",
                    "replies": [
                        {
                            "level": 2,
                            "comment": ":( mind sharing the link?",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this cannot be real. my heart hurts.\n\nhe still had so much more to do and accomplish. still young and brought me many laughs.\n\n\n",
            "score": 86,
            "author": "i_love_all"
        },
        {
            "level": 0,
            "comment": "[Soompi's](https://www.soompi.com/2017/10/30/breaking-actor-kim-joo-hyuk-passes-away-car-accident/) article. \n\nHe died too young at only 45. Can't even imagine what his ~~mom,~~ brother, girlfriend, close friends and fellow actors are feeling right now.\n\nRest in peace. Thank you for providing so many people with laughter and happiness. You will be remembered. ",
            "score": 51,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "both of his parents was passed away too, his mom just passed away 1 years ago i think ... cmiiw\n\nits 2d1n 10anniversary but we have such a devastating news, all the members really want to see him married ... but they cant now ..",
                    "score": 54,
                    "author": "mokomichi13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jesus. The 10th anniversary, you're right. To have him come back married, happy... This is heartbreaking. The cast and crew must be besides themselves. ",
                            "score": 22,
                            "author": "QueenDido"
                        },
                        {
                            "level": 2,
                            "comment": "i forgot about his mom! Oh my gosh, i hope his family and relatives are okay :( \n\nWill edit. Thank you ",
                            "score": 12,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Omg!! Your comment made me cry! Because I just remembered an episode where the members wrote letters to themselves as their future self. Joohyuk wrote about being married and having a child. The other members jokingly wrote how he would've been 60 yrs old. He was my favorite member too.\n\nRemember every member forever.",
                            "score": 13,
                            "author": "GlitteryGrizzlyBear"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gutaeng hyung :(",
            "score": 41,
            "author": "IndignantDuck"
        },
        {
            "level": 0,
            "comment": "Damn. To think the words **Remember the member** just have a really heavy weight to it now. This is just all so sad, he had so much ahead of him. \n\n",
            "score": 41,
            "author": "animediva72",
            "replies": [
                {
                    "level": 1,
                    "comment": "Remember every member forever rest in peace gutaeng hyung",
                    "score": 14,
                    "author": "zloc1984"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i dont think i can watch 2d1n next week .. ",
            "score": 38,
            "author": "mokomichi13",
            "replies": [
                {
                    "level": 1,
                    "comment": "I loved going back to rewatch older episodes whenever I'm bored or just need a laugh, I don't think I can do that ever again without feeling sad.\n\nOne of my favourite moments was them writing letters to each other predicting the future, that scene will never be the same. It quickly went from one of the funniest moments to one of the saddest moments in the show.",
                    "score": 59,
                    "author": "Vaark",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I actually find that watching old episodes has helped, but you're right - that \"predicting the future\" scene will never, ever be the same. ",
                            "score": 8,
                            "author": "BashfulHandful"
                        },
                        {
                            "level": 2,
                            "comment": "I'm just gonna say that, all he ever wanted is to have his own kids.  Such a tragic accident ",
                            "score": 5,
                            "author": "EnidBeaubie"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hope they honor him in some way... the members must be so shocked right now :(",
                    "score": 12,
                    "author": "mwsongz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm sure they will - they'll insist on it.  He was integral while he was on the show.  So terrible.",
                            "score": 6,
                            "author": "evixir",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bad bot.",
                                            "score": 4,
                                            "author": "evixir"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just watched last week's episodes with all the awards and they were reminiscing about him.. this is really unbelievable. ",
                    "score": 7,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He was just awarded for his role in “Confidential Assignment” at the Seoul Awards just a few days ago. Shame he has left so soon.",
            "score": 32,
            "author": "jekkibby"
        },
        {
            "level": 0,
            "comment": "Fuck this. Was hoping this is just another made up rumour like every other celebrity death news. But sadly...\n\nWhen he was mentioned again on last week's 1N2D episode I was hoping to see him on the show again as a guest but fate has other plans.\n\nMy heart weeps for Gutaeng hyung.",
            "score": 35,
            "author": "Vaark"
        },
        {
            "level": 0,
            "comment": "Wow, this is such terrible news. What a shock.\nHe was so nice on 1n2d, the other members will be devastated.\nRIP  :(",
            "score": 27,
            "author": "stijnx"
        },
        {
            "level": 0,
            "comment": "I'm so sad right now, will never forget the good 1N2D moments. Rest in Peace.",
            "score": 28,
            "author": "impedimentoLoL"
        },
        {
            "level": 0,
            "comment": "Omg I'm gonna cry. I watched 2d1n from the start and he has grown on me all through his stay. My heart is aching and I'm so sad right now. First time that somebody who've been a part of my life passed away and this feeling is so new to me. May he rest in peace. ㅠ ㅠ ",
            "score": 27,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Further update: Konkuk Univ Hospital informs the police that Kim Joo Hyuk had a heart attack before the accident\n[Source](http://entertain.naver.com/now/read?oid=468&amp;aid=0000316261)\n\nIt's possible that his sudden heart attack is what caused the accident in the first place.\n\nEdit: Added [video footage](https://www.youtube.com/watch?v=gY6OzLgwkyU). Warning! Some might find this disturbing or uncomfortable even though it doesn't show the moment of impact. It shows how his car stopped in the middle of moving traffic then suddenly sped off as he swerved off to the side where the crash happened (which is not visible in this footage). What is clear is this is no normal accident, it's looking very likely that it is indeed a heart attack that led to him losing control of his car as he desperately tried to move out of traffic.",
            "score": 48,
            "author": "Vaark",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very likely if you look at the black box footage. Terrible :(.",
                    "score": 11,
                    "author": "stijnx"
                },
                {
                    "level": 1,
                    "comment": "It is so heartbreaking. It is most likely because he had a heart attack. He was a heavy smoker.",
                    "score": 13,
                    "author": "GlitteryGrizzlyBear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some of the most healthiest people still have heart attacks at a young age.",
                            "score": 14,
                            "author": "eiko85",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I think marathoners can have heart attacks too.",
                                    "score": 4,
                                    "author": "Wilbii"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's a YouTube comment on the video that said he smoked three packs a day.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh gosh. Saw the whole thing on youtube. The car was a total wreck. 😫😩😭😭",
                    "score": 2,
                    "author": "knn328"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rest in peace",
            "score": 23,
            "author": "Mungbean22"
        },
        {
            "level": 0,
            "comment": "Supposedly his girlfriend, Lee Yooyoung, was filming Running Man today, so I hope she didn't get the news from headlines while on set. If filming is still ongoing, they should cancel. (edit: Just saw that they cancelled.) This is so tragic and shocking. I was halfway through his drama Argon, and now he's gone. He had such an enjoyable personality on variety and was a talented actor. Rest in peace.",
            "score": 17,
            "author": "winterlane",
            "replies": [
                {
                    "level": 1,
                    "comment": "They halted the episode.. just unbelievable news... ",
                    "score": 8,
                    "author": "broham89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NONONONONO",
            "score": 17,
            "author": "stone_soup"
        },
        {
            "level": 0,
            "comment": "Such horrible news, especially since he got attached recently. May he Rest In Peace. 😞",
            "score": 15,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I've literally been binge watching the 2d1n ep's he was in this past week. In one of the eps he was talking about his aspirations of having wife and kids before 50.......damn....",
            "score": 15,
            "author": "Voltorbs_Anus"
        },
        {
            "level": 0,
            "comment": "http://mnews.sbs.co.kr/news/endPage.do?newsId=N1004460298\n\nhttp://mnews.jtbc.joins.com/News/Article.aspx?news_id=NB11542796\n\nSomething went wrong with the link I attached to the main post, so here's more sources.",
            "score": 13,
            "author": "jegvilhais"
        },
        {
            "level": 0,
            "comment": "WTF?",
            "score": 14,
            "author": "appropriate_name"
        },
        {
            "level": 0,
            "comment": "All I wanted to do was check and see if this week's 1n2d episode was a re-run... Not to be broken like this.",
            "score": 14,
            "author": "jewson"
        },
        {
            "level": 0,
            "comment": "A man that left an indelible mark on the hearts of many, if not millions of strangers. You will be missed Gutaeng Hyung.",
            "score": 14,
            "author": "Peanuts34"
        },
        {
            "level": 0,
            "comment": "OMG....... I was hoping this news is fake.. My God.... just last night I had the change to watch 2D1N 10th years anniversary awards episode. Feeling really happy when they still mentioning his name and even Donggu said that for him, Kim Joohyuk is a big star. Suddenly remembered when the members wrote letters for the future. Kim Joohyuk wrote that he will be married and even had 2nd child in 10 years.",
            "score": 14,
            "author": "Iefa_San"
        },
        {
            "level": 0,
            "comment": "I saw the news when I woke up and am still processing the loss. I felt the same when Robin Williams passed. There are special people who have hearts of gold, possess such innocence and innate talent, and still muster the courage to share a part of themselves with the world for amusement. I'm so grateful I got into Korean variety because I've been able to laugh because of Kim Joo Hyuk. I'll miss his affable, smiling self. Condolences.  ",
            "score": 13,
            "author": "thingsyouchoosetobe"
        },
        {
            "level": 0,
            "comment": "[his car according to naver](http://mimgnews1.naver.net/image/416/2017/10/30/0000213469_001_20171030184620996.jpg)",
            "score": 28,
            "author": "i_love_all",
            "replies": [
                {
                    "level": 1,
                    "comment": "It went over stairs? Christ, I wonder what happened.",
                    "score": 10,
                    "author": "Ravenjade",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Another vehicle rammed into his, making it fall down the stairs. It also burst into flames. :'(\n\nEDIT: Just saw the updated report. The first report I read mentioned a car ramming into his vehicle. A CCTV footage was released and it looked like he lost control of his vehicle. The hospital confirmed he died from a heart attack. RIP",
                            "score": 3,
                            "author": "mochapichi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What I read is that he hit another vehicle, swerved afterwards and went down the stairs, his vehicle landing on its side and catching on fire. The other driver apparently said they saw Kim clutching his chest.",
                                    "score": 21,
                                    "author": "MegalomaniacHack",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "https://streamable.com/zmdrr\n\nheart attack? found a roadcam of his car during the accident",
                                            "score": 21,
                                            "author": "i_love_all",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "holy shit, I never realized that manual transmissions could save someone's life like that",
                                                    "score": 3,
                                                    "author": "MicaLovesKPOP",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's a very odd and specific case, because if it is as it seems and he was having a heart attack and put his foot on the throttle, he could well have managed that in a manual car just the same, it may not have managed to stall. But yeah given the speed it slowed down to and the gear he would have been in for that road, car would have either stalled or not pulled away at the speed that it did.\n\nWhat is going to be interesting to know is whether the cause of death was from the heart attack, or from his injuries in the accident. Maybe his heart attack was fatal anyway.",
                                                            "score": 9,
                                                            "author": "Lextube",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, I came to the exact same conclusion and thoughts as you wrote down above.\n\nI guess we'll hear what the cause of death was sooner or later.\n\nThe main thing about it for me was just the realization that in some rare cases this could have saved someone's life. But yeah, it may well not have mattered in this situation, even if the car would have stalled.",
                                                                    "score": 2,
                                                                    "author": "MicaLovesKPOP",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The concept of manual transmission saving lives is a pretty deep hole of discussion to dive into. I'd personally claim it doesn't save lives in rare case situations but just in general it promotes more active driving and allows more all round control of the car. Things that help prevent accidents in the first place. But again feel that discussion doesn't suit this particular case as it doesn't appear to be the case of driver error. ",
                                                                            "score": 3,
                                                                            "author": "Lextube",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Right. I don't know if that's true or not, but to be honest I've never driven an automatic, so I don't know if I'd find myself driving more actively with a manual gearbox.\n\nI know this is getting pretty off-topic for this sub and thread, but one thing that I personally believe in is that people should at least have a basic understanding and experience with car mechanics. I'd wager the vast majority of people in my country (The Netherlands) does not even know what 'understeer' is, let alone what to do when they experience it. The same goes for many more relatively basic dynamics that could easily save lives if understood.",
                                                                                    "score": 2,
                                                                                    "author": "MicaLovesKPOP",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "just read online that he actually had a heart attack.",
                                    "score": 12,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "oh...what..i read somewhere a witness saying he was like grabbing his chest.. as if he was having a heartattack",
                                    "score": 8,
                                    "author": "SituAZN"
                                },
                                {
                                    "level": 3,
                                    "comment": "No, that is not what happened.\n\nIt looks like he lost consciousness while having the foot on the throttle. ",
                                    "score": 5,
                                    "author": "jy3"
                                },
                                {
                                    "level": 3,
                                    "comment": "https://streamable.com/zmdrr\n\nheart attack? found a roadcam of his car during the accident",
                                    "score": 7,
                                    "author": "i_love_all",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Looking at that roadcam, a heart attack or some kind of panic/shock attack seems likely. His car was actually stopped for a few seconds before suddenly accelerating.\n\nGuess we'll have to wait for the autopsy results... if it gets released.",
                                            "score": 5,
                                            "author": "ajaya399"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so shocking and absolutely heartbreaking. :(",
            "score": 13,
            "author": "MyIxxx"
        },
        {
            "level": 0,
            "comment": "This is really really sad for me. I love him in 1n2d and his love for 1n2d even after he left. He also get recognized for his acting in Confidential Assignment. ",
            "score": 13,
            "author": "Chahaya"
        },
        {
            "level": 0,
            "comment": "I am speechless.\nHe's one of my favourite actors ever. My heart hurt seeing how hurt he was when his mother left him. His empty fridge made me tear up. I stopped watching 1N2D when he left. I was really happy for him when he confirmed that hes dating someone. One of my dream was to see him getting married and live happily with his little family.\nThis is so heartbreaking. RIP Gutaengi.",
            "score": 13,
            "author": "hodongi"
        },
        {
            "level": 0,
            "comment": "And 1n2d yesterday was a re-run episode with gutaeng hyung goddamnit T_T",
            "score": 14,
            "author": "zloc1984"
        },
        {
            "level": 0,
            "comment": "**“2 Days &amp; 1 Night” Relays Condolences Following News Of Kim Joo Hyuk’s Passing**\n\nKBS2’s “2 Days &amp; 1 Night” released an official statement on October 30 in regards to the passing of former cast member, actor Kim Joo Hyuk.\n\nEarlier on October 30, Kim Joo Hyuk was involved in a car accident where his car crashed into another, swerved into an apartment building, and subsequently flipped over. While he was rescued from the car, he passed away shortly afterwards at Konkuk Hospital.\n\nThe actor had been a fixed cast member on “2 Days &amp; 1 Night” from December 2013 to November 2015. Given his close relationship with the staff and many of the remaining cast members, the “2 Days &amp; 1 Night” crew officially expressed their condolences as a show.\n\nTheir statement is as follows:\n\n“There is no sufficient way to express the grief that all the [past and present] cast members and staff feel at the shocking and sad news regarding our everlasting member Kim Joo Hyuk.”\n\n“We offer our sincerest condolences from the bottom of our hearts.”\n\n“[Signed,] All of ‘2 Days &amp; 1 Night'”\n\nSource: https://www.soompi.com/2017/10/30/2-days-1-night-relays-condolences-following-news-kim-joo-hyuks-passing/",
            "score": 12,
            "author": "angellove_rm"
        },
        {
            "level": 0,
            "comment": "Wait what?  Man T_T\n\nThat guy is so funny in 1N2D. I know he's sucks in every game but he tries so hard to compete with others that's why I'm sad when he quit 1N2D because of his health.  :(",
            "score": 11,
            "author": "Deathzthe"
        },
        {
            "level": 0,
            "comment": "Seeing him show up in random 2d1n episodes every now and then was always so fun, sad we won't ever get to see him again.",
            "score": 11,
            "author": "kggb"
        },
        {
            "level": 0,
            "comment": "What?!? I'm sad... Rest in Peace ",
            "score": 11,
            "author": "angellove_rm"
        },
        {
            "level": 0,
            "comment": "Fuck fuck fuck fuck noooooo. They just visited him on yesterday's episode and they looked good. My heart is aching now. I'll miss gutaeng hyung even more.",
            "score": 9,
            "author": "midnightmarket"
        },
        {
            "level": 0,
            "comment": "This is devastating. I don't really watch Korean movies/dramas so the first I ever heard of KJH was when he joined 1N2D and watching him grow from the awkward guy during S03E01 up to when he left was amazing. Incredibly talented guy who made me laugh. A lot. It was impossible not to like the man. RIP gutaeng hyung.",
            "score": 11,
            "author": "Oat-"
        },
        {
            "level": 0,
            "comment": "The world is a bit dimmer today without this man's light.\n\nThank you bringing so much laughter and joy into our hearts.\n\nRest in peace.",
            "score": 11,
            "author": "GVObruh"
        },
        {
            "level": 0,
            "comment": "One more things. Don't forget Kim Joohyuk's GF Lee Yoo Young is currently filming of Running Man.. \n\nSource: https://twitter.com/OH_mes/status/924938856025247744\n\nNo way, she didn't finish due filming!!! T.T",
            "score": 8,
            "author": "angellove_rm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh i can't imagine how she has been shocked , how can this happen!! \n",
                    "score": 1,
                    "author": "3lmy3lmk"
                },
                {
                    "level": 1,
                    "comment": "There's no way she can continue filming now. The best solution is telling the truth to the audience that LYY can not finish the film because his Love died in a accident. 10/20 /30 sec silence to RM members for Kim Joohyuk would be fine for sure. ",
                    "score": -7,
                    "author": "Deathzthe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 24,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "it'd be sensible to scrap it. However, if the higher ups really want to kill of RM, they'd force the PD to air it and get scrutiny from the public. ",
                                    "score": 1,
                                    "author": "alastoris"
                                },
                                {
                                    "level": 3,
                                    "comment": "Twisted of what?  Hiding that 1 of there guess loveone died that's why we need to delete the episode because of her instead make a proper condolences to LYY for the death of Kim Joohyuk in TV. ",
                                    "score": -11,
                                    "author": "Deathzthe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Better scrap it. This kind of news is a mood killer especially when they are supposedly filming a fun, LOL show. Kim Joo Hyuk is also not exactly unrelated to RM and Variety show in general, with him guesting on RM back then and was one of 1n2d s3 casts.",
                                            "score": 22,
                                            "author": "polidarida"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There's a lot of cons for airing an episode whose cast or guest includes someone who is grieving.\n\nFor one, Running Man is a comedy and it'd be distasteful and disrespectful to the person who just lost someone for them to continue with the schedule. Second, the Running Man cast are not mere acquaintances of the late Kim Joo Hyuk, so even if the production staff were to decide to continue filming, it'd be hard for the cast to properly do their job. Third, there'd be a lot of backlash from a traditionally conservative nation if they ever decide to air whatever they have filmed prior to the news since it involves Lee Yoo Young. \n\nThe best course of action would be to scrap the episode and then reschedule filming, most likely with a different guest.\n\nOf course condolences will be made here, I don't see why they wouldn't bring that up in future episodes, but to just deliver condolences and a moment of silence and then air the planned episode as if nothing happened is a tad bit distasteful, disrespectful, and insensitive.",
                                            "score": 6,
                                            "author": "Mootwafel"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They undoubtedly talked to her about the relationship as they often do. It's even possible she talked about him at other times in the episode since he's been a guest before and could be friends with some of the members.\n\nA comedy show where she's going around having fun and then abruptly had to leave because her boyfriend died would be very awkward, and given that South Korean shows regularly cut out massive amounts of content over scandals and such, it's hard to see them using the episode as is.",
                                            "score": 5,
                                            "author": "MegalomaniacHack"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh my god. I don't usually mourn for celebrity's death, but I got hooked to Season 3 because if his awkwardness.\n\nSo much is going on well for him. Rest in peace, Gutaeng-hyung. \n\n",
            "score": 9,
            "author": "theinternetpotato"
        },
        {
            "level": 0,
            "comment": "damn, dude's one of the most likable and genuine dudes i've ever seen in variety. this really sucks, rest in peace",
            "score": 8,
            "author": "lupin88"
        },
        {
            "level": 0,
            "comment": "so sad..i'm shocked",
            "score": 8,
            "author": "yourmomisme"
        },
        {
            "level": 0,
            "comment": "NOOOOO MY HYYUNGGGGGGG ",
            "score": 7,
            "author": "ABEY_94"
        },
        {
            "level": 0,
            "comment": "RIP uri Gutaeng hyung. only if he wouldve still 2d1n members :'(",
            "score": 9,
            "author": "harzexcvi"
        },
        {
            "level": 0,
            "comment": "He was my favorite member in 1N2D. May he Rest In Peace.",
            "score": 8,
            "author": "AllDelete"
        },
        {
            "level": 0,
            "comment": "My God, no......... ",
            "score": 8,
            "author": "xyrsh"
        },
        {
            "level": 0,
            "comment": "What the fuck. I just started watching 2D1N last week and I found this dude to be the funniest out of the bunch. I can't believe this. ~~I think I recognize him from Star Show 360 and Battle Trip too.~~ Scratch that, that was Lee Hwi Jae, who looks exactly like him, but still:\n\nRIP my man. I will continue watching 2D1N in honor of you.",
            "score": 8,
            "author": "Agyr"
        },
        {
            "level": 0,
            "comment": "GUTAENG HYUNG T.T",
            "score": 6,
            "author": "pantamy"
        },
        {
            "level": 0,
            "comment": "No. No. What ? No. It's so sudden. What? ",
            "score": 6,
            "author": "PiscesKid"
        },
        {
            "level": 0,
            "comment": "I can't believe this news...\nHe supposed to marry this year...\nR.I.P Gutaeng hyung",
            "score": 6,
            "author": "feridegami"
        },
        {
            "level": 0,
            "comment": "Was hoping for him to appear during the 10th anniversary. Guess we all won't be seeing him again. My favorite member and actor. Rest in peace gutaeng hyung. ",
            "score": 5,
            "author": "Cuzztos"
        },
        {
            "level": 0,
            "comment": "I am actually watching an episode where they wrote what would their life would be from 10years...  I love watching hi.  In 2d1n.  This man always wished to have a kids. 😭",
            "score": 6,
            "author": "EnidBeaubie"
        },
        {
            "level": 0,
            "comment": "I saw every single episode of 2D1N with him in it. This is just terrible.",
            "score": 7,
            "author": "baegjag"
        },
        {
            "level": 0,
            "comment": "Man, this is so sad. Watching him grow out of his shell and come into his own in 2D1N was amazing. ",
            "score": 5,
            "author": "fulltimepanda"
        },
        {
            "level": 0,
            "comment": "**Update**\n\n**“Running Man” Filming Halts After Kim Joo Hyuk’s Girlfriend Lee Yoo Young Learns Of His Passing**\n\nOn October 30, actress and Kim Joo Hyuk’s girlfriend Lee Yoo Young was filming SBS’s “Running Man” in Busan when she heard the news of his passing.\n\nThe girlfriend of the actor was in shock after hearing the news and returned to Seoul with the permission of the staff. Filming for “Running Man” was halted.\n\nA representative of Lee Yoo Young said, “After she heard the news of his passing, she asked repeatedly if it was true that he passed. We are currently trying to verify facts.”\n\nLee Yoo Young and Kim Joo Hyuk started publicly dating in December of 2016 after meeting while filming director Hong Sang Soo’s film “Yourself and Yours” (literal title). Last month, Kim Joo Hyuk mentioned her in an interview and revealed he was thinking about marrying her and wanting a daughter.\n\nAround 4 p.m. on October 30, Kim Joo Hyuk’s car flipped over in Seoul’s neighborhood of Samseong. According to police, Kim Joo Hyuk was driving his car on Yeongdong Street when he crashed into a car nearby. Then, Kim Joo Hyuk’s car swerved onto the sidewalk, crashed into the wall of an apartment, and fell down the stairs before flipping over.\n\nKim Joo Hyuk was the only person in the car at the time of the accident. He was rescued from the car and taken to Konkuk Hospital but passed away.\n\nSource: https://www.soompi.com/2017/10/30/running-man-filming-halts-kim-joo-hyuks-girlfriend-lee-yoo-young-learns-passing/",
            "score": 6,
            "author": "angellove_rm"
        },
        {
            "level": 0,
            "comment": "RIP, remember these member forever",
            "score": 6,
            "author": "LifeOfChopSticks"
        },
        {
            "level": 0,
            "comment": "Woke up to pictures of him on Seulki instagram .. I teared up. RIP ❤",
            "score": 6,
            "author": "xoKaybs",
            "replies": [
                {
                    "level": 1,
                    "comment": "What is her instagram? ",
                    "score": 1,
                    "author": "EatBaconSS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.instagram.com/p/Ba4QxTulIJC/?taken-by=seulki_1002\n\n[hojin pd](https://www.instagram.com/p/Ba4MNjKlysM/?hl=en&amp;taken-by=hojin.ryu.1) has also posted a picture of him",
                            "score": 3,
                            "author": "lupin88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you... Really feel sad with them posting pictures of him... ",
                                    "score": 1,
                                    "author": "EatBaconSS"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im so heartbroken! I just watched the video of the members attending his memorial. Defconn was in tear and that made me cry. Just watching 2D1N you can see the love and friendship they had for each other. I know for sure I will bawl my eyes out when I see Joonyoung, because I remember how awkward they were on the first episode and now they're close. I just want to hug everyone and cry with them!",
            "score": 5,
            "author": "GlitteryGrizzlyBear",
            "replies": [
                {
                    "level": 1,
                    "comment": "Defconn crying was heartwrenching. ",
                    "score": 1,
                    "author": "stijnx"
                },
                {
                    "level": 1,
                    "comment": "where do you guys watch the video ?",
                    "score": 1,
                    "author": "asik99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Instagram and YouTube. Song jongki even came.",
                            "score": 1,
                            "author": "GlitteryGrizzlyBear"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dam, like seriously, such a gentle man in 2d1n. REST IN PEACE MATE.",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Such a nice guy.. 1N2D should do a special episode in his memory.. still hoping this is fake... so sad",
            "score": 8,
            "author": "kshowfan"
        },
        {
            "level": 0,
            "comment": "Rest In Peace,I cant believe it,I just cant.With 10th year anniversary 1n2d??Is this a joke?PLEASE......................",
            "score": 4,
            "author": "riseart"
        },
        {
            "level": 0,
            "comment": "NO fucking way?",
            "score": 3,
            "author": "F4ntasia"
        },
        {
            "level": 0,
            "comment": "The girlfriend must feel awful.. RIP :\\",
            "score": 3,
            "author": "caelinday"
        },
        {
            "level": 0,
            "comment": "so heartbreaking ... :(",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "horrible horrible news",
            "score": 4,
            "author": "enigmatic_zephy"
        },
        {
            "level": 0,
            "comment": "This is insane.. He's my favorite member on 1n2d and he's a damn good actor too. ",
            "score": 5,
            "author": "havvets"
        },
        {
            "level": 0,
            "comment": "Very sad. I recently rewatched the 1N2D episode where Yoon Si-yoon joins just because the part where Kim Joo-hyuk comes out made me laugh so hard. RIP Gutaeng Hyung.",
            "score": 3,
            "author": "grandpa_tootie"
        },
        {
            "level": 0,
            "comment": "Genuinely devastated, fuck. ",
            "score": 4,
            "author": "CutieButt"
        },
        {
            "level": 0,
            "comment": "Wow I’m in shock. Rest In Peace gutaeghyung. I’ll always remember his scene when he dressed up in that teletubbie-like costume down the hill. Can’t imagine what 1N2D cast/crew are going through.",
            "score": 6,
            "author": "roryn58"
        },
        {
            "level": 0,
            "comment": "Omg, i had to search google for his picture. He's that actor in Haha&amp;JongKook's team in RunningMan on that China episode.\n\n\nRest in peace.",
            "score": 7,
            "author": "ChrisInsanity",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 22,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same! Been his fan for a few years &amp; was so happy to hear he was going to be in 1N2D, though he left.. 😞",
                            "score": 9,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so sad.. When I click the link, I'm hoping its a different person. RIP.",
            "score": 3,
            "author": "Sacreville"
        },
        {
            "level": 0,
            "comment": "Shit.. Is this real? I just watched **Argon** omg...",
            "score": 3,
            "author": "josnic"
        },
        {
            "level": 0,
            "comment": "so fucking sad",
            "score": 3,
            "author": "ronkalonie"
        },
        {
            "level": 0,
            "comment": "My heart is breaking. May he rest in peace. He was my favorite member on 1N2D",
            "score": 3,
            "author": "conmigosiempre"
        },
        {
            "level": 0,
            "comment": "I really want this not to be true. My heart breaks for the many who know and love him, and for the many more who met him on screen and also loved him from afar.",
            "score": 3,
            "author": "mystyz"
        },
        {
            "level": 0,
            "comment": "This feels unreal. ",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is just so unbelievably sad.  So terribly sad.",
            "score": 3,
            "author": "evixir"
        },
        {
            "level": 0,
            "comment": "I'm speechless. I'm sure his 2D1N brothers are devastated. ",
            "score": 3,
            "author": "Beashi"
        },
        {
            "level": 0,
            "comment": "**Updated**\n\nLee Yoo Young has been staying in the funeral home late into the night and has not eaten or drank anything since Kim Joo Hyuk's accident\n\nSource: https://twitter.com/OH_mes/status/925521092760006658\n\n\nJung Joon Young is filming for LotJ atm so he can't be reached, so he may not know about Kim Joo Hyuk yet and will be arrived in Korea on Nov 5. \n\nSource: https://twitter.com/OH_mes/status/925557747164307456",
            "score": 3,
            "author": "angellove_rm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg omg. Someone needs to tell joonyoung. He would feel guilty and regret missing joohyuks funeral. Just thinking about it makes me cry. ",
                    "score": 3,
                    "author": "GlitteryGrizzlyBear"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Update**\n\nKim Joo Hyuk was taking the prescription drug Adipam, which is given to patients who have skin rashes or similar symptoms. A possible side effect for Adipam is heart attack, but it is extremely rare. A dermatologist of 30 years said he never seen this side effect. Cause of death is due to trauma to the head from hitting the apartment walls. Adipam can cause drowsiness and sluggishness though.\n\nSource: https://twitter.com/OH_mes/status/925571747411365888",
            "score": 3,
            "author": "angellove_rm",
            "replies": [
                {
                    "level": 1,
                    "comment": "maybe its because allergy? because i had allergy to 1 kinf of medicine and i cant eat that anymore forever ... because its very dangerous ... ",
                    "score": 2,
                    "author": "mokomichi13"
                },
                {
                    "level": 1,
                    "comment": "Yeah Adipam is a type of antihistamine, which is usually taken for allergies. It can cause drowsiness though, which is why people usually sleep like a log after they take allergy medications.\n\n But a Soompi article recently say that it is unlikely that the late Joo Hyuk was sleepy, because the pattern of the car stopping and accelerating did not match or something. I don't know really. When I read that it was a heart attack I was really sad, but now that the cause of the accident is up to speculation again it just made me restless and wonder. \n\nHe touched a lot of people's hearts, and I'm sure everyone wants to know what really happened :(",
                    "score": 1,
                    "author": "little_effy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is 100 percent speculation, but I saw that footage, and I personally agree that, allergies just wouldn't match the way the vehicle moved like that, and if it was something like a heart attack, then it'd be likely he accelerated to rush to a hospital or something, when they're mentioning the drug adipam and it's side effects, they're implying he lost consciousness, or passed out, so the car came to a complete stop, either by lack of acceleration, which going by the footage, looked like it, or he braked, then sped off. Anyway, a huge loss, it took me awhile to warm up to him on 2d1n, but when I did, I saw that he was just a genuine, gentle and honest man. I have my own theories of what happened, one is far out there, that most people would think absolutely insane, anyway, speculating at this point is just disrespectful, stay safe guys.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Urghh, the pictures from the funeral has Defconn openly weeping. Its just heartbreaking.",
            "score": 3,
            "author": "ajaya399"
        },
        {
            "level": 0,
            "comment": "Too young to die🙁. May his soul rest in peace. ",
            "score": 2,
            "author": "knn328"
        },
        {
            "level": 0,
            "comment": "Still couldn't believe. Our Gutaeng Hyung :(",
            "score": 2,
            "author": "bbeedee"
        },
        {
            "level": 0,
            "comment": "As RM fans since early days, I know him when first appeared in China episode, i fell in love with him and try to cath up with his another project and i'm so happy when he joined 1n2d.... Rest in Peace Mr Kim Joo Hyuk .... ",
            "score": 2,
            "author": "makjjang"
        },
        {
            "level": 0,
            "comment": "RIP Gutaeng hyung",
            "score": 2,
            "author": "Yonneveneration"
        },
        {
            "level": 0,
            "comment": "I currently can’t breathe. I can’t believe this has happened. Please this can’t be real. ",
            "score": 5,
            "author": "roseychu"
        },
        {
            "level": 0,
            "comment": "Man.... this is so sad. ",
            "score": 3,
            "author": "asianbeautyaddict"
        },
        {
            "level": 0,
            "comment": "After seeing the current 1n2d cast talk about him so much, I was gonna go back and watch when he was in the cast but now... T_T Even though I haven't seen so much with him I feel sad af, as when paul walker died.. RIP",
            "score": 3,
            "author": "Kineser"
        },
        {
            "level": 0,
            "comment": "rest in peace... to his family, friends and lee yoo young, i hope you will find strength somehow...",
            "score": 1,
            "author": "sparklingaria"
        },
        {
            "level": 0,
            "comment": "This is too sad!! Big fan of his since 1N2D",
            "score": 1,
            "author": "spanza_"
        },
        {
            "level": 0,
            "comment": "Unbelievable. RIP...",
            "score": 1,
            "author": "velspar"
        },
        {
            "level": 0,
            "comment": "Wow...I'm generally sad. God be with him and his family. ",
            "score": 1,
            "author": "Hitokiri2"
        },
        {
            "level": 0,
            "comment": "I’m stunt. Hope he rest in peace.",
            "score": 1,
            "author": "lehmle"
        },
        {
            "level": 0,
            "comment": "i'm crying right now",
            "score": 1,
            "author": "ecchioil"
        }
    ]
}