{
    "id": "paf39s",
    "score": 365,
    "title": "Sixth Sense 2 to extend 2 more episodes due to strong viewer support",
    "author": "Zephyrwin",
    "date": 1629774652.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/paf39s",
    "media_urls": [
        "https://www.reddit.com/r/koreanvariety/comments/paf39s/sixth_sense_2_to_extend_2_more_episodes_due_to/"
    ],
    "other_urls": [
        "https://star.mt.co.kr/stview.php?no=2021082411370945982)"
    ],
    "postText": "[Star News](https://star.mt.co.kr/stview.php?no=2021082411370945982) \n\nTranslation: \n\n\"Sixth Sense 2\" will cast two more extended and trendy guests thanks to hot love.\n\nAccording to a Star News report on the 24th, rappers Loco and Gray will appear as guests for tvN's entertainment program \"Sixth Sense 2.\" In addition, \"Sixth Sense 2,\" which was originally scheduled for the 12th episode, will be extended twice thanks to enthusiastic support from viewers, and the season 2 will be completed with a total of 14 episodes on September 24.\n\n\"Sixth Sense\" is an unpredictable sixth sense deception variety where six cast members find fake ones that are more real than the real ones hiding inside. Following season 1 that aired in September last year, season 2 was broadcasted this year and gained huge love. Yoo Jae-seok, Mi-Joo, Onara, Jeon So-min, Jessie, and Lee Sang-yeop appear to show different chemistry.\n\nIn particular, the 9th episode of \"Sixth Sense 2,\" which aired on the 20th, recorded an average of 3.8 percent and a maximum of 5.6 percent based on households in the Seoul metropolitan area, breaking its own record. (based on Nielsen Korea)\n\nMeanwhile, \"Sixth Sense 2\" airs every Friday at 8:40 p.m.\n\n----------------------\n\nCongrats Sixth Sense cast &amp; crew, they totally deserve it and season 3 please!",
    "comments": [
        {
            "level": 0,
            "comment": "I hope this means that we'll get season 3! Sixth Sense is currently the top variety show I look forward to weekly.",
            "score": 101,
            "author": "HarlequinCow",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope they diversify and do other stuff",
                    "score": 22,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "personal opinion but i think they should not continue with season 3 and start new project with the same cast. its getting repetitive now and the cast seems to already have a grasp on how to detect the fake one. its good that they win the gold but as a viewer seeing majority of them wins kinda feels less exciting than seeing them being fooled by the productions crew. the fake reveal video also has been less exciting for me as we already know how far can they go with the renovation and plan, that it just became normal to me on how they change the abandoned place. i would be happy if they continue with season 3 but a new project with new concept would be better imo.",
                    "score": 34,
                    "author": "sfr3xk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it really is the cast and their awesome chemistry that is the compelling part of the show. But I don't know if another concept would work even with the same cast.",
                            "score": 19,
                            "author": "mxwp"
                        },
                        {
                            "level": 2,
                            "comment": "Honestly, same. I think people love to show for the cast and chemistry first then everything else second. I could literally watch the cast do nothing but talk and would still be pretty amped about it. They definitely should make changes for season 3 (if it does come) as the current concept is getting stale.",
                            "score": 17,
                            "author": "HarlequinCow"
                        },
                        {
                            "level": 2,
                            "comment": "I agree with this. I like Sixth Sense and the concept but I think this cast could make other formats work too.",
                            "score": 5,
                            "author": "FuriousKale"
                        },
                        {
                            "level": 2,
                            "comment": "Honestly I think that why we’re getting extra episodes this season is because they won’t have a 3rd season 🤷‍♂️",
                            "score": 2,
                            "author": "abc052194"
                        },
                        {
                            "level": 2,
                            "comment": "It feels like a concept that can't last for too many seasons to me also, but then again, the american game show \"To Tell the Truth\", where celebrities try to guess the fake person by asking them questions, ran for 12 years in its first run, then has been rebooted several times.  So \"guessing the fake person/thing\" with celebrities concept has proved in the past it can run for a long time.",
                            "score": 1,
                            "author": "prospero2000usa"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "we love to see it!!!",
            "score": 54,
            "author": "ashyashhh"
        },
        {
            "level": 0,
            "comment": "so the episode with sukjin breaks record lol.\n\nIn that episode, they joked that the viewer ship will decrease.",
            "score": 44,
            "author": "CHOO5D",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is lower than previous ep",
                    "score": 7,
                    "author": "kripkrip",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Alexa, play JYP's The House You Live In",
                            "score": 9,
                            "author": "yeontura",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Youtube, play [Slayer - Repentless](https://youtu.be/yjb0j9l1sz4)",
                                    "score": 0,
                                    "author": "kripkrip"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "it's the highest rated ep this season",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love it!  The chemistry of the cast is amazing!",
            "score": 35,
            "author": "KnowItAlls"
        },
        {
            "level": 0,
            "comment": "I'm impressed they are going to build 2 new fake locations in just a week or two.\n\nLoco and Gray seem like single episode guests, so there's probably another guest or two.\n\nI wondered just how much money the show must spend, but then I realized they can operate kind of like house flippers. If they buy these places, they can turn around and sell for a profit after renovations. Or, they can negotiate renovations with the landlord for free use for a month. It's probably the same cost as building sets on a lot for a normal show.",
            "score": 38,
            "author": "Red_BW",
            "replies": [
                {
                    "level": 1,
                    "comment": "that's exactly what they do\n\nPD explained that after s1 ended",
                    "score": 26,
                    "author": "enigmatic_zephy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Any source about this? I've been really curious on what they do with the \"fake places\" that they're been making",
                            "score": 9,
                            "author": "PotatoBulletGun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "it was PD interview..\n\ni guess would need to google or hunt reddit threads..\n\naudience had asked how 6th sense is justifying the monetary investment, and he said it is actually profitable because they find buyers or folks who contract them because they are looking to renovate the place",
                                    "score": 19,
                                    "author": "enigmatic_zephy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "oooh so it's not random locations but places that people already asked for renovation help? so interesting, I hope they make a lil special edition clip one day to show this behind the scenes stuff",
                                            "score": 6,
                                            "author": "Naanaaah",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "not always",
                                                    "score": 3,
                                                    "author": "enigmatic_zephy"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i started looking forward more to see Sixth Sense than Running man, and no hate to running man i still watch it weekly, but i feel more excited towards Sixth Sense. I hope S3 will be around late dec or early 2022 (if they ever will make another season, hopefully)",
            "score": 37,
            "author": "xxkaito",
            "replies": [
                {
                    "level": 1,
                    "comment": "I completely agree with you! Still an avid running man viewer but sixth sense has been making me laugh more often!",
                    "score": 7,
                    "author": "real_hezatsu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It helps that they're less restrained in Sixth Sense than in Running Man. It allows Jessi, Somin, Mijoo, and Nara to do all their shenanigans and overpower Jaesuk, Sangyeob, and the guests.",
                            "score": 12,
                            "author": "Atharaphelun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Back when Somin first joined RM and she was allowed to do her thing it was great, but she got reeled in pretty quick (probably because RM was still rated 12+ at that time).",
                                    "score": 5,
                                    "author": "SpCommander"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hoping this will be a long-running show! this has been my new serotonin boost!",
            "score": 24,
            "author": "everyoof"
        },
        {
            "level": 0,
            "comment": "I wish it was a regular long-running show with no predetermined or fixed number of episodes. I know it's not possible because of the high production costs and time taken to prepare or set up fake places. But this is good news that it's getting good ratings because this means we can hope to see more seasons with probably more episodes. It already makes me sad thinking that this season will end soon but hopefully they'll announce they'll be coming back with a new season soon with the same members.",
            "score": 12,
            "author": "Uniquetrovert",
            "replies": [
                {
                    "level": 1,
                    "comment": "Production costs are actually lower than you think. The PD said it's far cheaper to do 6th sense than an episode of Running Man.",
                    "score": 9,
                    "author": "SpCommander"
                },
                {
                    "level": 1,
                    "comment": "I think cost is not really a problem. But they need to find new theme, as repetitive segment kinda become bored faster. Maintain current member + new fresh idea",
                    "score": 4,
                    "author": "Important-Turnover65"
                }
            ]
        },
        {
            "level": 0,
            "comment": "COME ON IRON MIN!!!!!",
            "score": 12,
            "author": "yeontura"
        },
        {
            "level": 0,
            "comment": "yay I'm so happy. i was sad that again we were getting closer to the end of this season but 2 more ep yess....really love the chem between the members",
            "score": 12,
            "author": "four-leaf-clover10"
        },
        {
            "level": 0,
            "comment": "Woohoo!!! Season 3 please!!!",
            "score": 9,
            "author": "avocadoberryshake"
        },
        {
            "level": 0,
            "comment": "Jessi is super funny in this show. I hope she continues on this show and joins more variety shows in the future!",
            "score": 8,
            "author": "sunningdale"
        },
        {
            "level": 0,
            "comment": "Yes! I can’t wait.\n\nI hope they green light more seasons after this",
            "score": 6,
            "author": "Marin115"
        },
        {
            "level": 0,
            "comment": "yes!!! they deserve everything for real.",
            "score": 6,
            "author": "pnoobs"
        },
        {
            "level": 0,
            "comment": "Yay. Happy to see what more we will get ;)",
            "score": 5,
            "author": "Financial-Deer-2804"
        },
        {
            "level": 0,
            "comment": "This is exciting news !!!",
            "score": 5,
            "author": "whatastrangequark"
        },
        {
            "level": 0,
            "comment": "Excited to see Gray and Jessi together after a while!",
            "score": 5,
            "author": "Sakuraxoxox",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gray’s album is fantastic. Really surprised at how much I have enjoyed it.",
                    "score": 2,
                    "author": "Fickle-Nectarine-542"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is probably an unpopular opinion but I wish this show had no guests. Most of the times I could not care less about the guests who often contribute minimally. The members' interactions are more than enough and they're what made the show what it is.",
            "score": 17,
            "author": "flungoutofspace9",
            "replies": [
                {
                    "level": 1,
                    "comment": "Respectfully, different guests have their own sets of fans who might not previously enjoyed the cast appearances in other shows. Lets think of it as an added exposure for them to fall in love with the cast members unique personalities. 😌👌🏻",
                    "score": 27,
                    "author": "dosabanget"
                },
                {
                    "level": 1,
                    "comment": "I think the guests play an important role. It's like the funny-man/straight-man combo. You can't just wish that only the funny-man was there. He needs someone to play off of. The guest is to highlight the contrast of how crazy the girls are. Also fawning over the guest and making them uncomfortable is part of the appeal.",
                    "score": 26,
                    "author": "enum5345",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yep I agree, I think it's also one of the main reasons Sang-Yeob was added. Since Jae Suk can do the straight man quite well, especially with these girls, but he's usually also one to be cracking jokes so they needed another straight man to balance the whole cast out",
                            "score": 15,
                            "author": "Naanaaah"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But then who will Mijoo and Somin excessively flirt with each week?",
                    "score": 9,
                    "author": "mxwp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love the concept of this show but I wish there were less food based themes, I've stopped watching it because it just seems to be the same each week, I know food is probably a fairly straightforward theme but I wish they'd mix it up a bit more",
            "score": 14,
            "author": "okiokiokir",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes!! Enough of the food, this is not mukbang. The exercise studio episode was great!",
                    "score": 9,
                    "author": "setlib"
                },
                {
                    "level": 1,
                    "comment": "Same. I do love the cast but I'm not watching if it's a food based episode, I'm honestly kinda sick of it.",
                    "score": 3,
                    "author": "l33d0ngw00k"
                }
            ]
        },
        {
            "level": 0,
            "comment": " Nice!!",
            "score": 3,
            "author": "red90999"
        },
        {
            "level": 0,
            "comment": "omgg locoo",
            "score": 3,
            "author": "hushluxx"
        },
        {
            "level": 0,
            "comment": "I want a 2D1N x Sixth Sense crossover",
            "score": 3,
            "author": "jpolo922"
        },
        {
            "level": 0,
            "comment": "I look forward every week to SS instead of RM so I am \\*\\*\\* DAMN happy about it :D\n\nI read a lot of people get sick of food themes, but I still love 'em. Korean food look so delicious.",
            "score": 3,
            "author": "hibousteph"
        },
        {
            "level": 0,
            "comment": "I actually really like the food episodes, and seeing the cast enjoy the food. It’s interesting to see different food concepts. I loved the food when I visited Korea previously, so it gives me good memories too.",
            "score": 3,
            "author": "bluebirdsandrainbows"
        },
        {
            "level": 0,
            "comment": "I have no idea who the extra guests are, but happy that we'll be getting more sixth sense :)",
            "score": 4,
            "author": "fokusfocus"
        },
        {
            "level": 0,
            "comment": "It's great to see a variety show with a female centric cast getting support like this.  If Running Man brings in a new cast member, I hope it's a women!",
            "score": 2,
            "author": "BluEyesWhitPrivilege",
            "replies": [
                {
                    "level": 1,
                    "comment": "This show would fail without Yoo Jaesuk. And he ain't a woman last I checked.",
                    "score": 2,
                    "author": "OptimumFries",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure what your point is.  Noone said it should be women only.",
                            "score": 3,
                            "author": "BluEyesWhitPrivilege",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You said female centric hence why I pointed that out. This show fails without the central male cast member.",
                                    "score": 1,
                                    "author": "OptimumFries",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean a lot of Korean variety shows are all or almost all male cast.  This one is a majority female and is one of the best out there.  Would be nice to have more like it.",
                                            "score": 2,
                                            "author": "BluEyesWhitPrivilege"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "From what i read, this is also bc New journey to the west season 9, is supposed to air after sixth sense finished, i mean the slot time. But njttw is being pushed back and sixth sense got extended.",
            "score": 2,
            "author": "orangecruzz",
            "replies": [
                {
                    "level": 1,
                    "comment": "really? where did you read that??",
                    "score": 1,
                    "author": "Naanaaah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "NJTTW9 was already announced in June to air in Oct. SS2 got the extension probably at that time, recently there were fan accounts that knew because of coffee tuck gifts plans, but kept it a secret until the news was released.",
                            "score": 2,
                            "author": "jhdnhc"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m so happy! Any ideas who the last two guests might be? 👀👀",
            "score": 1,
            "author": "WAPlyrics",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's in the post...\n\n&gt;According to a Star News report on the 24th, rappers Loco and Gray will appear as guests for tvN's entertainment program \"Sixth Sense 2.\"",
                    "score": 3,
                    "author": "fokusfocus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks!",
                            "score": 1,
                            "author": "WAPlyrics",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Actually it means that Loco and Gray will appear together on the 12th episode, so we shall see (hopefully one of the cast \"leaks\" during filming) soon!",
                                    "score": 12,
                                    "author": "Zephyrwin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you!! :)",
                                            "score": 1,
                                            "author": "WAPlyrics",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "loco and gray are the next guests already",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good show really. Quite entertaining. I think it can another season and that should be about it.",
            "score": 1,
            "author": "Psychological_War175"
        },
        {
            "level": 0,
            "comment": "ohh i got excited i thought Gary was guesting",
            "score": 1,
            "author": "darkapao",
            "replies": [
                {
                    "level": 1,
                    "comment": "They are",
                    "score": 0,
                    "author": "shilohdrummer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "LETS GOOOOO",
            "score": 1,
            "author": "SpCommander"
        },
        {
            "level": 0,
            "comment": "I hope and I need season 3! I love this show so much! Love the cast and it's hilarious! I usually don't watch k-variety but I stay tune every Friday  ( Saturday for subs ) for this show.",
            "score": 1,
            "author": "Xsandee"
        },
        {
            "level": 0,
            "comment": "I just hope if there will be another season, they need to step up. I noticed that there are parts in s2 that they gave hints or giveaways for the cast to guess the fake one. Also, more non-food episodes.",
            "score": 1,
            "author": "EpikMint"
        },
        {
            "level": 0,
            "comment": "Jessi y sanjeob ♥️♥️♥️♥️♥️",
            "score": 1,
            "author": "Alternative_Dig5126"
        },
        {
            "level": 0,
            "comment": "I don't think we'll get a season 3 with Jessi, she posted on her instagram story\n\n \"tomorrow...well in a couple of hours is our last day shooting and words can't express how I feel .... Thank you @6_s_e_n_s_e for the amazing experience and letting meet these AMAZING people. Love you forever @6_s_e_n_s_e family ❤ *something in Korean ❤😂\" \n\nSounds like an obituary and indication of saying good bye...",
            "score": 1,
            "author": "secretlyfromMars"
        }
    ]
}