{
    "id": "zafwqf",
    "score": 67,
    "title": "Love Catcher in Bali | E03 | 221202",
    "author": "Driz_12",
    "date": 1669969281.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/zafwqf",
    "media_urls": [
        "https://www.reddit.com/r/koreanvariety/comments/zafwqf/love_catcher_in_bali_e03_221202/"
    ],
    "other_urls": [
        "https://www.instagram.com/hoho_dragon/)",
        "https://www.instagram.com/laul_sb/)",
        "https://www.instagram.com/junghyuniiii/)",
        "https://www.instagram.com/kimyunsuro/)",
        "https://www.instagram.com/kwak_taehyeok/)",
        "https://www.instagram.com/h3_1o/)",
        "https://www.instagram.com/t_110771/)",
        "https://www.instagram.com/ririyujeong/)",
        "https://www.instagram.com/c.taeeun/)",
        "https://www.instagram.com/applemang0o/)",
        "https://www.bilibili.com/video/BV1uP41137xW?p=3)",
        "https://www.viu.com/ott/sg/en-us/vod/465040/Love-Catcher-in-Bali)",
        "https://link.emediaarts.net/lovecatcherinbali/lcib-episode-3)",
        "https://twitter.com/tvingdotcom/status/1599599446752231424?s=20&amp;t=0ZQGWe2QdVdhjWRYV2bbbA)",
        "https://www.reddit.com/r/koreanvariety/comments/yyjiu2/love_catcher_in_bali_e01_221118/?utm_source=share&amp;utm_medium=web2x&amp;context=3),",
        "https://www.reddit.com/r/koreanvariety/comments/z487z3/love_catcher_in_bali_e02_221125/?utm_source=share&amp;utm_medium=web2x&amp;context=3)"
    ],
    "postText": "# Description\n\n&gt; Love Catcher is a show featuring a group of men and women coming together for love or money. In this event, men and women who do not know each other will live in the same house. But before moving into the house, participants must choose between two identities: 'Love Catcher' or 'Money Catcher'. Later, 'Money Catcher' was seen forming sincere relationships with other 'Love Catchers'. On the other hand, 'Money Catcher' can win almost $50,000 if they can become a couple with 'Love Catcher' at the end of the show. When making romantic advances, there's an added mood of caution as participants can only guess who's there for love or money. \n\n# Panel\n\n* Jang Do Yeon\n* Joo Woo Jae\n* Jun Hyun Moo\n* Gabee\n* Kim Yo Han\n\n# Cast\n\nMale Participants\n* Park Yong Ho - [@hoho_dragon](https://www.instagram.com/hoho_dragon/)\n* Cho Seong Beom - [@laul_sb](https://www.instagram.com/laul_sb/)\n* Park Jung Hyun - [@junghyuniiii](https://www.instagram.com/junghyuniiii/)\n* Kim Yoon Soo Ro - [@kimyunsuro](https://www.instagram.com/kimyunsuro/)\n* Kwak Tae Hyeok - [@kwak_taehyeok](https://www.instagram.com/kwak_taehyeok/)\n\nFemale Participants\n* Kim Hyo Jin - [@h3_1o](https://www.instagram.com/h3_1o/)\n* Hwang Soo Ji - [@t_110771](https://www.instagram.com/t_110771/)\n* Lee Yu Jeong - [@ririyujeong](https://www.instagram.com/ririyujeong/)\n* Choi Tae Eun - [@c.taeeun](https://www.instagram.com/c.taeeun/)\n* Hong Seung Yeon - [@applemang0o](https://www.instagram.com/applemang0o/)\n\n\n# Episode Links\n\n|Info|Link|Notes|\n|:-:|:-:|:-:|\n|RAW|[Bilibili](https://www.bilibili.com/video/BV1uP41137xW?p=3)||\n|Stream|[VIU](https://www.viu.com/ott/sg/en-us/vod/465040/Love-Catcher-in-Bali)|^(ENG SUB)|\n|Softsub|[Download](https://link.emediaarts.net/lovecatcherinbali/lcib-episode-3)|^(ENG SUB)|\n\n\n# Important Update on Episode 4\n&gt; Due to internal circumstances, this week's &lt; Love Catcher in Bali &gt; episode 4 release schedule has been delayed by one week. On December 9th, a special video will be uploaded to TVING YouTube. Love Catcher in Bali Episode 4 will be released on December 16th at 16:00.\n\n— [TVING](https://twitter.com/tvingdotcom/status/1599599446752231424?s=20&amp;t=0ZQGWe2QdVdhjWRYV2bbbA)\n\n\n# Previous Discussions\n\n|Episode(s)|\n|:-:|\n|[01](https://www.reddit.com/r/koreanvariety/comments/yyjiu2/love_catcher_in_bali_e01_221118/?utm_source=share&amp;utm_medium=web2x&amp;context=3), [02](https://www.reddit.com/r/koreanvariety/comments/z487z3/love_catcher_in_bali_e02_221125/?utm_source=share&amp;utm_medium=web2x&amp;context=3)|\n\n___\nTHE DISCUSSION BELOW MAY CONTAIN ***SPOILERS***",
    "comments": [
        {
            "level": 0,
            "comment": "I have watched the subbed episode up until the boys talk in the beach scene and I find the way SB provoking YH is really annoying. I dunno why but I keep getting \"antagonistic\" feeling from SB, perhaps because he's put in contrast to YH who seems so kind and pure.",
            "score": 55,
            "author": "moon_gin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Totally agree, the whole conversation seemed so unnecessary, SB is just trying to provoke YH, which is pretty lame. Really liked YH’s answer tho.",
                    "score": 39,
                    "author": "SomewhereJaded5587",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hate to use this word because it is so cliche and overused at this point, but as a guy knowing fully what guys are like, sung bum gives me toxic controlling vibes, just off little interactions here and there he's had, already marking his territory with soo ji and acting like he is giving permission to talk to her, and how he talks down to her like a kid, masking it as being playful.. or when Yong ho is talking to her he moves in to try to shut it down immediately knowing Yong ho is considerate to a fault and will allow himself to be interrupted. Maybe because YH is such a good person that the contrast makes SB look bad, but idk I feel like there is a dark side to him under the surface.",
                            "score": 37,
                            "author": "NoviDon07",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup when he said that the other guys can talk with SJ as well, it's giving the vibe that SJ is like his possession and that he is giving his consent for the other guys to interact with her.",
                                    "score": 24,
                                    "author": "moon_gin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right. And normally I would just give the benefit of the doubt, dating shows are weird places your in a foreign environment with a bunch of  strangers for weeks or months with cameras everywhere and isolated from the outside world. Can make you say and do things you normally wouldn't. But the little, and I'd like to emphasize little red flags he keeps showing after just 3 days is making my toxicity alarm go into warning mode. Not sounding the alarm just yet.",
                                            "score": 12,
                                            "author": "NoviDon07",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"You can try so much more but for some reason guys don't\" and  \"I thought she would be shy about it but she wasn't.\"\n\nRather than posessive vibes, I thought what he was trying to say is that the girls there are easy. Forget love/money catcher thing, I would sincerely be surprised if he is actually a decent guy. One of the girls even said he didn't seem like a nice guy.",
                                                    "score": 18,
                                                    "author": "Lain-H",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "he is so weird, if i were sj i wouldn’t like being talked about like that",
                                                            "score": 11,
                                                            "author": "vesperxy"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "SB reminds me of Season2's Chanwoo",
                    "score": 15,
                    "author": "deardabangg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmao, his iconic smirk kept flashing back when I was watching Season 3 or Love Catcher in Seoul. And now here for Love Catcher in Bali.",
                            "score": 9,
                            "author": "MNLYYZYEG"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "God. I wish I found out about Love Catcher in Bali after it's all aired. I hate anticipating and waiting what's about to happen next. I can't wait for next week! All I know is that Tae-eun and Hyojin are my main girls.",
            "score": 45,
            "author": "Psychological_Pen491",
            "replies": [
                {
                    "level": 1,
                    "comment": "But it’s also sad for me rn, though So-Roo feels like a nice person, I think he isn’t meant for Tae-eun, they just simply have different styles ahh! Tae-eun seems very transparent and So-Roo gives a bit keep to himself vibes! Also his body language around Tae-eun feels too flirty too soon, him knowing how much she is invested in him",
                    "score": 16,
                    "author": "whateva135",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm trying my best not to be attached to the Taeeun and Sooro ship because the mechanics of this show is really brutal. But after finding out Tae-eun's mindset that she's open to being hurt it keeps me at ease that she's just all for the journey. I want her to meet the best pair she can find and I heard there will be a love triangle between her, Sooro and Jung Hyun. I'M INTRIGUED.",
                            "score": 13,
                            "author": "Psychological_Pen491",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;a triangle w/ junghyun? whoaa.. where did this info come from ? let me know :)",
                                    "score": 1,
                                    "author": "hafunohane"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I actually felt the opposite about the body language thing. It's Tae-Eun who is always more forward than him. Just this episode she came into the men's room, he moved to the back end of his bed to give her comfortable space and as their conversation went on, she leaned forward and inched closer. She is an \"act first, think later\" kind of person. So it might seem like transparency and the contrast makes him seem reserved/weird but I think So-Roo's approach is wiser. It really has only been 3 days since they met so I think it's good not to open yourself up completely to someone who you don't know yet and who could hurt you.",
                            "score": 7,
                            "author": "Naanaaah"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Over the course of 3 days, SY has experienced a lot of change of heart. She sent her message to SB on night 1, shifted to YH on the second day (with a subtle indication during the talk with her roommates that YH fits her ideal type), and now she is expressing her interest in SR as well. It's interesting to see if she will stick with SR or will she have another change of heart again?",
            "score": 26,
            "author": "moon_gin",
            "replies": [
                {
                    "level": 1,
                    "comment": "She said she figured it out and is commited to Soo Roo till the end so lets see lol",
                    "score": 10,
                    "author": "NoviDon07"
                },
                {
                    "level": 1,
                    "comment": "She bothers me so much lol.",
                    "score": 9,
                    "author": "Psychological_Pen491",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "she hasn’t done something objectively wrong right now so sorry for being confused but why??",
                            "score": 9,
                            "author": "Fair_Frame3079",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ep. 3 Preview episode really bothered me so much. TE and SR was obviously having a private conversation but she chose to join for what reason? It's obvious that she's feeling desperate as it's been the third night yet she still haven't receive a text message.",
                                    "score": 5,
                                    "author": "Psychological_Pen491",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "they're only there for 8 days ofc she's gonna take any opportunity to join? it's not like she even sat down, she asked and they said yeah...her conversation was interrupted too it's no big deal",
                                            "score": 11,
                                            "author": "PuzzledWarning"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "yeah this is a strange take. they are not exclusive and everyone is on the show to essentially find their match. whether she is \"desperate\" or not doesn't have anything to do with anything either.",
                                            "score": 9,
                                            "author": "bomhee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm rooting for SR and TE so her desperation is just normal that it rubs me off of her the wrong way. It's MY opinion. I don't care about what you think.",
                                                    "score": 3,
                                                    "author": "Psychological_Pen491"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I get the optics of it but we don’t know how the conversation is gonna pan out bc it’s an edited short clip and it’s not like she did it maliciously?? they’re in a house together and she asked can i join you and they said yes. it might seem a bit awkward but it’s not that serious i promise",
                                            "score": 5,
                                            "author": "Fair_Frame3079"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think it’s cos she is 💵",
                    "score": 7,
                    "author": "temptressmoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "if shes money sooroo will be her least target...due her strong connection with tae eun",
                            "score": 2,
                            "author": "accure18"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i actually support sooro-songyeon more they feel more natural together.",
                    "score": 3,
                    "author": "accure18"
                },
                {
                    "level": 1,
                    "comment": "she might be money but might switch to love cause her and soo ro acc do have rlly good chemistry and there is a good chance she might have just fallen for him lol",
                    "score": 2,
                    "author": "PuzzledWarning"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looking at the preview for ep 4, I hope that Yong Ho &gt;!opens his heart and entertains Hyo Jins interest.!&lt; Don't just be a one track mind with Soo Ji, because she has been doubting him from the beginning thinking he is in it for money and that has rubbed me the wrong way. Its really getting annoying, he isn't transparent? He is just shy around the one he likes and he is very conscious of others he is a very considerate guy. I hate when peoples kindness gets taken the wrong way or for granted. &gt;!she keeps picking Sung Bum over him during voting as well, even though she keeps exclaiming that they has such good chemistry. i guess the chemistry isn't all that good if you can't tell if he is sincere or not and always pick Sung Bum. !&lt;I was rooting for them at first, they look really cute together and have similar senses of humor, with the 4D cringe jokes, but now i'm slowly thinking that they are not compatible.",
            "score": 27,
            "author": "NoviDon07",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;she keeps picking Sung Bum over him during voting as well.\n\nI am convinced she is doing her best to keep both guys' interest in her. It is hard to do that, considering you are all living in the same roof, and I think she is doing well. She spends more time talking with Yongho but the night texts are for the other guy. I get it, she is torn between her attraction to the personality vs. looks but I hope this won't take too long. It would exhausting not just for the guys but also to her too. Seungyeon even confessed that she is already exhausted  by the 3rd night.",
                    "score": 24,
                    "author": "gCellAtWork",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it's easy for us to fall for soo ji because she is young and innocent and we want to protect her and have her find the right guy, but I think we may be blinded by her \"gullible\" cute charms. In her introduction of the show she said something about being really popular with guys and being approached all the time. She is also really young and working hard to pursue her dream. I don't think she is in a hurry to find a LTR. she says she doesn't think Yong ho is being transparent but in actuality she is projecting and is using yongho as a smokescreen. She's actual putting on an act and is in fact money.",
                            "score": 26,
                            "author": "NoviDon07"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd love to see YH expanding his options and considering HJ as well. It's still quite early days and it's not too late to try to expand the horizon and find out the charms of the other girls.",
                    "score": 14,
                    "author": "moon_gin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "as of now im rooting for yong ho and hyo jin, the rest still feels like money lol",
            "score": 28,
            "author": "thefaptard"
        },
        {
            "level": 0,
            "comment": "Just finished ep 3 and im rooting for SR and TE so much but my gut tells me SR is prob a money catcher whereas TE is the love one. She seems stable to me. With her current job, it seems like she doesnt come here for money (similar to YH).",
            "score": 28,
            "author": "No_Indication_3198",
            "replies": [
                {
                    "level": 1,
                    "comment": "Trueeee SR even told SY later he feels like he has nothing to show for himself (who does at 22?) but that would be another reason to pick MC",
                    "score": 9,
                    "author": "xiaopow"
                },
                {
                    "level": 1,
                    "comment": "Can’t wait for ep 4… did u see the end of ep 3? Omg what a cliffhanger 🤭 The love triangle that’s too intense! But team SR and TE here 🙋🏻‍♀️",
                    "score": 5,
                    "author": "DocInday95"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YH again is such a sweetheart. Maybe that’s why I was so frustrated with SJ! why do you have to doubt him and play in a pool with another man  in front of him and very other person in the house? Also, poor YH did all the dishes alone while they were chilling in the pool, despite that they both made the breakfast together.",
            "score": 24,
            "author": "SomewhereJaded5587"
        },
        {
            "level": 0,
            "comment": "This season is sorely missing the game aspect of the show and is trying to be more like Heart Signal. Shouldn't the Secret Night happen more often? They're only going to be in Bali for 4 more days. What happened to the competitions where the best couple/team can get clues on the other contestants? The photo shoot was nice, but it's essentially a three-way date.\n\nI figured Yong Ho was a &gt;!Love Catcher. First is his career as a teacher. Second because he comes off as too considerate and passive to be a money catcher. I'm rooting for Yong Ho and Hyo Jin to be together. Soo Ji is very pretty and holy smokes she looks hot in that bathing suit, but she can't read the room at all. I laughed when all the other girls implied she was a \"sweet summer child\" during lunch.!&lt;\n\nSeong Beom basically declared he was a &gt;!Money Catcher. The way he talked about Soo Ji felt demeaning like he's already claimed her as his property or something. !&lt;\n\nGood season so far, but I want to see more competition!",
            "score": 25,
            "author": "Jwang19",
            "replies": [
                {
                    "level": 1,
                    "comment": "So far we have Secret Night on night 1, while night 2 does not have any. Until the end of episode 3, we have not seen the end of night 3 so we'll see if there will be a Secret Night on night 3 during episode 4 I guess.",
                    "score": 5,
                    "author": "moon_gin"
                },
                {
                    "level": 1,
                    "comment": "What..there’ll only be 7 episodes? Pls lmk I m watching a love reality show for first time!! Started watching this to see wonderful comistry between JDY and JHM as they host it!!",
                    "score": 2,
                    "author": "whateva135",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Past seasons of Love Catcher usually have 8 episodes per season. We still dunno how many episodes this season will have.",
                            "score": 3,
                            "author": "moon_gin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sooji is all the time spacing out and not thinking fast when asked simple questions. It's like her process of information is a bit slower. She seems to think a lot. I started to react when she was thinking about the age gap and then after the next guys occupation and age reveal she was still thinking about it. Now it was another remarkable situation where the girls sat and talked about money catcher and a girl asked her what she thought about him. It's fascinating to watch her when she spaces out like that. What is she thinking about that makes her so slow in associating in normal pace during a conversation? So cute!!!",
            "score": 17,
            "author": "Secure-Ad4436"
        },
        {
            "level": 0,
            "comment": "I hope next season they can cast some guy from the Chaebol family , not some over the top muscle mania guys lol",
            "score": 14,
            "author": "Deep-Requirement3073",
            "replies": [
                {
                    "level": 1,
                    "comment": "We already got the rich Lamborghini guy last season 😂",
                    "score": 30,
                    "author": "zaichii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That guy has too much pride. But it was so funny watching him",
                            "score": 6,
                            "author": "Electrical-Prune-348"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "lol producers saw the popularity of single’s inferno and thought they needed a cast with similar physiques. And it’s Bali where they’ll have many chances to go topless. \n\nI’m also tickled at how HJ has been openly ogling and commenting about their topless-ness in every single episode so far.",
                    "score": 22,
                    "author": "anothersundayx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Soo-ji... Seong-beom is giving off major money catcher vibes, please go to Yong-ho instead 😣 Also, why did she go swimming right after eating? What if she got indigestion? 🤨\n\nSeung-yeon is so cool. It's not easy to confess to someone you know has no interest in you. Even in the first episode, her confidence was pretty charming. Though, it seems like her self-esteem took a hard hit after receiving no text messages. Hopefully, things get better for her. I really like her personality!\n\nYong-ho continues to be my favorite participant. He's awkward but cute. I was going to root for him and Soo-ji, but Hyo-jin seems like a good match as well.",
            "score": 13,
            "author": "warau16",
            "replies": [
                {
                    "level": 1,
                    "comment": "YH's comments after choosing to be an LC is so wholesome and sweet, how he has been in the situation of not having much money so he can deal with that but wanting to find someone for him. Gah.",
                    "score": 15,
                    "author": "zaichii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "With the revelation of one of the participant's identity this episode, &gt;!we know that among the male participants, there is at least one Love Catcher (YH) and one Money Catcher (the one inviting SJ to the Secret Night on episode 1) now.!&lt;",
            "score": 14,
            "author": "moon_gin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think its pretty clear who the money is now lol. spoiler---&gt;&gt;!who else would call out soo ji but sung bum?!&lt;",
                    "score": 16,
                    "author": "NoviDon07",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I initially thought it would be Soo Ro because he chose HJ to text on the first night so he was trying to feel out everyone and avoid the money catcher. But now I don't know because he seems genuine with both TE and SY hmmm",
                            "score": 7,
                            "author": "takemymoneyandleave",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;he seems genuine with both TE and SY hmmm\n\nDon't be fooled by his eyes. *\"It's the money catcher eyes!\"* \\-Woojae 😂",
                                    "score": 17,
                                    "author": "gCellAtWork"
                                },
                                {
                                    "level": 3,
                                    "comment": "The snippets of side profile are too obvious.. and the lip structure.l. it is SB..without a doubt. it was immediately clear the moment his lips were shown while chatting on that night",
                                    "score": 5,
                                    "author": "enigmatic_zephy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "One other possibility: It could have been the new guy, Tae Hyeok, who was the one to call out SJ to the Secret Night.  As the catfish, he may have been given special info (like ages and preliminary video feeds, like Pink Lie), and picked her because she seemed like the one who would be the most honest when questioning?",
                            "score": 11,
                            "author": "j6ce3Hfe6L",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True! That's very observant of you and makes sense. Maybe Tae hyuk was attracted to soo ji visually at first and wanted to question her about her True intentions to know whether to pursue her once in the house or go a different direction. I wonder who between the two guys it was. 🤔 crazy how much of the drama in the house is revolving around soo ji so far. I know she is cute but damn lol",
                                    "score": 3,
                                    "author": "NoviDon07"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I thought of that too, but the Secret Night guy said to SJ that night that he thinks she’s a Money Catcher.. Why would a money catcher pursue a money catcher.. \n\nBut it also doesn’t make sense for the others to be the Secret night guy. So maybe he is \nwho you guessed, but he said she’s a money catcher just to check her reaction?",
                            "score": 8,
                            "author": "anothersundayx"
                        },
                        {
                            "level": 2,
                            "comment": "Theoretically that should be the answer, but we can't never be 100% sure as there could be unexpected twist.",
                            "score": 3,
                            "author": "moon_gin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm still nervous about SR - TE pairing despite their mutual \"commitment\" to give a try for each other this episode. As we know, relationship is a long term game and I'm afraid they may have to work around a lot of different perspective and priority in life due to their age gap.",
            "score": 11,
            "author": "moon_gin"
        },
        {
            "level": 0,
            "comment": "Ahhh here come the votes for YHo. Age and occupation made a difference i think.\n\nAwww TE hasnt given up bc of the age gap! I really like her! Yaaayyyy a mutual loveline!\n\nThat means JH didn't msg HJ! So he msged YJ instead... i guess he likes them both. He could have been nicer to HJ in the kitchen though.\n\nSR's note was so cute! \n\nI think YHo feels intimidated by the other men... the juxtaposition between the outdoor workout scene and his 5 pushups was so brutal 💀 but SJ is giving him lots of signals despite not msging him \n\nAre korean people more prone to sunlight allergy? It just occured to me that this is the 3rd korean dating show participant with a sunlight allergy that i've seen in the last 2 months or so. \n\nOoooh i wonder if the women will be influenced by the girl talk regarding who others think are MCs. \n\nYay the catfish!!! He's pretty handsome. Seems like a moneyyyyy. \n\nSR and TE are soooo cuuuute catching up after spending the day apart. I hope theyre both LCs! \n\nOmg SY shooting her shot!!!! 🙈 that was cool. She's def a LC!!! \n\nAwww i hope YHo gets to find love. I can see him with both SJ and HJ.\n\nSo that means SB is money!!! He's probably the one who msged SJ on the secret night date right?",
            "score": 9,
            "author": "xiaopow"
        },
        {
            "level": 0,
            "comment": "Dating shows are always like this. The girls boys fall for are too predictable. I wonder if it's only Korean guys or guys in general who fall for the sweet/doll like vibe.\nI am sad for the girls who are not getting picked. I feel they are genuine and honestly more of the girl who are actually sincere.",
            "score": 10,
            "author": "Emotional-Ad6489",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah and the girls in this show feel great to me too, not to mention gorgeous. I’m not really feeling sj to be honest",
                    "score": 7,
                    "author": "temptressmoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sigh. \nI get  it and don’t get it at the same time. Haha \nI want to announce HEY, DO YOU SEE THESE OTHER GIRLS? THEY ARE PERFECTLY FINE.",
                            "score": 7,
                            "author": "Emotional-Ad6489",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it’s an Asian thing.. the sweet girl would be the least popular in shows like love island .. I think girls like tae eun and the girl with the lip fillers would be most popular",
                                    "score": 6,
                                    "author": "temptressmoon"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love catcher in Bali or Soo Ro in Bali?",
            "score": 8,
            "author": "Medical-Character655",
            "replies": [
                {
                    "level": 1,
                    "comment": "His modeling and acting career is about to explode lol",
                    "score": 4,
                    "author": "NoviDon07"
                },
                {
                    "level": 1,
                    "comment": "After episode 3, his IG account is gaining a lot of new followers. Viewers seem to love him a lot.",
                    "score": 2,
                    "author": "moon_gin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It seems I have a habit of rooting for the girls that don't get their happy ending in each season of love catcher :( I'm rooting for Hyo Jin and I desperately want her to win even if she is a money catcher (they don't deserve her). I'm usually drawn to the more shy or timid participants and Hyo Jin just seems easy-going and likable. &gt;!She's even great at yoga!!&lt; Plus her natural/ actress-like beauty is the cherry on top.\n\nPlease I cannot take another season of my girl walking away with no one (or no money).\n\nEdit: I actually shipped her first with Yongho since they met in the first episode &gt;!and the spoiler for ep 4 is giving me hope!!&lt;",
            "score": 21,
            "author": "doremi1217",
            "replies": [
                {
                    "level": 1,
                    "comment": "I actually hope Hyo Jin - Jung Hyun pairing would have worked, although in this episode Jung Hyun is still leaning more towards Yu Jeong. I need to watch the episode with sub later but it seems like during the talk with the other boys, Jung Hyun actually admits that he's torn between Hyo Jin and Yu Jeong.",
                    "score": 7,
                    "author": "moon_gin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes! They were very cute last episode so of course, I don't mind. However, you'll find with subs &gt;!that Jung Hyun might just be attracted to her for her looks and is finding that he has more chemistry with Yu Jeong. Also the way he treated Hyo Jin in the kitchen compared to how he treated Yu Jeong afterward was a bit weird to me. !&lt;",
                            "score": 18,
                            "author": "doremi1217",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The photographer of their photo shoot published some unreleased photos on Instagram and seeing those photos make me wish they are a thing. But yes, at this point, it seems that Jung Hyun's heart is still leaning towards Yu Jeong more.",
                                    "score": 5,
                                    "author": "moon_gin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "what's the account name?",
                                            "score": 3,
                                            "author": "hunny_16",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "@/mahakaraphoto",
                                                    "score": 2,
                                                    "author": "doremi1217"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Am I the only one who doesn't want Hyojin to end up with Junghyun?\nI don't like the way he treated her in the kitchen. To add his comment that he is only attracted to her beauty, well dude, you spent a day with her and if that's the only thing that you can praise of her, it means you aren't into her.\nSo she'd better move on to another guy.",
                            "score": 15,
                            "author": "chaerinna",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My comment was based on their chemistry during episode 2 photo shoot, which was undeniably one of the best of the day. But as it's revealed on episode 3 that Jung Hyun is still more interested to Yu Jeong, maybe they are indeed not meant together. \n\nI think Jung Hyun is not wrong to focus on making more connection with the girl that he is more interested in during the cooking time, especially that for the first 2 days, he almost couldn't have personal time with Yu Jeong at all. But he himself also said during the boys talk time that he hasn't actually felt a strong connection to any of the girls and for now he only has affinity towards Hyo Jin and Yu Jeong so we'll ses what happens next.",
                                    "score": 10,
                                    "author": "moon_gin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well of course it isn't wrong to get to know the others. The thing that turned me off is that he rejected Hyojin's help even when she said she enjoyed cooking, but then he proudly said he got helped from Yujeong. That's not so kind of him.",
                                            "score": 9,
                                            "author": "chaerinna",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes he could have been less direct like that even if he didn't want Hyo Jin to be the one helping him. But at the same time it's also a timing game for everybody and he might feel that if he didn't get a chance of one-and-one time with Yu Jeong that time, he might not get another chance again.",
                                                    "score": 3,
                                                    "author": "moon_gin"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "(1) I love the panel especially with Woojae's comments and Gabbi's facial reactions.\n\n(2) I hope we get more Hyojin screentime. Her expression [here](https://i.imgur.com/w0oNNn9.png) so cute. I really think she is a love catcher. She really tried her time with Junghyun but.. oh well.\n\n(3) I knew it Yongho is a &gt;!love!&lt; catcher. Moreover, he is a catch! He is very considerate to people. Seongbeom, &gt;!you money catcher!&lt;, really had the guts to say about mustering courage among the boys.\n\n(4) Yongho is doing fine, even Sooji reciprocate corny jokes to him. I think it is so sweet. For this ship to sail, she should be a love catcher. (I kinda doubt it though, that's why my next point...)\n\n(5) ...The possible loveline between Hyojin and Yongho is welcome. I am disappointed with Junghyun in this episode. I can't point something but he got so weird knowing that he isn't the oldest guy in the house. *(Also him cutting Seungyun and Sooro's conversation short! I'm fuming.* 😤*😡)*  I like Yongho's attitude the most. From the preview, Hyojin and Yongho had some quite interaction, and with Junghyun nudging her away, she's ready to move on. Or maybe she seems investigating whether he is love catcher or not. IDK, either way I am rooting for her too for Yongho, whichever ship works out.\n\n(6) I really like the love triangle between Taeeun x Sooro x Seungyeon. As much as I think that Sooro and Seungyeon could be money catchers, I would like to know how this will pan out especially with Seungyeon's overdose of heart-fluttering words. Her confession is the sweetest. Her friendship with Yujeong is so cute too, them scrunching up their noses like they have a secret friend language and helping the other to have some privacy with the person she likes.\n\n* Sooro sharing about him being just a shell and have nothing to offer is an evident clue that he is money catcher. After listening to Yongho's motive as a &gt;!love!&lt; catcher, I couldn't imagine Sooro explaining that he is a love catcher, he probably is in the stage of his life where he needs money. That isn't bad for Taeeun and Sooro's relationship though, I think he suits the married life with Taeeun if they ever decided to take things further. But marriage could be too early for Sooro.\n\n(7) About the newcomer, I agree that he and Yujeong have good chemistry. Her voice when she saw plenty of garlic. I think she likes older guys that's why her interest with Sooro waned. Also, I want to ask WHY did the newcomer picked his identity **before** meeting the women? That's just different from the other participants, I wonder if he has some benefit or something in the future.",
            "score": 21,
            "author": "gCellAtWork",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't remember YJ showing agyeo until now, it was a shocking yet pleasant surprise to see that kind of side to her, this guy definitely piqued her interest.",
                    "score": 14,
                    "author": "NoviDon07"
                },
                {
                    "level": 1,
                    "comment": "woo jae is wild hahaha",
                    "score": 6,
                    "author": "jooandtae"
                },
                {
                    "level": 1,
                    "comment": "Agree with everything u said!! \n\nHyojin and Taeeun are my girls, so I’m rooting for them whether they are love or money (but they both scream love IMO).\n\nI started off not liking Yong Ho but I’ve made a complete 180 on him. I relate to his lack of confrontation with SB, bc I hate conflict. Overall, he seems sweet and I am 100% here for YH x HJ!!!! They have similar vibes and the book scene in preview made me swoon!!! \n\nSY really surprised me, her confession was so bold and cute! I didn’t have any opinions on her before this, but major respect for putting it all out there like that! Even if she is money (I think she is), it’s still hard to say your feelings so bluntly. Although, I don’t really see it swaying SR, who I think is money, because he knows he has a sure thing with Taeeun, who he thinks is love. But, with that said, can’t wait to see their love triangle unfold, especially with that preview.",
                    "score": 12,
                    "author": "Illustrious-Insect26"
                }
            ]
        },
        {
            "level": 0,
            "comment": "TE really has like a quiet confidence. I really like her personality. You can tell that SR makes her shy lol it’s really cute. Also, the way SR looks at her when she’s not looking is really charming. For some reason I get that SR was treating SY like a friend? I think her confession surprised him. I wonder if her efforts will pay off? That preview was kind of weird for me lol like that’s so awkward. I kind of get money catcher vibes. \nI’m glad that the other girls are becoming more active. I wonder who the new guy will go after. I really am starting to like YJ as well.",
            "score": 19,
            "author": "Odeto_immortality",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think he was treating her as a friend. But among the house guests, other than TE, he's been most comfortable with SY. SR mentioned that he doesn't want to spend time with others unless it's with the person he is attracted to, and we saw him be considerate to SY while she washed the dishes. They did build a bit of affinity there and during their late-night convo so I'm really proud of SY boldly confessing her interest. Even if it doesn't go anywhere it's nice seeing women on the show express themselves without regret. I'm honestly rooting for both these girls, SR will have a tough choice!",
                    "score": 4,
                    "author": "Naanaaah"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For real though, is Suji like playing a character on purpose or what. Is she acting aloof. But then she don't mind showing off in front of everyone (but wait, how come she doesn't know how to balance or do yoga, wtf?). So like what is going on. Is she a legit love catcher. Just don't want Yongho to get hurt, pretty sure everyone's vicariously experiencing the show through him.\n\nIt's always nice to see the Suji x Yongho kitchen scenes or like coffee-making routine. Sigh. That ship better not sink.",
            "score": 7,
            "author": "MNLYYZYEG",
            "replies": [
                {
                    "level": 1,
                    "comment": "She is an intresting carachter. Her slow cognitive process stands out. Cute!!",
                    "score": 3,
                    "author": "Secure-Ad4436"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hyo jin is so pretty! can someone send me pics/ screencaps of her pls? i thought she looked the cutest on these eps",
            "score": 7,
            "author": "RedditFan1000",
            "replies": [
                {
                    "level": 1,
                    "comment": "haven't found one, but I agree hyo jin imo is one of the most beautiful non celebs I've seen in a k show...",
                    "score": 4,
                    "author": "thefaptard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "aside from her IG, i guess no one compiled some screencaps (especially from ep.2, when she's with the guy on the beach... her smile there was so pure and genuine!!) again, she's so pretty and certainly she deserves a great love &lt;3",
                            "score": 1,
                            "author": "RedditFan1000"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "it's amazing none of the guys interested with Hyo jin, she is a great woman lol smart and beautiful",
            "score": 7,
            "author": "Deep-Requirement3073"
        },
        {
            "level": 0,
            "comment": "am I the only one that is shipping TE and SooRoo so muuuch??? Like pleaseee make it that they can be together at the end",
            "score": 17,
            "author": "AcademicBadger9380",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope theyre both LCs 🥲",
                    "score": 6,
                    "author": "xiaopow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was there some rule mentioned regarding Secret Night? Like everything they say there has to be the truth?  One could easily dodge a question, be vague or outright lie if not.",
            "score": 4,
            "author": "Yuki_karase",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't recall they explain that part in detail so I guess there's always potential that someone is telling lie. One particular example is when SJ asked the MC if he is willing to change identity and the MC answered \"yes\", I think that answer could be a lie as ofc the MC won't answer \"no\" towards that question.",
                    "score": 3,
                    "author": "moon_gin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "no episode this week, they making us wait another week lmao",
            "score": 6,
            "author": "Liston08"
        },
        {
            "level": 0,
            "comment": "Hyo Jin’s my main girl and all these guys ignoring her is so frustrating. I mean I get that everyone has a type buuuut urghhh how can they not see how great she is 🥺 I hope she finds someone who’ll appreciate her. I dont even know who to ship with her anymore coz they just keep on letting her go 😭",
            "score": 6,
            "author": "FreshAd4289"
        },
        {
            "level": 0,
            "comment": "Butterflies in that last scene between Seung Yeon &amp; Soo Roo\n\nYong Ho confirmed best guy 🥹🥹🥹",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "i don’t see te and sr ending up together after the show, te mentioned in the car that she wants to settle down and i don’t see sr at the age of 22 wanting to commit, 8 years is not that big of a age gap but they are at very different phases of life and have different wants.",
            "score": 11,
            "author": "vesperxy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah SR doesn’t even seem to have a clear direction in life yet, so defs too early for him to want to settle down",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This has to be one of the most boring cut in any love reality show. Why the fuck would you separate the boys and girls for an entire day? Imagine how excited it would be if they do Yoga/ Surfing together. This episode and the trailer give me flashback of that terrible last season. The lack of events and poor planning",
            "score": 20,
            "author": "hourhandqq",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think they separate the boys and the girls to facilitate the entrance of the male catfish. They want to create a moment where the male catfish mingles solely with the girls while the other boys are away.\n\nI agree though that maybe they don't need to spend a whole day to achieve that purpose. They could have had an activity together for the boys and the girls during the noon, before splitting them in the afternoon for the girls to meet the male catfish first.",
                    "score": 24,
                    "author": "moon_gin"
                },
                {
                    "level": 1,
                    "comment": "I agree that it's a little odd to separate them on only their 3rd day.  \n\nAlso, the timeline seems a bit odd: \n\n* The men finished their surfing by mid-afternoon, but don't get back until well after dark.  Sure, Bali has bad traffic, but not *that* bad.  What were the guys doing until late at night?\n* For the women, how long can Yoga take?  1h? maybe 2h?  They would have been done by no later than 3pm.  So, that can't have been their only activity for that day.\n\nWe'll have to line up their outfits in Ep. 3 to see if they show up in later cuts, spliced into later episodes.",
                    "score": 16,
                    "author": "j6ce3Hfe6L",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it seems many events happened the night the new guy entered. Hyojin ---&gt; Yongho and the newcomer guy just witnessing everything, Seungyeon seeing Sooro and Taein after her 'confession' and then  her joining them.",
                            "score": 8,
                            "author": "gCellAtWork"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They were literally together all the time till day 3 lol, not to mention, they still have evenings to spend together, they need episodes like these, to get real confessions between the same sex and also to see how the friendship and wingman ship between the same sex is imo",
                    "score": 8,
                    "author": "whateva135"
                },
                {
                    "level": 1,
                    "comment": "I second this. It'd be better if they did random dates to get to know each other better.",
                    "score": 3,
                    "author": "chaerinna"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kwak Tae Hyeok instagram is kwak_taehyeok",
            "score": 3,
            "author": "Secure-Ad4436"
        },
        {
            "level": 0,
            "comment": "As they have revealed the identity of one male participant, if they also reveal the identity of one female participant, who do you want it to be?",
            "score": 3,
            "author": "moon_gin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't want to know SJ yet I feel like it'll ruin the season, but I am most confused by her",
                    "score": 5,
                    "author": "Naanaaah"
                }
            ]
        },
        {
            "level": 0,
            "comment": "omg I wanted to enter my screen to smack the chef guy when he interrupted SR &amp; SY’s convo!!!!! It was getting so cute and flirty!!!!! I wanted more heart fluttering moments bw the two of them 😫 whyyyyy!??!?",
            "score": 3,
            "author": "theteletubbypimp"
        },
        {
            "level": 0,
            "comment": "the best thing about this episode for me was SY showing her interest in SR😭😭. I rooted for them a bit after their first encounter in the restaurant but was down a little bit when SR and TE were just pursuing each other. i’m so upset their private conversation in the room was interrupted 😭😭. i cant wait for next week and i hope they work out",
            "score": 10,
            "author": "Fair_Frame3079",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hmm just curious, why do you want them to work out when it’s obvious that te and sr are interested in each other?",
                    "score": 4,
                    "author": "temptressmoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it’s only day 3, interest isn’t set in stone?? i like SR and SY’s energy around each from the clips i’ve seen and just enjoy SY’s personality and personally wanna root for her and them together.",
                            "score": 5,
                            "author": "Fair_Frame3079"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When she indirectly confessed to SR, I have the same reaction like the panel as well. I was squealing lol. But this means we need to brace for another potential love triangle.",
                    "score": 3,
                    "author": "moon_gin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "my jaw dropped when she said it😭😭. I’m a bit pessimistic bc i feel like SR and TE are very heavily interested in each other but i hope she can sway him a little bit. i really want them to work out.",
                            "score": 5,
                            "author": "Fair_Frame3079"
                        },
                        {
                            "level": 2,
                            "comment": "same i fangirled both are so charming and they seem very comfortable with each other gah i hate love triangles but i'm rooting for both SY and TE it's so hard",
                            "score": 2,
                            "author": "PuzzledWarning"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pre-sub comment\n\nA male catfish finally enters the Love Mansion, &gt;!and he is 30 years old, meaning he is the oldest one among the male participants and the closest one age-wise to TE.!&lt;",
            "score": 5,
            "author": "moon_gin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is he hot?",
                    "score": 4,
                    "author": "temptressmoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Personally he's quite good-looking but I myself do not find him particularly hot",
                            "score": 8,
                            "author": "moon_gin"
                        },
                        {
                            "level": 2,
                            "comment": "He somehow kinda reminded me of Kim Jung-hyun (Mr. Queen, Crash Landing on You, Time, etc.).\n\nYa he's a good-looking guy, wouldn't be surprised if some of the girls choose him. His nose is too straight or obviously altered for me though, so it kinda detracts. But ya that hairstyle is usually a winner for a lot of people, lol. Reminded me of Dean (Korean R&amp;B artist), https://www.youtube.com/watch?v=rCeM57e2BfU, https://www.youtube.com/watch?v=8wpX6164uk4, https://www.youtube.com/watch?v=eelfrHtmk68",
                            "score": 5,
                            "author": "MNLYYZYEG",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "he reminds me of hyunbin.",
                                    "score": 2,
                                    "author": "vesperxy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So far for the girls I’m guessing TE and SJ are love catchers. YJ and SY have money catcher vibes.. I’m still unsure about HJ. \n\nFor the guys, maybe only JH and YH are love? \n\nI’ve not watched the previous seasons. Was the ratio of money to love catchers quite balanced? I know they can change their identities, but do many do it? Or is it likely the producers already planned and cast people to make the chance of winning quite low?\n\nI’m hoping SJ and YH will pick each other! She seems genuinely innocent and YH is so awkward that he suits her because he won’t take advantage of her. His jokes are so cringey but she actually made a similar joke! lol. I really hope YH actually takes SB’s “advice” and be more active. I don’t think he’ll get the girl if he keeps giving way to other guys!",
            "score": 6,
            "author": "anothersundayx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting, I think HJ and TE are the only girls who picked love, so I’m curious what about HJ makes you think she might be money? To me, SJ is the hardest person to read, she says one thing but than does another and seems so worried about money vs love, which makes me think she is money, but she may just be indecisive. \n\nAgree with YH and JH being love, the other guys seems fishy. I really liked SJ and YH at first, but now I’m starting to feel bad for him, SJ is super hard to read so I get why he is hesitant to approach her. I’m curious about YH x HJ and how they will vibe since we haven’t seen them together that much! Also, I thought that book scene was cute!! \n\nI didn’t watch the last season, but I heard there were a lot of complaints that there were too many money catchers, so hopeful this season it is more proportionate! I know in the 2nd season there was a girl who was originally money but changed to love and her and that guy are still together, so it has happened before!",
                    "score": 11,
                    "author": "Illustrious-Insect26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe because to me, I think that money catchers’ goal is just to find any love catcher and pursue them. But SJ seems to be really considering their compatibility (like counting the age difference between her and YH, asking his job again even when his turn is over, considering between looks or chemistry). In this week’s girls chat she also said she relates to TE and agrees that she should just go with her heart. \n\nFor HJ, I’m just undecided. She doesn’t give me money vibes but I don’t have a good explanation yet on why she must be love. I’ll need to observe her a bit more! Can you share why you’re sure she’s a love? \n\nI think YH’s hesitation to approach SJ is not because he can’t read her, but rather he is always giving too much consideration to SB. Like he didn’t want to steal SB’s seat next to SJ, and didn’t want to be in the middle of their beer drinking session. SJ could be confused by his actions. He’s always moving away, going away to get a book when she invites him to sit next to her, picking someone else for photoshoot when he had the choice of all the girls. \n\nI’m also curious about how YH and HJ will develop! I wonder how he will behave if someone is pursuing him instead haha. Hope he doesn’t crack bad jokes and chase HJ away!",
                            "score": 6,
                            "author": "anothersundayx"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; YH x HJ and how they will vibe since we haven’t seen them together that much!\n\nThey were the first people to meet there too aside from Taeeun and Sooro. I get nice people vibes from YH &amp; YJ the most and probably they were the first people to enter. *(Or maybe just me overthinking everything HAHA)* 🤣",
                            "score": 4,
                            "author": "gCellAtWork",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol I forgot about that, I feel like HJ was nervous since it was the beginning, so hopefully they will have more banter and chemistry now",
                                    "score": 1,
                                    "author": "Illustrious-Insect26"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "S2 did not have too many money catchers. The MCs and LCs were balanced. Now, if you don't have spoilers, it would be fun.\n\nIt was a rare scenario that i was wondering would ever happen or not, and IT DID HAPPEN.. :P\n\nLove triangles/non triangles were not super engaging and that's why it was not as awesome or edge of the seat thriller\n****************************\nJH is the cook right? - Feels MC through and through\nI do think he is lying about his job as it is easiest to fake. In surfing segment, the beach chill out scene.. the way his veins in right shoulder pop out... i can't put my finger to it, but he is lying about his job\n\n********************************\n\nHJ is also interesting... anyway,",
                            "score": 3,
                            "author": "enigmatic_zephy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "JH does have a wine bar but you have a point there. It's possible that he might only own the wine bar but he is not a chef. The chef at his bar could be someone else that he employs.",
                                    "score": 2,
                                    "author": "moon_gin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In the past MCs lied about everything right? How are you sure about the wine bar? Have knetz tracked him down already?\n\nIf so, maybe he is indeed LC... OR, maybe the show has done away with that criteria",
                                            "score": 1,
                                            "author": "enigmatic_zephy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "About JH wine bar ... Yes knetz have tracked down his wine bar.\n\nAbout MC identity, the rule is that a MC may opt to lie about their identity but it's not compulsory. That rule was implemented first on S3. As far as I remember only 1 MC opted to use a fake identity in S3.",
                                                    "score": 2,
                                                    "author": "moon_gin",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "ah!.. for some reason i thought that MC would lie about everything.. but anyway ...this helped, thanks",
                                                            "score": 3,
                                                            "author": "enigmatic_zephy"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For Love Catcher it's available on Viki. \n\nSeason 2 was subbed here: https://www.reddit.com/r/koreanvariety/comments/dcbekl/love_catcher_season_2_e01_190822/. Links are gone now but there's ways to time travel (check Wayback Machine, unddit, /r/pushshift, etc.) and like other reddit threads when searching for the 2nd season.\n\nThere's also a Chinese version of Love Catcher, it's called **The Secret X (机智的恋爱)**, Episode 1 from iQIYI Youtube channel: https://www.youtube.com/watch?v=VrTj-dJkp8o\n\n---\n\nA lot of fansubs (or official subs) get uploaded/ripped later on the usual streaming sites, so the option is there too.\n\nUsually if you type the name of the show + English subs or like say Episode 1, it'll show up. Check the reddit threads here on /r/koreanvariety, /r/KDRAMA, /r/CDrama, et cetera to find which ones are considered good by the people in the community.\n\nIf you also go on MyDramaList (to find the native/original name of the show, or like know the many alternate English names of the show you want to watch) and check the comments, usually people will link the Twitter/Bilibili/etc. posts on where to find it and like the social media stuff of the housemates.\n\nDon't forget to search using the Korean name, for Love Catcher it's 러브캐처.\n\n---\n\nLove Catchers and Money Catchers are not balanced. People don't really change. Producers probably let them free reign on the choice but ya sometimes they will cast people that are clearly going to be probably only money catcher or only love catcher.\n\nIt's kinda spoilers already to speak about it, but make sure to watch the earlier seasons chronologically so that you can see how the systems/activities/etc. of the show change. \n\nSeason 2 of Love Catcher in particular is considered legendary.\n\nThis a list of other Chinese/Japanese/Korean cohabitation/dating/romance/slice of life/etc. reality shows: https://www.reddit.com/r/terracehouse/comments/zbgsso/has_anyone_found_a_good_replacement_for_terrace/iyso9ql/",
                    "score": 4,
                    "author": "MNLYYZYEG"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tae eun and soo ro has this feisty romance vibe while soo ro and seung yeon has a cute young love vibe. He looks good with both but I prefer his chemistry with seung yeon.",
            "score": 4,
            "author": "FreshAd4289"
        },
        {
            "level": 0,
            "comment": "What the actual? PUTAIN DE MERDE. HOLY SHIT. WHAT IN THE HELL IS THIS. THE LAST 1/5TH OF THIS SHOW WAS CRAZY. Begins at like ~1:16:00 when Yoonsuro is tryna act like something (with his side/lying down pose) in front of Taeeun, it's the scene from the trailers/preview/etc.\n\nWHEN JEONGHYEON RANDOMLY INTERRUPTED A POSSIBLE SEUNGYEON X YOONSURO THRILLING MOMENT. BECAUSE OF THE NEW GUY'S NEED TO FIT IN.\n\nAnd then the YOUNGHO X HYO JIN TIMELINE. Wow. This was the couple I wanted to see too. PLEASE MAKE IT BE REAL. They both got that foreign, English, et cetera experience.\n\n&gt; Hyojin and Yongho are the ship for those of us that somehow like pairing the first couple in the house for these dating shows, lol.\n\n---\n\nInsanity. Wow, the preview or teaser for the next episode had me yipping in glee. After the coincidental Yoonsuro entrance when Seungyeon and Yujeong were talking about him. And then Jeonghyeon ordering Yoonsuro to fix his stuff right as when Yoonsuro is about to answer Seungyeon. This has to be producer-influenced, scripted, staged. It's crazy. \n\nLike wtf, idgaf though, it's some timing that makes you so frustrated. Holy fml fam, I was like legit rooting for Seungyeon because ya she seems left out, and yo wtf. Jeonghyeon really just had to come at that moment, is the edit or sequence of events write? Why do PDnims/writers/etc. do this to us, this agony is not good. Give us cliffhangers to make us tune it for the next episode, but don't shatter plotlines just like that, as soon as it starts. Come on, bro, producers really had everyone's hopes up.\n\nAt least we finally confirmed that obviously the sensitive guy (Yongho) is like 90% not going to be a money catcher. It's a toss up either way as you never know how people act. What if he was given the option to be a money catcher though. Sigh.",
            "score": 6,
            "author": "MNLYYZYEG"
        },
        {
            "level": 0,
            "comment": "this season , the girls visual is top notch , but the guys .. mehh even their job just so so , probably almost 90% of them need that reward money lol",
            "score": 13,
            "author": "Deep-Requirement3073",
            "replies": [
                {
                    "level": 1,
                    "comment": "visuals on both side are really good..\n\n1. 19 yr old male model is def. money\n2. Rapper guy is money (this we already know spoiler)\n\nAlso, the money person will lie about everything , including the job\n\n3. So, one of the piano ladies is money.. \n\n4. Song hye kyo really doesn't look money at all.. he he.. but she really looks like song hye kyo\n\n5. I personally absolutely love and find TE so darn cute and adorable.. and just so pretty.. doesn't feel like money and i hope she isn't",
                    "score": 14,
                    "author": "enigmatic_zephy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "TE has a chic and cold city girl exterior but her eyes are filled with so much warmth and she has a surprisingly charming cuteness to her when you get to know her more. the contrast of what you think she will be like and who she really is is intriguing and attractive. Its the same with Soo Roo as well.",
                            "score": 11,
                            "author": "NoviDon07"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; 5. I personally absolutely love and find TE so darn cute and adorable.. and just so pretty.. doesn't feel like money and i hope she isn't\n\nIn the last episode post, after the age/career reveal, I came to [the conclusion](https://www.reddit.com/r/koreanvariety/comments/z487z3/comment/ixxxotl/?utm_source=share&amp;utm_medium=web2x&amp;context=3) that the only way the TE-SR ship says afloat is if TE is a Money Catcher (MC), and she's absolutely convinced that SR is a Love Catcher (LC).  I still stand by that statement.\n\n...but I'm totally with you.  I'd love nothing better than a [Something in the Rain](https://en.wikipedia.org/wiki/Something_in_the_Rain) scenario.  They *do* look really good together.\n\nThe only way to top the S2 [SRJ couple's](https://www.youtube.com/@srjjcouple) last-minute \"flip\" from MC-&gt;LC to create a LC/LC pair would be for TE-SR to *both* be MC right now, and have *both* flip to LC at the end.  That would be legendary!\n\nThe other way the TE-SR couple would be historic would be for them both to be MC right now, and TE convinces SR that's she's actually a LC, and then seduces him into flipping to LC.  Then, at the final reveal, the PD team springs the fact that despite acting all sweet talk and heart-fluttering moments, TE has been a MC the whole time, making her the most villainous player in Love Catcher history...I can imagine the ending montage, like [The Usual Suspects](https://en.wikipedia.org/wiki/The_Usual_Suspects), where they show TE's deception throughout the entire show, and then TE cackling like the Joker as she picks up the 50K briefcase and walks into the sunset. Just imagine the audience's [tears of unfathomable sadness](https://youtu.be/a-ixntLruNs)...",
                            "score": 10,
                            "author": "j6ce3Hfe6L",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ya.. but from drama standpoint.. it will create love impact if the guy flips in this case.. because he does not come across as naive guy, he is already the most popular in the house, is young, is a model..\n\nso psychologically.. if he is MC, and flips will be huge.. OR, if he is MC and flips to LC, but TE is hurt and was LC but flips to MC in some confusion only to find that our male lead indeed flipped for love.. NOW THAY WOULD BE FUN\n***********************8\n\nSomeone should really explain how in S1.. the main guy figured out female in the first meeting itself\n\n***************8\n\nisn't your scenario exactly what s1 was about? mostly\n\nI think the only scenario not played out till now in love catcher across seasons is .. true romantic tragedy, or true romantic comedy\n\n1. True romantic tragedy - what i said before. TE is LC but thinks SR is using her and flips in anger. SR is MC.. but really falls for TE and flips\n\n2. True romantic comedy - two LCs flip to MCs\n\n3. True love - two MCs flip to LC",
                                    "score": 5,
                                    "author": "enigmatic_zephy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Only the male rapper and the chef are good looking I feel",
                            "score": 0,
                            "author": "temptressmoon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "People be sleeping on JH",
                    "score": 2,
                    "author": "zaichii"
                },
                {
                    "level": 1,
                    "comment": "&gt;Am I the only one who lowkey ships JH and YJ?\n\nyes, JK.😆 Bu-but, YJ just did an aegyo voice with the new guy...",
                    "score": 1,
                    "author": "gCellAtWork"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i just googled taehyeok, and did he use to be in a kpop group a-prince?? the one in a-prince also shares the last name kwak, and was also born in 1991, which would also make him 31. it looks like theyre not exactly very famous and probably disbanded, which makes sense why taehyeok didn't introduce himself as a former idol, but surprising nonetheless!",
            "score": 2,
            "author": "bonaanza"
        },
        {
            "level": 0,
            "comment": "I really think that the Love Triangle between Taeun - Sooro - Seungyeon is very interesting. \n\n\n\n\nMy probable end-game scenario for these three:\n\nTaeun - Originally Love Catcher but will switch to Money Catcher; will choose Sooro\n\n\nSooro - Originally Money Catcher but will switch to Love Catcher; will choose Taeun\n\n\nSeungyeon - Love Catcher from the very beginning but will not be chosen. \n\n\n\nWho's with me? 🤔",
            "score": 5,
            "author": "Prof3ssionalObserver",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think SY is money..  she’s changed her targets twice and i think it’s because she’s trying to chose her best bet",
                    "score": 8,
                    "author": "temptressmoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's a dating show of course she's trying to choose her best bet. Even Yong Ho is shifting towards Hyojin based on the previews, but that doesn't make him a Money Catcher. Its obvious that Sooro is a Money Catcher and Seungyeon knows it. Maybe she's just going all out and hoping Sooro would change to Love.",
                            "score": 5,
                            "author": "Prof3ssionalObserver",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She changed her mind everyday I think? Like she chooses one guy and decides to change when she realizes the guy will never be into her, it’s the way she acts- it’s too motivated and she moves on quickly.. if you were there for love you would take your time to get to know the people more before deciding",
                                    "score": 5,
                                    "author": "temptressmoon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Who knows? I guess we shall see it in the next episodes. I am excited how it unfolds.",
                                            "score": 4,
                                            "author": "Prof3ssionalObserver"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "nope ratio wasn’t balanced at all, i mean a bit more in s1 and s2 but s3 was crazy. i’ll tell u if you want but it’s a big spoiler if u ever wanna watch it. and giving them the choice to switch at the end can also change things.",
            "score": 3,
            "author": "Objective_Tip_1416",
            "replies": [
                {
                    "level": 1,
                    "comment": "s3 was balanced... 5 LCs and 5 MCs.. lol.. it is just that the two camps were REALLY VERY CLOSE KNIT :D ;)",
                    "score": 3,
                    "author": "enigmatic_zephy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "this ep was much better than the prev 2. so far my bets are on SB, and JH as money catchers from the mens side and YJ and SJ and perhaps SY...i thought sy was a money catcher since day 1 but this ep kinda proved me wrong, cause her and soo ro acc have such good chemistry and i feel like she got the most comfortable and vulnerable with him and acc went for him bc of her heart...like if i were a money catcher i would choose the most vulnerable one and force chemistry, but soo ro is a difficult guy to chase after cause of his thing with TE, also the fact that he lowkey also seems like a money catcher lol. SY might be a money catcher that will switch to love we shall see....  \n\n\ni love tae eun adn soo ro too i was rooting for them in the beginning but i feel their age gap wouldn't last that long in the real world, idk lots to think about, an 8 year age diff is rlly big esp when it's someone from early 20s compared to early 30s...so rn i'm rooting for SY and TE to get their happy endings cause both are my fav girls i hate rooting for underdogs...also SY's and YJ's friendship is so cute, the way they're each others wing women was adorable, if anything i'm glad these girls will be close even after leaving bali",
            "score": 2,
            "author": "PuzzledWarning"
        },
        {
            "level": 0,
            "comment": "I see a lot of people shipping Hyo jin looks, but I truly don't get it! Just shows how different we see everyone. Maybe it is my Western view though ? To me she looks the least attractive of all girls, with TE being the most attractive",
            "score": 2,
            "author": "properminting"
        },
        {
            "level": 0,
            "comment": "Is that Gavin from season 2 in YuJeong's Instagram?",
            "score": 1,
            "author": "knottingman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, Kim Gabin from Love Catcher 2. Some people are saying Yujeong will go &gt;!money catcher as revenge!&lt; due to Gabin, lol.",
                    "score": 7,
                    "author": "MNLYYZYEG"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok so this is an unpopular opinion. Seung beom might be a good guy. Since Yong Ho revealed he's actually there as a love catcher, that means seung beom is a money catcher as he talked to soo ji that night anonymously. During that convo he said he thought she was also a money catcher, but it was never confirmed. Knowing that two people can't both be money catchers, Seung beom probably found that soo ji may actually be in it for love and actually pure hearted, so he would feel bad for leading her on and eventually taking the money. But Yong ho is making him irritated because Sung Beom is the money catcher, yet Yong Ho is so unconfident and non assertive that Seung Beom wants him to step up to the plate with Soo Ji. That's why he said those things about \"Just because I'm talking to her doesn't mean you can't too\"  to provoke Yong Ho and try to get him to be more aggressive with Soo Ji so they can be together. Soo ji seems to like assertive men like Seung Beom but Yong Ho is being very passive despite the fact that he's the one whos a love catcher.",
            "score": 1,
            "author": "Unusual_War2150"
        },
        {
            "level": 0,
            "comment": "Yong Ho deserves someone way better than Soo Ji. It was very self centered for her to say that  she needed a big show to move her towards YH or SB. I mean Yong Ho mentioned several times that he couldn't swim, you made plans with him to teach him and he relents to taking off his life vest for her so she can have a better experience. BITCH DO YOU NOT SEE.",
            "score": 1,
            "author": "Goodformcookie"
        },
        {
            "level": 0,
            "comment": "Was SR drinking a Bintang beer on the beach with the guys after surfing??? He opened a can to cheers.",
            "score": 1,
            "author": "mahlay1051"
        },
        {
            "level": 0,
            "comment": "After watching Transit Love the hosts here irk me. I'd rather see less of them, they seem like they're there to make jokes and be funny whereas I'd rather see a genuine reaction from them. Them standing up and overreacting to everything was annoying too",
            "score": 1,
            "author": "stephaniehuang66"
        }
    ]
}