{
    "id": "zbhbaq",
    "score": 25,
    "title": "How Do You Play? (Hangout with Yoo) | E162 | 22.12.03",
    "author": "ScrewySiu",
    "date": 1670077066.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/zbhbaq",
    "media_urls": [],
    "other_urls": [
        "https://subscene.com/subtitles/how-do-you-play/english/2944528](https://subscene.com/subtitles/how-do-you-play/english/2944528)",
        "https://fromsmash.com/HDYPE162221203720p-NEXT-NoonaSpoiler](https://fromsmash.com/HDYPE162221203720p-NEXT-NoonaSpoiler)",
        "https://www.reddit.com/r/koreanvariety/wiki/shows_of_the_week_2022/week_48/"
    ],
    "postText": "**Description of the Show:**\n\nThis is a show that was started in order to find out what Yoo Jae Suk would  be doing during his days off. Subsequently, the show showcases Yoo Jae Suk taking on various projects, with other guests currently. Currently, it's Yoo Jae Suk and new cast mates taking on projects.\n\n**Cast:**\n\n* Yoo Jae Suk\n* Lee Mi-joo\n* Jeong Jun-ha\n* Haha\n* Shin Bong-sun\n* Kim Sook\n* Park Jin-joo\n* Lee Yi-kyung\n\n**RAW:**\n\n|720p-NEXT Magnet|magnet:?xt=urn:btih:9581cf7fb10aa4622eaeba39da606e1e660755c4|\n|:-|:-|\n|||\n\n**Subtitle:**\n\n|Subscene Link|[https://subscene.com/subtitles/how-do-you-play/english/2944528](https://subscene.com/subtitles/how-do-you-play/english/2944528)|\n|:-|:-|\n|Smash Link|[https://fromsmash.com/HDYPE162221203720p-NEXT-NoonaSpoiler](https://fromsmash.com/HDYPE162221203720p-NEXT-NoonaSpoiler)|\n\n**Subbed/Streaming:**\n\n[Shows of the Week Post](https://www.reddit.com/r/koreanvariety/wiki/shows_of_the_week_2022/week_48/#wiki_saturday_.2822.12.03.29)",
    "comments": [
        {
            "level": 0,
            "comment": "Overall, thought this episode was relatively fun and Haha shone this time. The trailer too had them all dressed up, I hope they figured out how to make that whole memory thing a bit more interesting. \n\nThis isn’t specific to only this episode but an issue I’ve noticed is that Jinjoo’s character kind of overlaps too much with Mijoo. The idol concept/dancing, singing, bad at quizzes, being unfit, etc…I don’t know if that’s an unpopular opinion.\n\nAlso does anyone else find it ridiculous that you have the chance of receiving the PD’s photocard if you order the calendar 💀",
            "score": 16,
            "author": "hicantics",
            "replies": [
                {
                    "level": 1,
                    "comment": "They might’ve been hoping for a Somin like character since Mijoo-Somin are similar but still worked well together on Sixth Sense. Unfortunately Jinjoo shares a lot of qualities but isn’t as outgoing, so her character just seems to be a less hyper version of Mijoo atm.",
                    "score": 12,
                    "author": "creezle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think the reason Mijoo and Somin combo worked, because at that point, Somin could somewhat be consider a seasoned entertainer, who could play the “support” role pretty well to Mijoo’s joke.",
                            "score": 9,
                            "author": "No_Selection_7590",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's definitely part of it, but I think all the Sixth Sense girls took turns doing supporting roles. With them they're all naturally very chatty. Jinjoo could get better with time, but she could also just be the quieter type.",
                                    "score": 8,
                                    "author": "creezle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I agree. Another thing is that Sixth Sense girls is like an elite variety squad. Even Oh Nara, who was a new person to variety at that point, was already perform really well on Knowing Brothers and 3 Meals A Day.",
                                            "score": 7,
                                            "author": "No_Selection_7590"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I kind of see it as a lose-lose. Not only is Jinjoo a less funny Mijoo, it also kind of restricts what we can see from Mijoo. Yikyung is fitting in fine and has his own thing going on, but I hope Jinjoo finds her own different character. Admittedly I am a bit biased though since I didn't find Jinjoo that funny during the WSG arc and enjoy Mijoo the most in the cast.",
                            "score": 11,
                            "author": "hicantics",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah it's somewhat of a miscast by the production. If they were set on adding another female member they should've gone for someone to fill more of an ace role like SJH's in the earlier days of RM (e.g. smart/witty or athletic/coordinated). I think someone younger than Mijoo would've also given them a lot more to work with since Mijoo has enough variety sense to play up the seniority bit.",
                                    "score": 10,
                                    "author": "creezle"
                                },
                                {
                                    "level": 3,
                                    "comment": "I didn’t understand why they casted Jinjoo either. Jo Hyunah and Navi, for example, stood out much more during the WSG arc. In fact, Hyunah even said she wanted to work with YJS. I don’t think the show made the right call. Yikyung was a good choice though.",
                                    "score": 9,
                                    "author": "magablossom"
                                },
                                {
                                    "level": 3,
                                    "comment": "i havent seen Jinjoo on this show but in general she's never really been funny. She's been a weird weird, aloof, and maybe eccentric - which have all combined to make her come off as funny when she is guesting on shows. But as a cast member? none of those talents would gelp her i think",
                                    "score": 5,
                                    "author": "ArsenalThePhoenix"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yes idk why park chang hoon presented himself too much",
                    "score": 8,
                    "author": "Yooneunimcrazyfan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i legit hate the PD. no one wants him on screen nor is he entertaining.",
                            "score": 11,
                            "author": "happijai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "totally agree he should do his job better not present himself like this",
                                    "score": 4,
                                    "author": "Yooneunimcrazyfan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's such a tiny part of the show that if you find yourself focusing on him....you should question why you even watch the show.",
                                            "score": 2,
                                            "author": "CastillaPotato",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "for jae suk and now i just skipped him but just found it weird about season's greeting with pd photocard\nps.members are better now i think.",
                                                    "score": 1,
                                                    "author": "Yooneunimcrazyfan",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "at the end of the day, it's always just a joke.",
                                                            "score": 2,
                                                            "author": "CastillaPotato"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Relatively, sure. It still relied on a half living cast chemistry based on the cast sitting in transportation. Running Man did it about 3 weeks ago, but talking while sitting on a bus is Youtube level shit. Don't put 20 minutes of that kind of content into official media.",
                    "score": 3,
                    "author": "pm_me_ur_cats_kitten",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "After an hour of them watching football last week, I'll consider it an improvement 🤣",
                            "score": 3,
                            "author": "hicantics"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Haha shone this time\n\nHe's really the funniest when he dedicates himself 100% to skits lmao the city bus part was too funny",
                    "score": 2,
                    "author": "moretoachieve"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It feels like a continuation of last week even though is a new shoot…",
            "score": 6,
            "author": "shems-2383"
        },
        {
            "level": 0,
            "comment": "Eng Sub is out\n\nhttps://subscene.com/subtitles/how-do-you-play/english/2944528",
            "score": 3,
            "author": "MuhammadNazeem"
        },
        {
            "level": 0,
            "comment": "PD just got a show with Jaesuk and he already thinks like he is a celebrity. Dude will always find a way to include himself every episode.\n\nDamn I already miss Kim Taeho.",
            "score": 11,
            "author": "whitefang0824",
            "replies": [
                {
                    "level": 1,
                    "comment": "He is one of PD in Mudo and actually MBC beg him to come back and helm the show because he is familiar on how KTH worked. You can spot him too during refund sister eps (E62).\n\nUnfortunately he's (in my eyes) too shy even during mudo's time. And unable to overcome YJS to do things that might make his mood goes bad, thus playing it safe.",
                    "score": 10,
                    "author": "kripkrip"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it necessary to dress up like this? Last week they dressed up like kids along with make ups.. this week like beggar? What happen to to just dressing normally? They're starting to act like Gag concert comedians...",
            "score": 8,
            "author": "fokusfocus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Considering some of the members are comedians who like gags it's not so strange. I mean how many versions of Yoo Jae Suk has he cosplayed of himself?",
                    "score": 4,
                    "author": "CastillaPotato"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's disappointing how they're using costumes to compensate for the uninteresting concept each week. The PD should win some award for making even Yoo Jaesuk boring. \n\nOn a completely different note, is it just me or do y'all also feel the strong chemistry between Mijoo and Yikyung?\n\nI was never a fan of loveteams in variety shows. Also never really hated them. Just basically feel nothing towards loveteams. But Mijoo and Yikyung are actually cute together lol.",
            "score": 7,
            "author": "Zealousideal-Fix-438",
            "replies": [
                {
                    "level": 1,
                    "comment": "I ship them!!! I feel like there’s a thing between them even though Jaesuk keeps saying they don’t look good together. 😂",
                    "score": 1,
                    "author": "nessab000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was an alright episode, fast forward most of it. &gt;!Poor Jinjoo did so poorly at jumping ropes but it also felt as if it was because Mina and her decided to hold hands and jump into it at the same time. !&lt;\n\nJust don't understand &gt;!why they had to dress up as beggars. !&lt;",
            "score": 2,
            "author": "justwannasaysmth"
        },
        {
            "level": 0,
            "comment": "i haven't watched this since WSG Wannabe. I noticed that the cast seems a lot bigger now.\n\nWhat is the show about these days?",
            "score": 2,
            "author": "ArsenalThePhoenix",
            "replies": [
                {
                    "level": 1,
                    "comment": "Randomness. They have trouble finding what works.",
                    "score": 6,
                    "author": "nessab000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now is becoming a skit show",
                            "score": 1,
                            "author": "shems-2383"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just wondering. Does anyone know if PDs have some kind of contract for the shows they're on? I'm wondering if there's any chance MBC will fire him next year or if we're stuck with this outcome and they just want to keep him...",
            "score": 4,
            "author": "hicantics",
            "replies": [
                {
                    "level": 1,
                    "comment": "They also need better writers on top of that.",
                    "score": 7,
                    "author": "kripkrip"
                },
                {
                    "level": 1,
                    "comment": "PDs are employees not contract workers, so MBC can ax him from the show anytime, but not the employment (reshuffling is the way to go). Meanwhile most writers are contractual, many are freelancers and work across multiple channel.\n\nI wonder whether Kim Tae Ho left with his writers, and left the current PD assemble his own team. Because the editing seems in theme with KTH, but the content is severely lacking.",
                    "score": 5,
                    "author": "bbmnid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re right, KTH did take his main writers with him.",
                            "score": 6,
                            "author": "magablossom"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to be a BIG fan of this show. But not anymore.. Why?\n\nBecause of none other than the PD!\n\n   A. He is a narcissist. In what universe does he think the show would be better if we see his face? The only funny moment about him was when Jaesuk said people stopped bashing the PD after they saw how pitiful he looked. He should’ve just stopped there. I also felt pity at first lol but not after i’m forced to see his face every episode.\n\n   B. Lackluster/ boring ideas/themes/ uncoordination-Beggar costume? For what? In some episodes, you can tell even Jae Suk is astounded by the lack of coordination.. like not cooperating with the manager to make sure yi kyung can answer the door in the morning.\n\n   C. Editing/managing events - example: MSG wannabe was wwaaaayyy waaaayyy better than WSG wannabe! I actually felt sorry for the girls - because they weren’t given enough respect/importance and screen time. Everything was swept though very quickly, without entertainment value. You dont see their groups recording on the studio with Jae Suk giving commentaries and other tidbits of rehearsals. They probably practiced at least a week for those dance moves but only showed us 2 minutes of that performance.\n\n   D. Bad group dynamic - Like what everyone is saying, they all just dont fit together right. Personally, I would’ve preferred if Jaesuk was the only one in the show again-which I know is no fun for him, but very fun for the audience. Even the judges from WSG wannabe are not entertaining at all - which I get, they are not all comedians-BuT still, made it really not fun to watch. Jinjoo is funny with her idol skit but does not know yet how to support other’s comedy lines and has a tendency to put others down. Regardless, notice that when the group is together, they are only 10% funny and 90% complaining about each other and everything else. In the end, most of them are only funny when Jaesuk is around to make fun of them or give them ideas how to be funny. When they have individual or paired tasks/screen time without jaesuk- entertainment value goes down the drain. So yes, I prefer them to just cast Jaesuk again lol\n\n   E. I hate these senseless skits. Some skits are funny when done in small amounts. But even then - the only funny moments are when they break character. What’s so funny about pretending to be an employee in a company? Just stop giving them a script already. You can give them a character to use, but cut it short before it gets boring.\n\n   In summary, this show isnt as entertaining anymore. I love Jaesuk and for me is the only redeeming factor here. I wish they replace the PD faaaast!!!",
            "score": 3,
            "author": "Key-Drawer-1145"
        }
    ]
}