{
    "id": "zqk2i7",
    "score": 98,
    "title": "Singles Inferno S2 Ep 3 | Men's Challenge was Rigged",
    "author": "LilacAqua",
    "date": 1671528659.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/zqk2i7",
    "media_urls": [],
    "other_urls": [],
    "postText": " \n\nI am honestly mad about the tug of war &gt;!threeway!&lt; battle. &gt;!Kim Jin-Young had a massive advantage due to the starting positions and angles.!&lt;\n\n&gt;!Dong Wu and Jung Woo were pulling directly against each other, whereas the third contestant was just pulling to the side, with no one pulling directly against him he had a massive advantage. It was basically rigged for him to win and appear much stronger than the rest.!&lt;\n\nSeeing all the girls swoon at the results of the obviously rigged match made me pretty frustrated. You don't need to be a physicist to &gt;!see no one was pulling directly against Kim Jin-Young!&lt;. It makes me question their judgement, and also lose faith in the authenticity of this show. It makes me feel like I'm watching overproduced American TV again.",
    "comments": [
        {
            "level": 0,
            "comment": "Plus he had fresh energy while the other two already fight each other. At the end of the day it is a reality show you signed up to watch so I'm not that bothered they kind of rigged it. But they clearly wanted him to win.\n\nIt's more fun to see the new guy picking girls than the other guys",
            "score": 55,
            "author": "CrazyJellyPudding"
        },
        {
            "level": 0,
            "comment": "soon as they announced that its going to be 3 way and as soon as I saw a new guy coming, I knew it was BS.\n\n1. Energy level: new guy looked fresh from bath wtheck! while the other two were already exhausted fighting each other.\n\n2. Position: Flags were not placed in a perfect triangle. \n\nLast remark. After the new guy wins the match, the way he threw the flag was like \"its too easy\". The fuck's with that, you fight two tired people and act like \"this shit's nothing\". \n\nWell obviously if you're the new guy, you must not be embarassed by losing on your reveal right!?",
            "score": 18,
            "author": "TonLang",
            "replies": [
                {
                    "level": 1,
                    "comment": "You guys are too funny. Of course it's scripted for the best possible narrative for ratings. That you guys are getting upset and posting on some bulletin board is a testament to the brilliance of the show. I loved every second of it and so did you.",
                    "score": 2,
                    "author": "surfeat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I saw it too and immediately angry typed this exact explanation in a different post lmao. Idc who the guy is, it really frustrated me and it felt so unfair for the guys who were already originally there. \n\nEspecially cuz losing already must have felt really bad in this situation. And because the guys had to face each other 1:1 and had to work VERY hard and struggled.. \nand then how the girls were all swoon about it and didnt even seem to realize it was rigged.. -__-\n\nI just hope behind the scenes everyone just knew and were not allowed to say so at least the guys know it’s not them / their strength that made them lose.. lol. Fuck im looking way too much into this",
            "score": 16,
            "author": "BattleBunnyxx"
        },
        {
            "level": 0,
            "comment": "My exact thought.Just as I saw him winning I knew it was rigged.😂🤌",
            "score": 13,
            "author": "Humble-Effect2316"
        },
        {
            "level": 0,
            "comment": "You should know that this show is scripted and also gets edited a lot!! The way they edited the preview to eps 5 &amp; 6 made Seulki seem evil as hell and now they get a lot of engagement because of that. In the end their aim isn't to actually set up couples, but to have a successful show.",
            "score": 11,
            "author": "Whole-Schedule-7314",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes... The most scripted show this year is Pink Lie with Daon and Hanu as the ML and FL for the first 9 episodes 😖😖",
                    "score": 7,
                    "author": "Daebak70",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I sincerely doubt that. I don't think anyone would have agreed to play the role Hanu did in the show. He was a deeply frustrating and somewhat misogynistic dude who most likely got hate from the show.  I think however that at certain points, the producers did indeed give the contestants notes (like telling Daon that she forgot her charger on men's floor, only for her to overhear Hanu talking badly about her + encouraging Chanel girl to have a short fling with the hairdresser).",
                            "score": 1,
                            "author": "N-Crowe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To add drama and boost ratings lots of dating shows are scripted and maybe he wants to be an actor.... Hangyeol, Taeyang, Hanui and Daon all have acting experience before coming on the show and Hanu was an idol so most of them star in web dramas with their band",
                                    "score": 1,
                                    "author": "Daebak70"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm just done with ep 3 date of dong woo and seulki. She doesn't seem like an evil person at all to me. She was honest about being uncomfortable with straight questions by him but he continued to ask her. But I see so much hate already for her. So ur comment is a good reminder the shows are edited in a way to make majority people hate some of these contestants. This is why I've avoided watching these fking reality shows. It increases my blood pressure 😭",
                    "score": 2,
                    "author": "Longjumping_Soft2483"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hahhaa yea this triggered me too. If you hit pause during the birds-eye view camera shot, \n\nYou can see the clear angle advantage the new guy has.",
            "score": 9,
            "author": "ryanc902"
        },
        {
            "level": 0,
            "comment": "I feel like this happens all the time when they play this game and its a three-way match on other variety shows too. :/ it is what it is. Unfortunately, its a heavily produced program. I mean look at the contestants they recruited haha",
            "score": 25,
            "author": "ibabiiface"
        },
        {
            "level": 0,
            "comment": "Googled this as I saw the scene, thank you for your post so that I know I am not alone.",
            "score": 5,
            "author": "StijnHansen"
        },
        {
            "level": 0,
            "comment": "&gt;overproduced American TV again\n\nit is netflix afterall",
            "score": 5,
            "author": "Aiirene",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's just a dumb game in a dumb dating show. People shouldn't get too angry about it... but it's the internet, so I fully expected posts like the OP's.",
                    "score": 3,
                    "author": "not_old_redditor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are the pathetic one to think \"people shouldn't get angry\" obviously they will when they see cheating and lack of physics",
                            "score": -1,
                            "author": "kesterklien"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just like how they made Jia look like the hottest girl that ever graced the earth last season 😂😂😂😂 No hate towards Jia, I'm sure she's a lovely girl but there were a lot of pretty girls who were on par with her on that season. \n\nIt just made me lose interest in the show. It was overly produced to create a stupid love triangle/square. Made me lose interest, not tuning in to Season 2🙄.",
            "score": 18,
            "author": "Few-Particular1780",
            "replies": [
                {
                    "level": 1,
                    "comment": "Other than So E, I love the girls of S2 so far",
                    "score": 2,
                    "author": "Lululuna321"
                },
                {
                    "level": 1,
                    "comment": "Eden 2 Lana is obviously the Jia and way too obvious chosen as FL",
                    "score": 1,
                    "author": "Daebak70"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeh I didn’t think much of it until after when I saw people discussing how it was rigged. I will admit it was very smart on the producers part, really shocked me at first and was entertaining to see. The new guys reaction was funny how he was trying so hard and nonchalant when he won😭  \n\nHowever the more I think about it the more dogs it is for them to do that",
            "score": 2,
            "author": "Pixiedashh"
        },
        {
            "level": 0,
            "comment": "Yes... It was rigged so he could date 2 women... Last weeks chicken fight with the women was rigged too... 3 women Seulki, Nadine and Seo Eun against each other really played the game for 10 minutes while So E and Seo Jeong stood far away doing NOTHING until the other 3 women were ALL eliminated and then So E and Seo Jeong finally play each other (never fought against the other 3 women) and So E wins... SMH... PD wanted So E to have a double date so rigged it",
            "score": 2,
            "author": "Daebak70",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait I'm confused. Is that not how you think this game goes anytime it's played with a group of people?",
                    "score": 4,
                    "author": "Basis_Resident",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All 5 women were supposed to start the chicken fight at the SAME time not just 3 with 2 just watching the other 3 fight.... I have watched tons of Korean variety shows and dating shows and whenever they play chicken everyone is supposed to be in a circle facing each other and start the game at the same time until there is 1 person left",
                            "score": 0,
                            "author": "Daebak70",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay fair enough about the line vs circle, I didn't know that. But I think avoiding the combat is just strategic. It makes sense that in a lot of TV situations, people prioritize having fun over winning. For Soe and Sejeong it kinda made sense because they were actually that serious and competitive, not trying to entertain. So in a way this was actually more realistic.",
                                    "score": 5,
                                    "author": "Basis_Resident",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes.. It was a bit strategic since the other 3 women are more athletic so they knew they would lose against them but think the PD wanted So E to win since she was upset about not going to Paradise and she is ONLY interested in 1 guy so she is seen as the \"lonely girl\" or underdog on the show",
                                            "score": 2,
                                            "author": "Daebak70"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What's wrong with waiting it out tho? I mean I'm doing it in games like fortnite and pubg too 😂 It's more on the strategic side than the \"rigged\" side 😅 (Im sorry for replying to a post grom 2 mo ago😂)",
                    "score": 1,
                    "author": "Thorndike16",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "****spoiler for future girls competition below **************** \n\n&gt;!The 2nd competition in a future episode So E and Seulki AGAIN are paired together and everyone is paired in the exact order as they are standing when they pick a ball from a box so that is NOT very likely to happen... Seulki and So E are the non-athletes of the women and it is obvious Seulki won't fight since she is afraid to get hurt!&lt;",
                            "score": 1,
                            "author": "Daebak70"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Exactly, he shows up when the guys are already exhausted. Honestly the guy has fboy vibes.",
            "score": 2,
            "author": "FluffToeBeans"
        },
        {
            "level": 0,
            "comment": "I exactly thought the same and I was like this is so shit. He didn't have a minor advantage but a massive advantage and on top of that both of them were tired from the first match. I am sure if this was a fair match the doctor would have easily won. Its pathetic and annoying how they downplayed the other guys to show some new guy",
            "score": 2,
            "author": "kesterklien",
            "replies": [
                {
                    "level": 1,
                    "comment": "doctor would've easily won?!? jinyoung was in the SK version of the Navy Seals, i think he has more strength and endurance than a doctor who just works out tbh",
                    "score": 1,
                    "author": "Shikadance"
                }
            ]
        },
        {
            "level": 0,
            "comment": "all the girls pissed me tf off when the new guy came. he’s doing the literal most basic shit and they’re dripping wet for him lol. seul-ki in the episode 5 trailer “can i cross your boundaries?” to the new guy LOL. wants him so bad and not even tryna hide it",
            "score": 4,
            "author": "HouDaOpz",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; seul-ki in the episode 5 trailer “can i cross your boundaries?” to the new guy LOL.\n\nlol, I wonder if that's less cringey in Korean. I \"wtf\"ed out loud when I heard the line.",
                    "score": 3,
                    "author": "not_old_redditor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "hahahahaha ikr same 😂😂",
                            "score": 1,
                            "author": "HouDaOpz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "whatever.. i saw him and went like.. Dex from bloody game, yay!!",
            "score": 1,
            "author": "enigmatic_zephy"
        },
        {
            "level": 0,
            "comment": "Anyone have a pic?",
            "score": 1,
            "author": "MayIPikachu"
        },
        {
            "level": 0,
            "comment": "oh man, I knew I was not alone.   \nit was way too obvious! if you are doing that kind of arrangement in the show, you should not be showing a top-angle view to us.  poor producers  :))))",
            "score": 1,
            "author": "mrtsyr1"
        },
        {
            "level": 0,
            "comment": "Just saw the angle today and came here to express my frustration as an athlete and as a viewer lol",
            "score": 1,
            "author": "Artistic-Translator2"
        },
        {
            "level": 0,
            "comment": "They wanted to give him a chance to go to paradise with whoever he wanted lol",
            "score": 1,
            "author": "charmbraceletbunny"
        }
    ]
}