{
    "id": "zykov1",
    "score": 53,
    "title": "2022 MBC Entertainment Awards Winners",
    "author": "angellove_rm",
    "date": 1672357917.0,
    "url": "https://www.reddit.com/r/koreanvariety/comments/zykov1",
    "media_urls": [],
    "other_urls": [],
    "postText": "**Daesang (Grand Prize):** Jun Hyun Moo (“Home Alone,” “**The Manager**”)\n\n**Variety Program of the Year:** “Home Alone”\n\n**Entertainer of the Year:** **Kim Gura**, Kim Sung Joo, **Park Na Rae**, **Ahn Jung Hwan**, **Yoo Jae Suk**, Jun Hyun Moo, Lee Young Ja\n\n**Top Excellence in Variety:** **Boom**, Ahn Young Mi  \n**Top Excellence in Radio:** Jung Ji Young (“This Morning Jung Ji Young)\n\n**Excellence in Radio:** Kim Eana, Yoon Do Hyun  \n**Excellence in Music &amp; Talk:** Lee Mi Joo, **Yang Se Chan**  \n**Excellence in Variety:** **Lee Guk Joo**, **SHINee**’s Key\n\n**Achievement Award:** **Lee Kyung Kyu**\n\n**Best Couple Award:** Jun Hyun Moo, Park Na Rae, **Lee Jang Woo** (“Home Alone”)  \n**Best Entertainer Award:** Kwoon Yool (“The Manager”)  \n**Best Teamwork Award:** Hok6 (“Buddy Into The Wild”)\n\n**Special Award for Variety:** WSG Wannabe (Gaya-G)\n\n**Multiplayer Award:** Hong Hyun Hee, Kian 84\n\n**Popularity Award:** Lee Jang Woo, Lee Yi Kyung\n\n**K-Content Award:** “The King of Masked Singer”\n\n**Writer of the Year:** Kwon Jung Hee (“Buddy Into The Wild”)\n\n**Rookie Award for Variety:** **Park Jin Joo**, Code Kunst  \n**Rookie Award for Radio:** **Park Young Jin**, **Lee Seok Hoon**, **GOT7**’s Youngjae\n\n**Writer of the Year for Current Events and Cultural Programs:** Choi Mi Hye  \n**Special Award for Current Events and Cultural Programs:** Park Ji Hoon, Lee Seo Young, Jeon Jong Hwan\n\n**Special Award for Radio:** Kim Ga Young, Min Ja Young  \n**Writer of the Year for Radio:** Ryu Jung Eun  \n**Radio Contribution Award:** As You\n\nCongratulations to all the winners!",
    "comments": [
        {
            "level": 0,
            "comment": "Mijoo going up barefoot because she couldnt get her shoes back on was hilarious.",
            "score": 36,
            "author": "SpCommander",
            "replies": [
                {
                    "level": 1,
                    "comment": "The camera cut of the shoe was hilarious too!",
                    "score": 14,
                    "author": "genfunk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Camera Crew: Wait is she...did she just...yup shes barefoot. On stage. Accepting an award.\n\nEveryone: And you're surprised because...?",
                            "score": 11,
                            "author": "SpCommander"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mijoo and Lee Yikyung’s [performance of Trouble Maker](https://www.youtube.com/watch?v=_ul9lGWN2L0) was great too if anyone missed it!",
            "score": 29,
            "author": "hicantics",
            "replies": [
                {
                    "level": 1,
                    "comment": "I keep forgetting Mijoo is a legit proper idol and dancer. I say this with the outmost respect: Damn girl!\n\nAlso, a shameless plug for my favorite ever cover of this song - Dreamcatcher girls, Jiu and Handong in South America : https://youtu.be/PGedZPYZXHo 🔥🔥🔥",
                    "score": 5,
                    "author": "Ancient_Reply4583"
                }
            ]
        },
        {
            "level": 0,
            "comment": "awww happy for Kwon Yul for getting an award 😆 can’t wait to see him being teased about it in OIV. and congratulations to I Live Alone for winning the Variety Program of the Year!!",
            "score": 15,
            "author": "sseubsseul"
        },
        {
            "level": 0,
            "comment": "Yassss ILA bouncing back gave me life!",
            "score": 15,
            "author": "idkmansendhelp"
        },
        {
            "level": 0,
            "comment": "Can’t help but smile when I see GOT7 members still introduce theirselves as GOT7’s (Name) and when accepting their own awards because a lot of people think they disbanded. They were like nah, we’re solid. \n\nKian84, you deserve that award. I’m not JHM fan but that Couple Award for Palm Oil Fam was well deserved!",
            "score": 10,
            "author": "reiganalison"
        },
        {
            "level": 0,
            "comment": "last year : HDYP , this year : ILA.. i hope there will be a daesang for kian, i dont know when.. but he deserve it",
            "score": 10,
            "author": "AggressiveBite6"
        },
        {
            "level": 0,
            "comment": "Happy for Youngjae! He was so nervous attending the show and accepting the award by himself but he deserves it!! He’s gained a lot of fans through his radio program and many people enjoy it.\n\nHe also mentioned on bubble how he wished the members attended so they could joke around and flip bottles at the table lol 😭",
            "score": 9,
            "author": "serhae114"
        },
        {
            "level": 0,
            "comment": "So happy Jeon Hyun moo won Daesang! And personally I dare to say that MBC Daesang is the most noteworthy this year. I don't mean to 'downgrade' KBS and SBS Daesang winner because both Yoo Jaesuk and Shin Dongyub are more than qualified but as everyone expected Jeon Hyun moo is undeniably Daesang-worthy, just watch ILA and you can see why.\n\nCongratulations to all the winners and yeay to ILA &amp; ILA casts for bringing back lots of awards!",
            "score": 17,
            "author": "serendipity_2121",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel their reward giving is more balanced compared to KBS/SBS",
                    "score": 6,
                    "author": "shems-2383",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can't comment much as I only watch some of MBC shows - ILA + Adventure by accident weekly plus The Manager + DNA mate occasionally. But I love that MBC Daesang is just like everyone predicted and it's rightfully and undeniably belongs to JHM. It didn't happen with SBS and KBS so personally I agreed that MBC awards was more balanced.",
                            "score": 5,
                            "author": "serendipity_2121"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah. I'm fine with Dongyup and Jaesuk winning. But there are other contenders who deserves to win this year. \n\nAs much as I watch HYDP and Running Man more, other shows from the 3 broadcast stations had a better year.\n\nAside from the contenders and winners, I would say PD Na deserves a grand award this year with Game Caterers (HYBE, SNSD, Starship, The movie promotions) Youn's Unexpected Journey and of course Earth Arcade.",
                    "score": 4,
                    "author": "EpikMint",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The thing with SBS and KBS Daesang was they have several qualified nominees qualified but almost no one was really undeniably and strongly stand out among the others. In this regard, MBC Daesang is the most satisfying (?)",
                            "score": 3,
                            "author": "serendipity_2121"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I knew Jinjoo will win the rookie award despite reading some comments from a HDYP thread here on this sub like she's not fit for variety and other stuff (That's why I stopped reading the show's weekly discussion from the sub tbh because of the cynicism for like months now).\n\nI only watch I Live Alone and The Manager if I know the guests, but I see why Hyunmoo won the grand prize. He deserves it.",
            "score": 8,
            "author": "EpikMint"
        },
        {
            "level": 0,
            "comment": "Whatever it's, Lee Gyeong Gyu speech is hella cool and when I think about it, that man already working for 41 years and still staying a float. \n\nI just hope my favorite entertainer can keep working like what the Godfather of Variety Show did.",
            "score": 2,
            "author": "hopeurfutureshine"
        },
        {
            "level": 0,
            "comment": "Congratulations to all the winners! Can't wait to watch this tonight! Here are the magnet links:\n\n|1부 (1080p-F1RST)|magnet:?xt=urn:btih:da548b4bbc039b6c19480a9116a8c878c41f7a81|\n|:-|:-|\n|2부 (1080p-F1RST)|magnet:?xt=urn:btih:a3377a048ef363a29a13d4ec593e27b35280429f|\n|Subs|[Subscene](https://subscene.com/subtitles/2022-mbc-entertainment-awards-2022-mbc) (synced to 1080p.H264-F1RST)|\n\nEdit: Just wanted to say I loved Narae's outfit! She's so pretty! Also it was too cute how Hyunmoo continued to encourage Kian whenever he is speaking and it becomes awkward. It's too pure. Also enjoyed seeing Sechan's iconic YAyaYAya skit lmao",
            "score": 1,
            "author": "moretoachieve"
        },
        {
            "level": 0,
            "comment": "I've been missing Kim Jun Ho for so long since 2 days 1 night. I see he won an award, but in which show can we see him now?! He is so funny",
            "score": 1,
            "author": "jy3"
        },
        {
            "level": 0,
            "comment": "why are there so many awards nowadays? excellence in radio, music, variety....just do ONE excellence award ffs",
            "score": 0,
            "author": "ArsenalThePhoenix"
        }
    ]
}