{
    "id": "13gfq6m",
    "score": 0,
    "title": "Is york worth it?",
    "author": "halal_aski",
    "date": 1683979355.0,
    "url": "https://www.reddit.com/r/yorku/comments/13gfq6m",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, international student here. Will be applying for computer engineering winter intake 2024. I would have to take a loan to attend york. So is it worth taking a loan, like a full loan covering both tuition and living expenses. Or should I just go for Uottowa, Concordia University, SFU or Toronto metropolitan University??? Are there any other universities besides that are worth taking the loan??",
    "comments": [
        {
            "level": 0,
            "comment": "iirc concordia or some unis in quebec do not triple internarional student fees like universities in ontario do. If money is tight then you kight wanna consider universities that make you pay donestic fees instead. I believe that right now, you can expect to pay about 36-40k a year (for 6 and 6 courses during each semester), which might increase slightly due to york raising their course prices annually.\n\nis york a good uni?\nyes, but it's def not the best. The eng school is good i'd say and regardless, employers wont really look at which school you studied at usually",
            "score": 4,
            "author": "REDMOON2029",
            "replies": [
                {
                    "level": 1,
                    "comment": "So it would be better to stick to Concord you say?",
                    "score": 2,
                    "author": "halal_aski",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "if money is tight? absolutely. You end up paying x3 less (if and only if they make you pay domestic fees). That is assuming that the only thing that affects your choice is the university. Now you gotta go and see if concordia offers computer eng to the level that you want",
                            "score": 1,
                            "author": "REDMOON2029"
                        }
                    ]
                }
            ]
        }
    ]
}