{
    "id": "13gu0ug",
    "score": 22,
    "title": "Do people consider university a good place to meet someone and potentially be with down the road (ie: relationship/marriage)?",
    "author": "Pass_the_celery",
    "date": 1684015200.0,
    "url": "https://www.reddit.com/r/yorku/comments/13gu0ug",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just wondering what other people think?",
    "comments": [
        {
            "level": 0,
            "comment": "Everyone has different luck, but there are places that increase your luck, like for example, sports clubs/teams if you love sports, if you want to marry within culture, it could help to join a cultural or religious group",
            "score": 30,
            "author": "AdvancedFunction9"
        },
        {
            "level": 0,
            "comment": "Maybe, if you join clubs and volunteer so you can meet people with similar interests. Aside from that, do things outside of school and you might have have better results",
            "score": 10,
            "author": "Mojachee",
            "replies": [
                {
                    "level": 1,
                    "comment": "I should probably be clear this wasn’t for me I just thought in general for guys I know and people on campus if they felt they could find someone.",
                    "score": 1,
                    "author": "Pass_the_celery"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I met my girlfriend during the pandemic in a zoom study sessions. We’ve been together for 2 and a half years now. I’d say it’s pretty good lol.",
            "score": 9,
            "author": "ijustdontknowlol"
        },
        {
            "level": 0,
            "comment": "Not to say it's the only or necessarily the best place to meet someone for a long-term relationship but I think it's an environment that is, as a byproduct, very conducive for this purpose. For most people, university will be the last place where they're \"forced\" (by volition mostly and whatever extrinsic factors motivate you to keep going to class) to be around and interact with people who are mostly the same age (+/- a few years) that are in a very exploratory stage in life trying to solidify a social, personal, and professional identity. Once you graduate and enter the workforce, it feels like you're kind of liberated from the forced social boundaries that school sets in place and are left to try to navigate a much broader and loosely connected social world. Which I think makes finding relationships more difficult due to the loss of the inherent interconnectedness with other people that school imposes upon us. \n\nI do think dating apps have helped soften this problem and this isn't to say that your working environment can't be a place to find someone (im sure some will disagree lol) but I think university, and school more generally, offers a social environment that isn't really found anywhere else.",
            "score": 3,
            "author": "cud1337"
        },
        {
            "level": 0,
            "comment": "Honestly yes, but I would say do not just go to classes and then go home if you wanna meet new people. Go to clubs, to events, to the gym. I met my boyfriend thanks to that",
            "score": 4,
            "author": "Pafpafpafleloup"
        },
        {
            "level": 0,
            "comment": "Met wife first year york .",
            "score": 4,
            "author": "Aggravating-Monk-264",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congrats!",
                    "score": 2,
                    "author": "Pass_the_celery"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At the current state, I wouldn't even say the western world is a good place for that.",
            "score": 32,
            "author": "Nicklnq",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why? In the western world, women have rights here and don’t get killed for expressing their freedom. They can chose to marry who ever they want without being tortured and raped for it.\n\nEdit: I don’t know why I’m being downvoted. Women having freedom is controversial in this subreddit.\n\nDo better, mods.",
                    "score": -17,
                    "author": "Valuable_Ad1146",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In 2023 a lot of people can be soft and call things racist or this or that but this… this was racist 💀",
                            "score": 17,
                            "author": "Ham_-_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Still whatever they said wasn't really that racist imo.",
                                    "score": -1,
                                    "author": "WelderImage",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did you really make a new account to say that lmfao bro 😭",
                                            "score": 3,
                                            "author": "Ham_-_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "lmao that was kinda weak but it was funny af",
                                                    "score": 1,
                                                    "author": "juice_killer_1"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean… I didn’t *specify* any part of the world in particular. Lol",
                                    "score": -12,
                                    "author": "Valuable_Ad1146"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You’re being downvoted for your stupid ass take lol.",
                            "score": 6,
                            "author": "goku_vegeta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That wasnt even his original comment. It was “… can go back to the shthole you came from”",
                                    "score": 4,
                                    "author": "Ham_-_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good catch!",
                                            "score": 4,
                                            "author": "goku_vegeta"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I didn’t know women having rights is a stupid take. \n\nYikes, this subreddit has a radical Islam problem. You seem to really hate women judging by your comment history.\n\nHere in the western world we take pride in our modernization and free society to express ourselves. It’s the reason we are the best in the world.\n\nDo better and eat a downvote, mate.",
                                    "score": -3,
                                    "author": "Valuable_Ad1146",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I didn’t know you were an expert on Islam. Might want to stick to your area of expertise…",
                                            "score": 6,
                                            "author": "goku_vegeta",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Many news articles seem to back up the claims. It’s widespread information that doesn’t need to have some sort of “expert” knowledge. Especially with the mass amounts of honour killings, where a young girl got raped and murdered for being immodest.\n\nOnce again, do better and eat another downvote, mate.",
                                                    "score": 0,
                                                    "author": "Valuable_Ad1146",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You really want to get into this? Because this isn’t a debate you’re going to win.",
                                                            "score": 3,
                                                            "author": "goku_vegeta",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Don’t need to “win” the debate since it was already won, young man. \n\nIt’s already proven through many journalists throughout the years that western society and most of Europe is the best places for women in the world.\n\nSwallow another downvote, bless your heart.",
                                                                    "score": -1,
                                                                    "author": "Valuable_Ad1146",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "How adorable, you think your opinion is actually fact. Either put up or shut up. Making a vague statement and broadly generalizing never works out. Still the fastest growing religion ;)",
                                                                            "score": 4,
                                                                            "author": "goku_vegeta",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You mean fastest growing birth rate for those that practice it.\n\nSociety is advancing and religion as a whole is dying out. Gay marriage is becoming legalized faster and medicine is becoming more widespread.\n\nOppression is losing. Swallow the facts, mate.",
                                                                                    "score": 1,
                                                                                    "author": "Valuable_Ad1146",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "A lot of countries that follow Islam tend to radicalize it and make it a very horrible place for women to live.",
                                                    "score": 0,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "People also intermix cultural practices with religious ones as well which leads to social problems as well.",
                                                            "score": 2,
                                                            "author": "goku_vegeta",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Which was a result of Islam itself.",
                                                                    "score": -1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Culture does not equal Islam.",
                                                                            "score": 2,
                                                                            "author": "goku_vegeta",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "But Islam is what lead it to this culture.",
                                                                                    "score": -1,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "All because of this.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was the beginning of a beautiful friendship.",
                                            "score": 1,
                                            "author": "goku_vegeta",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Beginning of the most civil and intellectual debate on reddit.",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This should be adapted into a manga and anime series. Although granted it would be a lot of typing. Maybe a slice of life genre would work for it though.",
                                                            "score": 1,
                                                            "author": "goku_vegeta",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm honestly wondering if we should just stop. I don't even care about having the last word anymore, lol.\n\nWe are both in university, too old for this shit and its going to take forever.\n\nWe are not even close to Reddit's world record longest argument.",
                                                                    "score": 1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I thought we were in this together. \n\n![gif](giphy|OPU6wzx8JrHna)",
                                                                            "score": 1,
                                                                            "author": "goku_vegeta",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I mean, its 1:22 am and the mods will think we are the biggest fucking losers on the planet.\n\n&amp;#x200B;\n\n![gif](giphy|tmQrpA8zpG4a16SSxm|downsized)",
                                                                                    "score": 1,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As someone who was born in an Islamic country, where there are lots of arranged marriages, I agree with you!",
                            "score": 2,
                            "author": "Professional_Leg4470",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lmao. Who are you?",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What do you mean?!",
                                            "score": 1,
                                            "author": "Professional_Leg4470"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Fuck off. New contender.",
                                    "score": -1,
                                    "author": "Valuable_Ad1146",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You fuck off! You don’t have the right to tell me what to say! It’s not your freaking country! Women have rights and freedom in Canada!",
                                            "score": 2,
                                            "author": "Professional_Leg4470",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Mate, piss off. I have been taught by this comment chain to not respect women rights.",
                                                    "score": -1,
                                                    "author": "Valuable_Ad1146",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Who cares?! Lol",
                                                            "score": 2,
                                                            "author": "Professional_Leg4470",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lmfao. I came here to change things.\n\nIs that what liberals want?\n\nChange?",
                                                                    "score": -1,
                                                                    "author": "Valuable_Ad1146",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oh ok! You’re the new prophet! Lol",
                                                                            "score": 2,
                                                                            "author": "Professional_Leg4470",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The New Testament",
                                                                                    "score": 1,
                                                                                    "author": "Valuable_Ad1146",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I will arrange a marriage",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Why?",
                                                    "score": 1,
                                                    "author": "Valuable_Ad1146"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just be a “passport bro”",
                            "score": 1,
                            "author": "Mobile-Oil-2359"
                        },
                        {
                            "level": 2,
                            "comment": "Cause he’s single cause he’s in r/pcmasterace and can’t find a girl",
                            "score": 1,
                            "author": "Hopeful_Economist470",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Actually it’s not for me it’s for my boys lol. Im dating someone atm.",
                                    "score": -1,
                                    "author": "Pass_the_celery"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 3,
            "author": "Syed-Sami"
        },
        {
            "level": 0,
            "comment": "Idk, I haven’t made even made a friend yet :(",
            "score": 3,
            "author": "Specialist_Ad8898"
        },
        {
            "level": 0,
            "comment": "I met my guy at York U in the beginning of the pandemic and we’re celebrating our second anniversary in a month!",
            "score": 2,
            "author": "Professional_Leg4470"
        },
        {
            "level": 0,
            "comment": "I met my gf at the York Dungeons and Dragons Club, and she's honestly been way too perfect for me. I don't think I deserve her",
            "score": 2,
            "author": "Papi_BigBird"
        },
        {
            "level": 0,
            "comment": "Girls will never settle for their peers unless they suffer from the same mental disorder.",
            "score": 2,
            "author": "leftisright69"
        },
        {
            "level": 0,
            "comment": "I personally don’t recommend dating in uni specifically  undergrad, especially if you’re a girl because basically every guy you’ll meet is immature and won’t want anything serious and it can negatively impact your schooling. I dropped out twice because of terrible anxiety caused by my horrendous relationship.",
            "score": 1,
            "author": "girlonpause95",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well you’re not wrong, you make a valid point",
                    "score": 5,
                    "author": "Pass_the_celery",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes focus on school get a good job don’t let anything get in the way, cuz that’s what will help you get a good relationship later on. Also university may have been a great place to meet a partner long ago like the 70’s but definitely not now- people aren’t looking for serious at this age so be careful",
                            "score": 2,
                            "author": "girlonpause95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Actually I’m done York now and I am dating someone lol",
                                    "score": 3,
                                    "author": "Pass_the_celery",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ahhh okay that’s good! Wish you the best",
                                            "score": 3,
                                            "author": "girlonpause95",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks, hopefully I don’t f-up lol.",
                                                    "score": 3,
                                                    "author": "Pass_the_celery"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "me personally i scored w my bf😂😂 so i’d say absolutely",
            "score": 1,
            "author": "BriefDocument2616",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice 😎",
                    "score": 1,
                    "author": "Pass_the_celery"
                }
            ]
        },
        {
            "level": 0,
            "comment": "GO BACK TO CLASS! -your parents probably.😁",
            "score": 1,
            "author": "Dear-Parsnip",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea but I’m already done",
                    "score": 1,
                    "author": "Pass_the_celery"
                }
            ]
        },
        {
            "level": 0,
            "comment": "😂 freaky deaky. I don’t want no girl problems. I got mine to deal with. You do you lol!!!.",
            "score": 1,
            "author": "Exactomind"
        },
        {
            "level": 0,
            "comment": "I consider university to be a place to get an education, spend way too much money on it and end up in debt the rest of my life.",
            "score": 1,
            "author": "minutefalling"
        },
        {
            "level": 0,
            "comment": "I have a lot of friends who have met their long term bfs at york. personally me i haven’t had the same luck but all good 🫡",
            "score": 1,
            "author": "sinisterace7860",
            "replies": [
                {
                    "level": 1,
                    "comment": "Walk up to a guy and be like I’m ready for marriage where my 💍 if the guy responds with “I got 3 exams next wk 😳” just say…I can’t wait, I’m kiddding",
                    "score": 1,
                    "author": "Pass_the_celery"
                }
            ]
        }
    ]
}