{
    "id": "13gy0h2",
    "score": 4,
    "title": "urban studies program closure",
    "author": "Designer-Telephone12",
    "date": 1684025588.0,
    "url": "https://www.reddit.com/r/yorku/comments/13gy0h2",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m just wondering what other urban studies majors are doing based on the closure of urban studies. Like are you guys staying in Laps and just doing your mandatory classes in the environmental studies major or changing majors to the environmental studies major? This is so stressful as now it makes it more confusing during course selection.",
    "comments": [
        {
            "level": 0,
            "comment": "What do you mean closure? Its not accepting new applicants and switching to envs planning?",
            "score": 2,
            "author": "BrownieBear180",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah exactly that! you either get the choice to stay in laps and graduate with a bachelors in urban studies or switch to envs planning",
                    "score": 1,
                    "author": "Designer-Telephone12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's closing? \n\n\nIn any case wouldn't be a staggered closure which allows you to finish the program? \n\n\n\nThe closet program is probably Cities, Regions, Planning in EUC.",
            "score": 1,
            "author": "birchcrest",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah sorry I didn’t explain it properly but it allows us to finish the program just our mandatory classes in are the cities regions and planning program. It is still so stressful because they are giving like no information to anyone yet. Just saying speak to the advisors",
                    "score": 1,
                    "author": "Designer-Telephone12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd say it depends on what year of the program you are in and wait to see what their policies on equivalencies/substitutions for if you stay or change. \n\n\nFor instance if you change into CRP, their Y1/Y2 courses are different, and you probably don't want to more courses than you need. But, they might have a list if you switch that you'd be exempt from certain requirements. \n\n\n\nIf you stay, they'll give you a list of courses that substitutes the requirements that no longer exist. \n\n\n\n\n\nWhen geography/environmental studies merged a few years ago, they had lists of requirements that changed and the modified new substitutions for old/new programs. \n\n\n\nNormally with program closure or major modification they have wording to say students will not be disadvantaged, which provides leeway for program requirements by the faculty. \n\n\nFor the few students who became inadvertently disadvantaged by the geog/envs merger they made appropriate accommodations, so I'm pretty sure the same will happen with you guys.  \n\n\nSo the best advice is to ask when more information is coming and speaking with an advisor.",
                            "score": 2,
                            "author": "birchcrest",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much for all your help and advice! I genuinely appreciate it! You’ve calmed my stress by so much!",
                                    "score": 2,
                                    "author": "Designer-Telephone12"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got the same email from laps and repost message from Teresa. After the discussion in peers in wechat group, I think we just wait and see what coming out further. Very hard to make decision this moment.",
            "score": 1,
            "author": "Noahsenn"
        },
        {
            "level": 0,
            "comment": "So does this mean that all the students in that program can switch to any other program in LAPS? Or do they only get the option on switching into the one they recommend?",
            "score": 1,
            "author": "Different-Minute-28"
        }
    ]
}