{
    "id": "13knsu2",
    "score": 3,
    "title": "York vs TMU vs UofT (maybe?)",
    "author": "SeaPea4296",
    "date": 1684382332.0,
    "url": "https://www.reddit.com/r/yorku/comments/13knsu2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all,\n\nI hope this post will get out there as it is mid-May and I'm having a big crisis surrounding choosing a University. I have big questions about which school I should attend, I have read other posts concerning the same topic but wanted to ask on a more specific basis as I've read that everything depends on the program and other personal factors.\n\nMy options are\n\n\\- Law and Society at York with a potential double major in communications and media studies\n\n\\- Journalism at TMU\n\n\\- Social Sciences at UofT (st george)\n\nI'm not entirely sure what I want to do in the future, but my end goal is potentially going to law school. I'm not really banking on UofT as I've heard it would be risky having to maintain a strong GPA for grad school and I'd be better off going to York or TMU (but then again is it worth it because of it's name and status?). That being said I would be really curious to know what school would be a better choice in terms of:\n\n\\- Exchanges\n\n\\- Internships/Co-op experience + Connections\n\n\\- Social Life (I am aware I won't get anything close to Queen's and Western's vibes, but something that would be the closest thing to it)\n\nLocation isn't really a factor for myself as I'm coming from far so I'll be staying on res regardless of my chosen school.\n\nAnother worry is to have something reliable to fall back on should law not work out for me.\n\nAny advice/information at all would be absolutely appreciated.\n\nThanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "all 3 options leave you jobless at the end",
            "score": 5,
            "author": "bjjprogrammer"
        },
        {
            "level": 0,
            "comment": "All I can contribute here is saying uoft is notorious for having a poor social life",
            "score": 3,
            "author": "Ham_-_"
        },
        {
            "level": 0,
            "comment": "Tbh for law school, you can have virtually any major not necessarily just a social science/legal background.  I would really go with either York or UofT if I were you, since in the long run you can always change majors to something as a backup (York offers professional certificates if that helps). Good luck op",
            "score": 2,
            "author": "TisTwilight"
        },
        {
            "level": 0,
            "comment": "York’s Law and society program is great! I have a few friends that did that program and are now in law school, mainly Osgoode. \n\nAs for social life, it will be the same at York, TMU and uoft since they’re all commuter schools. It’s really on you to join clubs, social events, volunteer and be engaged/involved if you want an exciting social life.",
            "score": 1,
            "author": "Opposite_Paint1"
        }
    ]
}