{
    "id": "13m0q0s",
    "score": 3,
    "title": "URGENT CS ADMISSION",
    "author": "Abzz22",
    "date": 1684514318.0,
    "url": "https://www.reddit.com/r/yorku/comments/13m0q0s",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys, so I’m getting a little bit nervous now as I have still not gotten an offer for BA CS (computer science) yet even though my average is 93.6, and there is less than one week left. Do you guys think I should apply for the data science program in ouac (it’s still open) and transfer from that program to CS if I don’t get an offer by next week? As that program is more closer to CS than I.T for example…\n\nPlease help a fellow student out…",
    "comments": [
        {
            "level": 0,
            "comment": "Can you chill out and stop spamming this? I get that you are anxious, but Reddit is not a crystal ball and can't give you any special insights.\n\nYou have a week, stop freaking out. Apply to that other program if you want to, whatever, but you'll need straight As to transfer to CS.",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry bro I’m just dyeing of anxiety rn and don’t know what to do.",
                    "score": 1,
                    "author": "Abzz22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is York the only uni u applied to ?",
                            "score": 1,
                            "author": "Spooky_Dooky20",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bro I have couple of offers from other school but bro the only school I can go to is York (for very personal reasons) and I’m just so stressed about it man cuz I worked very hard and stuff but still nothing….",
                                    "score": 1,
                                    "author": "Abzz22",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "relax dude, you wont be rejected you'll just be transferred to IT most likely. you deffo should have applied to other programs at york and did more research for back ups. its not the end of the world though dont worry",
                                            "score": 1,
                                            "author": "Electronic_Score9724"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}