{
    "id": "13oxgre",
    "score": 5,
    "title": "Any Pre-PA (Physician Assistant) Students Here?",
    "author": "Cultural_Resolve6977",
    "date": 1684776951.0,
    "url": "https://www.reddit.com/r/yorku/comments/13oxgre",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nI think we need an association or a club that helps students interested in the field. I know there was a Pre-PA club but it does not seem to be currently active and if anything I am willing to run the club even because I am passionate about the career path. Who feels the same?",
    "comments": [
        {
            "level": 0,
            "comment": "I am! And I’d totally join that club!",
            "score": 2,
            "author": "kjohn12344"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I am a PA I will make sure you and your momma will get prescribed laxatives instead of pain meds since I am won't be an adult :)",
                    "score": 5,
                    "author": "No-Basis-5337"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i’d def join an association/club for this",
            "score": 1,
            "author": "Able_Contribution395"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What do you recommend instead of PA school?",
                    "score": 1,
                    "author": "Cultural_Resolve6977",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tbh I would do nursing then NP after that. NP is very similar to PA anyways",
                            "score": 3,
                            "author": "easymoneyhabibi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "if the hours weren’t so shitty i would be so for being a nurse then a NP after.",
                                    "score": 1,
                                    "author": "Cultural_Resolve6977",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It just feels like if you’re not close to a 3.95 gpa it’s wayyy too hard to get into PA. I was just talking to a girl who was also rejected and she had a 3.91 and said her interview went well too just like me. They also don’t tell you like what you need to improve on when you get rejected. This is for McMaster at least. For UOFT, they want people with already established healthcare careers.",
                                            "score": 3,
                                            "author": "easymoneyhabibi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh I see! Thank you for your insight! What are you planning on doing now if you don’t mind me asking?",
                                                    "score": 1,
                                                    "author": "Cultural_Resolve6977"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You most definitely do not need a ridiculous GPA to get into PA school. I know numerous people who have gotten in with 3.4's at best. A high GPA helps, as does other qualifying factors on your resume like clinical experience, but GPA is the last deciding factor they care about. Interviewing well is worth its weight in gold. I had a strong application in my opinion, but the only reason I got so many offers was because of my interview skills (applied to 17, cancelled 3, got into all the remaining 14 schools. I really wanted to get in my first try so I got scared and applied to an insane amount of Florida/Georgia programs lol). \n\nDuring my clinical year I even interviewing for the incoming class, and this one dude had over 20,000 hours as a ER Nurse. Super impressive on paper, but the guy spoke like he didn't know his own name.",
                                                    "score": 1,
                                                    "author": "Impressive_Foot8045",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The thing is, you applied to the states. In Ontario Canada, it’s very selective/competitive here. With only 2 PA programs in Ontario (3 in the entire country) and both accepting less than 40 students, it’s extremely difficult to get in. For Mac, we go through this preliminary interview kinda thing before the MMI, and that basically assesses how well you speak. This means it’s a pretty safe assumption that almost everyone who does the MMI can interview well because they wouldn’t have even got to this point if they couldn’t. I also read online that for mcmaster’s PA program, the weighting post interview is 60% interview and 40% GPA. This makes it almost 50-50, although the interview is still weighted more.",
                                                            "score": 1,
                                                            "author": "easymoneyhabibi",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "OHHHHH I completely blanked that this was regarding programs in Canada! Jesus, my bad lol. Based of what you just told me I could most definitely see how it's much more competitive. It's interesting how they weigh the GPA so much to where it's almost equivalent to an interview, dang.",
                                                                    "score": 1,
                                                                    "author": "Impressive_Foot8045"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I had a 3.3 and got in right out of undergrad. All about experiences and interviews. I had minimal experience as well",
                                                    "score": 1,
                                                    "author": "benbyc1234987",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Was it in Ontario Canada? Did you get in recently? I doubt a 3.3 would even get you an interview for Mac PA. For uoft, I could definitely see it though.",
                                                            "score": 1,
                                                            "author": "easymoneyhabibi",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yep, u of t this cycle, and I did have an interview for mac ;)",
                                                                    "score": 1,
                                                                    "author": "benbyc1234987"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I get where you’re coming from, but a lot of us want to get our lives started sooner, and don’t want to go through the hell of 8-10 years of extra school.",
                                    "score": 5,
                                    "author": "easymoneyhabibi"
                                },
                                {
                                    "level": 3,
                                    "comment": "To be honest I agree but a PhD could subject your life to being a prof most of the time. Dentistry, Optometry, Podiatry, PT, Chiro, and others maybe the best bet.",
                                    "score": 2,
                                    "author": "Cultural_Resolve6977"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's no such thing as a \"pre-PA\" student you can go to PA school with any degree",
            "score": 0,
            "author": "borogumsho",
            "replies": [
                {
                    "level": 1,
                    "comment": "when you are pursuing the degree before u apply PA school you are technically pre-PA",
                    "score": 1,
                    "author": "Cultural_Resolve6977",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well I'm sure there's enough interest you should make a club for it. It would be something nice to have on your resume as well",
                            "score": 1,
                            "author": "borogumsho",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "hmm that is what i’m considering…. do you think it’s not redundant to make one when there is a existing (non active) pre PA club?",
                                    "score": 1,
                                    "author": "Cultural_Resolve6977"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}