{
    "id": "13pel9t",
    "score": 6,
    "title": "How is the psych program at YorkU? How is campus life?",
    "author": "milkycreambuns",
    "date": 1684818138.0,
    "url": "https://www.reddit.com/r/yorku/comments/13pel9t",
    "media_urls": [],
    "other_urls": [],
    "postText": "Really broad questions I know but I'm currently in the process of deciding of what uni to go to!! I applied for Psych BA and wanted to know why you chose to go to York. Some questions I have are:\n\n1) How's the campus like? Is it as dangerous as people say, or dangerous compared to other universities?\n2) If you are a Psych student (BA) what has the program given to you\n3) Is it expensive to live there?? I know Toronto prices are crazy. \n4) Why did you decide to go to YorkU?\n\nIf you have any experiences you want to share (or complain about in general) lmk!",
    "comments": [
        {
            "level": 0,
            "comment": "1) don't listen to the bunch of privileged fucks who complain about anything if you ended up on any campus especially ones downtown imagine the ttc situations and apply it to walking out of your very secure keycard building. you are generally at risk of shit in toronto.\n2) As a psych student in York, its honestly what you make of it. Personally, never had the balls to approach anyone in class because everyone looks intimidating and to themselves. I'm sure if you do try they'll be open to being friends. The program provides you with the same general syllabus you'd find anywhere else and the lecturers are a hit and miss like every other school honestly. \n3) There are pretty reasonable places you could find in the Village ranging from 600-1.2k \n4) Last option, and it ended up being a pretty good Psych school anyways",
            "score": 12,
            "author": "madlad200215"
        },
        {
            "level": 0,
            "comment": "I just applied for a Psych BA. Interested in what you said as well. How long did it take for you to get an offer after applying?",
            "score": 2,
            "author": "ThrowRAegodeath",
            "replies": [
                {
                    "level": 1,
                    "comment": "I applied to York around December 17th and recieved my offer on December 22nd. I don't remember my average at the time.",
                    "score": 2,
                    "author": "milkycreambuns",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m going the mature student route. I just applied and I understand it takes 4-5 business days before getting a student number and being able to uploads my docs. That’s fairly quick for you. I assume you’re going into 1st year as well?",
                            "score": 1,
                            "author": "ThrowRAegodeath",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, I am going to first year! I am wishing the best of luck for you (⁠人⁠*⁠´⁠∀⁠｀⁠)⁠｡⁠*ﾟ⁠+",
                                    "score": 1,
                                    "author": "milkycreambuns",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Likewise! Do you mind if I dm and stay in touch in case any questions pop up or anything?",
                                            "score": 1,
                                            "author": "ThrowRAegodeath",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not extremely knowledgeable, nor am I applying as a mature student. But you can if you need to",
                                                    "score": 1,
                                                    "author": "milkycreambuns"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. There definitely have been incidents that happened on campus that make you question your safety, but that's kind of a problem that has been happening throughout the city and not necessarily only on the YorkU campus. However, the best advice I could give to feel safe on campus is to walk with people and stay within crowded places. \n2. I'm currently going into my 4th year of psychology this fall and really loved my experience so far. The program is filled with really good profs (at least all of the profs I have had have been great. You just need to do your research properly) who are willing to go out of their way to help you. The students I have met in the program have all been super kind and relatable, but I'm also a commuter so I don't stay much after class to socialize. Regarding the program, I really like the fact that there are so many different courses in psychology and found that anyone could find a course that caters to their interest ex. Psychology of Women, Personality Psychology, Abnormal Psychology, Sensation and Perception etc. \n3. Can't speak too much about prices since I don't live on campus.\n4. It's close to home, it has one of the best psychology programs in all of Canada and I overall really liked campus when I came to tour when I was in high school.",
            "score": 2,
            "author": "pothetellitubbie"
        },
        {
            "level": 0,
            "comment": "I’m a 4th year psychology student. \n\n1. It is pretty dangerous, sure it’s just as dangerous as if you’re downtown but it’s also a huge campus that’s pretty isolated. I’ve had 2 stalkers and there has been a couple instances. I carry dog spray with me now for self defence as a woman who commutes for 1.5 hours each way. \n\n2. The psychology program is pretty good, York offers a range of psych courses. The program hasn’t given me anything crazy as there’s no co-op. It’s a huge program so it isn’t rly easy to make friends but there’s tons of clubs at York. \n\n3. I heard the psychology program is good and big. I thought it would be better than UTSC and Ryerson. I didn’t love my experience here. It was pretty lonely and isolating and I was online for a good chunk of it. Even before Covid it felt like this. But ig it’s what you make of it. \n\nSome tips:\n1. always focus on the classes you’re interested in + prof reviews before picking any course. There’s no “easy” courses, it all depends on those factors. \n\n2. join clubs and make an effort to make friends! It’s still pretty hard for me and a lot of ppl complain abt how the campus is lonely and unfriendly but clubs and making an effort does count for something \n\n3. if you can commute, just commute. The campus experience isn’t crazy different like it would be at Western or other unis not in Toronto. \n\nAll in all, I wish i went to Waterloo but the experience wasn’t bad",
            "score": 2,
            "author": "bumbee44"
        },
        {
            "level": 0,
            "comment": "I’m a 4th year psychology student. \n\n1. It is pretty dangerous, sure it’s just as dangerous as if you’re downtown but it’s also a huge campus that’s pretty isolated. I’ve had 2 stalkers and there has been a couple instances. I carry dog spray with me now for self defence as a woman who commutes for 1.5 hours from Scarborough and back \n\n2. The psychology program is pretty good, York offers a range of psych courses. The program hasn’t given me anything crazy as there’s no co-op. It’s a huge program so it isn’t rly easy to make friends but there’s tons of clubs at York. \n\n4. I heard the psychology program is good and big. I thought it would be better than UTSC and Ryerson. I didn’t love my experience here. It was pretty lonely and isolating and I was online for a good chunk of it. Even before Covid it felt like this. But ig it’s what you make of it. \n\nSome tips:\n1. always focus on the classes you’re interested in + prof reviews before picking any course. There’s no “easy” courses, it all depends on those factors. \n\n2. join clubs and make an effort to make friends! It’s still pretty hard for me and a lot of ppl complain abt how the campus is lonely and unfriendly but clubs and making an effort does count for something \n\n3. if you can commute, just commute. The campus experience isn’t crazy different like it would be at Western or other unis not in Toronto. \n\nAll in all, I wish i went to Waterloo but the experience wasn’t bad",
            "score": 1,
            "author": "bumbee44"
        }
    ]
}