{
    "id": "13v4oy5",
    "score": 1,
    "title": "ITEC easier than CS?",
    "author": "Evening-Leader661",
    "date": 1685389983.0,
    "url": "https://www.reddit.com/r/yorku/comments/13v4oy5",
    "media_urls": [],
    "other_urls": [],
    "postText": "My nephew recently finished high school outside of Canada. He wishes to study at York. He was accepted into both the ITEC honours and the CS program. Nevertheless, he admitted that he doesn't really like the math, and only applied because of parental pressure. For context, my major is economics, so I have no idea about the difference between ITEC and CS. \n\nSo his question is: \"Is ITEC a dumb down CS degree, that's closer to a business degree? Also how much harder is CS compared to ITEC?\"\n\nObviously, he didn't really do his research when applying. How should I answer him?",
    "comments": [
        {
            "level": 0,
            "comment": "Think of it this way, CS builds the lego blocks and ITEC uses those lego blocks.",
            "score": 6,
            "author": "Live-Concentrate-715"
        },
        {
            "level": 0,
            "comment": "It's easier to switch from CS to ITEC (if he wants he could go that route after seeing the courses in first year).",
            "score": 5,
            "author": "Jared_1_9"
        },
        {
            "level": 0,
            "comment": "BCOM ITEC is more business focused while BA ITEC is more technology focused. ITEC has less math than computer science and is a smaller faculty.  I switched from CS to BA ITEC because i was struggling with the math requirements for CS. The computer/technology based courses are pretty similar to each other in both programs for the most part. I personally wouldnt say ITEC is a dumbed down version of CS.",
            "score": 9,
            "author": "cookierent",
            "replies": [
                {
                    "level": 1,
                    "comment": "How different is ITEC from CS?",
                    "score": 1,
                    "author": "NinjaGamer4123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "CS 100%. It's much harder to switch from itec to CS than the other way around.",
            "score": 2,
            "author": "harold_liang"
        },
        {
            "level": 0,
            "comment": "Yes is easier",
            "score": 1,
            "author": "United-Village-6702"
        },
        {
            "level": 0,
            "comment": "It’s like comparing apples to oranges. \n\nITEC Focusses on Network, Security, Project management, UX/UI, Intermediate Programming, Basic Data Structures. \n\nCS focusses on Programming and development on various platforms, Advanced Data Structures and Development. \n\nCurrently working in the industry as an ITEC Grad. \n\nAs long as you get experience and study in classes, you’re good to go",
            "score": 1,
            "author": "SnooRobots8780"
        }
    ]
}