{
    "id": "13w92jv",
    "score": 2,
    "title": "BA Global Health/ BA Psychology/ or Undeclared Major (BA) ?",
    "author": "monkeyscorpion",
    "date": 1685498350.0,
    "url": "https://www.reddit.com/r/yorku/comments/13w92jv",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve graduated from high school last year and took a gap year, but I will be an incoming first year student this Fall 2023 and am deciding on between these 3 programs. I’m more leaned towards BA Psychology and the Undeclared Major (BA).\n\nMy future career goals are to get into public health policy, as I want to work on improving mental healthcare on a societal level, specifically mental health in education. I am planning on pursuing a Masters degree for this. \n\nThe reason why I applied for the Undeclared Major (BA) was because I am not 100% certain if Psychology or Global Health is for me, and I’ve heard from some students who are in the Psychology and the Global Health program say that they have difficulty finding research opportunities/getting hands-on experience due to competition and also difficulty with employment after graduating which makes me feel a bit uneasy/ indecisive as to which program I should choose. \nI also chose to apply for Undeclared Major (BA) because I don’t know if I should go into Public Administration/ Political Science if I am interested in pursuing public policy later on. \nI’ve looked at the courses that I would be taking for both programs and I find the Psychology courses to be more appealing to me than the Global Health courses, except the Global Health program also has the advantage of the 4th year practicum course for Specialized Honours students which seems to be very beneficial for post-grad applications. However, if I’m not mistaken, I’ve heard that the Global Health program is still relatively new and a small program with not much track of the whereabouts of alumni, other than a few individuals, whereas the Psychology program is a very large program with many faculty members and alumni. \n\nBecause I am still quite indecisive on my decisions, I’m considering the Undeclared Major (BA) to further explore my options and see which courses I am genuinely interested in before declaring my major. Although, I saw some York students who are in the Undeclared program mentioned that it is difficult to transfer into a program at the end of first year due to the long wait-times and how the transfer is not always guaranteed due to competition, limited space, etc, which makes me hesitant about choosing it, too.\n\nCould someone who has been in or is currently a Undeclared Major explain to me how the process works ? (For example, even if you are a first year Undeclared student and you want to transfer into a more competitive program like Neuroscience, are you also still competing with current Grade 12 students who are applying to the Neuroscience for a spot onto the program ?) Is it also more feasible to switch majors if I’m currently in one than to be in an Undeclared major, or is it vice versa? \nAnd for those in Psychology / Global Health / Public Administration, could you please provide some advice or further insight about your programs, in terms of research/volunteer/career opportunities/ hands-on or work-experience, employment and what your next steps will be after obtaining your undergraduate degree? \nOne last thing, does anyone have the contact info as to where I can contact York for advice about this? I’ve talked to the Faculty of Health admissions officer a few times before and tried their general LA&amp;PS email, but they take a long time to reply. I’ve also been told that I’m not able to speak with an academic advisor, unless I accept my offer, so I’m in bit of a limbo.\nThank you !",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly IDK about the specifics of your particular programmes but I did an undeclared s major and wish I’d just jumped right into my best idea of where I wanted to go. Undeclared is fine to mess around or if you really really can’t decide but you can wind up being marooned in the wrong place, disconnected from others in your programmes. Your major is full of other peeps who can’t decide. Yea there are supports there and they’re nice of course but it wasn’t the best situation. And then you still have to apply to get into the programme you want after potentially wasting time with the wrong courses. I’d say make your best (not perfect) assessment of your situation and jump. You can always apply to switch majors first year, but you might have nailed it first choice. With undeclared you are guaranteed nail biting experience of potentially not knowing or getting a decision until spring or even June as to your second year change application. Just my thoughts.",
            "score": 2,
            "author": "canjeyre",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you for letting me know. i've also heard about this, too from another student in the undeclared program which makes me hesitant about choosing the program, as well.  is it easier to declare a major first and if i find that it's not for me than i switch, rather than being an undeclared major and transferring into my designated program at the end of first year? could you also please explain the process of how transferring works as an undeclared major? (for example, the # of credits needed to transfer, do they look at how high ur GPA in ur first year courses plus grade 12 courses as well? and if i want to transfer into a more competitive  program like neurosci, would i also have to be competing with the current grade 12 students that are applying to neurosci for a spot in the program, even as a york student?",
                    "score": 1,
                    "author": "monkeyscorpion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My switch wasn’t grade dependent, but they needed my current first year York results plus a portfolio. In other words you will still need to qualify for the new major to be approved to switch majors. The process is easy enough : there’s a form you fill out. But I filled out the switch form in late December and didn’t get approved till late May. So whatever you need in terms of marks you need to achieve. You can’t jump the line with low marks just bc you’re undeclared. Hope that makes sense and someone else may have another idea about it.\n\nSo my thinking is: if you choose and decide to switch, you have to fill out that form and wait. That’s a maybe. If you go undeclared you’re definitely going to have to fill out the form and wait. So I don’t see the downside of just trying out your best idea now, and hope you like it. If you like it, you’re set. I didn’t connect with ANYONE in the undeclared group. I wished by December I was in my real faculty. I missed out on a lot.",
                            "score": 2,
                            "author": "canjeyre",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh and another thing. It’s harder to get into classes as undeclared bc a lot of seats are reserved for majors of those programmes.  So you can wind up just studying gen Ed courses.",
                                    "score": 2,
                                    "author": "canjeyre"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "PM with specific q about Global Health!",
            "score": 2,
            "author": "Alarming_Leg6871",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you! i just sent you a message!",
                    "score": 2,
                    "author": "monkeyscorpion"
                }
            ]
        }
    ]
}