{
    "id": "13zkd28",
    "score": 0,
    "title": "Opinions on my schedule?",
    "author": "DesignerWorth3612",
    "date": 1685815142.0,
    "url": "https://www.reddit.com/r/yorku/comments/13zkd28",
    "media_urls": [
        "https://i.redd.it/wirkvnwxdu3b1.jpg"
    ],
    "other_urls": [],
    "postText": "I’m starting my first year in September as an English major and I’m debating in between a biology or an art minor or maybe doing a double major. (I’m trying to be a hs teacher that’s why such random major/minors) does this seem like a good schedule? I feel like I should’ve picked more stuff in my major but I really wanna figure out my minor first. Also this is as smushed together as I could make it, most of these classes only had one or two time slots.",
    "comments": [
        {
            "level": 0,
            "comment": "in all honesty, this looks like a nightmare\n\nsuggestion: maybe don't take 6 courses in a semester, you can instead take fewer courses throughout the F/W term and then take a course or two in the summer",
            "score": 8,
            "author": "Sam930",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed. I’d at least shift one of the fall courses over to the winter. First years should take it easy just to get adjusted to Uni before they throw themselves into the muck of it lol.",
                    "score": 1,
                    "author": "Queensay10",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If I switch the sc-biol 1500 from fall to winter on Monday and Wednesdays right after my other classes on those days do you think that’s more manageable? That way I have 5 classes each semester.",
                            "score": 1,
                            "author": "DesignerWorth3612",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;ou think that’s more manageable? That way I have 5 classes each semester.\n\n5 classes/semester definitely sounds better than 6/4",
                                    "score": 2,
                                    "author": "_pastelbunny"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, since you won’t feel extra stressed or pressured in the Fall or develop burn out. Something to note for the future, it can be challenging to have lectures back to back because you need to be focused for hours in order to note and interact with the lecture.",
                                    "score": 1,
                                    "author": "Queensay10",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you I really appreciate your advice!",
                                            "score": 2,
                                            "author": "DesignerWorth3612",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Anytime! ![gif](emote|free_emotes_pack|slightly_smiling)",
                                                    "score": 1,
                                                    "author": "Queensay10"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "rip",
            "score": 3,
            "author": "BishSlapDiplomacy"
        },
        {
            "level": 0,
            "comment": "If you're an English major and you plan on doing teacher's college after, you don't need to worry about taking more English courses in first year. 1001 &amp; 1002 are the only mandatory ones for first year. The schedule looks fine, just remember your current schedule gives you no break in between classes, meaning you will have no time to buy food unless you plan on bringing it. I can't speak on the other courses but obviously as an English major just be expected to read a lot and manage your time well with whatever work you will be given in your other courses. Having Fridays off in your first semester and 2 days off in your second is really nice, especially if you plan on working on joining some school clubs.",
            "score": 3,
            "author": "_pastelbunny"
        },
        {
            "level": 0,
            "comment": "That’s actually a pretty good schedule. You have day offs and you classes are spaced out nicely.",
            "score": 5,
            "author": "astromicide"
        }
    ]
}