{
    "id": "142t9cr",
    "score": 5,
    "title": "ANTH 1120 or MODR 1760",
    "author": "msksikw",
    "date": 1686085581.0,
    "url": "https://www.reddit.com/r/yorku/comments/142t9cr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m going into first year And wanted to know if anyone has taken one of these courses, what is your opinion on them.\n\nTaking one of these 6 credit courses in one term with 4 other courses is that manageable?\n\nThank you!!!",
    "comments": [
        {
            "level": 0,
            "comment": "Took both of them. If u want an easier time take modr1760. If u want to actually learn something take anth1120. Both ez courses regardless and yes this in addition to 4 courses is manageable",
            "score": 4,
            "author": "ParticularMaize9684"
        },
        {
            "level": 0,
            "comment": "I actually learned a lot from 1760 and really enjoyed it. I found it extremely manageable with 4 courses because I got to take the fully online version. I just spent 3ish hours per weekend on it and it worked for me the entire year! Would highly recommend online version but I’m sure in person is doable too. I had it with Prof Cohen—I found her really great and helpful (and really caring/sympathetic).",
            "score": 2,
            "author": "Ilawil",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did the course have a lot of group activities online also because I heard there is a lot of group work",
                    "score": 1,
                    "author": "Mission-Project-732",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i had no group work in mine",
                            "score": 1,
                            "author": "Ilawil",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Would u say it is an easy course to take",
                                    "score": 1,
                                    "author": "Mission-Project-732",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "depends on who you are and what you’re comfortable with, as with all courses. But yeah I’d say it’s a relatively easy course in that you really don’t need any preexisting knowledge and the concepts are fairly intuitive to grasp.",
                                            "score": 1,
                                            "author": "Ilawil"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1760 is actually pretty interesting and the easiest class you will ever take",
            "score": 1,
            "author": "Budget_Yard3701"
        }
    ]
}