{
    "id": "144ngyl",
    "score": 6,
    "title": "ANTH 1120 - Ryan James (summer course)",
    "author": "NoDingo3198",
    "date": 1686263740.0,
    "url": "https://www.reddit.com/r/yorku/comments/144ngyl",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm intending on taking ANTH 1120 during the summer and was wondering if anyone knows how the structure is for people who have taken it. Also, is Ryan James a good marker and given good comments back? Thanks :)",
    "comments": [
        {
            "level": 0,
            "comment": "Ryan James is a pretty good prof, took a full year course with him before he has lots of course content on his youtube channel as well",
            "score": 5,
            "author": "BrownieBear180"
        },
        {
            "level": 0,
            "comment": "Ryan Gomes-James is one of the best profs I've ever had. Compassionate to students and has a really interesting research background. His class \"Cities in Film\" was one of my favourites before they shut the Urban Studies department down. He is an extremely fair marker and will provide comprehensive feedback. You'll be in good hands.",
            "score": 3,
            "author": "blaisebailey"
        },
        {
            "level": 0,
            "comment": "I had him in person before the pandemic and he was good! I really enjoyed his lectures and I found that the way he spoke made things easier to understand. He’s a nice guy too. From what I remember there was a small writing assignement, and a test as well based on some novels assigned",
            "score": 2,
            "author": "okiedokieartichokich"
        },
        {
            "level": 0,
            "comment": "Took a class with him last semester. Really good guy and not a harsh marker",
            "score": 2,
            "author": "circassian416",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you don’t mind me asking, what did you get in the course?",
                    "score": 1,
                    "author": "NoDingo3198",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "B+, which was generous given that I was pretty distracted the entire semester",
                            "score": 2,
                            "author": "circassian416"
                        }
                    ]
                }
            ]
        }
    ]
}