{
    "id": "145yjiq",
    "score": 1,
    "title": "Seeking Review/Advice for KINE 3012 - Human Physiology II",
    "author": "Grand_View_2774",
    "date": 1686398648.0,
    "url": "https://www.reddit.com/r/yorku/comments/145yjiq",
    "media_urls": [],
    "other_urls": [],
    "postText": "For anyone who took KINE 3012, how did you find the course and do you have any advice for doing well in KINE 3012? How did the difficulty of the course compare to KINE 2011? Any advice or tips would really be appreciated. Thanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "It was pretty easy. Similar in difficulty to KINE2011 if not easier. It's just another memorization-based course so use flashcards and review often, and you should be fine.",
            "score": 2,
            "author": "NaughtyNeutrophil",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the reply! How were the labs in this course?",
                    "score": 1,
                    "author": "Grand_View_2774",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're easy. You don't get marked or anything, you don't even have to show up tbh. The lab manuals released before each lab have all the information you need for the lab exam",
                            "score": 2,
                            "author": "NaughtyNeutrophil",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much!!",
                                    "score": 1,
                                    "author": "Grand_View_2774"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I loved KINE 3012! I would say it was actually very much about understanding systems, not just about memorisation. I and a lot of people liked KINE 3012 better than 2011 because it was more focused on systems which can feel more real world applicable than learning about more cellular stuff in 2011. If you get Michael Connor as your prof for 3012, you are so lucky - he is absolutely amazing \n\nEdited to add: tip for success - go to the PASS sessions for this course. They were so helpful!",
            "score": 2,
            "author": "RainbowLightbulb3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank u for the reply!",
                    "score": 1,
                    "author": "Grand_View_2774"
                }
            ]
        }
    ]
}