{
    "id": "146fuvo",
    "score": 5,
    "title": "I'm a pre-med student at York and I was wondering, those who are pre-meds getting ready to apply to med school or those who have already applied/are in med school, how do you develop a close relationship to a professor since you need at least one academic reference to get into Ontario med schools?",
    "author": "Decent_Sundae_3254",
    "date": 1686443675.0,
    "url": "https://www.reddit.com/r/yorku/comments/146fuvo",
    "media_urls": [],
    "other_urls": [],
    "postText": " For context:\n\nI'm a Psyc BA undergrad going into my 3rd year. Before people ask me why I chose psyc BA over BSc, (because I get that question a lot) it's because I didn't want to have to take a computers course and a math course. \n\nI have found most of my profs to be good but I don't really know how they are supposed to get to know me and write like a good reference letter on why I'd be a good doctor using the OMSAS criteria. \n\nI do ask my professors questions about the course content when I don't understand something, but other than asking questions, I don't really talk about anything else with them. Plus, most of my classes have 100+ students in them so it's kind of hard to stand out in front of a professor when many of them also teach other courses and/or sections of the same class.\n\nBesides doing research with them, as this isn't always possible since there's the possibility of them rejecting your application or they might not have a lab or they might not be currently recruiting people for their lab, what are some good ways to get a good relationship with a professional so you can get a great reference letter for med school?\n\nI really don't know what I should do. I guess maybe I could try to have the same prof twice for 2 different courses but, again, I don't know how to get close to them in a way that they will get to know me and my personality.\n\nIf you know any profs who are easily approachable in the Psyc department or faculty of science department (I'm taking bio and chem courses as electives), that would be great too.\n\nI really don't know how to go about this and any tips/advice are appreciated!!!\n\nThank you so so SO much if you made it to the very end of this very long post. 😊",
    "comments": [
        {
            "level": 0,
            "comment": "The psych professors are so nice!! \n\nAfter graduating with my first degree in biomedical science. I worked closely with the psychology professors. \n\nI rounded up about 12 references in total from my professors and then picked the top three. \n\nThis included a few biology, psyc, social science, and anthropology profs. \n\nDefinitely ask more than one professor. \n\nLiterally go up to them and tell them you're applying for med school and would love a reference. And offer any kind of assistance or help in exchange for the referral. \n\nYou can email them.\nYou can directly ask them in person.\n\nI remember Professor Julie Conder provided an excellent reference letter. So did assistant professor Jessica Sutherland's. Prof A. Kopinska as well. \n\nIf you didn't have any of these profs genuinely just build a connection by introducing yourself and simply ask! \n\nI recently applied for a second graduate program. I'll provide a template below for reference :) \n\n* But genuinely I know it seems scary but do not be intimidated. Professors at York actually want to see you succeed.",
            "score": 8,
            "author": "kirby_bubbles11",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good Afternoon Professor X, \n\nI hope you’re well 😊\n\nI wanted to request your permission to list you as an academic reference. \n\nI had an exceptional experience using your guidance and help to improve my research and related projects in the X Assignment and Final Project X. \n\n\nI also learned invaluable X related skills in your classes: \n\nCourse Code - Full course title - Section # - Semester, Year\n\nGrade received: A\n\n (If you have taken more than one course with his professor, list all the courses with the associated grades). \n\nI will be graduating with my Bachelors of Science in psychology degree in X semester. \n\nAny relevant work or volunteer experience related to med school that you've done*\n\n 1-2 sentences ab why you're applying to this program and how it would advance your career* \n\nI am applying to X Medical School at X University. \n\nThe application deadline is DATE (month, day, year). \n\nI wanted to request an academic letter of recommendation. \n\nMore information regarding the medical school program: link to the program \n\n \n\nFor your reference, I have attached the following documents:\n\nUniversity Transcript\nProof of degree conferred\nResume\nX Assignment\nX Project \nX publication if you have any* \n \n\nI also included a few links to my recent publications in this e-mail. \nIf you have any publications, link them here* \n\n\nPlease advise if you require any additional materials. \n \n\nAdditionally, I wanted to offer virtual or in-person support or assistance – I would be more than happy to assist you in any way! \n\n \n\nThank you for considering my request. \n\nI hope you have a great day! \n\nKindest regards, \n\nStudent Name \nStudent Number",
                    "score": 7,
                    "author": "kirby_bubbles11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey, thank you SO SO SO much for your detailed reponses. I have not had those professors yet but I have heard they are nice professors. I especially appreciate your advice to ask several profs and the sample email template. That is very kind of you. ☺️ I wanted to ask what you meant by doing something in return for the professor? Of course I would be more than willing to do something in return for them if they gave me a reference letter but I was wondering what exactly I'd do in return for them? Thanks 😊 again for your help!!",
                            "score": 3,
                            "author": "Decent_Sundae_3254",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I once handed out blank sheets of paper for one prof lol. And another prof asked me to hand back assignments during class. \n\nI don't think they would actually take you up on the offer in all honesty! \n\nAnd ofc no worries at all :) \n\n* also, if you haven't already started working on your academic letter of intent - start! And definitely get it edited by the writing center a few times! \n\nWishing you success and the best of luck 🍀",
                                    "score": 3,
                                    "author": "kirby_bubbles11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What faculty of health position do you have now? You seem pretty smart and I'm just curious. 😊",
                                            "score": 2,
                                            "author": "Decent_Sundae_3254",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wow!! That is very cool!!",
                                                            "score": 2,
                                                            "author": "Decent_Sundae_3254"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I see. Thank you so much ☺️",
                                            "score": 1,
                                            "author": "Decent_Sundae_3254"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lots of ways to form deeper connections with profs. Some ideas that I’ve done (I’ve done this with PSYC, KINE, HLST, and SOSC profs/TA’s):\n\nGo to their office hours to ask questions so you get to know them one on one. Ask questions one on one after class and sometimes you can leave the class talking together. When there’s a lecture / topic / tiny point even that feels relevant or especially interesting to you, tell them after class! “I just wanted to say I really appreciated when you discussed / touched on / mentioned _____, that feels really important and relevant for me because ____”. Sometimes that will get you talking about your life sorry with them a bit and getting to know them more personally. For zoom classes I have even sent an email saying that kinda thing. Also if you have zoom classes, put your camera on. If you make a list of questions before a test or something, ask to meet with them one on one like in their office. After classes thank them and tell them it was interesting. After the first class introduce yourself “my name is ___ I’m really interested in your course / excited to take your course because ____” - can show your specific interests. Email them a thank you email after the course finished that personally addresses how they impacted you and how their course was personally relevant for you or your goals. Oh, another thing I’ve done is if I have used something that I learned in their course later on for another course or project or anything, I write them and tell them how what they taught me stuck with me and is continuing to impact me and thank them. These are just some ways off the top of my head.",
            "score": 2,
            "author": "RainbowLightbulb3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, thank you so much!!! This was very helpful! 😊",
                    "score": 1,
                    "author": "Decent_Sundae_3254"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So here’s the thing-  might be too late for you, but still might be helpful info-\n\nThe biggest mistake anybody can make in undergrad if they want to follow with a graduate program in Medicine, Law, or MBA, is to study the “expected” undergrad for those programs.   Switch out now if you can.\n\nThese are highly competitive admissions processes where your aim should be to stand out from the other applicants-   \n\nThe vast majority of applicants to Medicine will come from “premed” or some biology related stream; the vast majority of law school applicants will all have similar backgrounds (polisci/philosophy/some other liberal art) too; and at least for younger students, the vast majority of mba applicants will come from economics or business undergrad. \n\nBut look at the composition of the accepted students- it’s extremely varied.   Certainly take the required prerequisites, but you have a waaaaaay better chance of acceptance if you come from an “unrelated” undergrad program.  They want classes with diverse backgrounds where people contribute from unique perspectives.\n\nYou want to get into medschool?  Excel in an architecture,  literature, or computer science undergrad. For you to stand out as an exceptional premed candidate you have to be better than 10,000 other premed candidates.   But to stand out as an architecture student, you just need decent scores to get into medschool because you already have a compelling story. \n\nYou want to go to law school?  Kick ass in microbiology or physics.\n\nYou want to get into an mba-  just fucking wait a few years and excel in whatever field choose as a passion and excel at-  nobody needs Econ  major mbas in the real world-   But somebody who comes from a Steam\nBackground with experience and gets an mba to augment their career is really valued-\n\n\nEdit-  furthermore if you stay in premed but don’t get into medicine, your degree is basically useless and won’t get you a job anywhere.",
            "score": -2,
            "author": "evilpeter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi, thank you for your comment and your opinion.\n\nYou mention in your last sentence that a pre-med degree is useless but I don't think that's true. A degree is still a degree. Also, I'm not in the undergrad program that everyone usually takes for med school. I barely know anyone in psychology that is actually interested in going to med school. Most pre-meds are in medical related programs like biomedical science, biology, kinesiology, health sciences, neuroscience, or biochem. \n\nI think Psyc is a useful undergrad degree because if med school doesn't work out for whatever reason, I could go to grad school or get a Psyc related job. And that is my back-up plan.\n\nI'd just like to know where you got your info from about it being more useful for those wanting to go to med school to get into an undergrad program not related to medicine.\n\nMost people actually pursue a science undergrad degree because bio, chem, physics, psychology and sociology are on the MCAT. \n\nI was actually looking at so many medical school people's LinkedIn profiles (like maybe 30 of them) and most of them had a biology, biomedical science, kinesiology, or health science undergrad.\n\nPlus, I like psychology a lot so why would I change my undergrad degree to architecture or engineering? Shouldn't I pursue a degree that I'm interested in and passionate about?",
                    "score": 1,
                    "author": "Decent_Sundae_3254",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As you point out, you’d need to go to grad school.  I just mean the degree in its own isn’t useful.  You say you colud just get a psych related job-  no, you couldn’t.  Plenty of psych grad school graduates have a hard enough time finding work; a BSc (or BA is even worse) in psych won’t make you employable anywhere in the field.",
                            "score": 0,
                            "author": "evilpeter"
                        }
                    ]
                }
            ]
        }
    ]
}