{
    "id": "147aque",
    "score": 0,
    "title": "Need Help with Making a Manageable Time Table",
    "author": "12Anon890",
    "date": 1686531478.0,
    "url": "https://www.reddit.com/r/yorku/comments/147aque",
    "media_urls": [
        "https://i.redd.it/ctf86e6zjh5b1.jpg"
    ],
    "other_urls": [],
    "postText": "I am going to be a first year at york u taking honours bsc computer science. I thought my time table was fine at first but by reading others apparently it’s too packed. This time table also does not include the required general education course as the yu start provided a list that was from 22-23 but I plan on taking a visual art’s general education course since I am strong in art. Any help or adjustments would be great!",
    "comments": [
        {
            "level": 0,
            "comment": "How many credits per semester is this? I'm too dumb to try to figure it out manually.\n\nHonestly there's no rush with finishing your degree or even in chronological order. I did mine (non-CS) in 5 years and the work load can get very intense and exhausting. I finished my last gen ed my last semester, lol. The only year I did a full 30 credit load was my 3rd year and it was during COVID. The rest of the time I did 4 classes instead of 5, and it was much more manageable for both stress levels, my mental health and making sure I was able to give enough attention to each course. \n\nClass time doesn't even touch the surface, in my last 2 years I was only going to campus for a few hours 2-3 days a week and spending most of my time outside class working. I could have finished my degree in 4 years if I had wanted and would have done 24-27 credits in the fall/winter, and just taken an extra class in the summers, but I did an honours thesis and had to stretch to 5 years.\n\nSo don't feel pressured to put so much on your plate. First year can be a rough adjustment. The drop deadlines for finances are very early on too, usually within the first 2 weeks of classes starting, so overloading your plate and having to drop classes later can also get expensive.",
            "score": 2,
            "author": "yellowpowerr",
            "replies": [
                {
                    "level": 1,
                    "comment": "i think it’s around 26, but i don’t wanna do summer school that’s the thing",
                    "score": 1,
                    "author": "12Anon890",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I only took one summer class my whole degree, and it was online. I spend most of my summers non-stop travelling.\n\nYou can try this course load and see how it goes, but it looks overwhelming just from looking at it. Especially in the second semester, it looks like you'll be having late nights and sacrificing sleep a lot.\n\nMost classes you have to account for spending 3 hours outside of class for each hour in-class, whether that's assignments, readings, studying, etc. It's a balance IME you don't get better at until later semesters and years, and a lot of first years hurt their GPA by overestimating how much they can take. Heavy course loads, even when done, can really harm your health. Having a healthy work-life balance is my key suggestion to any students for not hating your student life, as well as for thriving and staying sane enough to achieve high grades. Make time for hobbies, extra-curricular, enough SLEEP (can't emphasize this enough), your friends, and just having a full life outside school.\n\nA lot of people end up biting more than they can chew, and later have to drop courses halfway through the semester/year. It's expensive and I'm convinced is the reason universities have such inflexible financial drop deadlines, they're a for-profit business and this lines their more of their pockets at the expense of the students. There is no rush nor is there in shame in taking on less work for better balance.",
                            "score": 1,
                            "author": "yellowpowerr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "the gaps are bc i plan on just driving back in between since i live relatively close… idk how to improve my schedule cuz all of those courses are required and i still need to add the gen ed course",
                                    "score": 1,
                                    "author": "12Anon890"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}