{
    "id": "jao8bt",
    "score": 368,
    "title": "I got my dream job today. I wanted to share a piece of motivation for anyone having hard time.",
    "author": "Ahanaf",
    "date": 1602628734.0,
    "url": "https://www.reddit.com/r/yorku/comments/jao8bt",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just got offered my dream job today for one of the Big4 as a technology consultant. I don't believe in a \"dream job\" but I will define this as a career goal that I wanted to get into. My journey wasn't easy (failed courses, low GPA, transferred school,  medically ill, etc). I wanted to make this post to motivate anyone else who might be feeling hopeless. This is going to be a long post but I will try to minimize it much as possible. It basically goes over what I went through and how I approached to where I am today.\n\nI initially joined UofT as a CS student in 2014. I always wanted to become a developer so studying Computer Science was a passion of mine. Unfortunately, things did not turn out the way I planned, I became super depressed and anxiety which brought down my GPA which led to not making the POST. I forced my way to try to earn my place but It was near 2016 when I started giving up. I randomly applied to a bunch of companies and luckily enough, I managed to land a PEY internship to IBM as a Software Analyst. My GPA at UofT was super bad and the requirement to PEY and the job was a good GPA so I had to take the L and literally beg the PEY vp in the downtown campus to let me do it. Regarding IBM, I had to print my unofficial transcript but remove \"BOLDED GPA PART\" and act dumbfounded if anyone asks why the GPA part was missing (Thankfully no one questioned so I think the transcript was only to show proof).\n\nI spent 16 months at IBM which had changed my life in many ways. First of all, I got to see professional life first hand. I realize that the field of Computer Science is NOT just 9-5 programming. There are other adventures out there like DevOps, Consultancy, and business solutions. I started loving consultancy and what they do. The fact that you get paid big bucks to travel every day and still work with programming sounded like a dream to me. It is 2018, my IBM managers and colleagues have become like my best friend. My management was from the USA but in Toronto, I had really good mentors (only a few years older than me) so my whole team was pretty chilled. \n \n Toward September 2018, I had to come back to school to finish up my degree. IBM kept me as part-time until I graduate to rejoin the team as a full-time. I felt hopeless knowing that I never made the POST and it is impossible now even with my GPA. To make matters even worst, I became extremely ill and hospitalized multiple times. After multiple surgeries and endless hospital visits/ stays, turned out I was diagnosed with Crohn's Disease (This was another battle of my life but I won’t go into detail).\n\nMy colleagues (who are my close friends now) and even my mentors from IBM showed me how going to other universities can accelerate my future development. One valuable lesson I learned at IBM was that it does not matter If you went to UofT or YorkU, people who I worked with and the clients that I mingled with only cared about your degree + experience. Where you graduate from is valueless to the vast majority of the tech companies.\n\nI joined YorkU as a transfer student, my GPA was low from UofT so I had to join ITEC. I did a semester of ITEC before transferring to Lassonde (I had to bother the poor advisors so many times). YorkU has its own set of requirements to finish up the degree but I managed to get half of my courses waived using transfer. I am doing very well now, very happy choosing YorkU. I always felt the pressure and receiving aid “environment” much more acceptable. My marks are good and I made a bunch of friends from joining a club last year (The only reason I appreciated SSC was to chill in the club room ;) )\n\nAt UofT, I had this “being a failure” type of feeling whenever I am around people or professors but being at YorkU made me feel comfortable. I am currently in my final year, only have 5 more courses left (including the Fall semester) so I will be graduating April 2021. Since August, I have started applying to Technology consultancy positions. I see much potential growth in that career path. Working with clients and engaging with partners made me love this type of work even more. Traveling every day was also a big boost for me.\n\nI managed to land an interview for one of the Big 4 and frankly I got my offer from the biggest consultancy in the world. I never imagined I would even reach this far especially with Big4. My competitions were MBA/ master students from more prestigious departments/ Universities but I was able to be chosen out of hundreds only because of the support and experience I gained from YorkU and my past internship experience.\n\nMy journey was hard, I was depressed, medically ill, failed but I did not give up! I honestly feel sad whenever I see people complain about YorkU being a failure or not preparing students but I contradict this claim because the University has prepared me in many different ways that a lot of students overlook. I cannot speak for freshman years but I have enjoyed my senior years so far (maybe not Eiffel and 3101 proofs) but every other course was a joy to learn. I had to overcome a lot of failures and blockage in past years trying to graduate. I am sure there is more blockage to go in my future but I hope this post is a motivation to those who are on verge of failing or people who failed like me to never give up! If you are passionate about a certain end result then keep changing up the path to your goal because the path is not always going to be linear. \n\nAlso, there is no such thing as \"the end\". Even if you fail courses or Universities, you still have the opportunity to retrieve yourself. \n\n**tldr;** It is taking me 8 years to get my bachelor of science degree in CS. I had to endure failing Universities, depression, medical problem just to get to my goal. If you are in similar shoe and have passion to do what you are doing then keep going. Sometime you just gotta do what others don't when trying to reach the end.",
    "comments": [
        {
            "level": 0,
            "comment": "This is a beautiful and positive thing to see. Thank you for posting this motivational story.",
            "score": 55,
            "author": "investor3489",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I am glad I was able to make someone see the positivity. My main goal was not to brag but hopefully to give people who are depressed a motivation to keep fighting because they are not alone!",
                    "score": 16,
                    "author": "Ahanaf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great wholesome post :)\n\nI have put it up as the current subreddit announcement",
            "score": 28,
            "author": "AbleDelta",
            "replies": [
                {
                    "level": 1,
                    "comment": "After 9 years of being a Redditor, I have achieved my dream of being stickied. I will keep you as a reference for my resume.",
                    "score": 15,
                    "author": "Ahanaf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for this",
            "score": 13,
            "author": "ofuje"
        },
        {
            "level": 0,
            "comment": "Hey OP,\n\nCongrats!!!!  It made me super proud of you and I know how hard to keep yourself positive while you’re facing these obstacles.\n\nAs someone who graduated from both York (for undergrad) and U of T (for Teacher’s College), I found that U of T is brutal meaning that the university itself do not always prioritize students’ mental health.  I found that most of the student population are being “pressured” to be the very best at U of T which can be very harmful.",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; As someone who graduated from both York (for undergrad) and U of T (for Teacher’s College), I found that U of T is brutal meaning that the university itself do not always prioritize students’ mental health. I found that most of the student population are being “pressured” to be the very best at U of T which can be very harmful.\n\nAbsolutely, I do agree the undergraduate is very demanding for freshman. I did had a great sessions with the UTSC mental health clinic. I remember the doctor was pretty young and understandable. I do not hate UofT, but I still feel incomplete whenever I think about the University. I do have plan to do MBA in future so maybe I will choose UofT.",
                    "score": 1,
                    "author": "Ahanaf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations! If you have specific tips to pass on to future students, please drop me a line by DM or email. I collect student feedback and use them in my job interview prep sessions.",
            "score": 7,
            "author": "SDattaEECS",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you professor, I think your prep sessions are more than enough to prep us for full-time interviews.",
                    "score": 3,
                    "author": "Ahanaf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, your story is so inspiring and I’m happy for you!",
            "score": 10,
            "author": "musicismymusee"
        },
        {
            "level": 0,
            "comment": "Thanks for your post... it makes me feel hopeful :)",
            "score": 8,
            "author": "Muddy_puddlesss"
        },
        {
            "level": 0,
            "comment": "Wow, this is very relatable to what I'm currently going through. \n\nI also failed to make PoST at UofT. Ended up dropping out and taking a year off while struggling with depression. I just transferred to York this year. I'm still struggling, but trying to push through. \n\nHopefully I can turn things around like you did. Thanks for sharing.",
            "score": 8,
            "author": "SeanLXXIX",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I also failed to make PoST at UofT. Ended up dropping out and taking a year off while struggling with depression. I just transferred to York this year. I'm still struggling, but trying to push through.\n\nI am glad you made the transition to pursue your goal. The fact that you transitioned showcases that you are willing to adapt to big changes and take risks to grow for your future! You now have more courage and experience than students who have yet to face such difficult life-changing decisions.",
                    "score": 5,
                    "author": "Ahanaf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "thank you for this. I needed this",
            "score": 5,
            "author": "SwimmingQueen6"
        },
        {
            "level": 0,
            "comment": "Inspiring.",
            "score": 4,
            "author": "Mr-Champ"
        },
        {
            "level": 0,
            "comment": "Thank you for the post.. really helped me get back on track. And congrats on the new job!",
            "score": 3,
            "author": "Crazy-Commission390"
        },
        {
            "level": 0,
            "comment": "This made me so happy man. I’m in grade 12 rn and I’m hoping to get into York, but I’m really scared cause that means I gotta leave home to be all by myself and if I fail my courses then I’m all alone and can’t go back. This made me feel so much safer. Thank you",
            "score": 3,
            "author": "Smalleycat"
        },
        {
            "level": 0,
            "comment": "Congrats! You should be very proud of yourself!",
            "score": 3,
            "author": "jigglypuff9"
        },
        {
            "level": 0,
            "comment": "Congrats! And all the best.",
            "score": 2,
            "author": "double_four_time"
        },
        {
            "level": 0,
            "comment": "Congrats!",
            "score": 2,
            "author": "somewhere_up_north"
        },
        {
            "level": 0,
            "comment": "This is such a nice story! Congrats to you! Lassie will be proud of you!",
            "score": 2,
            "author": "mckdz"
        },
        {
            "level": 0,
            "comment": "Thank you so much for this post!! Needed this today..very badly",
            "score": 3,
            "author": "NinjaGamer4123"
        },
        {
            "level": 0,
            "comment": "Congratulations! Amazing story!",
            "score": 1,
            "author": "JxSmasher"
        },
        {
            "level": 0,
            "comment": "Congrats! What a journey. Btw what skills (hard/soft) would a tech consultant need?",
            "score": 1,
            "author": "john1green",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. I am not a consultant yet so I can’t answer that. However, I believe being comfortable to a client facing situation is a major skill. Since I worked with so much client from my internship, this gave me an upper hand negotiating in my interviews. In term of hard skill, being technical and having side project is always good. I interviewed for cloud solutions since I have exposure into AWS and Bluemix.",
                    "score": 2,
                    "author": "Ahanaf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey OP! This is awesome! Stay Gold! ❤️",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Going through something similar.... returning to York to finish what I started...you're doing amazing!!! Keep it up!!!!!!",
            "score": 1,
            "author": "DullEmployment0"
        },
        {
            "level": 0,
            "comment": "Congratulations!!!",
            "score": 1,
            "author": "Wonderful-Cold"
        },
        {
            "level": 0,
            "comment": "CASHMONEY MY BOI",
            "score": 1,
            "author": "Agmius"
        },
        {
            "level": 0,
            "comment": "Congrats! So happy for you",
            "score": 1,
            "author": "Obi_kobe"
        },
        {
            "level": 0,
            "comment": "So inspiring thank you sooo much 😭",
            "score": 1,
            "author": "ndthuyduong"
        },
        {
            "level": 0,
            "comment": "Thank you for sharing, this is very inspiring. I too, did not make the POST at UTSC and transferred to YorkU, still struggling but getting better. I hope one day, I’d get there. Fingers crossed!!",
            "score": 1,
            "author": "AzureDanii"
        },
        {
            "level": 0,
            "comment": "I second that.   It's not just all programming.  Alot of it is people skills,  getting feedback from customers etc.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They told me the salary was fixed for my entry but they will do performance review every July. There are yearly bonuses but this is dependent upon my project performance. The signing bonus is only few thousand dollar. The stock option is available as an employee benefit but I haven't read the full benefit package yet.",
                    "score": 1,
                    "author": "Ahanaf"
                }
            ]
        }
    ]
}