{
    "id": "mgyhap",
    "score": 337,
    "title": "Anyone else? Just me? Ok",
    "author": "ManOfGames_YT",
    "date": 1617166387.0,
    "url": "https://www.reddit.com/r/yorku/comments/mgyhap",
    "media_urls": [
        "https://i.redd.it/smylahkfoaq61.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I just got back an assignment worth a shit ton that I failed. Shit hurts. So much stuff to do, not enough time to do it",
            "score": 43,
            "author": "GenericMemesxd",
            "replies": [
                {
                    "level": 1,
                    "comment": "So many one percent assignments for one class that take up time and not worth it and a couple classes with two midterms so no break in between then the other class has an early final the week right after... I retook Econ 1010 just to up my grade and didn’t study as much as a should because seemed easy... failed the second midterm, multiple choice just crushes me.",
                    "score": 19,
                    "author": "Serenity-03K64",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm honestly just about to say fuck it and take a W on my transcript for a course. I really don't think the headache it causes is good for me. Thought it would be easy too but I've been struggling since day 1. Not sure why I decided to stay in it.",
                            "score": 5,
                            "author": "GenericMemesxd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This!!",
                                    "score": 1,
                                    "author": "TisTwilight"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m having to withdraw from 2 courses this semester because I probably won’t pass. I’m starting to regret not just taking the year off and waiting until things got back to normal",
            "score": 18,
            "author": "nottaraccoon"
        },
        {
            "level": 0,
            "comment": "I feel tbis",
            "score": 7,
            "author": "bee-swell"
        },
        {
            "level": 0,
            "comment": "And I got covid ugh",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Got into a car accident in February. Was hospitalized for a few weeks and couldn't do anything school related until mid March. Uni told me they would offer me a full refund but I'm suppose to finish school in April.\n\n\nI basically had around 30 days to catch up in 5 classes. I put this on myself but things are going alright right now. I'm hella stressed that all my exams are wroth 70-80% now though. I'm just so done with school.",
            "score": 5,
            "author": "Muglah"
        },
        {
            "level": 0,
            "comment": "I’m so glad to know I’m not the only one feeling this way🥺😩😢",
            "score": 4,
            "author": "Comfortable-Try-8507"
        },
        {
            "level": 0,
            "comment": "Holy fuck the emails are absurd. Like yes I totally need to know every time someone posts to a fucking discussion board thanks so much. Good lord just send me the important shit ffs.",
            "score": 5,
            "author": "EnderCreeper121",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can choose and filter what Eclass notifications are emailed to you, click on “unsubscribe from this thread” at the bottom of the email",
                    "score": 6,
                    "author": "Jfrmdaends",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ah neat, thanks for the info!",
                            "score": 2,
                            "author": "EnderCreeper121",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Np",
                                    "score": 2,
                                    "author": "Jfrmdaends"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Doing my masters at York after doing my undergrad there too. This has been my life for the past 6 years 😂",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Cue sera sera 😭",
            "score": 3,
            "author": "throwaway224202269"
        },
        {
            "level": 0,
            "comment": "True",
            "score": 2,
            "author": "trcsigmaf"
        },
        {
            "level": 0,
            "comment": "Definitely not just you. I’ve contemplated dropping a number of courses to reduce my course load, but decided against it bc I’m “almost at the end.” The end feels like it’s an eternity away and I regret not dropping every day.",
            "score": 2,
            "author": "caesar-seled"
        },
        {
            "level": 0,
            "comment": "Inbox only 184?\nNo no no those are rookie numbers you gotta get em up.",
            "score": 2,
            "author": "singhrbir"
        },
        {
            "level": 0,
            "comment": "*more like due at 4pm, 5pm,9pm &amp; 11:59pm. Living life at the edge by completing 25-60% assignments the day before and day they are due cause I’ve got no time.",
            "score": 1,
            "author": "TisTwilight"
        },
        {
            "level": 0,
            "comment": " Classes over here are literally going at 4x speed.\n\nYou get the same amount of class time, but a quarter of home time to finish shit.",
            "score": 1,
            "author": "PlayfulMinute"
        },
        {
            "level": 0,
            "comment": "Laughs in University of Toronto",
            "score": 1,
            "author": "West_Tek"
        }
    ]
}