{
    "id": "wp0lpe",
    "score": 296,
    "title": "A student at this school has been inquiring online about bringing a gun to school. The post was removed but this is serious and I'm not sure what kind of actions I should take if any. Thoughts?",
    "author": "[deleted]",
    "date": 1660572478.0,
    "url": "https://www.reddit.com/r/yorku/comments/wp0lpe",
    "media_urls": [
        "https://i.imgur.com/CxLvoMr.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Locked at the request of OP.",
            "score": 1,
            "author": "howdygents"
        },
        {
            "level": 0,
            "comment": "Little background information: Buddy caught me at a bad moment online and I replied in an aggressive way to one of his comments. He then made a thread on askreddit asking about bringing weapons to school immediately afterwards. At what point do you take a threat like this seriously enough to phone it in?\n\nEdit: He is online, just replied to a comment I made in another thread.\n\nEdit 2: I welcome anyone to use the information from this thread to make a call to whoever they want to about this themselves. I am on the phone all day today until 6pm and to be honest if other people could make sure all of this gets where it needs to go I would love that. I'm just the messenger here and maybe the antagonist too but honestly I don't think the crime fits the punishment. Anything I know about this guy is available in the comments here. Plenty of people here have looked through his comments more than I have. It's clear he is a danger to others.\n\nIf we haven't had an update from someone who reported it then I will spend more time on the phone.  Of course I will. This will be resolved by the end of the day but I hope I don't have to do it. 😂\n\nEdit 3: ~~I have either been blocked by him or he has deleted his account.~~ Reddit has suspended his account.\n\nEdit 4: u/keh2022 has confirmed that TPS is aware of the situation and is working with York to identify the student.  We did it reddit?\n\nEdit 5: If you have any information about the guy in question, please message u/keh2022.  The police have given them a number to use as a reference number.  This will keep it all organized and easy for the piggies to do their jobs.  Which is important or else they just won't.\n\nEdit 6: Probably the last edit until the guy is found.  Huge shoutout to u/keh2022 and u/SandalwoodSticks for taking the extra step and reporting it, along with anyone else.  I will update this post when we find out more, but I am going to stop refreshing this page and enjoy my evening.  I just want to go back to shitposting again.\n\nEdit 7: I want to wash my hands of this tbh, the constant stress is horrible for my mental right now, I'm signing off from my duties, and I pass the torch to whoever to create a new thread with updates. Hope y'all understand. Cheers 🥂😊",
            "score": 72,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd say report it to the police and university administration just in case and let them decide what action they want to take.",
                    "score": 55,
                    "author": "StrabossToss1587",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This was my thought too and I will once I get a bit more input saying so. This seems a bit too big for me to decide myself. I don't like police so I'd prefer to deal with York. Any suggestions are welcome",
                            "score": 15,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Let the police know. No this isn’t too big to decide by yourself. If something happens…",
                                    "score": 14,
                                    "author": "jnffinest96",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Somebody else in the thread was going to report it in person today. I am on the phone all day today and can't make the call.",
                                            "score": 7,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "looking at his username, his previous posts etc. I would definitely notify someone...  \nhitler posts. Nihilism posts. Clearly struggling at home etc.",
                    "score": 48,
                    "author": "Sinan_reis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's clearly mentally ill, so shit like this should definitely be taken seriously. It's better to be safe than sorry.",
                            "score": 20,
                            "author": "Ziontf"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Aside from this potentially being a  police matter, there is also a \"[Student Code of Rights and Responsibilities](https://oscr.students.yorku.ca/csrr)\" and if any student violates this they can be subject to sanctions which can include reprimand, fines, suspension or even expulsion. \n\nTwo of the responsibilities are: \n\n* The responsibility to behave in a way that does not harm or threaten to harm another person’s physical or mental well-being.\n* The responsibility to uphold an atmosphere of civility, honesty, equity and respect for others which values the inherent diversity in our community.\n\nIf you want you can also make a complaint at the page I linked above. \n\nAfter what's happened at Virginia Tech, Ecole Polytechnique,  etc. I would suspect that these threats are taken seriously, although one can never underestimate the incompetence or laziness of the police, so who knows. \n\nThe police can probably find him by getting the records from reddit of what IP address was used when he logged in and posted the thread, and then going to his ISP (Rogers, Bell, etc.) to find out the name and address of the person who was using that IP address at that time.  Then he gets an unpleasant knock on his door.    \n\nIt's extremely stupid of him to make some veiled threat of violence on a university campus since that is likely to result in a bad outcome for him, but it's most likely that he's just trolling and the only kind of violence he has the means or desire to commit is the kind that's done via a keyboard, although this of course should be investigated.",
                    "score": 17,
                    "author": "sis_iud"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m going to campus today (Keele). I could show this to the security office.",
            "score": 42,
            "author": "SandalwoodSticks",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd appreciate that. I've left my comments from last night that sparked his rage available. I'm not proud of them but I didn't break any laws or anything I wouldn't be comfortable having associated with my online alias. Feel free to show them the context as well. Let me know how it goes. Thanks",
                    "score": 20,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah no worries. Your convo with him brought him to our attention. Can you direct me to the thread with him? I don’t use Reddit much.",
                            "score": 9,
                            "author": "SandalwoodSticks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Edit 2: enough people saw my stupid post for it to get to the people it needs to, I'm deleting it now because it was a stupid post I regretted immediately anyways and it did its job.  It was just hotheaded and aggressive which is not an accurate representation of who I am; rather who I was in a single instant. \n\nEdit: here's the thread from the screenshot https://www.reddit.com/r/AskReddit/comments/wos10q/how_feasible_is_it_to_bring_a_gun_or_machete_to_a",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh that’s crazy, I opened Reddit today to see that post but had no idea such chaos was happening in the comments",
                                            "score": 9,
                                            "author": "SandalwoodSticks",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Unfortunately I've got a pretty short fuse on my bad days and I'd seen him around before being a degenerate. Bad mix of wrong place at the wrong time.",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Your comment wasn't even that harsh. The dude clearly made a shitpost but somehow has a lack of self-awareness.",
                                                            "score": 11,
                                                            "author": "Ziontf",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It's definitely one I made, realized that I should just go to bed and then I just went to bed. It looks like he got in his own head with spamming me until he got fed up with me being \"scared\" and made a dumb post like that. If I set him off with mildly antagonizing him with a pretty shitty insult (not my best) then maybe it's best it happened now and not at a time where he could do something.",
                                                                    "score": 7,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I spoke to security and luckily they had been notified and they got the police as well. Sea-Presentation had valuable info that I gave to the officers as well. If anyone has more info on the guy, feel free to DM me",
                                                                            "score": 3,
                                                                            "author": "SandalwoodSticks",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You are a beautiful person.  Thank you",
                                                                                    "score": 3,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can you please check my dms so I can help out.",
                                                    "score": 4,
                                                    "author": "Sea-Presentation8588"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pls report this to the police. From what I’ve read about school shooters, this is exactly how they act.",
            "score": 43,
            "author": "keh2022"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 37,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see your comment. If you want to delete it to keep your identity safe then feel free. There is another user in this thread that was going to go in person to security today. I'd recommend working with them via pm.",
                            "score": 8,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely report",
            "score": 32,
            "author": "anonreddituser1010"
        },
        {
            "level": 0,
            "comment": "Please stop responding to him and provoking him this. Block him and report it to the school. I no longer feel safe to attend my own school in the fall now.",
            "score": 26,
            "author": "whatsurissuebro",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was already nervous about the subway…",
                    "score": 14,
                    "author": "nitro-elona",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am not sure if this helps but if you would like someone to wait with you for the subway if you have night classes or something, I live in the area and I would be happy to help. I'm not a physically strong person but usually someone there is enough deterrence for creeps and weirdos. Let me know.\n\nEdit: also look into gosafe, a program York runs to help escort wary students from point a to point b on campus.",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That is very kind of you. I was planning on doing the whole no headphones, alert but not skiddish, no eye contact route and if I were to feel unsafe I’d look into my options. Thank you for the info too!",
                                    "score": 8,
                                    "author": "nitro-elona",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My PM's are always open and we can coordinate from there if you need it. Feel free. Good luck!!!",
                                            "score": 5,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I didn't plan on responding further. I'm sure that he will be reprimanded and you won't have to worry.",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please report this. I don’t want anyone getting hurt.",
            "score": 15,
            "author": "Ornery_Owl_6746",
            "replies": [
                {
                    "level": 1,
                    "comment": "Feel free to make a call to whoever yourself. I will be busy until 6pm and a few people have already expressed desire to.",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ah the ol’ too busy to report the potential school shooter. You probably have the most background on this person and considering it seems like it started from your response to him, you should probably make it a priority…",
                            "score": 2,
                            "author": "beanplantlol",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "??? What classes is he going to shoot up right now?  If you read the thread then you'd know I do not have the most background information on him.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "youre right theres zero people on campus. No summer school, no teachers, no cleaning staff, no security, not crowds of people from tennis canada, just a ghost town.",
                                            "score": -3,
                                            "author": "beanplantlol",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What did you do to stop him?  Get your holier than thou shit out of here.",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I didnt provoke him like you. You clearly did it long enough that people in this thread told you to stop. So considering you provoked him, made this post, and know the background, I would say you have a greater responsibility to report it and not wait until tomorrow.",
                                                            "score": -3,
                                                            "author": "beanplantlol",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Also, I did not provoke him.  The only message I sent him after I saw he made the post about weapons on campus was \"You should stop posting for your own good.\"\n\nPeople were being precautious.  You are being unreasonable.  Grow up",
                                                                    "score": 4,
                                                                    "author": "[deleted]"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I bet you're the guy on a new account lmao",
                                                                    "score": 3,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I like how instead of taking criticism and mending the situation which rooted from your comment, you just deflect. If you have enough time to respond to me and all these other people then clearly youre not that busy to provide the police with your story.",
                                                                            "score": 0,
                                                                            "author": "beanplantlol",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The OP didn’t give root to the situation. It brought out a troublesome user into the open. Unintentionally so but this is a good thing. I don’t play the blame game ‘cause that solves nothing. If you won’t help, that’s fine. But don’t waste our time.",
                                                                                    "score": 3,
                                                                                    "author": "SandalwoodSticks"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Find me a way to make phone calls while using my phone and I will oblige you next time.",
                                                                                    "score": 0,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Share this alert to Twitter and tag every Yorku accounts and Toronto police account (TPSOperations).\n\nThis is serious and needs immediate attention",
            "score": 14,
            "author": "External-Following38"
        },
        {
            "level": 0,
            "comment": "You can’t go on his profile anymore, “failed to load profile”. I’m guessing reddit already banned him or something.",
            "score": 11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "He might have deleted it thinking that it would keep anything incriminating away from law enforcement. He would be wrong.",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It says \"This account has been suspended\", so it looks like action on reddit's part, probably due to that post.",
                            "score": 10,
                            "author": "ThatCrazyCanadian413",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I gave all of his alleged info based on his posts (20-21 yr old male of Mexican Chinese descent, self identifies as loner, virgin, asexual, aninatalist, drop out, speaks of suicide etc) to TPS, along with screenshots that show him directly threatening OP to TPS. 31 division and YorkU are actively investigating.",
                                    "score": 18,
                                    "author": "keh2022",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Keep us updated. Hopefully they find him and punish him appropriately.",
                                            "score": 4,
                                            "author": "ThePillowsColdSide",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Shouldn’t be too difficult to find him. His email was verified and there can’t be that many drop out international students from Mexico born in 2001-2002!",
                                                    "score": 11,
                                                    "author": "keh2022",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Would additional people contacting TPS help? I’d be happy to give a statement",
                                                            "score": 4,
                                                            "author": "ThePillowsColdSide",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You mentioned that you had other information about him, I would call 311 and offer the information.  Worst that can happen is they take it down and don't do anything with it.",
                                                                    "score": 6,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thanks :), will do.",
                                                                            "score": 2,
                                                                            "author": "ThePillowsColdSide",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Message me! They gave me a specific number and case number if I have additional info",
                                                                                    "score": 2,
                                                                                    "author": "keh2022",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Thank you so much!!! For real.  I am no longer dreading an additional phonecall at the end of my day.",
                                            "score": 5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You’re welcome! Thank you for posting. I have looked into the psychology behind school shooters before since they’re absolutely unhinged and terrifying, that person checks all the boxes. Thank you for making us all aware and TPS seems to be taking it very seriously. Seriously you may have been an integral part in preventing a very dangerous mental health crisis and mass shooting.",
                                                    "score": 12,
                                                    "author": "keh2022",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I just shitpost on the internet ma'am.",
                                                            "score": 5,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Where I would get their updates? Please share. Thanks",
                                            "score": 3,
                                            "author": "External-Following38",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I will update my comment to link to any follow-up so just check back in a day or so.",
                                                    "score": 3,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow what an absolute psycho. This is not healthy or normal behavior in the slightest. I know he has been reported, but I urge everybody to stay vigilant during this time considering the potential threat. You may want to believe that this kind of thing will never happen to you, but it can and it is a real threat.\n\nStay safe out there.",
            "score": 13,
            "author": "EmiKoala11"
        },
        {
            "level": 0,
            "comment": "Bro forgot what country he’s in💀",
            "score": 12,
            "author": "Bababooey53"
        },
        {
            "level": 0,
            "comment": "See if you can do online for a bit for *safety purposes*. Especially if you’re POC or visibly LGBT. \nAlso send this, and their account, to your dean. \n\nIt sucks that people are like this, but better safe than sorry.",
            "score": 10,
            "author": "dragracesssss",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a straight white man, me and my privelege can go anywhere!!! No worries there but good call.\n\nEdit: What the commenter warned me of is a very real thing and I am very aware of my social privelege afforded to me from birth.  Please don't look at my reply as a minimizing snarky comment about a very real issue.",
                    "score": 11,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "The individual is clearly hispanic based on his history, talking about going back to Mexico and his use of the Spanish language so I’d assume he wouldn’t discriminate against POC specifically. Regardless it would be best for everyone to report this individual and get them found out.\n\nEdit: Allegedly Chinese/Hispanic, stated both parents to be from Guangzhou but also has a connection with Mexico and stated themselves to be “Chinese Mexican”. Stay safe y’all, I would NEVER recommend profiling but you know DAMN well I am going to be batting an eye or two.",
                    "score": 3,
                    "author": "whatsurissuebro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He hates being chinese. He hates exisiting, he doesnt give a fuck about POC or anything but his little bubble. He wants to be anything but Chinese so he will say he is Mexican now. He has made tons of accounts before with the same concept. If this isnt the signs of a school shooter I dont know. \n\nStudents like these dont deserve an education at all. They dont and I hope York does something cause this behaviour preludes to something really bad.",
                            "score": 10,
                            "author": "Sea-Presentation8588",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am a bit late, but that sounds really depressing. Nothing worse than hating your own identity. TPS/RCMP obviously needs to step in and implements proper measurements. But oh man, I really hope he gets appropriate medical help as well....\n\nPS: kudos to OP and everybody contributed here!",
                                    "score": 3,
                                    "author": "nt2701"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not clearly, considering he said \n\n&gt;[My parents are from Guangzhou but I was born in Mexico.](https://www.reddit.com/r/antinatalism/comments/w59r7b/my_mom_said_better_to_give_birth_to_a_piece_of/ih6pd74/)\n\nHe also posts a lot about Chinese content and culture.",
                            "score": 9,
                            "author": "DelayedEntry"
                        },
                        {
                            "level": 2,
                            "comment": "I have provided all of the information I have on him. He has edited his comments to make them look like they were targeted at me specifically. For some reason he doesn't seem to understand why this doesn't absolve him. Somebody else said they would report it today but you are more than welcome to make a call yourself if it would help put your mind at ease. I'm sorry to inadvertently cause you this stress but I am glad he showed himself before he could do anything.\n\nWith how seriously these threats are taken in Canada, the response from the subreddit being overwhelmingly in agreement and his continued urge to incriminate himself; we won't have to worry.  I am the focal point of his rage and I'm not worried. It's gonna be okay fam.",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hey, I completely agree with you but if you are really concerned then I wouldn't make those statements. He's watching this thread I'm sure. He's a little ant that needs attention and he's probably in Mexico right now which is why he has such reckless abandon. He doesn't seem to realize that his ability to re-enter the country to do these horrible things relies on not being added to a RCMP terror watch list. Which he has surely done so with his actions.",
                                            "score": 3,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Report it. No excuses. Zero tolerance for this",
            "score": 10,
            "author": "BigBoy7_4"
        },
        {
            "level": 0,
            "comment": "This person has stalked my profile, went and commented on months old posts of mine. Had to block them…",
            "score": 9,
            "author": "ThePillowsColdSide",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh no doubt, he is completely unhinged.  I'm very sorry that you went through that.  If you pm the person who said they would talk to security today more details, it would definitely be helpful to build a case for his arrest.",
                    "score": 4,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Hi, I’m the one that went in person today. If you have addition info, PM me\nEdit: or to keh2022 we both have the reference number so either of us should work",
                    "score": 3,
                    "author": "SandalwoodSticks"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's actually fucked, scary people out there",
            "score": 9,
            "author": "Turtnamedburt"
        },
        {
            "level": 0,
            "comment": "report to Police and they’ll do the rest.",
            "score": 9,
            "author": "Select_Shock_1461"
        },
        {
            "level": 0,
            "comment": "contact the police so that they can get the accounts IP and find out who this guy is? no idea how stuff like that works, but please call the police - for real.",
            "score": 7,
            "author": "tubbywubby2001",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why would anyone downvote this?",
                    "score": 3,
                    "author": "Haunting-Habit-4177"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bruh this person has made many posts here before, one was how they’re going back to Mexico since they’ve now graduated",
            "score": 7,
            "author": "NextLiving3814"
        },
        {
            "level": 0,
            "comment": "Not a York student but I say report his ass",
            "score": 7,
            "author": "TheGhostOfYamato"
        },
        {
            "level": 0,
            "comment": "I will call the school tomorrow and say something about it. I am very busy today and I doubt he's a danger to the school in August. If anyone would like to do this today in my place, feel free to do so.",
            "score": 17,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Report him",
            "score": 5,
            "author": "TorYorku"
        },
        {
            "level": 0,
            "comment": "I dont attend this University, rather a University in Virginia US. This post popped on my feed, as I read what it was about I hope your school catches and figures out what to do, best thing your school police can do is contact lawenforcement@reddit.com about the issue because this is a life threatening situation. If your school does that they can request their perdonal information. You can find out more at [Guidelines for law enforcement](https://www.redditinc.com/policies/guideline-for-law-enforcement) on the reddit website. Again I hope your school follows similar steps to catch this person. That person is clearly a dangerous individual and should be apprehended for making violent threats and asking if it is allowed to do so. Good luck you guys. \n\n-- Love from the Americans",
            "score": 17,
            "author": "DredgenCyka",
            "replies": [
                {
                    "level": 1,
                    "comment": "Always great to have an expert opinion, cheers from Canada eh?",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah, not an expert opinion. I actually had to go through the process of this helping local law enforcement track someone down for threatening to Doxx minors and spread their (SFW) pictures on the internet. Law enforcement simply didn't know where to start. It's more of a concerned person. I absolutely hate people like that especially the person who is threatening harm. I simply wish to cast them out of our civilization",
                            "score": 5,
                            "author": "DredgenCyka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am sorry, I have replied to so many comments and I made a really dark joke about a really real thing.  It didn't translate at all.  I agree with you on your last two points.  \n\nHe's not white so I expect the police to do their jobs.",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No dude you're okay man. No biggie. Though white or not, people like this don't deserve a chance in the world. Why would I trust them to run my grocery stores I shop at? Why would I trust them to pump my gas? Why should I expect them to run our national defense? They will never be trusted, people with violent mindsets who want to do harm against good people have no sympathy from me. \n\nYou guys need to be super safe, especially with the terrorists from my country seeping into yours over lock downs. \n\nAs always we all prevail",
                                            "score": 6,
                                            "author": "DredgenCyka",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Absolutely, I agree with you.  I am saying that because he is not white, the police will actually do something before he does something.  Our police in Toronto is notoriously awful at their jobs, more infamous than any other police in Canada.",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Damn I didn't know it was as bad in Canada either. I've only been to the Canadian Side of Niagra falls. So I haven't had any run ins with police, other than border control. But I was only a wee little lad. Guess both our nations need to work on our law enforcement",
                                                            "score": 2,
                                                            "author": "DredgenCyka",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "https://en.wikipedia.org/wiki/2010_G20_Toronto_summit_protests\n\nSome light reading!  ACAB, defund the police, etc etc",
                                                                    "score": 1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Ah, yeah I don't remember this because I was only 7 living in Guam at the time. So that makes sense why I was unaware of police brutality in Canada",
                                                                            "score": 2,
                                                                            "author": "DredgenCyka"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "oh..",
            "score": 5,
            "author": "Ilawil"
        },
        {
            "level": 0,
            "comment": "Good on you OP for bringing it to prompt attention. And those who reported this asap and took action, tons of thanks to you all too.\n\nWouldn't want anyone to get hurt.",
            "score": 5,
            "author": "GalladeTheNoble"
        },
        {
            "level": 0,
            "comment": "Unrelated, but if your phone has an AMOLED display, consider using the \"Black BG for dark themes\" toggle in RIF to save even more battery while reddit'ing.",
            "score": 4,
            "author": "DelayedEntry",
            "replies": [
                {
                    "level": 1,
                    "comment": "I cannot wait to get a new phone in September, I am currently using a Samsung Galaxy s5 Neo but with my grants and stuff I was going to look into a used galaxy s10 or something similar.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Great phones. I had a Galaxy S5 myself, and a Galaxy S10 too. \n\nThe Galaxy S5 does have an OLED screen so you can definitely benefit from the pure black background to save power, since a pure black pixel draws no power.",
                            "score": 2,
                            "author": "DelayedEntry",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I will look into it.  I had a galaxy s7 for 5 years but one day it literally melted so I had to beg my buddy for his old phone since I am broke.  OSAP gives me quite a bit of grant money because of my circumstances and there is more than enough to get a new one. \n\nI will definitely look into it.  Cheers!",
                                    "score": 2,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "My phone is considerably less laggy on reddit now. Cheers",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is serious, i have seen way too much mass murder footage to know i will not even tolerate this for half a second.\n\nfind the guys real name, seriously. \n\ni have seen what a head blown off by a shotgun looks like. report this guy.",
            "score": 4,
            "author": "tubbywubby2001",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd suggest reading the thread!",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow. This is scary.",
            "score": 5,
            "author": "vertigomirror"
        },
        {
            "level": 0,
            "comment": "His drivel is all archived on the [waybackmachine](https://web.archive.org/web/20220728000913/https://www.reddit.com/user/AsexualAntinatalist/)",
            "score": 2,
            "author": "datgermanboy",
            "replies": [
                {
                    "level": 1,
                    "comment": "You vould also go to a reddit archive, not gonna link that here  though looking at the stuff he posted.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wth this is a moddness 💀\nWhat did u do to broski? 😭",
            "score": 3,
            "author": "TorYorku",
            "replies": [
                {
                    "level": 1,
                    "comment": "Words in response to words.",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is not America lmao.",
            "score": -27,
            "author": "other_e",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tell that to the relatives of the Polytech victims or the Nova Scotia shootings. What an insensitive thing to say. I know people my age (20~) who have multiple firearms after taking pretty short courses and checks. These people are thankfully very mentally sound and the dead last person to do anything heinous and evil but the way they described the ease in obtaining the permits/licensing to owning their firearms leads me to understand that many unhinged lunatics could have the same access should they just mask their intentions. \n\nCanada is not without mass shootings and this individual in question that OP is referring to is asking about brining weaponry and firearms to the school with a long post history about torturing and killing animals, enjoying it, feeing like God, having no friends, etc. Clearly an unhealthy individual and a sort of threat that constitutes some kind of action or at least caution.",
                    "score": 22,
                    "author": "whatsurissuebro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know I know. I meant the fact that he asked to bring a firearm to school, by that I meant this is not America.",
                            "score": -9,
                            "author": "other_e",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you were trying to make a joke then it did not translate and it is not the right place or time. Sorry dude.",
                                    "score": 11,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep. Should’ve worded it better.",
                                            "score": 6,
                                            "author": "other_e",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Or not at all!!! But I know you probably did not intend to cause shit. Sometimes I fall victim to the unintended offensive joke timing too with my ADHD.\n\nAll good fam",
                                                    "score": 6,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, do you want it to be? Dumbass.",
                    "score": 8,
                    "author": "Ziontf"
                },
                {
                    "level": 1,
                    "comment": "Tell that to the freedom convoy idiots aka the gun owners of canada",
                    "score": 13,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}