{
    "id": "1066a6j",
    "score": 5,
    "title": "Tips?",
    "author": "Upbeat_Lawyer7923",
    "date": 1673142388.0,
    "url": "https://www.reddit.com/r/Imperial/comments/1066a6j",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m in year 12 and it’s January so I have about 10 months until I have to start submitting uni application. I’d like to study engineering or natural sciences (probably natural sciences) and I have barely done anything that I can put on my personal statement so far. I’d like to know what my chances could be of getting into top universities (e.g oxbridge) if I work super hard from now on. Is it at least a little normal to be in my position or would almost all people who get into top universities have done wayyy more than me by now? Also, if anyone has any tips on what makes a good science applicant then that would be so greatly appreciated. If anyone who has been accepted to any top university anywhere could tell me what they did to get in that would be amazing too! Thank you😊",
    "comments": [
        {
            "level": 0,
            "comment": "There isn't much you can or should be doing at this stage apart from just getting the best grades you can.\n\nUntil the summer of year 12 I was planning on applying for engineering so I didn't really have anything relevant for my personal statement. But as long as you can convincingly explain why you're interested in the course you don't need to be drowning in supercurriculars. I just talked about a few books I'd read and my astronomy GCSE.\n\nWhat matters a lot more, particularly with Oxford/Cambridge is the admissions test and interview. Start practicing for the tests over the summer.",
            "score": 1,
            "author": "Amazonit"
        },
        {
            "level": 0,
            "comment": "Apply to some uni run summer programs/summer schools for the 6 week holiday. Apart from that you dont really need to be doing anything apart from preparing for your mocks.",
            "score": 1,
            "author": "lilbabyfan4pf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don’t you need to already have done impressive things to be able to get accepted to do a summer programme though?",
                    "score": 1,
                    "author": "Upbeat_Lawyer7923",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "as long as you can display your interest in the subject with a few examples outside of your studies (books, hobbies, projects) you’ll be fine in terms of extracurriculars, it’s more about showing your dedication to want to learn more about the subject than about what you’ve already done",
                            "score": 1,
                            "author": "tinkxrer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dunno about Oxbridge but imperial is plain awful. Don’t bother applying. As for applications, just make sure you know the subject well enough for the interview. A decent A level grade should guarantee you an interview, and answering the questions correctly during the interview should get you in.",
            "score": -1,
            "author": "No_Republic9657",
            "replies": [
                {
                    "level": 1,
                    "comment": "Worst advice award",
                    "score": 3,
                    "author": "GlitchedTurtleDev"
                },
                {
                    "level": 1,
                    "comment": "whats wrong with imperial?",
                    "score": 1,
                    "author": "lilbabyfan4pf"
                }
            ]
        }
    ]
}