{
    "id": "127uzlo",
    "score": 5,
    "title": "JMC Career Prospects",
    "author": "2502buddy",
    "date": 1680288313.0,
    "url": "https://www.reddit.com/r/Imperial/comments/127uzlo",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys, got a conditional offer for JMC recently, and I am a UK citizen but an overseas resident so it is international fees.\n \nI just wanted to learn more about the career prospects out of the course as I saw only it’s 55k which is much lower than I’d thought/heard about the big tech or finance jobs.\n\nI wanted to ask how people are generally doing  from the JMC course, and I’m specifically interested in investment banking/quant roles and also FAANG. What’s the general salary range and how likely is it to get a tier 1 banking job in general?\n\nI’d really appreciate any help as I’m trying to weigh my options for bachelors/undergrad right now so I’m trying to get a lay of the land in terms of future careers.",
    "comments": [
        {
            "level": 0,
            "comment": "mate if you get any response, could you please ping me too?",
            "score": 1,
            "author": "SueIsAGuy1401",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sure",
                    "score": 2,
                    "author": "2502buddy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "JMC is one of the best options and preparation in the country to get into quant and FAANG, but in the end is about how well you do in the interviews and a bit of luck. Salaries for these roles are way higher than 55k (think some people get into phds or other less paid roles which lower the statistics). Hard to say a specific salary, but if you get into any of these firms you should expect 6 digits rather soon and 7 if you’re good and progress in your career.",
            "score": 1,
            "author": "aristosldn",
            "replies": [
                {
                    "level": 1,
                    "comment": "How realistic is a path like that for an imperial graduate. Do you see many of them reach those levels of pay or is it just a select few?",
                    "score": 1,
                    "author": "2502buddy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There are many Imperial alumni in these roles, it’s a realistic path, but it isn’t easy to go beyond 150k, independently of which uni you come from. Doable if you are smart, make good decisions and a bit of luck",
                            "score": 1,
                            "author": "aristosldn"
                        }
                    ]
                }
            ]
        }
    ]
}