{
    "id": "12cokxk",
    "score": 9,
    "title": "Master in the US",
    "author": "Impossible-Sun8592",
    "date": 1680709699.0,
    "url": "https://www.reddit.com/r/Imperial/comments/12cokxk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I am an international Imperial Electrical and Electronic Engineering offer holder. I would love to pursue my masters degree in a top tier US school(MIT, Princeton, Stanford). Do you know how hard are them to achieve after bachelors in Imperial? And what can I do in Imperial during my degree to increase my chances? Any tips would be appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "Imperial certainly has the prestige and ranking to open doors to the US, but I think few of us here are going to know the requirements for US grad schools that well. You're probably better off asking US university communities what is expected of graduates looking to get in those programmes. You probably want to look like the ideal American candidate as much as possible, but also most administrators in the US will know what a good UK CV looks like, and interviewers will just care about domain specific knowledge that you would have to revise at the time.",
            "score": 2,
            "author": "drcopus"
        },
        {
            "level": 0,
            "comment": "Master’s degrees in the US are their money makers so just be warned it’ll likely cost an arm and a leg since scholarships are limited. As long as you’ve got good grades and great letters of recommendation, you should be good to go. Acceptances to masters degrees at top schools are a lot higher (more around 50% acceptance) than undergraduate degrees simply because they make most of their money through them. I’d say just focus on getting good grades and getting to know your professors to get in, but just be prepared for the price!",
            "score": 1,
            "author": "TheProtagonist333"
        },
        {
            "level": 0,
            "comment": "Masters in the US really don’t make sense. It’s so hard to find good jobs here. Especially if you are from India and will require a visa. Honestly not worth the money and the effort",
            "score": 1,
            "author": "bot2699",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes",
                    "score": 1,
                    "author": "RoutineAd6903"
                }
            ]
        }
    ]
}