{
    "id": "iwmlsr",
    "score": 3,
    "title": "Any chemist around ?",
    "author": "Novel_Refuse4966",
    "date": 1600637114.0,
    "url": "https://www.reddit.com/r/Imperial/comments/iwmlsr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm going into imperial for chemistry this year and frankly scared ?\nCould anyone give me a low down on the modules ? Very little info I can get online. So what exactly do you learn ?\nAlso how are the teachers like ?\nI've been given the option to defer since I am not sure about the course, would you say I should just try it out ? Do you need to be very interested in order to get through imperial ?. There's days where I am alright with the thought of studying at imperial and days where I am dreading it but have no clue what other subjects to do. I quite like the idea of a gap year but also have no confirmed plans (also due to covid most of my plans seem unlikely). Should I just try out the course or not?\nThanks for the help !",
    "comments": [
        {
            "level": 0,
            "comment": "Not a chemist but imo if you're gonna go through with the programme, start now. After a gap year, your knowledge starts to fade and you'll just become more scared at the thought of going back to school. \n\nIf you start this year and realize it's not what you want, you will have time to maybe try other things out now that you have reduce chemistry out of the equation. (Assuming you have enough finance to support) to me that's a pretty good outcome from attending 1-2 terms\n\nIf you feels like it's too hard or you're not qualified, just believe in ICL when they sent you the offer.",
            "score": 2,
            "author": "hippoMay"
        },
        {
            "level": 0,
            "comment": "I completed a chemistry degree there. The degree mainly teaches you to become a research scientist. The first year teaches you the basics across all parts of chemistry and in the second  year onwards you get to specialise in physical, inorganic or organic chemistry. It is very heavy in laboratory work from the first year onwards. You will spend several hours per day doing experiments in the lab, the experiments take quite some skill and attention to detail and quite often do not turn out what is desired. The lectures are long at one hour each back to back in the morning. The lectures are very information heavy. You are assigned to a small class with a tutor to ask questions and given homework once a week in the lecturer's office. There are a lot of lectures in the second and third year and you need to be organised and will not have time to read everything. The months from May to June are spent studying for exams all the time. Many students have to spend hours studying in the library which is open 24h. The laboratory opens in the morning and the hard working students are there already by 9am. There are many exams at the end of each year which count towards your final grade. I would do this degree if you wish to become a researcher, scientist or work in academia in science as that is what this degree mainly trains you on. There are options to take courses in finance and management in the third year but they are oversubscribed and there is no guarantee you will get a place. The way this degree is taught is quite similar to how the other physical sciences are taught at Imperial. If you want to work in different career you may need to spend time and money on another degree all over again. Out of the students in my year, a lot went to do PHDs in science, some went on to do further study in law, some went to become chemistry teachers and a handful went to work in the city in accounting and finance. Imperial college degrees are hard work and you will need to work hard just to get decent grade.",
            "score": 1,
            "author": "FrostingMurky2741"
        }
    ]
}