{
    "id": "kk6tj4",
    "score": 2,
    "title": "question about Civil Engineering (MENG) entrance maths exam revision",
    "author": "Jingtian_Wang",
    "date": 1608933604.0,
    "url": "https://www.reddit.com/r/Imperial/comments/kk6tj4",
    "media_urls": [],
    "other_urls": [],
    "postText": "I recently got an email from Imperial admissions asking me to do a 45-minute math exam as a part of my civil engineering application. However, I couldn't find any material on the test and I'm worried that I will get a nasty surprise.  \n\nCould anyone who has taken this exam tell me what I should expect? Do I need to do complex calculus by hand? And are the questions based on pure math (i.e integrate xsinx/5tanx) or is it application-based questions? \n\nLastly, because my math course allows a formula sheet (IB math AI HL), I haven't memorized many (if any) formulas, should I be concerned about this? If yes, what formulas should I memorize?",
    "comments": [
        {
            "level": 0,
            "comment": "Hey there, good to see another civil eng applicant. I was asked to do this last month and tbh it wasnt half as bad as i expected it to be. I, like you, also expected complex stuff like integrate ln(lnx) or stuff like that but then the test i did was actually decent. The questions would be like the extension questions we get at the end of each exercise from the textbook. They are contextual, so its not like a straight up find the derivative of so and so - the question is based off of a situation. U dont need tl revise, but i guess you could just skim through the textbook to make sure u know how to do the working out and each stage of a particular method. Dont stress too much, u will do absolutely fine.",
            "score": 2,
            "author": "Dwayne-Carter-Jr"
        },
        {
            "level": 0,
            "comment": "it really easy and it's just a level math, not further math",
            "score": 1,
            "author": "CharacterKH1166",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is there any mechanics on the paper?",
                    "score": 1,
                    "author": "K_Willow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Since imperial specifically instruct me to not discuss details about the test to question, forgive me for being vague. \n\nAs u/Dwayne-Carter-Jr said, the test is about solving problems and assess if you have a chance to survive in imperial. Keep in mind that physics is a important part of civil.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have u guys done the video submission? What kind of questions should I expect? Any physics or math questions",
            "score": 1,
            "author": "CharacterKH1166",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll repeat this from my other reply: since imperial told me to not discuss details about the test, forgive me for being vague.\n\nThe videos aren't about technical problems.\n\nIt's a mixture about you as a person, and also your way of approaching somewhat civil related problem.\n\nMy suggestion is that you have several sheets of A3 paper in front of you to plan your answer. You have minimal time (1 minute max, as little as 15 secs) to think, so choose an answer and plan it - better than spend all your time deciding. Nothing much you can do to prepare.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}