{
    "id": "ky6wbi",
    "score": 8,
    "title": "Why is student satisfaction among EIE students so terrible?",
    "author": "silica-gel",
    "date": 1610753861.0,
    "url": "https://www.reddit.com/r/Imperial/comments/ky6wbi",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was looking through the Discover Uni student satisfaction stats for the EIE course, and the student satisfaction ratings for both the BEng and MEng are significantly lower than other courses (including EEE) at Imperial and at other unis and I was wondering why that is. It seemed like every category across the board had pretty abysmal scores. Is there anything I should know about as an offer holder to clarify this?",
    "comments": [
        {
            "level": 0,
            "comment": "the vibes are fucked",
            "score": 7,
            "author": "TimeSinkUtiliser"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a massive aside from an alumnus but wow the student union satisfaction has dropped massively. I wonder what happened.",
                    "score": 2,
                    "author": "Emma172",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But the course and the department output aren't the responsibility of the SU are they? When I think of the SU I just think of the bars/ societies/ extra curriculars but maybe I am misremembering\n\n You're right though the sharp drop does appear to start around 2016 when those on 3 year courses would be finishing. I hadn't considered that as I started in 2010 myself.",
                                    "score": 1,
                                    "author": "Emma172",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "All good, thanks for taking the time :). I think you are right generally though it will be due to higher expectations across the board.",
                                                    "score": 2,
                                                    "author": "Emma172"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "because Imperial is extremely overrated and its basically a prison",
            "score": 1,
            "author": "Exotic_Ghoul"
        }
    ]
}