{
    "id": "mj0pzv",
    "score": 6,
    "title": "It is worth it to do a Msc now ?",
    "author": "Sufficient-Papaya326",
    "date": 1617421653.0,
    "url": "https://www.reddit.com/r/Imperial/comments/mj0pzv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi,\n\nI was wondering about if it is worth pursuing a masters (Financial engineering Imperial) next year. I do not know if conditions will improve. Do you think that full face to face mode will return for autumn? If not, do you believe that getting in debt 40 k is worth it?",
    "comments": [
        {
            "level": 0,
            "comment": "If it’s remote then no. Doing it rn and it’s a disaster, hate it so freaking much...",
            "score": 5,
            "author": "ezrix94",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, could you maybe shed some light on the employability of this program as per your experience? I already have an offer, but I don't know if it's worth the risk of the massive debt i'll be taking for it. I seem to be finding not a lot of info on net plus some pretty cynical views as well.",
                    "score": 1,
                    "author": "FuzzyAardvark3057"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No, no, no! Absolutely ***NOT***.\n\nPostgraduate degrees (and certificates) are the best way for universities to make money. You will be a \"master\" of none. 40K can be better spent. Especially if it is going to be a remote one, then buy online courses and combine them with actual practical experience, in which you will gain practical ***hard and soft skills***. Start your own projects, start freelancing, ***start networking*** (online meetups or webinars) or find a job (even if it is slightly \"irrelevant\").\n\nUnlike American universities, Imperial will not give you access to a huge network to boost your career. So, undergraduate degrees at Imperial are a wise option, but postgraduate degrees not so much.\n\nThere is only one case that a Master's degree ***might*** be worth it: To land a job in another country (e.g. in the US).\n\nThe typical formula to see if a degree is worth it is to calculate the Return on Investment (ROI): \n\n***ROI = (Amount Gained - Amount Spent)/(Amount Spent)***\n\nWHERE:\n\nAmount Spent = Twelve months of \"lost\" salaries + Tuition fees + Extra accommodation or other fees (which you wouldn't normally have if not taking the course)\n\nAmount Gained = Amount of money that you will get in the next 5 (or so) years WITH the degree - Amount of money that you would get WITHOUT the degree\n\nRead more here: https://www.forbes.com/sites/theyec/2020/08/20/the-roi-of-a-university-degree-is-it-worth-it/",
            "score": 2,
            "author": "kourouklides"
        }
    ]
}