{
    "id": "nn13gg",
    "score": 1,
    "title": "Why are there two prices for Xenia standard single and twin rooms?",
    "author": "O_A_H_Z",
    "date": 1622217835.0,
    "url": "https://www.reddit.com/r/Imperial/comments/nn13gg",
    "media_urls": [],
    "other_urls": [],
    "postText": "For example the standard single rooms are priced at either £119 or £127 but there doesn't seem to be a difference between them. I would normally just go for the cheaper one but I wondered if you'd get a much better room for just £8 more.\nThanks",
    "comments": [
        {
            "level": 0,
            "comment": "I don't know, it might be one with a bassin and one without or it could be the window like if it's south facing it might be more expensive with the natural sunlight. But I doubt that second option is it tho.",
            "score": 1,
            "author": "leela_loca",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ohh I hadn't thought of the bassin thing, thank you",
                    "score": 1,
                    "author": "O_A_H_Z"
                },
                {
                    "level": 1,
                    "comment": "That's not the case, all single rooms at Xenia have bassins. The one that ia more expensive is bigger, the cheap one is pretty small",
                    "score": 1,
                    "author": "kt2909",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Makes sense, sorry",
                            "score": 1,
                            "author": "leela_loca",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Np",
                                    "score": 1,
                                    "author": "kt2909"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just a note on Xenia rooms: some rooms are great and some rooma suck. I live in a big single room with view towards S-W and it's the best room ever (I got to choose this room since I am a 2nd year). There are some small single rooms that suck (they are veryyyy small and have a very small window). I still recommend Xenia because the location is just amazing, it's literally in the middle of London and just the location alone is worth having a shitty room, but just keep in mind that if you're unlucky you can get a bad room. If you can afford a bigger room then I'd go for the more expensive one.",
            "score": 1,
            "author": "kt2909",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see, thanks for helping!",
                    "score": 1,
                    "author": "O_A_H_Z",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem, let me know if you want to know more about Xenia, this is my 2nd year in this hall",
                            "score": 1,
                            "author": "kt2909"
                        }
                    ]
                }
            ]
        }
    ]
}