{
    "id": "o123ac",
    "score": 5,
    "title": "Incoming student here, how often will I need to wear formal clothing at Imperial?",
    "author": "RickoleYT",
    "date": 1623840797.0,
    "url": "https://www.reddit.com/r/Imperial/comments/o123ac",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm considering to buy a suit prior to arriving in London, but I don't know how frequently I'll need it. I know everyone will definitely need formal clothing at the graduation ceremony, that's very far away, aside from that are there other occasions where a suit will be needed? Thanks in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "If you want to recruit for banking/consulting spring weeks, it's a good idea to have a suit, apart from that some societies do a formal dinner here and there and they're always good fun.",
            "score": 5,
            "author": "UdvPeter"
        },
        {
            "level": 0,
            "comment": "Depends on how often and how much you want to get involved with formal dinners.\n\nRSM for example has a formal dinner 1-2 times a term, and you might have one with various different social clubs or halls for Christmas, and there is the  the end of year ball. That's usually \"themed\" but most people just wear something smart.",
            "score": 2,
            "author": "ImperialSeal"
        },
        {
            "level": 0,
            "comment": "In addition to the below, my halls did a Christmas dinner in a hotel that everyone got dressed up for. I don't remember anyone wearing a suit before that",
            "score": 1,
            "author": "Emma172"
        },
        {
            "level": 0,
            "comment": "Never needed a suit, usually just having something considered \"smart\" is fine, even for black-tie events. Nice shirt, shoes and a pair of nice trousers will do the job, and for graduation you can rent them from what alumni have told me.",
            "score": 1,
            "author": "Girgias"
        },
        {
            "level": 0,
            "comment": "Formals do happen, so if ur planning to attend that kinda thing then have a suit",
            "score": 1,
            "author": "PuliVeeram"
        }
    ]
}