{
    "id": "sp0gdl",
    "score": 1,
    "title": "Switching Departments",
    "author": "apondy2004",
    "date": 1644476992.0,
    "url": "https://www.reddit.com/r/Imperial/comments/sp0gdl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, \n\nSo I applied to imperial for 2 courses, matsci and eee for fall 2022 entry. I was accepted for matsci and rejected without an interview for eee. This was honestly expected because my sop was all about materials (barely any eee content on it) as I was applying to other colleges (basically oxford) for materials. However, at Imperial my first choice would be EEE not materials. Is there a way for me to now switch to the department of Electronics? \n\nMy marks are far above the entry requirements for both so idt that should be an issue. I've also done a lot of work with electronics in the past I just couldn't mention it in my sop due to materials taking preference. \n\nIf it is possible to switch, how do I go about it? Im hoping its possible since I haven't actually began my degree yet.",
    "comments": [
        {
            "level": 0,
            "comment": "Did you have an interview for the matsci course?",
            "score": 1,
            "author": "youcantseeme008"
        },
        {
            "level": 0,
            "comment": "I doubt it, I was excepted for mech eng and tried to switch to computing. They made me reapply. No harm in asking tho.",
            "score": 1,
            "author": "Sporeray"
        },
        {
            "level": 0,
            "comment": "you should contact eee, I think they accept people from other dept sometimes",
            "score": 1,
            "author": "minipimmer"
        },
        {
            "level": 0,
            "comment": "If EEE and Matsci have similar classes and course structure, then theoretically your request for switching courses should be accepted. However, you should note that there is a very low chance that you actually get to switch because imperial doesnt usually allow students to switch over. \n\nimo your best bet is to join imperial for matsci and request for a change as soon as possible, where you can still catch up to the classes for EEE. When you send the request, be ready to answer a few questions from the administration about the peculiarly early change of degrees.",
            "score": 1,
            "author": "su3aaj",
            "replies": [
                {
                    "level": 1,
                    "comment": "this is information is from what I know, so do your own research before taking any decisions.",
                    "score": 1,
                    "author": "su3aaj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This page talks about Imperial making changes to their courses not students switching between courses.",
                            "score": 1,
                            "author": "ConnoisseurDesMemes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that's my bad. I'll remove the link",
                                    "score": 1,
                                    "author": "su3aaj"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When did you apply to Imperial cause even I have applied to imperial and haven't got a decision as of now",
            "score": 0,
            "author": "Sad_Country_5246"
        }
    ]
}