{
    "id": "10gnjst",
    "score": 2,
    "title": "WHEN SHOULD I BE LOOKING FOR OFF-CAMPUS HOUSING??????",
    "author": "great_rhyno",
    "date": 1674189526.0,
    "url": "https://www.reddit.com/r/fsu/comments/10gnjst",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi so im pretty much decided on attending FSU fall 2023! o have two roommates already and we are all stressed looking for places to rent from, houses and apartments alike. we are also really cheap and looking for like mid400 to low500 per person, and we can find options, but they are like already available so to my knowledge its not a place we can rent out for august. are more places supposed to start popping up soon?? ive seen a ton of conflicting information and heard negative reviews of every management company under the damn sun, so id really appreciate some guidance from anyone with experience in off-campus housing. thank you!!!!!!!!\n\nedit: btw it would be mid400-low500 before utilities + tax + whatever else is added on!",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly, if you’re looking for that cheap you’re going to end up somewhere between 8-10 minutes off campus. the only place I know that cheap is Torchlight, but I’m not sure if they are sold out or not. Be warned, when my friend moved in they had not cleaned her apartment at all but her and her roommates cleaned it up themselves and now it’s a pretty decent place to live. For that cheap, all of the apartments are gonna have their downsides. I would say that if you’re able, you should try and visit these apartments before committing to one. Also, places have definitely started renting out for next august as I have already signed my lease for next year.",
            "score": 4,
            "author": "Large_Engineering826"
        },
        {
            "level": 0,
            "comment": "I say start now. I literally just last week — nearly a month early — got my renewal email from my leasing office saying that rent was increasing (no shock there) and that the market is tight right now. Renewing raised the rent to $975 from $925, but if we’d opted to leave and the house went back on the market they were going to let it for somewhere around $1-1.2k/month.\n\nOn that note, check rental sites closely; we found our current place almost three years ago by checking when it was noted to be “available for leases and lucked out that way.",
            "score": 3,
            "author": "katsuko78"
        },
        {
            "level": 0,
            "comment": "I would definitely start looking now, it’s hard to find apartments in that price range because they go fast. I had to sign my lease in early September to get a spot in an apartment that’s not even built yet.",
            "score": 2,
            "author": "LLPeace"
        },
        {
            "level": 0,
            "comment": "The earlier the better. Things in that price range fill up fast. If you can’t do it now you can wait until June or July and get a really good deal but it’s a gamble because things might be full. I have one piece of advise though. DO NOT SIGN AT SEMINOLE GRAND.",
            "score": 1,
            "author": "elena_marie_l"
        }
    ]
}