{
    "id": "10l8v2x",
    "score": 6,
    "title": "Japanese Study Buddies",
    "author": "Fanalia123",
    "date": 1674678681.0,
    "url": "https://www.reddit.com/r/fsu/comments/10l8v2x",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone in the elementary Japanese classes want to study together? The distinct lack of actual teaching in the classroom leaves a lot to be desired when trying to learn the language. I'm not sure why they think having us do 5 minute grammar point video quizzes, quick vocab quizzes, and quick kanji quizzes online make up for actual teaching. I get having homework and planning study time but it seems like I paid for a class that is just pop quizzes with brief oral comprehension exercises and no instruction. Anyone else having trouble keeping or learning the material in general?",
    "comments": [
        {
            "level": 0,
            "comment": "Similar dilemma with another language dep. I recommend you find clubs and reach out to those people or head to office hours but I understand hesitation with that.  When learning a language immersion is so important, try your best to think in the language and focus on words/phrases used in everyday conversation.",
            "score": 2,
            "author": "fireflyy3"
        },
        {
            "level": 0,
            "comment": "Curious who your prof is. This was a while back but I had Junko sensei, Kaori sensei, and Walter sensei. I rather enjoyed all of them.",
            "score": 1,
            "author": "FrostByte_62",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pretty sure she's just a grad student. Took elementary 1 over two years ago and had a grad student back then too. Fast paced either way but two and half years ago the guy made an effort to teach the material to an extent. Now it's like I'm expected to teach myself everything and class time is just to test out brief oral/reading comprehension exercises.",
                    "score": 1,
                    "author": "Fanalia123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hey! not sure if my input will be helpful but thought i would offer it anyway as a student in the program currently in Advanced Japanese B.\n\ni felt the same way when i started out in Elementary 2. the jump from 1 to 2 was shocking to me and honestly i struggled a lot in 2. i felt frustrated that there wasn’t a lot of review of the material in class so i fell behind. there’s just so much to get through in the earlier levels that it feels a little rushed.\n\nunfortunately, if you want to feel caught up you will have to do a lot of the learning from the textbook on your own time. it was hard for me to realize just how much time i had to dedicate to studying if i wanted to do well in the program. \n\ni will say that it gets a lot better when you get further into the program - in my experience, after the first 4 or so classes i felt like i understood a lot more and that more time was dedicated to learning in-class. but i still have to dedicate hours before every class period to do homework, review the reading materials, study the grammar, etc. \n\ni know i’m not an elementary student but if there’s anyway i can help with anything please feel free to msg me :)\n\nがんばってください！",
            "score": 1,
            "author": "deuxme",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for telling me. I actually started out as a Japanese major but I switched so I could take more classes outside the department that interested me. Kinda glad I did if you have to get past four or more classes to get actual in-class instruction. Seems unfair that we're paying for classes that depend solely on how well you can teach yourself at home. I can teach myself at my pace for free. I paid for a teacher and it's very disappointing to know that I basically don't have one for the next two semesters.",
                    "score": 1,
                    "author": "Fanalia123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "well, in my experience there was still in-class instruction in the first few levels so it could just be an issue with the professor you have now which is understandable. \n\ni just meant that at the higher levels there’s more of reading the material as a class and reviewing the grammar points, but they don’t have the time to spell everything out for you - you still have to dedicate a lot of time to learning outside of class. \n\nhow well you do is partially dependent on how much you study by yourself, as many majors are. the classes provides structure and interaction with people who are at your proficiency level that you may not get otherwise. \n\nyour professor is there to help you. if you’re not understanding something, ask. if you don’t feel comfortable asking in class go to their office hours.",
                            "score": 1,
                            "author": "deuxme"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! I'm currently in Elementary Japanese 2 and would love to be study buddies. \n\nI also agree with you. I don't think we have the same professor but I still feel there is much to be desired. \n\nFeel free to DM me if you want to!",
            "score": 1,
            "author": "owou"
        },
        {
            "level": 0,
            "comment": "im in japanese 2 with markesia square",
            "score": 1,
            "author": "hurighzero",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh cool. Are you looking for a study buddy too?",
                    "score": 1,
                    "author": "Fanalia123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I transferred here as a Japanese major, and I was a bit shocked to find that Japanese III is Japanese-only in the classroom, and any English speaking is penalized. But, on top of that, they don't actually teach anything! You just show up and take quizzes and chat with students who are non-native learners.\n\nThe instructors are graduate students at this level. It's pretty frustrating because I took the first two classes online (during Covid), and then to suddenly be required to have a low-level fluency for the third class seems like a herculean leap in expectations. \n\nI had to drop the course to spend time self-studying, and I'm wondering if I should even major in it now. I've been taking mostly business courses since I got here. I probably spend 5-6 hours per day studying Japanese, and it makes me wonder if I even need to major in something that I'm teaching myself anyway.",
            "score": 1,
            "author": "Riddlewrong",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly! Thank you! I took elementary 1 during COVID in 2020. Now that everything is on campus it's been like two and a half years for me. They wouldn't let me retake elementary 1 since I passed by the skin of my teeth the first time. Used a lot of money last semester on a tutor plus months beforehand studying solo. I hate this class. I'm a little hard of hearing and so I'm lost half the time on what's going on because most everything is said in Japanese. If I didn't need a foreign language requirement I wouldn't waste my scholarship money on these next two Japanese classes. I don't have time to study the language solo 5 hours a day and that's obviously what's expected since there's no actual teaching. It is total bs that I'm paying for a view of the classroom essentially. Good luck with Japanese 3. We both need all the luck we can get.",
                    "score": 1,
                    "author": "Fanalia123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I sent you a DM. I think I can help you get through the classes.",
                            "score": 1,
                            "author": "Riddlewrong"
                        }
                    ]
                }
            ]
        }
    ]
}