{
    "id": "10lqntm",
    "score": 6,
    "title": "If I double major will both degree show up on my diploma?",
    "author": "cozylillie",
    "date": 1674736050.0,
    "url": "https://www.reddit.com/r/fsu/comments/10lqntm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello Everyone.\n\nI was looking through some threads on here and I’m getting contradictory answers to this question .\n\nSome people are saying that both degrees will show up on my diploma while others are saying only my primary one will show up on my diploma.\n\nSo which is the actual answer?\n\nAlso, if only one is going to show up on my diploma, is there a way I could get it to show my secondary major instead? I would prefer that.\n\nIf not, is there a way I can switch which one is my primary major? I’m currently a junior.\n\nI’m also wondering… if I double major will I be able to apply for grad school for either major? Or will I only qualify for grad school for whatever is my primary major?\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Considering the mixed results in the comments, it’s best to ask your advisor, or better yet, the graduation office. You can email them at graduation@fsu.edu\n\nMaybe the reason both show up for some people is because they did a double major within different colleges?? I know that when I initially was a double major, I was told only my primary major would show up which is why I switched to a dual degree. No way I wasn’t going to have my efforts show on my diploma.",
            "score": 10,
            "author": "sara34987",
            "replies": [
                {
                    "level": 1,
                    "comment": "Listen to sara34987 and just ask the real people who have an actual and up to date answer\n\nFor me, I graduated in 2000 and did a triple major in the college of business. I have 1 piece of paper (degree) but all 3 degrees (majors) are listed.",
                    "score": 4,
                    "author": "JustAnotherNole"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Double major is only your primary on your diploma. Both majors will be on your transcript, which is used for grad admission. \n\nDual degree, you get two diplomas.",
            "score": 22,
            "author": "__sarabi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mine shows both of mine.",
                    "score": 4,
                    "author": "LetshearitforNY",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They stopped printing both majors in 2016 or 2017. Only the primary major is listed now",
                            "score": 5,
                            "author": "ezug_01",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ohh okay thanks for clarifying",
                                    "score": 2,
                                    "author": "LetshearitforNY"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Double major is not the same as dual degree. Double major is one degree with two majors. Dual degree is two separate degrees (you get separate diplomas).\n\nIt used to be that if you double majored, both majors were printed on your diploma. I believe I read that this is no longer the case and only your primary major will show up on your diploma. Kinda lame if true.",
            "score": 3,
            "author": "NewTampan"
        },
        {
            "level": 0,
            "comment": "Both will not show up on your diploma. Your advisor can help you switch your primary and secondary though, it’s pretty quick.",
            "score": 2,
            "author": "hannhan"
        },
        {
            "level": 0,
            "comment": "Both will show up https://i.imgur.com/g9mPJpg.jpg",
            "score": 0,
            "author": "ManfredBoyy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mine is this way as well.",
                    "score": 4,
                    "author": "LetshearitforNY"
                },
                {
                    "level": 1,
                    "comment": "Both majors used to show up, but that is no longer the case.",
                    "score": 2,
                    "author": "Important-Print4463"
                }
            ]
        }
    ]
}