{
    "id": "10m7wu8",
    "score": 30,
    "title": "What happens to the rats when lab is done?",
    "author": "owou",
    "date": 1674781237.0,
    "url": "https://www.reddit.com/r/fsu/comments/10m7wu8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Currently in a Conditioning and Learning Lab where we work with rats. What happens to them when the semester is over? Just curious. I love rats and would hate for anything to happen to them.\n\nEdit: okay i understand they are killed now. what would the chances be of getting my hands on one of the rats I work with when we are done? I feel it is very unlikely but a girl can dream... My first pet rat I \"saved\" (he was a feeder rat) was such a sweetheart.",
    "comments": [
        {
            "level": 0,
            "comment": "Oh dear. I'm sorry. The fates of psych rats are never good.",
            "score": 37,
            "author": "Science-of-Sound",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh no :(( \n\nFrowning right now. That sucks, but at least I have an answer",
                    "score": 6,
                    "author": "owou"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They're probably killed because they're genetically modified and might gain supernatural powers if they end up in the sewers",
            "score": 36,
            "author": "magicsandwhich"
        },
        {
            "level": 0,
            "comment": "My friend is a neuroscience PhD student in charge of the FSU rat colony. \n\nI regret to inform you that when they are no longer able to be used in experiments, they are killed by him personally in the college of medicine basement, using a machine called a “ratatine” which is essentially a guillotine for rats.",
            "score": 75,
            "author": "Unconquered-",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am regretting asking this question",
                    "score": 55,
                    "author": "owou",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He feels very badly about it and tries to make sure they’re happy in their last moments, if that makes you feel any better.",
                            "score": 33,
                            "author": "Unconquered-"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are there too many to euthanize? My old lab piled their mice into essentially a gas chamber and the. slowly knocked them out and then fully put them down.",
                    "score": 16,
                    "author": "--serotonin--",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m unsure, he wasn’t really eager to tell me more and became notably more depressed because of it once he started doing it.",
                            "score": 15,
                            "author": "Unconquered-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You cannot take the rats. Many are genetically modified or too inbred to be safely kept as a pet. Many also have health issues later on due to said inbreeding or purposefully for research.",
            "score": 20,
            "author": "--serotonin--",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah yeah that makes sense.",
                    "score": 2,
                    "author": "owou"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rat Barbecue 😔",
            "score": 7,
            "author": "LifeIsDificlut"
        },
        {
            "level": 0,
            "comment": "If you are able to rescue any please make sure to get at least 2 rats are pack animals and can become super depressed without a friend!",
            "score": 6,
            "author": "Madi_jelly"
        },
        {
            "level": 0,
            "comment": "Hey! I took this lab last semester and REST ASSURED these specific rats will not be killed! Rats used by individual researchers are generally euthanized, but the conditioning and learning lab rats are kept around to be used for as many semesters as they are able and healthy. Don’t worry! And say hi to 7A for me!",
            "score": 5,
            "author": "Dangerous-Opening-80",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for this comment it saved me much sadness",
                    "score": 2,
                    "author": "owou",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course! I wondered the same thing so I asked my TA last semester and this is what she told me",
                            "score": 1,
                            "author": "Dangerous-Opening-80"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a bio major that worked with Dr. Fitz at the rat lab.\n\nThey're humanely disposed of with the ratatine. Then they're biorecycled at both Seminole café and Suwanee. I too wondered what meat they used in the mystery meatloaf. Also, the beyond burgers are NOT vegan or vegetarian. Enjoy 🍔",
            "score": 3,
            "author": "Jumpy_Ad_2279"
        },
        {
            "level": 0,
            "comment": "I found out animals are autoclaved too for science 🤢",
            "score": 2,
            "author": "clydefrog811"
        },
        {
            "level": 0,
            "comment": "You're a kind soul, good on you.",
            "score": 2,
            "author": "fsuthundergun"
        },
        {
            "level": 0,
            "comment": "they're killed after they're used and often abused by different laboratories (not specifically fsu but in general)?! this has made me significantly sadder.",
            "score": 3,
            "author": "rosebloom25",
            "replies": [
                {
                    "level": 1,
                    "comment": "and...i get it, but it doesn't make me any less sad for those poor things 😔",
                    "score": 5,
                    "author": "rosebloom25"
                }
            ]
        }
    ]
}