{
    "id": "10spunf",
    "score": 1,
    "title": "Am I gonna get my admission revoked if I get a C or two?",
    "author": "Green-Account-3248",
    "date": 1675445090.0,
    "url": "https://www.reddit.com/r/fsu/comments/10spunf",
    "media_urls": [],
    "other_urls": [],
    "postText": "Got in for fall with 4.0 weighted 1410 and one sport.",
    "comments": [
        {
            "level": 0,
            "comment": "No, I got a D and they didn’t revoke my admission.",
            "score": 9,
            "author": "moony-eyed",
            "replies": [
                {
                    "level": 1,
                    "comment": "When",
                    "score": 1,
                    "author": "Green-Account-3248",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "4 years ago lol",
                            "score": 3,
                            "author": "moony-eyed"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "if you’ve already been admitted then no, i wouldn’t worry about it. they would probably raise an eyebrow if you straight up failed a class but even that can be forgiven if you have a viable excuse or your life significantly changed from the time you applied and got in until now. granted i was a transfer who already had an AA but i got 2 Cs in my last semester before coming to FSU and they didn’t even care or mention it",
            "score": 7,
            "author": "Novel-Star6109"
        },
        {
            "level": 0,
            "comment": "So I got in with a 4.0 and a 1320 with a few sports and organizations and they almost revoked my ass for a C. I’ll say it’s pretty hit or miss but with that bein said they weren’t going to revoke me, but they wanted to see me grovel. They might make you write an explanation paper as to why you got that grade, but they won’t not accept your $!",
            "score": 3,
            "author": "whitewaterhashin"
        },
        {
            "level": 0,
            "comment": "Most likely no I’d bulk up that application with everything tho like if you put up posters for your school you can put that you were part of a planning committee that helped organize different activities! And if you get anything lower then a passing grade you can also write to admissions and explain why and if it’s good there’s a good chance you’ll still get in I know three people who did that last year when they got a F",
            "score": 2,
            "author": "Madi_jelly"
        },
        {
            "level": 0,
            "comment": "No, probably not, but try to keep it at one. Admission standards are getting stricter all the time so don’t poke the bear too much with low Senior year grades.",
            "score": 1,
            "author": "dalej42"
        },
        {
            "level": 0,
            "comment": "If you already had a C by the time you got accepted then no, but even then I don’t think you would get your admission revoked as long as you don’t end up with anything lower. \nI got accepted and ended my senior year of HS with two Cs and a withdrawal and nothing happened.",
            "score": 1,
            "author": "txicab",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dope thanks. When we’re you admitted?",
                    "score": 1,
                    "author": "Green-Account-3248",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "2 years ago for the summer term",
                            "score": 1,
                            "author": "txicab"
                        }
                    ]
                }
            ]
        }
    ]
}