{
    "id": "112uk28",
    "score": 14,
    "title": "Why is my application plan rolling decision despite applying on Dec 1st for regular? Also my application status is still “Under Review” and has been stuck like this for over 2 weeks now..",
    "author": "osmanimran",
    "date": 1676455306.0,
    "url": "https://www.reddit.com/r/fsu/comments/112uk28",
    "media_urls": [
        "https://i.redd.it/rv5ilp7cadia1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Regular decisions come out today, as for why it say rolling idk.",
            "score": 10,
            "author": "Pretend_Influence_25"
        },
        {
            "level": 0,
            "comment": "Mine says under review too which is weird. I thought it would at least say awaiting decision since it's day of decision.",
            "score": 7,
            "author": "Melon_KokiriCat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah mines been stuck like that for a while now.. weird. Does ur application plan say rolling or regular ?",
                    "score": 1,
                    "author": "osmanimran",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mine says regular. Maybe you can contact them about your rolling status since you submitted it on time.",
                            "score": 3,
                            "author": "Melon_KokiriCat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i got an email that says welcome to fsu, does everyone get that?",
                    "score": 1,
                    "author": "Economy_Shallot9106"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The deadline to receive all application materials for the Regular Admission decisions was December 1. Depending on when your materials were submitted this could change your decision release date. If you have additional questions, please contact our office at [admissions@fsu.edu](mailto:admissions@fsu.edu) or via phone at 850.644.6200.",
            "score": 3,
            "author": "FSUAdmissions",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unrelated, but what is the outlook like for deferred students? Are there statistics for the percentage of deferred students who got in last year? Also, does opting in for a possible First year Abroad improve your chances?",
                    "score": 3,
                    "author": "furth_or_nuthin69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mine has said under review since I submitted it in like October",
            "score": 2,
            "author": "nickle3663"
        },
        {
            "level": 0,
            "comment": "I‘m a little concerned about this as well.  My daughter’s says under review as well and has been that way since shortly after she submitted all of her materials.  (It does list her as regular decision.) She did get an email last week reminding her to check her portal 2/15 for her decision.",
            "score": 1,
            "author": "SmTownMom"
        }
    ]
}