{
    "id": "11b94gb",
    "score": 12,
    "title": "FSU Review and Data science/Comp Sci Major",
    "author": "Shivram101",
    "date": 1677290938.0,
    "url": "https://www.reddit.com/r/fsu/comments/11b94gb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone, I got accepted into FSU, UCF, and USF. I plan on doing something related to sciences or aerospace and was wondering if someone could tell me how it is like at FSU. My brother attended UF and my original plan was to go there but I got rejected. So how is it at FSU? \n\nAlso how is the campus, community, and overall experience there? I'm not trying to flame any college so let me know your thoughts!\n\nThanks.",
    "comments": [
        {
            "level": 0,
            "comment": "Im not familiar with data science at any of these schools but for comp sci definitely focus on FSU and UCF. Both have great programs with promising career paths post grad. This sub is obviously going to lean towards FSU, and as someone that went to both schools, my vote is FSU. They're both just incredibly different experiences. FSU felt like a \"real college\" experience, whereas UCF felt like an extension of highschool. FSU felt like a community, UCF has a ton of commuters. There are pros and cons to both, but really think about what you're looking for in terms of cities and college experiences.",
            "score": 5,
            "author": "abbrad",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your response!\n\nFor comp sci undergrad how would you rate the faculty and teachers and what are the availability of internships?\n\nAgain, thanks for responding!",
                    "score": 2,
                    "author": "Shivram101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My roommate just graduated from here with a dual major in finance and comp sci. He is starting off making 89k (that’s really good). My other friend who is an engineer just started off making 85k.",
            "score": 1,
            "author": "runningNole",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for responding!\n\nLol that's actually what I wanted to have as my career path, where does he work?",
                    "score": 1,
                    "author": "Shivram101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Graduated in 2016 in comp sci. Current TA for the department. There has been a major overhaul since my time as a student. The classes seem far more straightforward than they used to be, and the faculty really does want you to succeed. \n\nThere may be one or two that everyone is weary of, but every university has those. If you ask for assistance, you will receive it. As for internship availability, I have heard there's not too many options available. However, that can always change, keep looking and im sure there will be something.",
            "score": 1,
            "author": "Otherwise-Mirror-738"
        },
        {
            "level": 0,
            "comment": "For the love of God don't come here for engineering",
            "score": 1,
            "author": "meemmen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for responding!\n\nIs it really that bad? I thought the cs program was different from the engineering one.",
                    "score": 1,
                    "author": "Shivram101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "CS was not what was stated in the post. The CS program isn't bad in and of itself, but it's overdue for the professors to have their houses cleaned if you get what I mean. Used to be a CS major",
                            "score": 2,
                            "author": "meemmen"
                        }
                    ]
                }
            ]
        }
    ]
}