{
    "id": "11dfypk",
    "score": 1,
    "title": "Vertex Apartments",
    "author": "Dry_Dimension2793",
    "date": 1677515315.0,
    "url": "https://www.reddit.com/r/fsu/comments/11dfypk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey y'all, I'm looking for a place to lease for the coming Fall and came across Vertex Apartments on Jackson Bluff. Does anybody here have any reviews about the place? There are some reviews online but I've heard that they're under new management now so I guess those would not be entirely current. I'm mainly interested in things like how responsive and professional management is, the roach and mold situation, neighborhood etc. Thanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "So I live at the Vertex and I really like it. The apartments are nice, newly renovated, and it’s quiet surprisingly. We’ve never had an issue with neighbors.\n\nManagement has been really nice in working with us as we have joint lease situation. Overall, my best student housing situation I’ve had",
            "score": 2,
            "author": "Bubbles-Scribbles"
        },
        {
            "level": 0,
            "comment": "I'm wondering the same! It's so hard finding a place.",
            "score": 1,
            "author": "Sarabethq",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s not as hard as you think if you look just a little further off campus. I’m living about 12 minutes away in a really nice area. Obv if you don’t have car it’s much harder",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hi do you feel comfortable sharing or dming the area or zip code? If not totally understandable. I do have a car! Safety is a big priority of mine since I’ll be solo female",
                            "score": 1,
                            "author": "Sarabethq",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you mind if I pm you? Don’t want to put the area on a big space",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Perfectly okay to dm!",
                                            "score": 1,
                                            "author": "Sarabethq"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}