{
    "id": "11grx65",
    "score": 2,
    "title": "graduating in 2 years?",
    "author": "Ok-Collection-8922",
    "date": 1677819858.0,
    "url": "https://www.reddit.com/r/fsu/comments/11grx65",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'm a second semester freshman who just calculated today that I only have 8 more classes (24 credits) left for my major and minor, and by spring 2024 I would have 118 credits (need 120 to graduate). Essentially this means that if I just took one extra course next year I could graduate in two years. Graduating this early sounds kind of crazy but I'm kind of considering it since I don't feel that happy here and have been wanting to transfer but don't want to leave FL because of bright futures. Right now I want to go to grad school for urban planning so maybe I could use the extra time try to build my resume? I'm definitely going to speak to my advisor about this just speculating on here because sometimes people on reddit have good advice :)",
    "comments": [
        {
            "level": 0,
            "comment": "Talk to the graduation planning strategies office because they work with students like this a lot to talk about ways to get more out of your time, like with other degrees or starting grad school early. If you're thinking about urban planning, they are one of the programs that has a combined pathway that allows you to take graduate credit as an undergrad and have it count towards both degrees",
            "score": 8,
            "author": "ezug_01"
        },
        {
            "level": 0,
            "comment": "Hey I’m in a similar situation I came in w/ a bunch of credit and I’m also graduating in spring ‘24 as a freshman \nThere is something I’d like to point out which is that the easiest and best place to build your resume when you’re first starting out is in college. There are so many programs and opportunities and career fairs and people who know people who if you get to know can help you find more opportunities. It’s a big school and while there are a lot of applicants for some positions\nthere are way more people who will just fuck around and not take it seriously. Even if you don’t have experience or much experience if you keep looking you will find stuff to build your resume\n\nWith that being said if you aren’t happy here an extra 2 years won’t do you that much good. Yes it’s good to build your resume for grad school but you can only do so well if you don’t like the school. Professors become annoying trying to network makes you want to kill yourself and every resume builder feels pointless and cynical which makes it hard to do your best work. If you genuinely don’t really enjoy it here (which is totally fair) it might be better to graduate early as long as you figure out when you’re for sure applying to grad school and what you’re going to do in the mean time\n\nOne last caveat though is make sure you actually, really don’t like it here and based on what you know it’s not likely that it’ll get better. Just as a matter of odds if you’re here for 4 years you’ll probably have one that’s shit one that’s great and two that are right in the middle (especially since you’re so career focused you’re not going to have 2+ years of the “fun” part of college which is dicking around skipping classes and still passing, going out all the time, having no responsibilities, etc.) your worst year will likely not be how it is all the time, and as cliche as it is there is a chance that it gets better and you come to like it a lot more. But if the mediocre is soul crushing you might be better off graduating early \n\nEither way talking to an advisor is a good idea but make sure it’s your decision at the end of the day\n\nSorry for the long sort of rambling answer but I hope it helps",
            "score": 3,
            "author": "altmsub"
        },
        {
            "level": 0,
            "comment": "I was in your same boat! I didn't intend on graduating early, but it just ended up that way with my courseload per semester and credit hours and such. I also wanted to go to grad school, and I decided to go straight into it. So far, it's really not too bad. It's really different from undergrad, but I like the change of pace. Although I like the decision I made, I'd just caution you to be very careful. I have known for years what I wanted to do career-wise, so I was already prepared to go straight into grad school after undergrad (though at a quicker pace than expected). You don't want to jump in too quickly into a program and realize that you want to do something else. It's the downside of graduating early: you're still so young with less years of career/field exposure (typically). I still deal with this, as I have classmates that are actual industry professionals. Nonetheless, I'd just take this time that you have to really plan ahead for the future and make sure it's something you can live with. If that means taking the summer to work and stay in Tally to make sure you really want to transfer, do that. Or moving away, but taking a semester to settle into a new location and have a resume building job in the meantime, do it. I'd just say that make sure you still feel motivated to get through grad school, you'll want to keep up your momentum to start grad school earlier rather than later. Lastly, I'll say that either way, there's no actual rush. It all depends on your career (like some fields require years of work experience before starting grad school). Make sure you are going for you and not because that's \"the next step\". Grad school is super expensive and a lot of work. So, whenever you are able to fund it, and feel mentally prepared and motivated for grad school (and have a solid plan set) I'd say go for it! I promise it's not as scary as it seems for a would-be junior/senior, just keep up with the work and make sure you're able to find value in it!",
            "score": 2,
            "author": "rosebloom25"
        },
        {
            "level": 0,
            "comment": "I did the same thing and graduated early. I actually only had to pay for one semester of grad school because I had leftover Florida prepaid money from not spending it in undergrad. I graduated grad school before most people I knew were graduating undergrad. Now I am pretty well-established in my career and was able to buy a house vs my peers just now starting their jobs. Like the other commenter said, though, I went into undergrad with a clear end-goal in mind, which is not the case for everyone.",
            "score": 2,
            "author": "queenbeta"
        },
        {
            "level": 0,
            "comment": "If you can get a job in municipal government somewhere for at least a year, before going back to school,  I think that would be very beneficial in your career path.  good luck .",
            "score": 1,
            "author": "veedub447"
        }
    ]
}