{
    "id": "11mtgqt",
    "score": 30,
    "title": "Third time this semester....",
    "author": "Sabatar446",
    "date": 1678371753.0,
    "url": "https://www.reddit.com/r/fsu/comments/11mtgqt",
    "media_urls": [
        "https://i.redd.it/o3k5zyaxkrma1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "My internet has been down since yesterday, but I have one of those Verizon 5g home internet things. They said something about a network tower being down? I'm not sure exactly what's going on, but I know it's not just us",
            "score": 8,
            "author": "Classic-Problem"
        },
        {
            "level": 0,
            "comment": "Oh shit I'm moving to the UV next year lol. Guess I'm fucked\n\nDo they have like wired internet connection?",
            "score": 4,
            "author": "mao1756",
            "replies": [
                {
                    "level": 1,
                    "comment": "The connection is fiber and something happened where the cable was cut and they have not fixed it to bury the cable underground still so the cable simple rides on the power lines above it exposed....",
                    "score": 1,
                    "author": "Sabatar446"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pavlov ain’t shit they do the internet at Torchlight too and it’s out rn",
            "score": 4,
            "author": "briancast122"
        },
        {
            "level": 0,
            "comment": "FUCK U PAVLOV MEDIA!!!!",
            "score": 1,
            "author": "denadeadly"
        },
        {
            "level": 0,
            "comment": "Go to campus? Internet being down is not really something they can control when its a service provider outage.",
            "score": -5,
            "author": "jaammo1234",
            "replies": [
                {
                    "level": 1,
                    "comment": "I could write alot about the other issues with university village. I can go to campus but I have a nice monitor and setup in my room that I feel better doing work in. UV never notifies me of shit as well. They didn't even mention the internet would go down until there was some huge issue.",
                    "score": 2,
                    "author": "Sabatar446",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I get preferring to work at home but like, things happen in life. Systems go down. \nDid you ever consider they didn’t know the outage would happen? I’m not advocating for the apartment, I don’t have a dog in that fight.  \n\nI’m a local teacher. Our internet and phone lines were down for the majority of today, too. Sure threw a wrench in things but yelling at people won’t bring it back any faster.",
                            "score": -8,
                            "author": "jaammo1234",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn't yell at anyone. But good luck with your situation.",
                                    "score": 2,
                                    "author": "Sabatar446"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}