{
    "id": "11zkgwv",
    "score": 98,
    "title": "Imagine if we had professors like this.",
    "author": "n_matt_",
    "date": 1679578194.0,
    "url": "https://www.reddit.com/r/fsu/comments/11zkgwv",
    "media_urls": [
        "https://i.redd.it/x950c8s2icpa1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The emphasis on student well being is admirable, but imagine you're a classmate who turned in the work on time and got a 15/20.",
            "score": 77,
            "author": "ProudFSUAlum97",
            "replies": [
                {
                    "level": 1,
                    "comment": "FSU teacher here. Came here to say this. Maybe there is more context to this event, but I have found other ways to show compassion towards my students. My common response is to email the student just to check-in and see how things are going.\n\nI also have ADHD, and when I was in college, I routinely went to bed between 2 and 3am. If some professor had given me 20/20 like this, I would have a lot of confused feelings… I just wouldn’t feel deserving.",
                    "score": 3,
                    "author": "ResearcherIs4Life"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve gotta say I’ve been really lucky with some professors. I feel like always giving a good effort and being honest gets you a long way. A lot of professors I’ve found to be super understanding of how crazy college can get at times.",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Dr. Benjamin Dodds in the history department did something similar for me for a final project. I had to work the entire afternoon after class and ended up getting off late due to circumstances outside my control. I hadn't finished my paper yet (roughly 3k words, only had about 900 or so) so I started working on it the second I got home. I ended up finishing it around 2am with a midnight deadline and had just resolved to turn in something I was mostly proud of and confident in, so that way the late penalty wouldn't be so severe.\n\nWhen I got the grade for it he didn't do the penalty at all and said something like \"Don't worry about the late penalty, you're a good student and I know you still tried your hardest with this essay.\" He graded it normally and left some very helpful feedback on it.\n\nSo yeah that is one reason I will always recommend Dr Dodds for history courses. The other being he is just a fun lecturer",
            "score": 31,
            "author": "Classic-Problem",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s awesome. Sounds like a good guy",
                    "score": 1,
                    "author": "n_matt_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m an alum, and there are definitely professors with compassion for students at FSU, but some without it.  In 2005, I was a pregnant student dealing with intense morning sickness in the last few weeks of the semester. I told my profs. One, a female professor for Intro to New Testament, said show up to the exam or fail. I had to throw up mid exam, and she said that if I leave the room, I’m done, so I only finished half my exam and my grade dropped from an A to a C. Contrast that with my professor for GEO4300, Biogeography, not a required class for my humanities major but incredibly fascinating. He told me I could skip the exam and he’d give me whatever I earned on my midterm for my final. I had worked really hard all semester and made the only 100 on the midterm. When I became a high school teacher, I always remembered these two. I took into account the effort, engagement, and circumstances of my students. When siblings and parents died, when students were in foster care, when Covid hit, I was able to consider how to be both fair and compassionate.",
            "score": 4,
            "author": "Unusual-Hedgehog-687"
        },
        {
            "level": 0,
            "comment": "I guess I'm lucky to have only had a couple of subpar professors and TAs when I was at FSU.",
            "score": 3,
            "author": "kerouacrimbaud"
        },
        {
            "level": 0,
            "comment": "Someone wanna shoot this over to Wayne hochwarter",
            "score": 6,
            "author": "jjviddy94"
        },
        {
            "level": 0,
            "comment": "I'm currently taking two courses towards finishing up my bachelor's degree at last, and had a medical situation where I was my wife's ride the day of her procedure but were never given a time until literally the Friday before the procedure. I talked to both profs about potentially needing to miss class.\n\nMy first prof (SAS Data) wished my wife good luck with her procedure and said I could just review the notes and ask for help if needed.  \nMy second prof (ANOVA Design) said the same and added that if I had to miss the quiz for the day he'd figure out a way for me to take it from home, even if he had to email me the access code or make my quiz different from the rest of the class.\n\nMy SAS prof has also extended deadlines for students simply because they asked.",
            "score": 1,
            "author": "katsuko78"
        },
        {
            "level": 0,
            "comment": "I’ve had some fantastic professor luck so far at fsu. Just a few weeks back I had a professor delay a due date, by a whole week, because many people were not prepared for the assignment. Even those who had turned it in already, were allowed to resubmit. My freshman year spring semester was embarrassingly bad but thanks to a few of my professors I was able to keep my grades at Cs for two classes. One gave me extra time to submit older assignments that I missed, while the other opened up two quizzes that I couldn’t take at the time and brought my grade up to where I needed it. On the flip side, I’ve had professors (understandably tbh) outright say \"No\" to an extension of some kind. I needed like a point and a half to get my desired grade and they refused to help. I was a bum that semester, mental health and laziness ruined the dream, but I’ve made the deans list since then, so I guess that’s some great improvement.",
            "score": 1,
            "author": "Local_Permission_516"
        }
    ]
}