{
    "id": "12aiujp",
    "score": 24,
    "title": "FSU Internet aggressively banning websites",
    "author": "jenl_fsu21",
    "date": 1680524815.0,
    "url": "https://www.reddit.com/r/fsu/comments/12aiujp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a sophomore but lived on campus last year. They started aggressively banning websites late spring last year. For instance, they banned most crypto trading platforms like coinbase, kraken. I honestly don't understand why they would outright ban them since they aren't crypto mining pools.\n\nThey also banned one of my favorite free open-source software - syncthing (tl;dr it's a file sync software that allows you to securely sync files between your devices without having to let onedrive and google drive mine your data for ...) I use it to sync files between my desktop and laptop where notes get automatically \"pushed\" to my laptop as the files are being modified.\n\nWhen I emailed the IT department about (syncthing not crypto lol) they basically told me to go kick rocks. Ironically, Tor can still be used on campus.\n\nIs anyone else having issues with their favorite (legitimate and useful) websites being banned?",
    "comments": [
        {
            "level": 0,
            "comment": "How aggressive is the blocking? VPNs are great for online privacy, security, and all other lawful purposes.",
            "score": 13,
            "author": "badMotorist",
            "replies": [
                {
                    "level": 1,
                    "comment": "VPNs are on the chopping block if S.686 passes .. scary stuff",
                    "score": 9,
                    "author": "sumpygreg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which is going to be interesting for university personnel who work remotely and use the mandatory uni-issued VPN for added security…",
                            "score": 1,
                            "author": "katsuko78"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Grammarly has just been banned since the company can't verify they keep data on US servers.",
            "score": 7,
            "author": "mojoisthebest",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work at Grammarly and can confirm that Grammarly data is stored on servers hosted by Amazon Web Services in the US.",
                    "score": 1,
                    "author": "PersonalAstronomer47"
                }
            ]
        }
    ]
}