{
    "id": "12arb04",
    "score": 307,
    "title": "fsu bans tiktok",
    "author": "iluvelonmusk",
    "date": 1680542842.0,
    "url": "https://www.reddit.com/r/fsu/comments/12arb04",
    "media_urls": [
        "https://i.redd.it/dkh755sowqra1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I'm not sure how the student body is going to feel about this because I'm basically a boomer to y'all now, but we're going to let any and all discussion move forward on this as a mod team. We just ask you keep all the discussion to this thread only, other threads will be removed.\n\nAnd as always please keep it civil in the comments. Debate the ideas don't attack the person.",
            "score": 1,
            "author": "420yoloswagblazeit"
        },
        {
            "level": 0,
            "comment": "RIP to any Asian students trying to communicate with family through WeChat 💀",
            "score": 176,
            "author": "TwoToedSloths",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't use WeChat anymore, but boy does your comment make me feel.",
                    "score": 46,
                    "author": "GK71011-2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh no  \n*Turns off wifi*  \nAnyway...",
            "score": 83,
            "author": "nothingmeansnothing_"
        },
        {
            "level": 0,
            "comment": "Meanwhile, you know faculty members are still using personal Dropbox and Thunderbird…",
            "score": 37,
            "author": "Electrical_Prune6545"
        },
        {
            "level": 0,
            "comment": "Presumably this only applies to university devices &amp; networks. The university doesn't have jurisdiction over personal devices, unless you enroll your device into a BYOD program under the university's control.\n\nNot saying I condone the use of TikTok; Personally, I hate short-form content as a concept. But for all of the students who are about to freak out over the news, Just don't use the wifi anymore and use LTE/5G instead. (I'll suggest against VPNs, since S.686 will criminalize that behavior if it passes.)",
            "score": 35,
            "author": "Azure_Agst",
            "replies": [
                {
                    "level": 1,
                    "comment": "Correct",
                    "score": 3,
                    "author": "Winter_Fault4389"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Board of Governors which is over ALL state universities banned TikTok. If you’re gonna be mad, at least be mad at the right people.",
            "score": 24,
            "author": "bridgettthelibrarian"
        },
        {
            "level": 0,
            "comment": "All kids have to do is turn off the Wi-Fi and they’ll be able to access it. It’s really not that big of a deal in that case.\n\nHowever when it comes to hypocrisy, it’s definitely there. Facebook/Instagram and others do the same data mining and sell it. \n\nI’m okay with them banning it, but if you do, then keep the same energy for other platforms.\n\nThe reason I’m okay with banning it is because it could actually result in positive action in the future. If Facebook and others see that their platforms are banned from being accessed in certain areas, they will want to change that going forward. Would that be enough to not sell our information anymore? I’m not sure, probably not. but it’s definitely a thought",
            "score": 20,
            "author": "UrbanLawProductions"
        },
        {
            "level": 0,
            "comment": "productivity increases by 200%",
            "score": 28,
            "author": "LucinaOrly"
        },
        {
            "level": 0,
            "comment": "Plenty of other apps collect and store data, including American ones. This reads much more like an anti-China policy rather than something based on a real security policy, which is a shame.",
            "score": 128,
            "author": "jxdxtxrrx",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's exactly what this is, protectionism under the guise of foreign threats. Jan 6th was planned on forums, twitter and facebook, but yet we can still actively use them.",
                    "score": 42,
                    "author": "CineFunk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good point.",
                            "score": 1,
                            "author": "GNVfeedback"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The argument would be that security and anti-China policy go hand in hand, no? Not saying I agree, but the justification would be that the CCP having data is much more dangerous and constituting a national security risk than Meta and Google having your data. That feels like a tough point to argue against.",
                    "score": 21,
                    "author": "Devjorcra",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But do you not think that Google and Meta not sell our data to the CCP and other governments. This just seems more like a lobbying issue to me than the government “caring about our data.”",
                            "score": 25,
                            "author": "kaanoman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have no proof that Google and Meta are actively selling data to hostile foreign governments, so no I don't think that.\n\nNot sure what you mean by a lobbying issue, but I would guess that you think the TikTok ban came as a result of lobbying by other tech companies wanting to reduce competition, and while you might not be entirely off base, I think there's a lot more willingness to support this policy than you think. It wouldn't take more than a nudge.",
                                    "score": 6,
                                    "author": "Devjorcra",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Meta forfeiting data to China was actually a [serious controversy](https://amp.cnn.com/cnn/2023/02/07/tech/lawmakers-meta-user-data-china-russia/index.html) recently, and its remarkably similar.",
                                            "score": 17,
                                            "author": "jxdxtxrrx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I had heard of this, but I don't remember anything about actively selling data to the CCP. If I recall correctly, it was about concerns that they mismanaged data, allowing it to be accessed in China, which may have let it get into the hands of their intelligence agencies. That is a far cry away from the relationship TikTok has with the CCP, but obviously is an issue in itself.",
                                                    "score": 2,
                                                    "author": "Devjorcra"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The issue is that Tiktok isn’t necessarily owned by the CCP. [According to Newsweek,](https://www.newsweek.com/tiktok-owned-controlled-china-communist-party-ccp-influence-1752415) there’s a lot of controversy over whether or not the CCP really does have any degree of control over the app. To quote, “Although ByteDance and TikTok both have offices in China, neither is owned by the ruling Communist party.” This makes it very complicated as to what degree of security conflict is involved, especially when many American politicians assume that Chinese companies and the CCP are one in the same. It would be irresponsible to claim that the CCP definitively is benefitting from data provided by Tiktok.",
                            "score": 5,
                            "author": "jxdxtxrrx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Obviously, it is not \"owned\" by the CCP, but the last sentence of your comment puts it perfectly. There is no debate, for instance, that Meta, Google, and Twitter are private organizations. It should be a moment of caution that we can not tell how much influence the most dangerous government in the world has over one of the most popular apps, and I don't relish having to decide how to move forward.",
                                    "score": 3,
                                    "author": "Devjorcra"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yep",
                    "score": 2,
                    "author": "russellbell101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No matter how you feel about Tiktok, this sets an extremely dangerous precedent not only federally but state/locally",
            "score": 106,
            "author": "Media-Nerd-98",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 24,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This exactly. It opens up the potential for any site to be blocked.",
                            "score": 40,
                            "author": "kubrickfanclub_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I understand where people are coming from, but FSU has been banning sites forever. There was literally a post on this subreddit TODAY talking about it.\n\nIt only feels like it sets precedent because it’s more salient for young people, as they all actively use TikTok. I’m not sure how I feel about it yet, but to claim this is unprecedented is false.",
                                    "score": 16,
                                    "author": "Devjorcra",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly. Restricting access to certain websites (ie pornography, shopping, etc) is nothing new. I think the big issue is that the overarching bill that would allow for TikTok to be banned is pretty open to interpretation, which could lead to unnecessary censorship.",
                                            "score": 9,
                                            "author": "kubrickfanclub_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can see that being a concern but so far it doesn't seem like they want to do that. I honestly believe a lot of the main backers of this just genuinely worry about CCP influence.",
                                                    "score": 2,
                                                    "author": "Devjorcra",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh yeah, TikTok is horrible for personal data. But so is Facebook, Google, Instagram etc. I’m not sure what the answer is, as it is a multifaceted issue. But, I do think that censorship laws should be scrutinized heavily.",
                                                            "score": 5,
                                                            "author": "kubrickfanclub_",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The difference between TikTok and FB and Google, is the American sites are selling your data to sites who want you to buy things as consumers. TikTok is taking your data as the Chinese government and tracking everything you do as an American citizen. There is a difference. The Chinese government is using that info to manipulate Americans in voting, tracking military members locations, and corporate espionage to try to ruin the American economy and weaken us worldwide. Again, FB and Google just want to sell you things and make ad revenue. It's not just ugh, we don't like the Chinese, FB and Google isn't the American government.",
                                                                    "score": -4,
                                                                    "author": "AndyP79",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I thought there was evidence that Google, FB, etc sell the data to *data brokers,* who in turn will sell your data to anyone and everyone, including China and Russia.",
                                                                            "score": 4,
                                                                            "author": "ansinoa",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I hadn't read anything about that. I would think that would be bigger in the news.",
                                                                                    "score": 1,
                                                                                    "author": "AndyP79",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "This is actually a poor argument considering Meta and its subsidiaries have all been under intense scrutiny for its role in the 2020 election and subsequent 2021 insurrection. \"Just selling you things\" is not just what data does -- it effectively profiles who you are and submits that data to anyone who wants to buy it. Companies all around the world can buy this data, and whether choose to make their investment back in the form of making an ad and explicitly hoping you buy something is not always the end goal. I'm not defending TikTok in any case, but to act as if these companies just want to be better advertisers is [ignorant at best](https://www.forbes.com/sites/forbestechcouncil/2020/06/24/data-collection-the-good-the-bad-and-the-ugly/?sh=313604ea45fa) and [harmful at worse](https://www.nbcnews.com/business/business-news/why-data-not-privacy-real-danger-n966621). And every time you accept a privacy policy, especially on a free website, such as Reddit, your data is the product. What happens when you don't even get an ad? [When you just simply use the website and they track you?](https://www.security.org/resources/data-tech-companies-have/) What about when they do collect all the data for advertisement and then it leaks everywhere, free of charge, on the dark web? You need to explore your own questions further rather than taking things at face value since you are sort of parroting the bigger headlines. And remember, just because something doesn't make headlines, doesn't mean it's news. News companies and governments work hand-in-hand to promote and not promote certain articles, right here in our own country. While we could have a more poignant discussion on the ethics surrounding TikTok and ByteDance, simply resorting to a nativist party-line doesn't quite cut it, especially in the age of chatGPT who quite literally taps into all this data.",
                                                                            "score": 3,
                                                                            "author": "prouser07",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I see what you're saying. I get it. But we can also limit and control those American companies for the betterment of our citizens. The web shouldn't be a free for all. We don't have control over TikTok, we know these companies like this are having data harvested on purpose by the CCP to harm us, therefore they shouldn't be allowed to even be used in the US. I'm usually pretty liberal on most things, but if it actively and purposely harms us for the good of a government that hates us, I'm not got it, at all. FB isn't purposely selling our data to the CCP. We should regulate and stop foreign intervention that is actively trying to harm us, and in the meantime strengthen domestic oversight of American companies selling our data which ends up in the hands of foreign adversaries.",
                                                                                    "score": 1,
                                                                                    "author": "AndyP79"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Censorship? In Florida??? There’s no way. I thought this was the free-it state of the union",
                                                    "score": 2,
                                                    "author": "Buckyhateslife"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "On the flip side though, should we not want malicious sites blocked? \n\nI can see where you're coming from here, just trying to see the flip side too though. I don't generally have an opinion on TikTok itself.",
                                    "score": 6,
                                    "author": "420yoloswagblazeit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think the issue is, what classifies as a malicious site? The current problem most cited with Tiktok seems to be that it’s a Chinese company. So does every Chinese site become malicious by association? And if so why do we considered Chinese sites inherently malicious? There’s no clear answers for these, it’s just a thought experiment.",
                                            "score": 29,
                                            "author": "jxdxtxrrx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think the general vibe I get from this entire thing is that we need vast improvements in data security and privacy in general at a federal legislative level. If we had significantly better codified consumer protections it would sort of be a non issue whether the company was owned by china or America or anyone else.\n\nProtect the consumers data and don't exploit it or face penalties.\n\nBut the further issue seems to be our current legislative assembly either doesn't want to protect consumer data or fundamentally doesn't understand the problem at all.",
                                                    "score": 8,
                                                    "author": "420yoloswagblazeit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Absolutely agree. It feels like appealing to the dangers of China is a way to deflect from the fact that we don’t have adequate privacy protections digitally. Of course, the people in Congress didn’t understand how wifi worked so I doubt we will be getting any substantial change any time soon sadly.",
                                                            "score": 2,
                                                            "author": "jxdxtxrrx"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "exactly.",
                                                    "score": 2,
                                                    "author": "owou"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol, it’s super dumb, \nThere is no risk more than Facebook, Twitter or Reddit. Anyone can sell your data to anyone. We lack basic data protections in the US. I spent 4 years studying at FSU hearing lectures from my IT professors all about how this is the case.\n\nThis is definitely an political backed policy rather then a fact backed policy. They want to show that they are strong against China while doing the same censorship as China. \n\nNow they’ve banned tiktok and several other chat apps from companies that are adversaries to the US. Well, why didn’t they ban Fortnite? League of Legends? Valorant? All of those are owned by Tencent. They can all get our juicy data. Well any game made with unreal engine can be banned since it’s owned by China. Also easy anti-cheat too. Might as well say we can’t play games anymore at FSU. \n\nHow about we just get to the heart of this and just ban businesses from china working in the US. That’s practically the goal of this policy ain’t it? Well, just know you’ll kill the economy that way since they will just do the exact same thing to us. Big corporations love the Chinese market and their hands are deep in it.\n\nNow, an actual sensible thing to do is actually working on getting some data protection laws passed. That is the first step. Another thing that should be done is force companies that use recommendation algorithms in the US to have them publicly documented. That is the true heart of the issue. TikTok’s algorithms supposedly have sway to influence the masses. It’s the way they have stayed ahead of the competition. And the US politicians don’t like that they don’t have that influence. Make all recommendation algorithms known and it will influence customer choice. Another way to look at it. Food products are sold with a list of ingredients. People like to know what they consume. Right now most of these algorithms are secret. Twitter just recently released theirs which shows that it is possible and people can tear them apart for specific bias’s in it. I say we treat the algorithms like ingredients on the back of a cereal box.",
            "score": 18,
            "author": "Indeliblerock"
        },
        {
            "level": 0,
            "comment": "I’m a cyber security SME, and I think this is a very smart move by the school.  I went to the ACFE’s global fraud conference in 2019, and the high risk of using TikTok was echoed over and over again. And this was 2019.",
            "score": 34,
            "author": "Mrw04c",
            "replies": [
                {
                    "level": 1,
                    "comment": "“High risk of using TikTok” … can you please elaborate further. I’m asking for your professional opinion, not the stuff spewed on the news.",
                    "score": 15,
                    "author": "kelsnuggets",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I posted something further in this thread. \n\nAt a more macro level, the risk is heightened due to a combo  of history of unethical use with the data (tracking and attempted silencing of journalist-domestic and foreign-speaking against China &amp; the CCP), as well as the CCP essentially utilizing this information/data in nefarious ways and manipulating user behaviors, spreading propaganda as well as purposely fomenting political descent.",
                            "score": 7,
                            "author": "Mrw04c",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "CCP doing some heavy downvoting in this thread.",
                                    "score": 3,
                                    "author": "Mrw04c",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "😂",
                                            "score": 0,
                                            "author": "UrbanLawProductions"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you have an issue with TikTok, you should be similarly concerned with Facebook, Instagram, Twitter, etc. This policy has nothing to do with security given it's not a blanket restriction on invasive spyware.",
                    "score": 23,
                    "author": "TOWW67",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean, most of us *are* concerned with those too, I think. Like I explored higher up we **want** better data protection legislation. The geriatrics in Congress don't know or don't care to enact it though.",
                            "score": 8,
                            "author": "420yoloswagblazeit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe I'm jaded, but I think it's a simple matter of the domestic companies lining the pockets of the politicians to do the same things TikTok does. By specifically blocking certain platforms for essentially identical violations, they've demonstrated that they have no concern for data security, they just want to be the ones to profit.",
                                    "score": 4,
                                    "author": "TOWW67"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly - this is a \"follow the headlines\" reaction.",
                            "score": 5,
                            "author": "ImmaNobody"
                        },
                        {
                            "level": 2,
                            "comment": "They never said they weren't.",
                            "score": -2,
                            "author": "scrambled_groovy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then they should convey as much. Supporting the ban of specific platforms citing security concerns instead of supporting regulations to fix those concerns with blanket coverage heavily implies they aren't even considering platforms that aren't involved in this particular instance",
                                    "score": 3,
                                    "author": "TOWW67",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The post is about tiktok. Dude was talking about tiktok. If the post was about mayonnaise, and they said they didn't like mayonnaise, their thoughts on mustard is irrelevant",
                                            "score": -2,
                                            "author": "scrambled_groovy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not saying to talk about mustard, I'm saying to discuss condiments as a whole which I would argue is relevant to a discussion based on mayonnaise.",
                                                    "score": 3,
                                                    "author": "TOWW67"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you not just use it on data?",
            "score": 3,
            "author": "babymunch8",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can.",
                    "score": 3,
                    "author": "Winter_Fault4389"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this just on school device or over any network connection?",
            "score": 2,
            "author": "blodreina_kumWonkru",
            "replies": [
                {
                    "level": 1,
                    "comment": "School network connection",
                    "score": 6,
                    "author": "Indeliblerock"
                }
            ]
        },
        {
            "level": 0,
            "comment": "VPN go brrrrrrr",
            "score": 2,
            "author": "SelectPrizm"
        },
        {
            "level": 0,
            "comment": "Shame that it doesn't the American data harvesters too.",
            "score": 2,
            "author": "meemmen"
        },
        {
            "level": 0,
            "comment": "well what am i supposed to watch during class now",
            "score": 2,
            "author": "SageMiggy",
            "replies": [
                {
                    "level": 1,
                    "comment": "YouTube shorts",
                    "score": 4,
                    "author": "ExodusLegion_"
                },
                {
                    "level": 1,
                    "comment": "Tik Toks reposted to Instagram like an adult",
                    "score": 3,
                    "author": "noideawhatoput2"
                },
                {
                    "level": 1,
                    "comment": "TikTok compilations on YouTube",
                    "score": 1,
                    "author": "katsuko78"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is such a hard subject to really form an opinion on because both sides have merit which is going to get bogged down by the attachment of disingenuous bad actors. On one side, yea tiktok is definitely dangerous and it would be a good thing to limit its influence as much as possible. On the other side, measures used to limit tiktok run the risk of setting a precedent which could then be used to limit any number of social media platforms; which in turn limits peoples ability to speak freely in the modern public forum: the internet. People who don’t care about the issue but want to to inhibit free speech will leech onto the Pro-ban side of the argument and make it look bad. People who don’t care about the issue but are sympathetic to China may leech off the anti-ban side, making it look bad. In short, I can see this debate quickly devolve into: you can’t advocate for a ban without aligning with Tea Party republicans. You can’t advocate against the ban without seeming like a commie. Real Catch-22 we got here boys",
            "score": 4,
            "author": "professor__seuss"
        },
        {
            "level": 0,
            "comment": "Good. TikTok is dangerous never downloaded it, never will.",
            "score": 2,
            "author": "greyavenger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why is this being downvoted?  Let me guess, it’s being politicized like everything else?  As I said previously, as an unbiased cyber security professional - this is totally a smart move.  I would also recommend no one personally utilize tiktok on their devices, or you are opening yourself up to have your phone and all of your critical information compromised.",
                    "score": 2,
                    "author": "Mrw04c",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So, my only gripe with this is the hypocrisy. All other social media's are notorious for gathering info and selling it. The government needs to crack down on that, but the focus seems to only be \"china bad\".",
                            "score": 25,
                            "author": "GodlyHermit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Here’s an excerpt to a larger article from Dec 2022 (which I’ll link) as it can explain it more concisely than I can:\n\n“While many apps, including U.S. ones, harvest and sell user data, it’s important to contextualize TikTok’s data collection practices within the CCP’s overall strategic objectives. In 2015, China announced its “Digital Silk Road” (DSR) plan. The DSR’s focus on data gathering represents a key feature of the CCP’s overall Belt and Road Initiative (BRI) designed to develop economic and strategic influence globally, explained the Carnegie Endowment for International Peace. The CCP sees data as a critical means to integrate market advantage, national power, and strategic influence as well as to develop machine learning models. In 2019, the CCP declared data a “national resource,” reported Newsweek, with the Party prioritizing it on par with land, labor, capital, and technology.\n\nAdditionally, TikTok has shown a willingness to take unethical action through leveraging internal app data. In a December 2022 incident covered by CNN, TikTok admitted to accessing the locations of several journalists as part of an investigation into whether they had leaked internal documents to the broader press. Another risk is TikTok's operators could augment the app via a patch or update effectively infecting users' devices for other malicious purposes, granting them even greater surveillance and control of real-time user data in the event of heightened tensions or a national conflict. Given TikTok’s deference to the CCP and recent history of exploiting sensitive user data for targeting purposes, this poses a real risk that the CCP will use this data to target journalists and Chinese nationals abroad as well as pursue intelligence-related goals.\n\nhttps://www.cisecurity.org/insights/blog/tiktok-influence-ops-data-practices-threaten-us-security",
                                    "score": 16,
                                    "author": "Mrw04c",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's a fascinating viewpoint that we don't catch in the flashing headlines.",
                                            "score": 4,
                                            "author": "ImmaNobody"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Huh, that's actually pretty interesting, thank you. Ok, now that there was an actual incident in December, that makes more sense. I hadn't heard about it, so I'll have to do some research about that. Personally, everything about China trying to use data as an economic advantage is a bit meh because every country is doing that, but the bit about journalists? That is scary stuff.",
                                            "score": 6,
                                            "author": "GodlyHermit"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Saving this for the next time someone calls me simply racist for not wanting authoritarian regimes to have our data.\n\nAnd for the record: I don't want corporations or our own government to have the data either. That is a related, but separate issue from cybersecurity national defense.",
                                            "score": 2,
                                            "author": "Shazbot42069",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't even know why you are downvoted.",
                                                    "score": 3,
                                                    "author": "Mr0HIC"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We all have been warned about this...sooner or later this was going to happen...To be clear this has nothing to do with being Anti-China, as far as I know no one has anything against the Chinese people or the Chinese people against us,  it is the goverment of China that has no regards towards the American people right to privacy and well being...just saying",
            "score": 3,
            "author": "LMG_Miami"
        },
        {
            "level": 0,
            "comment": "Any link to a press release on this? Don’t see anything online",
            "score": 2,
            "author": "BirdsAreGovDrones",
            "replies": [
                {
                    "level": 1,
                    "comment": "it like \\*just\\* happened so i doubt theres any reports yet",
                    "score": 6,
                    "author": "sumpygreg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "TikTok is just entertainment but WeChat is literally the official mean of communication in mainland china and these students aren't going to be able to talk to their family anymore without it.",
            "score": 2,
            "author": "Kurisu810"
        },
        {
            "level": 0,
            "comment": "My school did the same. It’s genuinely ridiculous",
            "score": 0,
            "author": "Both_Jellyfish3047"
        },
        {
            "level": 0,
            "comment": "personally tik tok should be banned. those dances are just cringe",
            "score": 1,
            "author": "Longjumping_Ad3146"
        },
        {
            "level": 0,
            "comment": "this is so stupid. \n\ndata from now on ig lol",
            "score": 1,
            "author": "Fit-Ad985"
        },
        {
            "level": 0,
            "comment": "FAMU and other Universities have already ban TikTok, so this doesn’t really come as a surprise. People will find other ways to become internet infamous or famous.",
            "score": 0,
            "author": "Evening_Change_9459"
        },
        {
            "level": 0,
            "comment": "This isn't a big deal. Another app will replace tiktok and life will go on. And guess what I bet another app comes along and replaces the app that replaced tiktok.",
            "score": 0,
            "author": "-LostInTheMusic-"
        },
        {
            "level": 0,
            "comment": "Just get vpn",
            "score": 1,
            "author": "shhsjsjshssjshs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Careful, that may be illegal under proposed legislation.",
                    "score": 1,
                    "author": "trbleclef"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How does internet work in the dorms?  Is it Wi-Fi? How fast?",
            "score": 1,
            "author": "blackbirdspyplane"
        },
        {
            "level": 0,
            "comment": "If the FSU administration banned this App it must be bad because FSU never takes a hard line on many things.",
            "score": -12,
            "author": "Apprehensive-Ad8791",
            "replies": [
                {
                    "level": 1,
                    "comment": "The BOG banned it, FSU admins don't have a choice",
                    "score": 9,
                    "author": "nothingmeansnothing_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Politics. Zzzzz.",
            "score": -2,
            "author": "Sunsetknights78"
        },
        {
            "level": 0,
            "comment": "Coming in the 2024 legislative session: Geofencing to prevent all devices from accessing TikTok etc through any means on state campuses.",
            "score": 0,
            "author": "slugator"
        },
        {
            "level": 0,
            "comment": "I’ll take pandering to the governors party for 500 whoever the current host of jeopardy is.",
            "score": 0,
            "author": "DSMilne"
        }
    ]
}