{
    "id": "12lb2x9",
    "score": 2,
    "title": "Need help with my schedule. Is this manageable?",
    "author": "Ramen-rambo",
    "date": 1681428272.0,
    "url": "https://www.reddit.com/r/fsu/comments/12lb2x9",
    "media_urls": [],
    "other_urls": [],
    "postText": "\n\nGEN PHYSICS 2 (PHY 2049C)\nDavid Van Winkle\n\nDISCRETE MATH 1 (MAD 2104)\nYaineli Valdes\n\nCOMPUTER ORG 1 (CDA 3100)\nGary Tyson\n\nINTERMEDIATE SPANISH (SPN 2220)\nProfessor Unknown",
    "comments": [
        {
            "level": 0,
            "comment": "I can only speak to Discrete Math and Comp Org. Both are doable, but you will crash and burn if you don't put the work in. Give assignments plenty of time, plan to put in some hours of studying to lock down your understanding of things.",
            "score": 7,
            "author": "fsu2k"
        },
        {
            "level": 0,
            "comment": "Discrete Math is a coinflip, ive never heard of a person who had a moderately rough time in the class, you will either breeze through it or it will hit you like a ton of bricks and theres no real way to tell till you take it.\n\nComp Org is just a bitch of a class. But, I took it with Tyson last fall on a 19 credit hour schedule and passed with an A, so it is doable. The class requires very little regular work but the projects are significant sudden escalations over anything you would have done up to that point and take a lot of time. The tests are just impossible, Tyson will openly admit the average is *supposed* to be somewhere between a 45-60 on them and he curves appropriately, so dont stress too hard about that.\n\nI never took a language or physics at FSU so I cant speak to either of those classes. What I will say is that to me it looks like you have a very reasonable schedule, but I also tend to take lots of credits and you have 0 “easy” classes, so take that with a grain of salt.\n\nLast note, Tyson is easily the best lecturer ive ever had, his course is set up like shit and he cant return grades quickly for anything, but he is a ridiculously good teacher. Attend every lecture, take tons of notes, his slides are not nearly enough to keep up with the amount of information he provides during class and missing a class will absolutely mean you miss a huge chunk of what you are supposed to get out of that course. Best of luck.",
            "score": 5,
            "author": "AndrewHolness"
        },
        {
            "level": 0,
            "comment": "Be prepared to study for Physics",
            "score": 3,
            "author": "fsuprof"
        },
        {
            "level": 0,
            "comment": "Did you use https://www.ratemyprofessors.com/\nto look up your teachers? Game changer",
            "score": 3,
            "author": "lawlesslolita",
            "replies": [
                {
                    "level": 1,
                    "comment": "RMP is hot garbage. Here's a link to the actual course evaluations administered by the university.\n[Official Course Evals](https://fsu.evaluationkit.com/Report/Public)",
                    "score": 4,
                    "author": "fsu2k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Meh-rate my professors has good commentary for the personality, vibe &amp; experience of the class. But never hurts to have a 2nd source",
                            "score": 4,
                            "author": "lawlesslolita"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Physics is one of the hardest classes. You should re-consider taking PHY next semester.",
            "score": 2,
            "author": "RedzStar"
        }
    ]
}