{
    "id": "12mlkgm",
    "score": 6,
    "title": "fall schedule freshman",
    "author": "Turbulent_Ad2299",
    "date": 1681522991.0,
    "url": "https://www.reddit.com/r/fsu/comments/12mlkgm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey! I'm a psychology/neuro double major and I'm beginning this fall at FSU (coming in with an AA) and I was beginning to map out my schedule as I'm looking to knock out both psych and med school reqs (similar to neuro) without having an overloaded schedule. \n\nfor the moment I came up with the following classes: \n\nbsc 2010 + lab\n\ndep 3103\n\nSta 2122\n\npsb 2000\n\nPSY 2023\n\nI'm not entirely sure if the schedule is too heavy, I believe it is because I know labs are they're own classes as well, but I know because three of the classes are psychology/neuro classes I had similarly taken before that they might not be as hefty. Though I'm not 100%",
    "comments": [
        {
            "level": 0,
            "comment": "I’ve taken and gotten A’s in all of those classes. That’s an extremely doable, verging on easy, schedule.\n\nThe lab is annoying because the TA’s teaching it generally don’t have the slightest clue how to teach and are brand new PhD students themselves, but other than that it’s smooth sailing.",
            "score": 6,
            "author": "Unconquered-",
            "replies": [
                {
                    "level": 1,
                    "comment": "that's good to know I was stressing about stats because I know its a hard class, thank you!",
                    "score": 1,
                    "author": "Turbulent_Ad2299"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’ll be fine. I thought neuro people weren’t allowed to double major in neuro/psych or neuro/bio since the major is shared between those departments and there’s so much overlap?",
            "score": 2,
            "author": "--serotonin--",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not totally sure! but I will ask",
                    "score": 1,
                    "author": "Turbulent_Ad2299",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you choose the behavioral neuro track you get to take a bunch of psych electives.",
                            "score": 1,
                            "author": "--serotonin--"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "if you are a freshman how r u deciding on classes. im an incoming freshman and i havent even considered trying to figure this out",
            "score": 0,
            "author": "GarbageFew3120",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have over 100 credits from my community college so I looked at what credits transferred to FSU and saw what credits I needed based off of my majors. Theres like schedule planner, what if reports (what classes you need for your major/grad requirments), etc on your fsu portal and I believe its on the Academics tab.",
                    "score": 2,
                    "author": "Turbulent_Ad2299"
                },
                {
                    "level": 1,
                    "comment": "i hope that helps",
                    "score": 2,
                    "author": "Turbulent_Ad2299"
                }
            ]
        }
    ]
}