{
    "id": "12u1jkv",
    "score": 1,
    "title": "What are the most difficult courses for Accounting majors?",
    "author": "cozylillie",
    "date": 1682083240.0,
    "url": "https://www.reddit.com/r/fsu/comments/12u1jkv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Which courses should an Accounting major should be wary of?\n\nWould anyone be willing to tell me how difficult these courses are?\n\nACG 3101 (Financial Accounting and Reporting 1)\n\nACG 3111 (Financial Accounting and Reporting 2)\n\nACG 4201 (Financial Accounting and Reporting 3)\n\nACG 3341 (Cost Accounting)\n\nACG 4401 (Accounting Information Systems)\n\nACG 4632 (Auditing Theory and Application 1)\n\nTAX 4001 (Federal Tax Accounting 1)\n\nTAX 4011 (Federal Tax Accounting 2)\n\nBUL 3351 (UCC and Law for Accountancy)",
    "comments": [
        {
            "level": 0,
            "comment": "The 3 FARs are all difficult but imo FAR 3 was the “easiest” and one of my favorite accounting classes. It still requires a lot of effort. These will most likely be your hardest and most intense accounting classes unless you’re naturally good with it. Some people were. \n\nI hated Cost Accounting with everything in me but I had a terrible professor who I don’t think is there anymore. It’s like an even more in-depth version of managerial so if you did okay in that then you’ll be fine. \n\nAIS was very boring but not too difficult. The lectures will put you to sleep. \n\nAudit was a fun class for me, it was very interactive and the professor was awesome. Some people did not like it, but I thought it was a lot less intense than other accounting classes. \n\nTax 1 and 2 I was kinda indifferent about. They’re not super hard but there are a lot of rules to learn and it was so boring to me. I think I liked Tax 1 more than 2\n\nBUL was really easy",
            "score": 3,
            "author": "canyonxmoon"
        },
        {
            "level": 0,
            "comment": "ACG 3101, 4401, 3341 is a little confusing because it’s a different type of accounting. That’s all I’m up to so far but everyone says ACG 3101 is the weed out class. I agree",
            "score": 2,
            "author": "SlattSlime711"
        },
        {
            "level": 0,
            "comment": "Take Professor Polinski for 3101 Mauler is supposed to be harder.",
            "score": 2,
            "author": "SlattSlime711"
        }
    ]
}