{
    "id": "12xbxd4",
    "score": 1,
    "title": "Difficukty deciding between FSU or UF for mechanical engineering",
    "author": "Aggravating-Kick-545",
    "date": 1682334510.0,
    "url": "https://www.reddit.com/r/fsu/comments/12xbxd4",
    "media_urls": [],
    "other_urls": [],
    "postText": "I don’t know what to decide between FSU and UF for mechanical engineering, like which one in your guy’s opinion is better for mechanical engineering",
    "comments": [
        {
            "level": 0,
            "comment": "I know several members of the board of engineering and owners of engineering firms here in Tallahassee.  Pretty much everyone, even the FSU grads, will agree that UF has the better engineering program. FSU has other strengths.",
            "score": 31,
            "author": "Unusual-Hedgehog-687"
        },
        {
            "level": 0,
            "comment": "I got my degree in Mechanical Engineering from FSU but I acknowledge that UF has the more renowned  Engineering program. I would have preferred if the College of Engineering was on the FSU campus rather than being a separate campus. At the end of the day, I still got an excellent education and started making 6 figure just a few years out of college despite my mediocre GPA and no internships. There are also good opportunities for research and a good Masters of Engineering program at FSU. At the end of the day, it doesn’t matter THAT much which university you choose.\n\nI recommend that you visit the college of engineering at each campus and make your decision after that. You won’t much time on the actual FSU campus so don’t be blinded by how nice it is.",
            "score": 11,
            "author": "Ilikep0tatoes",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with this. I graduated 2017 and had no issue getting a job. Since that first interview literally no one has cared what university I went to.\n\nOutside of academic prestige, remember that you're going to have to live there for 4-5 years. Pick the one you think you'll enjoy.\n\nPersonally, I liked the separate campus since I never had to deal with parking issues, and had tons of resources entirely dedicated to Engineering majors, like separate computer labs and study areas.",
                    "score": 8,
                    "author": "definitelytheFBI"
                },
                {
                    "level": 1,
                    "comment": "Im thinking of doing automotive engineering, do you know if that’s a something that FSU or UF is good at?",
                    "score": 2,
                    "author": "Aggravating-Kick-545",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What’s more important is that you join SAE wherever you go. I know Cummins hires a lot of people through FSU due to its partnerships with SAE. \n\nAs a side note, FSU (and probably most schools) don’t offer a dedicated automotive engineering program. You instead complete a mechE degree and your senior tech electives will be automotive oriented; i.e. you will result in a degree specialization. But it’s practically the same thing.",
                            "score": 5,
                            "author": "XephyrMeister",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why is it partnered with SAE?",
                                    "score": 1,
                                    "author": "ilovemorbius69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Society of automotive engineers. Not whatever the heck the frat is",
                                            "score": 1,
                                            "author": "XephyrMeister"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "uf",
            "score": 4,
            "author": "GroundbreakingCar714"
        },
        {
            "level": 0,
            "comment": "Both are ABET accredited.  UF is an engineering powerhouse.  FSU seems to put more emphasis on undergrad studies.  What does this mean?\n\nUF\n\nIf you think research is in your future UF has more \n\nYes Applying to grad school, UF probably opens more doors.\n\nFSU\n\nIs a smaller program, professors are seemingly more interested in your successful graduation.  If you go to office hours, they will be there.\n\nFSU is a less competitive atmosphere, especially in engineering.\n\nIt seems easier for undergrad to get involved in research in engineering at FSU.  This is because there aren't as many grad students and because it is less competetive.\n\n&amp;#x200B;\n\nBOTH WILL GET YOU HIRED.  Employers don't care so much about which school especially after first job, only that the school/degree is ABET accredited.",
            "score": 3,
            "author": "FSUDad2021"
        },
        {
            "level": 0,
            "comment": "Hey I’m a recent UF mechE grad that just came across this post. Feel free to message me if you have any questions about UF.",
            "score": 2,
            "author": "toy2ify"
        },
        {
            "level": 0,
            "comment": "Probably the best question  that a prospective engineering student should ask about engineering school is how likely am I to actually graduate with an engineering degree?  \n\nIn [https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;ved=2ahUKEwjK9pCY-ML-AhVQnWoFHZNaAsUQFnoECEAQAQ&amp;url=https%3A%2F%2Fwww.flbog.edu%2Fwp-content%2Fuploads%2FBUD-05c-FAMU-FSU-COE.pdf&amp;usg=AOvVaw3LKLXqpBfCPcmQOqdPW6nj](https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;ved=2ahUKEwjK9pCY-ML-AhVQnWoFHZNaAsUQFnoECEAQAQ&amp;url=https%3A%2F%2Fwww.flbog.edu%2Fwp-content%2Fuploads%2FBUD-05c-FAMU-FSU-COE.pdf&amp;usg=AOvVaw3LKLXqpBfCPcmQOqdPW6nj)\n\nFSU states the following \n\n\"Almost 50% of incoming undergraduates fail to continue on to the major,\" and further \n\n\"after transferring from pre-engineering, the graduation rate is over 70% but the time to graduation on average exceeds four years.\"\n\nwhich means 70% of the 50% who started as freshman actually graduate.  35% roughly.\n\nI was unable to find similar numbers for UF but do know the UCF numbers in 2005 were 70% attrition from pre engineering (calc 1,2,3 Physics 1&amp;2) \n\nUF has an office called STEPUP that provides support for underrepresented student groups in engineering.  I suspect they could provide you with exact attrition rates.   \n\nThe general rule of thumb nationally is that less than 50% of freshman who start in engineering will graduate in engineering.  Given this fact, you should look at the school that is most likely to support your personal goals.  Its a tough road and prestige doesn't help you pass courses to complete the degree.",
            "score": 2,
            "author": "FSUDad2021"
        },
        {
            "level": 0,
            "comment": " Im studying engineering at fsu and UF is definitely the better choice. FSU has a solid engineering program but UFs is top tier",
            "score": 2,
            "author": "SpikyPickaxe"
        },
        {
            "level": 0,
            "comment": "IMHO, go to UF if you have the chance. I've been there a couple of times and their teaching quality and engineering building are state-of-the-art. FSU does not have an engineering dept per se, they rely on a joint program with FAMU, so the quality is not as good. UF challenges you more academically and mentally, so you will get used to pressure, which is something that you'll need once you get a job.",
            "score": 0,
            "author": "Alternative-Sea7982",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why do you say that the teaching quality is not as good solely because it’s joint with FAMU? My experience was that the FAMU professors that taught at the college of engineering were excellent. Many of them genuinely cared about teaching and not just about their research. Also, the classes taught at each university are going to be very similar. Dynamics isn’t magically more complex because it’s taught at one university over another. Although as an FSU Mech E alumni I do acknowledge that UF has a more renown engineering program.",
                    "score": 3,
                    "author": "Ilikep0tatoes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Quick question what branch of engineering did you do?",
            "score": 1,
            "author": "Aggravating-Kick-545"
        },
        {
            "level": 0,
            "comment": "I have another question. Are their requirements for entering the Mechanical Engineering program? Like a math requirement, or something of sorts?",
            "score": 1,
            "author": "Aggravating-Kick-545",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m good at math, but what I’m asking if there is a class pre-requisite for entering? for example in my freshman year in my county i wanted to go to a school that had an engineering program as a “magnet program” but the thing is that I didn’t have the math course pre-requisite so I couldn’t enter that HS; Therefore, I’m asking if there is a pre-requisite class/course for entering becuase i would hate for what happened to me to happen again😥",
                    "score": 1,
                    "author": "Aggravating-Kick-545"
                }
            ]
        }
    ]
}