{
    "id": "12xddnr",
    "score": 17,
    "title": "FSU CS",
    "author": "EvenOddAvg",
    "date": 1682337908.0,
    "url": "https://www.reddit.com/r/fsu/comments/12xddnr",
    "media_urls": [],
    "other_urls": [],
    "postText": "How is Computer Science (BS) at FSU. I would really appreciate it if somebody could tell me about the program in more detail than the posts I've seen around here. I have to choose between UCF and FSU for cs, I have around the same things offered from both. UCF is offering a bit more money but my housing still isn't approved and it's a worry, on the other hand FSU gave me a really low contract number so I'm all good for housing if I choose to come. So if anybody could tell me about the curriculum, job opportunities, and clubs at FSU for CS that would be great.",
    "comments": [
        {
            "level": 0,
            "comment": "I'm graduating from the program this semester so I can provide some insights.\n\nProfessor quality can be a little hit or miss. Some are great, some are not. This is almost certainly true of any program at any university, though. \n\nThe curriculum covers concepts that are important for career advancements. One of the technologies I worked with in a course is fundamentally identical to a major project at the company that hired me on for after grad, which I would guess played a major role in their decision.\n\nI can't speak for UCF on this, but FSU's size and sheer number of graduates means you'll find alumni almost anywhere you go which is great for networking purposes.\n\nIf you have any other specific questions, feel free to reach out.",
            "score": 11,
            "author": "TOWW67",
            "replies": [
                {
                    "level": 1,
                    "comment": "Heads up UCF is actually the second  largest school in terms of enrollment in the country! But I agree with your points above about FSU! I would pick FSU based on my time there as well. Career center is really good at placing you",
                    "score": 3,
                    "author": "OrginalBlackWater"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was a student at UCF and now I'm here at FSU. I was in CECS at UCF, now COAS here. Not really familiar with the CS dept here, but at UCF it is a very well regarded department. All of the programming classes I took were great, and there are a bunch of different clubs related to CS, including a programing club that places well nationally consistently. The culture of both schools is good, here at FSU its a lot more party based and I see less 'nerd culture' than I did at UCF, but that could be I just haven't found it yet. Orlando is very good for getting CS related internships and experience. If you have any more questions feel free to reach out.",
            "score": 7,
            "author": "soccerrocketbopit"
        }
    ]
}