{
    "id": "12zu8cn",
    "score": 1,
    "title": "Just signed freshman housing contract. My number is 6003… am I out of luck getting housing on campus?",
    "author": "DryPaleontologist907",
    "date": 1682535052.0,
    "url": "https://www.reddit.com/r/fsu/comments/12zu8cn",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "id recommend joining an LLC, there’s a decent amount and if you join one, you’ll get a spot in whatever dorm they’re housed in. you’ll have to take a class each semester ab it but it’s rly simple and it’s w the other members of the llc who live on your floor with you so it’s a good way to make friends. for example, there’s an engineering llc that’s in magnolia hall, so if you get in, ur housing number becomes irrelevant and you’ll dorm in magnolia \n\n[https://housing.fsu.edu/living-learning-communities](https://housing.fsu.edu/living-learning-communities)",
            "score": 10,
            "author": "Objective-Search-449",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is great to know, thank you.",
                    "score": 3,
                    "author": "DryPaleontologist907",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "very hard to get into an llc atp",
                            "score": 2,
                            "author": "No_Transition7509",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "rly? i didn’t end up joining one last year but i applied to 3 and got into 2 and my friend who actually ended up joining one got into all the ones she applied for. has it gotten that competitive?",
                                    "score": 0,
                                    "author": "Objective-Search-449",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "when did you apply? llc priority round 1 and alternative round 2 already passed",
                                            "score": 2,
                                            "author": "No_Transition7509",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i applied pretty early actually, didn’t consider the timing w this one, but yea totally get its probs hard at this point",
                                                    "score": 1,
                                                    "author": "Objective-Search-449"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro join an LLC you don’t wanna be in sally 😭. It’s like living in a middle school bathroom, and my LLC (social Justice) was awesome and let me be in wildwood with a similar number. Not the nicest dorm but was placed perfectly between campus and college town.",
            "score": 1,
            "author": "cfunk17"
        },
        {
            "level": 0,
            "comment": "im 5060, tried joining an llc, still under alternate status sadly",
            "score": 1,
            "author": "GarbageFew3120"
        }
    ]
}