{
    "id": "13i81zl",
    "score": 4,
    "title": "Sent to collections",
    "author": "elguajiro17",
    "date": 1684156634.0,
    "url": "https://www.reddit.com/r/fsu/comments/13i81zl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I had to stop doing classes in fall of 2022 (mental health issues) and I haven’t been able to return. Long story short, my subsidized loan was reversed for that semester, and without any mail or phone call warnings I received 2 letters on Friday, May 12th stating that my loan was sent to collections. \n\nThese 2 letters were both dated for March 29th, and I received both at the same time. I’m worried this is gonna destroy my credit score. I just spoke to Student Business services which told me that fsu is no longer handling the payment of the loan, BUT it still appears as payable on my.fsu.edu, plus a nice little 300 dollar collections fee… \n\nAnyways, I’ve received NO information from this collections agency, no intimidating phone calls and no mail. \n\nHas anyone been in a similar situation? If so, do you have any advice? I’ve certainly never defaulted on a loan and I am shitting bricks at the moment. Any advice helps.",
    "comments": [
        {
            "level": 0,
            "comment": "I'm sorry you're dealing with this - I know how stressful it is. Take a deep breath; you have options and can get things back on track. \n\nI'm sharing this from my experience as a student, not from my position as a staff member. Students get one opportunity to \"rehabilitate\" a defaulted loan so that the default is removed from their credit history. I did this about a decade ago and it was very straightforward. \n\nhttps://studentaid.gov/manage-loans/default/get-out",
            "score": 8,
            "author": "__sarabi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! You’re saving my life",
                    "score": 2,
                    "author": "elguajiro17"
                },
                {
                    "level": 1,
                    "comment": "Actually… the default isn’t on the government’s end with the loan, it’s on FSU’s. They reversed my financial aid when they withdrew me and I owed it honestly without my knowledge. Both the letters I received a month late were about money I owed FSU directly. So I’m probably screwed since I can’t use the loan forgiveness from financialaid.gov",
                    "score": 2,
                    "author": "elguajiro17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay I understand now - that is different from my experience and I'm not well versed in what resolution looks like in that case. I'm sorry to have gotten your hopes up ☹️\n\nI would strongly encourage you to go in person to student business services if you're able and see if you can talk to someone to map out your best next steps.",
                            "score": 1,
                            "author": "__sarabi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No worries! This is a complicated situation and I was still lost after my first call with SBS, which was right before I made this post. I’ve left voicemails at all the necessary places and now I’m just waiting for call backs. Thanks again!",
                                    "score": 2,
                                    "author": "elguajiro17"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not certain, but I believe their are laws surrounding timely notifications of these type of matters. A month and 12 days does not sound timely at all. I'd look into this, maybe consult an attorney if you can afford it, and take what you find to SBS. \n\nWhile it's true (from my understanding) that once sent to collections they no longer handle it, it IS possible for them to retract it. However, that usually only happens when it's truly a mistake. While it's unfortunate, when you take out a loan there is a degree of personal responsibility to be aware of the clauses/restrictions, and following up with payments. \n\nAre you still in town? A visit to their office in person and speaking to a specialist may be beneficial. A lot of calls to the university are handled by a call center staffed by student workers following a script. This may have changed and/or SBS may not be under that umbrella. But if it is, it is possible those students are wrong sometimes.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Just a heads up for the future. You can apply for a medical withdraw and the university will reimburse your tuition, even with loans, thus it won't be on your account.",
            "score": 1,
            "author": "JustB510"
        }
    ]
}