{
    "id": "13ldxtu",
    "score": 4,
    "title": "CGS 2100 or CGS2518?",
    "author": "KrabbyPatty-Formula",
    "date": 1684451355.0,
    "url": "https://www.reddit.com/r/fsu/comments/13ldxtu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Should I take Microcomputer applications for Business or Spreadsheets for Business? Which is the easier/less time consuming one?",
    "comments": [
        {
            "level": 0,
            "comment": "Spreadsheets for Business is easily the most useful class I've ever taken. It's not hard.",
            "score": 6,
            "author": "fsu2k"
        },
        {
            "level": 0,
            "comment": "I took both. Take CGS2518 with Ken Armstrong if you are a business major since it is required of everyone and is not a difficult class by any means (it’s just time consuming). \n\nIf you are NOT a business major, and are only doing this for a credit that’s needed to graduate FSU, then take CGS2100 with Adria Peaderson (idk if i spelled her last name correct but it’s along those lines). \n\n\nI highly recommend CGS2518 bc I found it to be an easy A and it allowed me to get EXCEL certified which is something employers universally want to see. But, you do what’s best for you!",
            "score": 6,
            "author": "Icy-Drop-2524",
            "replies": [
                {
                    "level": 1,
                    "comment": "Adria Peaden. I know her personally, she’s a great woman and teacher. Very caring, I took her as well online. I recommend!",
                    "score": 3,
                    "author": "can1getawaffle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Spreadsheets for business was time consuming, but I learned so much and apply it every time I use excel (which is often). If you think you're going to use excel a lot in the future, I'd say take spreadsheets and just power through",
            "score": 3,
            "author": "the_black_mamba3"
        },
        {
            "level": 0,
            "comment": "Only take CG2518. The other class is a waste of your time money and credits. COB only cares about 2518",
            "score": 3,
            "author": "Flynn402"
        },
        {
            "level": 0,
            "comment": "Spreadsheets for business will be much more useful in your career.",
            "score": 3,
            "author": "NewTampan"
        },
        {
            "level": 0,
            "comment": "CGS 2100 is a lot easier and less time-consuming. I personally found CGS 2518 to be a way more difficult and I really did not like the professor. If you're choosing between one and the other choose CGS 2100 as you will save way more time and effort.",
            "score": 0,
            "author": "PristineTeen300"
        }
    ]
}