{
    "id": "13tdfah",
    "score": 8,
    "title": "financial aid offer question",
    "author": "snail1001",
    "date": 1685209049.0,
    "url": "https://www.reddit.com/r/fsu/comments/13tdfah",
    "media_urls": [],
    "other_urls": [],
    "postText": "I transferred in last fall as an out of state student and I didn't get any financial aid help from FSU and paid the full ~25k out of pocket. I thought I would get some kind of grant for this year and figured I just applied late last year as a transfer for aid and this was why I got none.\n\nDoes FSU give grants? I have a pretty big estimated need number on the portal but I'm getting absolutely nothing and I don't have another 25k to be paying for this school year.",
    "comments": [
        {
            "level": 0,
            "comment": "Did you fill out a FAFSA? I assume you’re undergrad?  Lotta information missing but I transferred in from outta state too so I can try and help",
            "score": 7,
            "author": "JustB510",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes so I don't know why I'm getting absolutely nothing",
                    "score": 2,
                    "author": "snail1001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What’s your socioeconomic background?",
                            "score": 2,
                            "author": "toptierwinner"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wdym “full 25k”? I’m OOS w/o financial aid too and paying close to 40k a year.",
            "score": 4,
            "author": "hurrikatrinamorelike",
            "replies": [
                {
                    "level": 1,
                    "comment": "the class tuition part was like 25k, my housing was another probably 10k so overall it was probably around the same for me",
                    "score": 2,
                    "author": "snail1001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh ok. Yeah it sucks, my family can barely afford it, but it was that, my in-state safety for about the same price, or worse campus of safety that gave me 7.5k merit aid, plus I could live at home (but I REALLY don’t want to do that).",
                            "score": 3,
                            "author": "hurrikatrinamorelike"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank god for bright futures. I paid nothing in tuition😭😭😭",
                    "score": 0,
                    "author": "throwaway4637282",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don’t be mean to the OOS students.  Don’t you know Florida is the backwater of education.  If you tell them our bright kids go for free you’ll ruin the backwater storyline.",
                            "score": 4,
                            "author": "FSUDad2021"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn, I assume you don’t meet the need based requirement. I would go down to financial aid and talk to them, just to make sure you either didn’t exhaust it or there was a mistake in your submission",
            "score": 4,
            "author": "JustB510"
        },
        {
            "level": 0,
            "comment": "You could also look at some scholarships at FS4U (FSU’s scholarship platform) There’s scholarships for specific regions where you’re from or what college you are studying",
            "score": 2,
            "author": "Jonofthelife"
        },
        {
            "level": 0,
            "comment": "Wait are you from NC?",
            "score": 1,
            "author": "Jonofthelife"
        }
    ]
}