{
    "id": "142zaep",
    "score": 2,
    "title": "Financial Aid Question",
    "author": "Sufficient-Excuse315",
    "date": 1686100750.0,
    "url": "https://www.reddit.com/r/fsu/comments/142zaep",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was told that all of our student aid totaled together CANNOT be more than the cost of attendance per semester at FSU. \n\nI have some grants &amp; scholarships that make my financial aid over the cost of attendance…are they going to cut my grants just because of this “rule”?\n\nMy financial aid account has been under review for some time and I am STRESSING",
    "comments": [
        {
            "level": 0,
            "comment": "To my understand but I might be wrong, there's a certain order as to how they reduce your aid if your total aid (grant+scholarship+loans) &gt; cost of attendance. Yes, they will adjust your aid package if your total aid exceeds cost of attendance.\n\nAccording to common sense, one would suspect they will first reduce any loans on your aid, and then if your total aid is still greater than cost of attendance, then they'll proceed to reduce grants, and then scholarships.",
            "score": 3,
            "author": "jenl_fsu21",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gotcha that makes sense! Thank you",
                    "score": 2,
                    "author": "Sufficient-Excuse315"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you pulled an invoice for the semester from your Student Financials page?  And have you contacted Student Business Services for an ETA on when the review would be complete?",
            "score": 2,
            "author": "bradynho",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have absolutely no clue how to pull an invoice for the upcoming fall semester. I have accessed my current financial aid for this upcoming fall through the Student financials page^ which is what’s under review. There is also the budget worksheet which shows the projected cost but it’s not an invoice \n\nThey did say 24-48 hours for the under review period but it’s been like since Friday so I’ve just been waiting.",
                    "score": 1,
                    "author": "Sufficient-Excuse315"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The cost of attendance includes tuition, housing (not sure about off-campus), meal plan, and a lot of room for books, transportation, etc. If your financial aid is above that they will adjust it to be at the limit, but that limit is high enough where you’ll be financially fine.",
            "score": 2,
            "author": "Trikzon"
        }
    ]
}