{
    "id": "1478ill",
    "score": 6,
    "title": "Limited major options",
    "author": "Witty-Bag333",
    "date": 1686525212.0,
    "url": "https://www.reddit.com/r/fsu/comments/1478ill",
    "media_urls": [],
    "other_urls": [],
    "postText": "/hiiii\n\n  .dont know who’s gonna see this but if you can help I’d appreciate it.\nBasically I went to FSU in 2021 and moved back home after a year due to personal issues, but I still took classes at my community college. I’ve already gotten my AA and I wanted to return to FSU (im still enrolled if I register for summer classes) and stay in the major I was in previously, but I found out I actually can’t apparently because I’m missing prerequisites. Now I only have a few majors available to me, none of which I am particularly interested in. Do i seriously have to get a degree in one of those majors to go to FSU? Going to FSU is the best option for me right now but I don’t want to be stuck in a major that I hate or that wont get me a job(apparently). The advisor I talked to said I have to consider a different school if I want to be a stat major &gt;.&lt; Is there really no way I can change it later? I dont mind if it takes a bit longer, I just dont want to be trapped :/ thank you",
    "comments": [
        {
            "level": 0,
            "comment": "I’d recommend taking the necessary prerequisites so you can get a degree in something that interests you. If you don’t, you’ll likely be miserable taking classes and miserable if that ends you up in a career that you don’t love. Is taking the prereqs a viable option for you?",
            "score": 14,
            "author": "GTSeminole",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know… the advisor I spoke to made it seem like taking the prerequisites now isn’t an option for me:( idk what to do",
                    "score": 7,
                    "author": "Witty-Bag333"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why don’t you just take the prereqs so that you can pursue the major you want?",
            "score": 9,
            "author": "kairoschris",
            "replies": [
                {
                    "level": 1,
                    "comment": "basically they told me that i no longer have the option to take the prereqs... \" You will be at MAP Term 5 for the upcoming Fall 2023 semester, so you will need to already be meeting the required Milestones and pre-requisites of a new major for Terms 1-4 and be ready to take their Term 5 Milestones in Fall 2023...This means that you will only be qualified for majors you already meet Milestones and pre-requisites for. You cannot “make up” any required Milestones or pre-requisites that you are missing.\"",
                    "score": 3,
                    "author": "Witty-Bag333",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s strange unless you’re missing several prerequisites or are way off map. Is this the Stats advisor telling you this? If not, I’d talk to an advisor for the Stats program to double-check.\n\nAlso, according to the [Statistics map](http://undergrad1.its.fsu.edu/academic_guide/map-display.php?program=statistics), there are only 5 courses required for Milestones 1-4 (ENC 1101, ENC 2135, speech, 1st math course, and 2nd math course or stats). What are you missing out of those? Or is it the prereqs you’re missing?",
                            "score": 3,
                            "author": "kairoschris"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "depending on the major you can take upper division classes needed for that degree program without ever being admitted into the major. if you can mange to take prerequisites and upper division courses/electives for the degree at the same time you could probably petition to be admitted into your desired major. the likeness of you being admitted into the you want probably mostly depends on how much of the degree program you’ve already completed and whether or not you could manage to graduate “on time”. you could change your major and change it back depending on how far along you are. but if you are off-track for 2 semesters they will require you to change your major anyways. i was in a major for a year &amp; didn’t take any related classes for it so i could take courses for the major i actually wanted to study. it would greatly suck if your petition wasn’t accept so maybe its not worth the risk because you won’t be admitted into the major you want &amp; the classes you took for that major may not be applicable for another one.",
            "score": 7,
            "author": "springhilleyeball",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting, thank u !",
                    "score": 2,
                    "author": "Witty-Bag333"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How many classes are you missing? Are you saying taking those pre-reqs, then switching, would delay you one semester from graduating?",
            "score": 2,
            "author": "Schitzengiglz",
            "replies": [
                {
                    "level": 1,
                    "comment": "They pretty much told me I dont have the option to make them up because id be at \"MAP term 5\" when I return... they didnt really tell me I could take them and be delayed one semester, id be willing to do that though",
                    "score": 2,
                    "author": "Witty-Bag333"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take the prereqs this summer",
            "score": 2,
            "author": "throwaway4637282",
            "replies": [
                {
                    "level": 1,
                    "comment": "Idk the advisor kinda made it seem like that wasnt an option... \"University policy states that to be eligible to change your major, you must meet the MAP Milestones and required pre-requisites for the intended major (meaning that you already have them completed or are currently enrolled in them and completing them) for the MAP term you are at. You will be at MAP Term 5 for the upcoming Fall 2023 semester, so you will need to already be meeting the required Milestones and pre-requisites of a new major for Terms 1-4 and be ready to take their Term 5 Milestones in Fall 2023...If being a Statistics major is what you really want, then you would need to look to another University that is not as strict in its academic regime, such as possibly UCF in Orlando, UWF in Pensacola, etc.\", Id totally be willing to do the prereqs over the summer but the responses from the advisor made it seem like i did not have that choice...",
                    "score": 2,
                    "author": "Witty-Bag333"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would like to know if what the advisor says is true or not. I am looking into going to a community college, then transferring to FSU after the AA, but I am undecided on my major. So I could potentially be in your situation when I don’t have needed pre requisites. I always thought that there is an option to take the pre requisites before I transfer to FSU even if it takes another semester. More info is greatly appreciated",
            "score": 1,
            "author": "Intrepid-Increase300",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can and should take pre requisites before you transfer .. 1 semester isn’t going to matter and small class size sling with half price tuition make this the smart choice.",
                    "score": 1,
                    "author": "FSUDad2021",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can i hypothetically take 5 semesters in a community college, get pre requisites for 2 different but complementary majors (in case one of the majors is somewhat selective), then transfer to FSU for the Winter semester? Or does it have to be a fall semester?",
                            "score": 1,
                            "author": "Intrepid-Increase300",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Daughter took 114 credits at community college (all dual enrollment but same classes as you are taking) she arrived with all the pre requisites for engineering (calc 1,2,3 physics 1 &amp;2) and much to my surprise they accepted 93 credits toward her International affairs degree.  She only needed 27 credits from FSU to graduate with that one (Ironically you need 30 from FSU or they can't award a degree) so yes absolutely you can have pre requisites for two degrees.  From this experience you can see you can actually have more than just pre requisites you can actually complete most of a degree.  Careful planning is the key.",
                                    "score": 1,
                                    "author": "FSUDad2021",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did she go to Tallahassee cc? My local cc has rather short list of courses, mostly general Ed and some technical education . I am thinking about TCC online maybe.",
                                            "score": 1,
                                            "author": "Intrepid-Increase300",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "She went to Eastern Florida State College.  It’s one of the central Florida equivelant s to TCC.  Valencia and Seminole state are the others.  Gen Ed’s 36 credits) and or req for major are what you need to transfer.  Technical and Microsoft word type classes won’t do anything for you .",
                                                    "score": 1,
                                                    "author": "FSUDad2021"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I made the decision not to attend FSU because of the “limited access” in many of the majors. Mine in particular only accepts 100-150 students each fall semester and acceptance is solely based on GPA, the average being 3.45. I could work my butt off for two years only to get denied entrance to the major and get stuck having to settle if I get beat out on my GPA.",
            "score": 1,
            "author": "SKK12619",
            "replies": [
                {
                    "level": 1,
                    "comment": "Which is this?",
                    "score": 1,
                    "author": "FSUDad2021",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which is this? Do you mean major?",
                            "score": 1,
                            "author": "SKK12619",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes what major?",
                                    "score": 1,
                                    "author": "FSUDad2021"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How many semesters to “catch up”?  Now I  am very suspicious of advising on these issues. My daughter showed up as a freshman with 114 credits in 2021.  She had all pre requisite courses for both engineering and international affairs.  Two years in and advising is saying she is making unsatisfactory academic progress despite having accumulated 180 credits, completed all IA degree requirements and well into upper division engineering. She’s had 15 credits a semester and classes last summer snd now.  She should be just a sophomore and we are waiting for Simone in advising or financial aide to explain what satisfactory progress would actually look like.  \nAll that said advising isn’t infallible.  Sit down map out a plan that makes sense and follow through.  In the end you pick your classes and if you do well you will be admitted to almost any major that is not seriously impacted (forget about film school for example) be careful that you plan to graduate under your excess credit hour requirement or it will get pricey.  \nThe college is really pushing 4 year graduation as this influences ratings.  It’s good because you don’t want to be hanging out for 7+ years but sometimes it comes off like they want to limit you in order to meet that goal.  If you can show a departmental advisor a plan that has you graduate under the excess credit threshold then you should be ok.",
            "score": 1,
            "author": "FSUDad2021"
        },
        {
            "level": 0,
            "comment": "There’s great advisors and terrible advisors. Talk to someone else and make a plan with them. Take the prereqs for the major you want and then apply to the program. Look up (whatever major) FSU academic map and find what you need to take. If still no one can help talk to the Dean we get transfers all the time",
            "score": 1,
            "author": "TrashPanda-1108"
        }
    ]
}