{
    "id": "148wgvp",
    "score": 4,
    "title": "AMH2020 with Dr. Jones",
    "author": "kriemil",
    "date": 1686710648.0,
    "url": "https://www.reddit.com/r/fsu/comments/148wgvp",
    "media_urls": [],
    "other_urls": [],
    "postText": "hey everyone! i’ve heard mixed reviews about Dr.Jones and wanted to know what i’m getting myself into!! any tips?",
    "comments": [
        {
            "level": 0,
            "comment": "She’s amazing. You definitely have to take her class seriously, but as long as you do the readings and participate, you’ll be good. She was by far my favorite professor from FSU",
            "score": 3,
            "author": "lma16b"
        },
        {
            "level": 0,
            "comment": "As someone who took her during freshman year during COVID, I would say be prepared to work for the grade. She is awesome and good with her teaching! Make sure to take plenty of notes. \n\n&amp;#x200B;\n\nLastly, if she says that you will fail her first test in the class, you will absolutely. I did not believe her thinking I was going to pass. But I failed with a D. That served as my first humbling lesson in college.",
            "score": 2,
            "author": "Many_Strawberries_24"
        },
        {
            "level": 0,
            "comment": "Does megan martinez not teach amh2020 anymore? Take it with her if possible, her class had no exams or papers. Just an easy af weekly quiz from the lectures.",
            "score": 1,
            "author": "throwaway4637282"
        },
        {
            "level": 0,
            "comment": "Honestly, one of my favorite classes I have took. Had for summer B so it was a bit rushed but overall just attend classes, takes notes, be engaged with her. Also the first exam is not as bad as people make it out to be. I scored a B even though I studied not a lot but I was just paying attention in class. Copy her words almost verbatim for your notes she doesn’t say anything unnecessary and what will be on the exam. Lastly, she will boost your grade is you are engaged and answer her questions especially during the discussion days. I got boosted from a B to an A+. Amazing teacher",
            "score": 1,
            "author": "BrownSugarXS"
        }
    ]
}