{
    "id": "ivqvq0",
    "score": 316,
    "title": "Shout out to all you party animals.",
    "author": "Itsallanonswhocares",
    "date": 1600515029.0,
    "url": "https://www.reddit.com/r/fsu/comments/ivqvq0",
    "media_urls": [],
    "other_urls": [],
    "postText": "You're fucking this up for the rest of us.\n\nNo really, you're not gonna get to party for long going at the present rate. Tighten up or accept the fact that you're imposing consequences for your behavior on everyone, which includes you petulant children who can't be bothered to follow basic public health advice. \n\nWe're ALL sick of this pandemic shit\nI wanna party too, I miss meeting girls. I'm single in the middle of all this bullshit and I'm not letting my dick do the thinking. I was making musical breakthroughs and getting ready to play shows before the lockdown, you think I don't wanna pack people in a room and make them dance? Of course I do, but this ain't the time to be selfish, because your actions affect the people around you. \n\nPlease wear your masks correctly, over your nose. Figure out ways to hang out with people that don't involve literally poisoning your immune system and packing into buildings like sardines. Cmon yall, think outside the box. \n\nFucksakes.",
    "comments": [
        {
            "level": 0,
            "comment": "Sometimes I let a rant post like this go through just to see how many people get banned for belittling the situation on campus.\n\nReminder: making fun of the situation, calls for not wearing masks, shaming those who are trying to promote health and safety and other reasons will result in a 30 day ban. If your account is new or very little activity and you do this it is a permanent ban.",
            "score": 1,
            "author": "420yoloswagblazeit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "B-but bro, you don’t understand. I personally myself am pretty unlikely to die so itd be super beta of me to live in fear brah, nothings gonna stop me from shotgunning these claws",
            "score": 124,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This sounds like an actual chapter house quote",
                    "score": 32,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Fuck yo whiteclaw bb :3",
                    "score": 6,
                    "author": "Itsallanonswhocares"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 38,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fuck what they think, I know what I'm about. There will be a record of who got with the program and who didn't, and I personally will use this time as a litmus test for the character of people who I intend to get involved with in the future. \n\nI appreciate the sentiment about the girl thing, there will be plenty of time to meet people when the time is right. It sucks to be lonely, but I'm honestly using the time to work on myself, and everyone should learn how to maintain and function alone, both emotionally and academically/vocationally. &lt;3",
                    "score": 11,
                    "author": "Itsallanonswhocares"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What",
                            "score": 1,
                            "author": "blackwhitetiger"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YES. I was walking to my apartment from campus last night, and it was like a zoo unleashed. There were big crowds of people either packed into the College Town restaurants/bars, or hanging out behind buildings just trying to get as drunk as possible or doing stupid stuff in general. (No masks, of course.) I was thinking, why would any of this be fun for anyone? The saddest part is even if they all read this post, or the warnings, none of them will care. It doesn’t matter to them until they are actually the ones suffering, and then they’ll find something else to blame it on.",
            "score": 19,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately, I hope posts like these help at the margins. Not everyone's a fucking idiot, and I get people's desire to cut loose. I don't respect it whatsoever, but I get it.\n\nThe reason I make a big deal out of going everywhere noticeably geared up, (including driving alone, with the windows down, very obviously wearing my mask and gloves) is that it serves as an annoying reminder to these fucking babies that this shit doesn't just go away because they wish it would.  Nope, you get to look at my masked dumb face and get irritated, because guess what, this shit is happening and anything other than full compliance is some weak shit you WILL be judged for, years from now. \n\nI have an idiot friend I split with who is currently alienating a lot of people, including me, by not taking this seriously and putting his ego over the possibility of him being wrong. It's personally made me loose all respect for the guy, to the point where anything outside of a public apology and complete acknowledgement of his arrogance isn't gonna get him back on my island. And I'm going places and doing cool shit, when the time comes to bring people along for the ride he ain't coming.\n\nThere's a permanent record of your stupidity and selfishness, remember that. This judgment will follow you, and it not just me paying attention to this.",
                    "score": 12,
                    "author": "Itsallanonswhocares",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yo I'm a shit show of a human being, but I get to be proud of my accomplishments. Go ahead and be a punk, once you fuck up your rep that shit follows you, I speak from experience as someone who has rarely been taken seriously up to this point.\n\nIt's easy to lose respect, it's extremely difficult to earn it back.",
                                    "score": 5,
                                    "author": "Itsallanonswhocares",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, I've made some missteps, but these days that plays in my favor. Few things in life are as gratifying as wildly exceeding someone else's low expectations.\n\nIdk man, don't get hurt. Hope you and yours make it through this okay. Sorry this global crisis is causing you personal inconvenience.",
                                                    "score": 3,
                                                    "author": "Itsallanonswhocares"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just think some people just don't care. I have a co-worker who literally caught covid, was quarantined, whole 9 yards. She still comes into my work and doesn't like to wear her mask. Some people just don't care.",
            "score": 10,
            "author": "Continumn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wack.",
                    "score": 5,
                    "author": "Itsallanonswhocares"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh don't worry, it just gets better:\n\nhttps://www.cbssports.com/college-football/news/florida-state-coach-mike-norvell-tests-positive-for-covid-19-will-miss-rivalry-showdown-vs-miami/",
            "score": 6,
            "author": "Steeps5"
        },
        {
            "level": 0,
            "comment": "Tell that to the administration.  Blaming individuals isn't going to do anything, college kids gonna college kid when they're out on their own at college.  The real problem is that they're all still in Tallahassee instead of at home, as well as the federal handling of the virus where they didn't shut anything down until it was too late.  Pretty much every other country has got a handle on this except America.\n\nI mean you're totally right and people sould def not be partying, I just don't like this narrative that the FSU administration and our federal and state governments are handling this more or less fine and the reason we have all these cases are poor choices by individuals instead of a failure to act by the government and the school.  If we lived in a civilized country this would have been solved months ago.  Instead, our leaders are having thousands of students come onto campus and having football games while acting like it's all these dumb kids fault...  They need to take some damn responsibility instead of acting all surprised when college students party.",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed!",
                    "score": 2,
                    "author": "118arcane"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well this post didn’t age well",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’m curious as to what the infection rate is, both the daily infections and rolling two week rate. I would guess that FSU is past the peek with what it can do with enforcing social distancing",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really hope they just clamp down and pack it in for the semester. This slow burn is just gonna continue to get worse as more people start to relax and the economy is \"reopens\" some more",
                    "score": 6,
                    "author": "Itsallanonswhocares",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe. I’d rather use data to make assumptions. The covid rate in Tampa has dropped to 5% from its peak in late June and early July. Suspension seems like a good punishment for rule breakers and to scare others",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unfortunately I don't think that addresses the core issue of these people being in close proximity to each other. Where there's a will there is a way.",
                                    "score": 6,
                                    "author": "Itsallanonswhocares"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "lol",
            "score": -69,
            "author": "canmenzo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wants to downvote but also wants to keep it at -69",
                    "score": 3,
                    "author": "TheChatotMaestro"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You know the nature of his post, you're a notorious contrarian.",
                            "score": 1,
                            "author": "420yoloswagblazeit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 0,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -56,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "the point just flew above your head bud",
                    "score": 18,
                    "author": "nrikks"
                }
            ]
        }
    ]
}