{
    "id": "z4y9m1",
    "score": 246,
    "title": "State Champs 2022 baby!!",
    "author": "TheGisbon",
    "date": 1669437814.0,
    "url": "https://www.reddit.com/r/fsu/comments/z4y9m1",
    "media_urls": [
        "https://i.redd.it/fcs1m2p7682a1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This is one of the best looking teams since we were National Champions!",
            "score": 33,
            "author": "aeromalzi",
            "replies": [
                {
                    "level": 1,
                    "comment": "They've grown a lot, good to see.",
                    "score": 12,
                    "author": "DasKleineFerkell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So proud of you fuckers for storming the field. I always wanted to do that as a student.",
            "score": 35,
            "author": "Andy_In_Kansas",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t know about that, the storming the field was a surprise to a lot of people.",
                            "score": 3,
                            "author": "CollegeSoul",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Huh. The Sheriffs at the game were saying otherwise, I asked a couple, but I figured their responses would be the same even if they were given a green light. Still, the people on the field were definitely not all Seminole Boosters, people jumped onto the field.",
                                            "score": 3,
                                            "author": "CollegeSoul"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And it only aged me by like 35 years in one evening!",
            "score": 8,
            "author": "rigpa"
        },
        {
            "level": 0,
            "comment": "That was an awesome game - refs TRIED to give it away but the D was there!",
            "score": 5,
            "author": "trinole"
        },
        {
            "level": 0,
            "comment": "As a die hard Gator fan, I hope we can all hold hands together and declar Brock Osweiller is the worst Dipshit commentator of all time. \n\nRespect for a legit win.  See you fuckers next year.",
            "score": 2,
            "author": "salestard",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will gladly hold your hand and watch the \"eye candy\" Brock Osweiller burned at the stake.\n\n\nLove you fuckers too. ;)",
                    "score": 2,
                    "author": "TheGisbon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My god man, that escape in the backfield…\n\n\nLet’s just say I went outside and kicked the trash can.  #notkidding",
                            "score": 2,
                            "author": "salestard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If it makes you feel any better i ruined a table runner with beer and dip when I jumped up like a jackass forgetting it was in my lap.",
                                    "score": 2,
                                    "author": "TheGisbon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Awesome.  My wife gets mad when I kick shit so I did it outside pretending to walk the dog.  Then I limped in and she knew.  She fucking knew.",
                                            "score": 1,
                                            "author": "salestard",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't they always. I got ZERO sympathy or toned down frustration from how awesome that run was. Not one single bit. Two sides of the same coin at the same moment lol c'est la vie.",
                                                    "score": 1,
                                                    "author": "TheGisbon"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Umm yeaaaa nope still gotta play ucf to make that official",
            "score": 1,
            "author": "Strick09",
            "replies": [
                {
                    "level": 1,
                    "comment": "UCwho?",
                    "score": 2,
                    "author": "TheGisbon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The team that beat uf when yall couldnt last year 😂😂. But props to you guys for giving milton a chance to QB, that dude is a legend. All in all im happy when UF goes down, i just wish the moo cows would have done their part as well.",
                            "score": 1,
                            "author": "Strick09",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Still never heard of her. Maybe play the other state schools and people might care until then you the irrelevant school down south. ✌️",
                                    "score": 2,
                                    "author": "TheGisbon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hahahahaha this is the first year FSU has been relevant since when? You guys finally beat UF and now big dog on campus??? 😂😂😂 good luck in your ACC play-offs…. Oh wait…..",
                                            "score": 1,
                                            "author": "Strick09",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "FSU-1 UCF - 0\n\nFSU titles -3  UCwho titles - 0 \n\nGo be irrelevant elsewhere.",
                                                    "score": 2,
                                                    "author": "TheGisbon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lets take a trip back to the 90s i see lmfao its been 3 decades since yall been consistent",
                                                            "score": 1,
                                                            "author": "Strick09",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It's been well, never since UCF mattered.",
                                                                    "score": 2,
                                                                    "author": "TheGisbon"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yall needed a miracle and some questionable calls to escape 1-10 USF after losing to Navy.\n\nWith wins over FAU and USF, I'll definitely give you that UCF is the D2 state champ.",
                    "score": 2,
                    "author": "NewTampan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeaaaa we dominated usf until qb got injured but backup qb got it done. Navy always a trap game for us for some reason. But I can argue that we beat a better UF team than you did, you know the one you last to last season that kept yall from going to a bowl…..",
                            "score": 1,
                            "author": "Strick09",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your backup QB didn’t give up 39 points to pitiful USF. \n\nAnyways, i would like to hear your argument.\n\nAnthony Richardson did not play in last year’s Gasparilla Bowl, a neutral site game. The team you play in a bowl game is not the same team from the regular season. Lots of sit outs and players that are checked out. We dominated the gators last year when Emory Jones was in at QB, and would’ve won handily on the road had AR15 been out all game. Also, Jordan Travis was hurt for several possessions, and we did not have a capable backup quarterback. Regardless, no one is saying we are last year’s state champions.",
                                    "score": 2,
                                    "author": "NewTampan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And im guessing you are commenting about a game you didn't even watch correct, go watch the game and tell me the difference between 1st and 2nd half? Wait dominated the gators last year, what game was that?? I only saw the one where y'all lost....Also, you blast our loss to Navy, y'all lost to wake forrest with a healthy team....",
                                            "score": 1,
                                            "author": "Strick09",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Emory Jones threw 3 picks against us last year. If he plays the whole game, we win. Doesn’t matter anyways, we’re talking about this year not last year.\n\nWake Forest is much better than Navy, 7-5 vs 4-7. Fabien Lovett was out for the Wake Game, which was a killer on defense. Jared Verse and other guys were also banged up. \n\nGood luck against Tulane. If you win the next two, maybe you can print up some more off brand national champions tees",
                                                    "score": 2,
                                                    "author": "NewTampan",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hey that system is rigged and without our school making the ruckus there would never have been talks of expansion.  \n\nI do worry about our performance against Tulane tbh.  I think next year should be a bit better as gus gets more settled. \n\nTBH FSU is my #2 team for FL. I will usually pull for FSU in your games. I am always happy when gators lose. Hope we get to have a matchup some time soon and hope we both have good teams that year so we can see it settled on the field :p",
                                                            "score": 2,
                                                            "author": "Strick09"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "GO NOLES &gt;&gt;—|&gt;",
            "score": 1,
            "author": "Queasy_Penalty_1371"
        }
    ]
}