{
    "id": "104f7aa",
    "score": 4,
    "title": "Is the 3D Art Certificate worth it?",
    "author": "Brimikyu",
    "date": 1672964527.0,
    "url": "https://www.reddit.com/r/fullsail/comments/104f7aa",
    "media_urls": [],
    "other_urls": [],
    "postText": "If anyone on here has taken it, what was the 3D Arts certificate like? I got my BA in Game Design, but it was a very general degree so there were only a few relatively beginner classes (like 2 on maya, 1 on zbrush, and 1 vfx for unreal engine,) so I ended up having to teach myself a lot (such as propper retopo for characters, substance painter/designer, etc.)\n\nI want to further my 3D knowledge so the certificate sounds nice, especially since it's from full sail,  but if it's mostly stuff I know already I hesitate. I don't mind a little reinforcement, but if 80% of it is recap I'd be quite upset lol.\n\nOn the other hand, I could take a few courses at a time on CGMA that have (seemingly) more variety/specialization, longer courses, and end up being more cost effective (course price per month) 🤔 \n\nWhatever I choose it'd have to be online as I can't afford to move and pay tuition 😔",
    "comments": [
        {
            "level": 0,
            "comment": "If you already know painter zbrush maya and unreal even the full game art BS would be a waste, just watch some youtube vids and join an online community and you'll be good to go. Paid classes like cgma are okay but you can be much cheaper and still find education. I recomend 3d fast track discord channel by Dennis porter, it's a dollar a month and the pros there will help you on anything ur trying to learn. I've seen several students go from nothing to AAA pro on that server alone",
            "score": 2,
            "author": "NgonConstruct"
        },
        {
            "level": 0,
            "comment": "I'm close to the end of the Computer Animation program and can say based on my experience it would probably be a waste. Your best bet is to just practice.",
            "score": 1,
            "author": "hardwire666too"
        }
    ]
}