{
    "id": "11vboyn",
    "score": 2,
    "title": "Should I go to Fullsail?",
    "author": "Sparrow5109",
    "date": 1679201351.0,
    "url": "https://www.reddit.com/r/fullsail/comments/11vboyn",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm currently a sophomore in highschool, and I've been dreaming of directing films for a while now. I was planning on actually visiting the school next year, and applying for the film bachelor's course. I'm just scared however that it won't be what I'm expecting? I'm hoping I'll be able to film some things of my own at the school, and make a portfolio for when I leave and hopefully get a job in the industry. I have a couple of key questions:\n\nWhat are you paying for tuition?\n\nHow much time do you spend actually in the classroom, will I be able to work as well as attend the school?\n\nDoes the school help you network for the film industry?\n\nDo you get to work with students in other programs on projects?\n\nThis is all I can think of, thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "I wasn't a film student - i am a show production alumni but i would say school wide it's almost impossible to hold any sort of traditional job due to the class schedules (they changed every 4 weeks when i was there in 2014)\n\n My student loans from full sail are 70K and it's absolutely not necessary to work in the industry to have a degree , i would say most people i work with now never went to college . If i was you i would move to places where there is film hubs ( LA/ NYC/ Atlanta ) and just take entry level roles , find a roommate and and learn from working and networking while on the job.  If i could do it all over i would have gone that route , but if the price tag dosen't scare you off i will say the school gave me a lot of amazing tools and it really is more useful the more you as a student put into your time there ( join clubs, do projects, intern extc.)",
            "score": 7,
            "author": "Glass_Force_2035",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a current show production student, I do agree with not getting a degree unless necessary there are some places that will only hire you if you have a degree or are at least working towards getting one. I came here because I had a high paying job offer that required a degree.",
                    "score": 5,
                    "author": "Velvel_Thorgsen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not a film student but can weigh in.\n\nTuition is $88,000 ish, with a pretty paltry amount of scholarship opportunities unless you're a minority in which case you can get a full ride (that's not meant to be offensive or anything, it's just true).\n\nIn class time is is 2 hours of lecture, twice a week, plus 4 hours of lab time after each lecture. In my more than a year at the school, I've only had one class where I was required to stay for the entirety of the lab and I was only required because the TA for that class was an asshole. If you do your assignments ahead of time you'll only spend four hours per week in class. If you're taking two classes in a month, double that. \n\nRegarding working while enrolled, yeah you'll have time **if** you're a good student. A lot of people say the schedule is too heavy for another job but those are the same people with midtier grades that are struggling to stay on track. If you can get everything done quickly you have plenty of free time. Many of my classmates work regular shift jobs, I'm full-time employed (granted, at my own company) and have been taking contracts on the side to make a little more dough.\n\nThe school will present you with opportunities to network but they won't do it for you. You'll have to go to the events they put on but they do put them on regularly.\n\nYou do work with students in other programs, in fact for my own program it's required multiple times.\n\nIf you've got any other questions please let me know!",
            "score": 6,
            "author": "Tarc_Axiiom",
            "replies": [
                {
                    "level": 1,
                    "comment": "heheh as a minority on a full ride I'm not offended. There's literally no way I'd be attending without it tbh, I am grateful. \n\nWhat I will say is, while my Ohio University full ride was based on my race + grades (Templeton scholarship, established by a black guy I think) what I was told by FSU is that my scholarship is based on my income, which is six feet under.\n\nSo as long as everything I get awarded and loaned from the Feds goes straight to tuition, FSU covers the rest. (Again,,,, income is six feet under, I don't know if they'd award this to someone who is just barely scraping by. I'm not even scraping by, I'm alive by the grace of friends and government assistance.) It works out fine for me because I am terrible with money, so having it all be automated is just a weight off my shoulders.\n\nI'm glad you have enough energy to work while attending, it's really cool that you have your own company! \n\nI simply don't have the capability. I was working for the first four months and could not keep up. I am trying to keep up with returning to school plus intensive therapy to untangle about 2 decades of untreated CPTSD. And I failed a class which will for sure be tacked onto my federal loan debt (c'est la vie)\n\nI think it's relevant to mention bc I didn't fail that class just cause I couldn't get the work done exceptionally. Any assignment I turn in gets 100. I failed because I was going through a depressive episode, out of ADHD meds, and FSU requires a lot of effort on my part to maintain my accomodations, which kind of defeats the purpose of requesting the accommodations lol.\n\nI definitely am not complaining though, just kind of.. pointing out blind spots you might have. I primarily chose FSU for the networking options and the more self directed nature of the programs, but not everyone is able to do so many things at once like you are..",
                    "score": 1,
                    "author": "SL1MECORE"
                }
            ]
        }
    ]
}