{
    "id": "127wjpz",
    "score": 4,
    "title": "Audio Production Launch box",
    "author": "Alexthaanimal",
    "date": 1680291347.0,
    "url": "https://www.reddit.com/r/fullsail/comments/127wjpz",
    "media_urls": [],
    "other_urls": [],
    "postText": "can anyone tell me what plugins come with the audio production launch box. and also Will this degree plan include Protools user Certification or beyond ?",
    "comments": [
        {
            "level": 0,
            "comment": "Also, for future reference, a list of plugins are included in the launchbox section. More detailed information on some of the plugins is included in the software part of the FAQ. I'm unsure if protools certification is included, but Full Sail is listed as an Avid Learning Partner.",
            "score": 3,
            "author": "ANoviceScholar"
        },
        {
            "level": 0,
            "comment": "Yeah, give me 15 minutes to pull up the it support answer I got",
            "score": 2,
            "author": "ANoviceScholar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Message 1:  hope this message finds you well.\n\nFor Pro Tools and Slate, it is a 3 year license and should last for the duration that you are a student, in the event that it expires and you are actively taking classes then please reach out to us. To my understanding, AutoTune should be perpetual.\n\nFor iZotope RX10, I think it may be standard but I am reaching out to our Materials team to confirm this information.\n\nFor slate plugins, it should be ‘All Access Pass’ which to our understanding should be all of their plugins.\n\nMessage 2: We just wanted to follow up with you in regards to the inquiry for iZotope. At this time, our materials team was unable to confirm as it is a new software they are going to be deploying in the upcoming terms so they do not have much information on this.",
                    "score": 2,
                    "author": "ANoviceScholar"
                },
                {
                    "level": 1,
                    "comment": "Thank you. Let me know",
                    "score": 1,
                    "author": "Alexthaanimal"
                }
            ]
        }
    ]
}