{
    "id": "1372r3p",
    "score": 5,
    "title": "Has anyone successfully completed the online digital cinematography course at full sail, if so can you give me some pointers and your experience",
    "author": "Comfortable-Ninja142",
    "date": 1683155401.0,
    "url": "https://www.reddit.com/r/fullsail/comments/1372r3p",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I graduated back in 2020, so I know some things have changed, but not much. I would say overall I had a good experience, but like all online courses, no matter where you attend, you're basically teaching yourself. So be prepared to work on your skills both in and out of class. So if you're a more hands-on on learner that does better alone, then you'll enjoy it. If you need a physical instructor for every lecture, then it is not for you.",
            "score": 4,
            "author": "Gli_tchh",
            "replies": [
                {
                    "level": 1,
                    "comment": "i have a question because i’ve also been looking for someone who completed the course. how are you job wise, did you get any good connections from the program?",
                    "score": 2,
                    "author": "RealOven11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When it comes to jobs, it's based on several factors: location and your overall abilities. Understand that people tend to have expectations that this school will just hand things to you and that isn't the case, so finding a job after graduation is a challenge if you're not staying up to date on your skills and updating your resume, demo reel, etc as things change. \n\nWhen I first graduated, I got a job within six months; however, I live in an area with limited access to this line of work and since then have been laid off and haven't found a job since. I've been doing freelance mostly. \n\nThe best advice I can give you is to take advantage of their mentorship program, attend their mixers for career events, Hall of Fame is a big one, and just connect with your classmates. I've connected with several people, but as I said, it's going to come down to your diligence, especially right now during the Writer's strike, where it'll mess with everyone's job in the industry.",
                            "score": 5,
                            "author": "Gli_tchh"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I completed it in Feb 2021. It was good, not as great as an in person class because you are teaching yourself, I had a lot of health issues pop up so they let me switch around classes. I did not find any jobs and received little to no help in finding jobs. My situation was also a little different because I literally live in a camper and travel the country full time. Lots of jobs pop up in Atlanta and Orlando area.  I had a lot of fun with the course and learned a lot from doing deep dives. I also had great teachers.",
            "score": 1,
            "author": "ExploringTheLiminal"
        }
    ]
}