{
    "id": "2vtaaa",
    "score": 4,
    "title": "Film Degree - is it worth it?",
    "author": "Quackinator100",
    "date": 1423866035.0,
    "url": "https://www.reddit.com/r/fullsail/comments/2vtaaa",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm considering attending Full Sail University in 2016. I would most likely be going there for the bachelor's degree in film. My question, is the degree worth it? To those who have graduated, how difficult has it been for you to find a job relating to your degree? What are the other college alternatives for full sail, if it's not worth it? I'm interested in editing films and TV shows, but less on the side of directing and makeup. I just don't want to enroll and then slowly realize that this isn't a good college, and that I've wasted thousands of dollars.",
    "comments": [
        {
            "level": 0,
            "comment": "If you have doubts the best thing to do is come to a Behind the scenes event. It's free.",
            "score": 2,
            "author": "UrFavSoundTech"
        },
        {
            "level": 0,
            "comment": "There are way better and less expensive film programs around the country. I met so many film kids who could operate a red camera but didn't know very basic stuff. \n\nOther programs you can get what you put in, but the film program was kind of a joke around campus. No one knew what they were doing.",
            "score": 2,
            "author": "AwHellNawFetaCheese"
        },
        {
            "level": 0,
            "comment": "Hi sorry Im so late to the game, this sub is semi-dead and limping along. I have several friends who graduated the film program, to be honest it really varies how successful they are! The key (as you will hear a million times) is NETWORKING. The harder you work, the better you network, the more jobs you volunteer for, the more you impress your peers and professors the better your chances for good jobs are! Most of the people who crash and burn after they graduate, scraped through and learned little or they didn't have a strong work ethic, or they pissed off professors and peers so they didn't get offered gigs to build their resume (yes I currently know of several people doing this right now). Another reason people fail when they graduate is because they have delusions of being an award winning director right from the get go, that is NOT how the film industry works 95% of the time and these kids have no back up plan.\n\n\n\n The good news is you're interested in editing. Editing is amazing for job security, its a difficult job and few people want to do it or can master it nicely. Editing is also a great way to do freelancing work WHILE you're still in school! I have several friends paying bills this way so that they can take out minimal loans.  As with any college, FullSail has its positive and negatives, yes it is very pricey. I decided to go here because of the schools connections, the networking opportunities, and the ability to work with like minded individuals. Some people also really like the state of the art equipment, which is much nicer than any other campus i've toured. So really you'll have to decide what the reasons are that you're most interested in! Hope that helps sorry for the wall of text!! Let me know if you have more questions ",
            "score": 1,
            "author": "Babusaurus"
        }
    ]
}