{
    "id": "3ps0my",
    "score": 1,
    "title": "Some simple questions I would like to know befor I commit. Any feedback will help, thank you.",
    "author": "dustycruton",
    "date": 1445524645.0,
    "url": "https://www.reddit.com/r/fullsail/comments/3ps0my",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello I am looking into possibly starting at full sail in the game arts major, or whatever. There are a couple questions that the administration I feel kind of skirted around when I was on the phone, and was hoping I could get some better feedback here. First off I'm fresh out of the military and would like to know if they actually know how the benifits work or if its somthing I will have to walk them through. Secound, I guess this is more a personal prefrence but is the use of the launchbox Mac an undisputable have to use in order to get through the course. The only other thing i would like to know is the overall experiance or vibe shall you say of the school. Im going to be attending online so the campus life doesnt really matter but im still curiouse on how the staff acts tword the students. Thanks for any help you can provide.",
    "comments": [
        {
            "level": 0,
            "comment": "Fullsail(FS) has many veteran students and will know how to deal with your specific benefits, If i remember correctly most of the veteran finical aid staff are veterans themselves. \n\nThe main reason behind the lunchbox thing is to have everyone be on the same page with hardware and software. I don't know about the software for game art, but for Show Production it was way cheaper to buy the lunchbox then buy each thing separately. \n\nEach degree is different when referring to the staff, in Show Production the staff are all nice and want you to succeed.",
            "score": 1,
            "author": "UrFavSoundTech",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats all I needed to know thank you.",
                    "score": 1,
                    "author": "dustycruton",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Im in my 5th month of game art. The launchbox is well worth the money you get the entire Adobe Cloud, all Microsoft programs, Maya, Zbrush, mudbox. Each of these programs are ~$600 a pop. So it's worth the money. I heard from some game artists who were graduating this month that you don't have to purchase the MacBook and still get the programs but I don't know anything about that. ",
                            "score": 1,
                            "author": "RunningJedi"
                        }
                    ]
                }
            ]
        }
    ]
}