{
    "id": "3t6vsa",
    "score": 1,
    "title": "I'm about to fail an online class. What do I do?",
    "author": "Rangore",
    "date": 1447786407.0,
    "url": "https://www.reddit.com/r/fullsail/comments/3t6vsa",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm currently in the online Game Design program and I'm in the last of my Core 4 classes (English Composition I). Almost everything I've done in the class has been mind-numbing simple. I already know where commas and quotation marks go. So after the first week I started putting stuff off and slacking, resulting in my current predicament.\n\nI'm in my fourth and final week of the class and if I get a 100 on the three remaining assignments, I'll come out with a 57. I've passed all three of my previous classes with at least an A. \n\nWhat will happen if/when I fail this class? Will I have to retake it? Is asking the instructor for extra credit even worth it, or is there nothing they can do? Thanks in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Does that mean I'll be able to retake the class I'm going to fail while I'm taking my next class (two classes at once) so that I won't fall behind, or do you mean something else?",
                    "score": 1,
                    "author": "Rangore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I failed a class also, you will retake it next month, or the month after meaning you will fall behind a month.",
            "score": 1,
            "author": "Onfiiyaah",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is there a possibility of me retaking the class alongside the next one (i.e. two classes at once)? ",
                    "score": 1,
                    "author": "Rangore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't know for sure, but I doubt it. From a school standpoint they won't let you take two if you failed one. But it probably won't hurt to ask.",
                            "score": 1,
                            "author": "Onfiiyaah"
                        }
                    ]
                }
            ]
        }
    ]
}