{
    "id": "4x89x0",
    "score": 1,
    "title": "Would like to hear some opinions from students in the game design or game dev classes",
    "author": "bctopics",
    "date": 1470925941.0,
    "url": "https://www.reddit.com/r/fullsail/comments/4x89x0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'd love to hear some opinions from current students or alumni of these courses. What do you guys think of the school? Worth it? Not worth it? Did you find a RELEVANT job after school?",
    "comments": [
        {
            "level": 0,
            "comment": "Finished Gamedev associates back in 2005. I personally felt it was worth it. I was in the 'game dev' industry for 9 years before going into non game dev work for the last 3. \n\nThe industry has changed so much since I started that I, at this point in time, would not recommend going through with it. Others can chime in, but I see a lot of the game industry dead to what I came out to, a lot of mid size companies doing midsize work. It now seems to be just huge studios left or everything indie. Multiple job boards used to be swarmed with jobs in USA in game dev engineering, nowadays not so much.\n\nAnyway, my 2c; I had a great time and learned a lot. If i was redoing it now, I would stick to a regular uni 4 year for comp sci. Unity / UE4 being the state they are in now, graduate or work in one of those engines while going to school, and work on small indie projects while having an engineering job.",
            "score": 1,
            "author": "ShivalM",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much for your quick answer!\n\nIf you don't mind me asking what exactly do you mean by the state of Unity/UE4 are in now?\n\nAlso, with a computer science degree from a traditional 4 year college do you think I'd have an advantage/disadvantage while looking for a job in game design?",
                    "score": 1,
                    "author": "bctopics",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unity and UE4 are in a great state for many people to take it up and create wonderful things. 10+ years ago, this was not the case; teams hired engine developers in mass to create the exact same thing both do now. Studios still hire engine devs, but definitely not as much as before.\n\nBeing able to do anything technical while in a design role is a huge huge plus. Many times companies will have at least designers do scripting of objects; whether that's in c# (with unity), lua, ue4 script; etc. Knowing how to do your own work is extremely beneficial and moves you, imo to one of the top hiring spots.",
                            "score": 1,
                            "author": "ShivalM"
                        }
                    ]
                }
            ]
        }
    ]
}