{
    "id": "9izs4l",
    "score": 0,
    "title": "One day into my classes and I can already tell this school is outdated.",
    "author": "UselessFailure72",
    "date": 1537940446.0,
    "url": "https://www.reddit.com/r/fullsail/comments/9izs4l",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does Full Sail have any actual intent to help people enter the entertainment industry or do they just want to make money off everyone misfortune enough to apply? I got in after turning in documents late twice and having regrettably terrible high school performance. SCAD, who rightfully didn't reply to my requests seems to be much more interested in those with creative minds and high potential.",
    "comments": [
        {
            "level": 0,
            "comment": "You’re very general. How is it outdated. Why do you feel they only care about those with potential. Why do you think they only care about money. Because you had a bad high school record? I’ve got nothing from this post whatsoever except a random rant on something nobody can help you with unless you go into detail.",
            "score": 5,
            "author": "Valiuncy"
        },
        {
            "level": 0,
            "comment": "It's a for profit school. If you want to give them money they will accept you. Your claim that it's outdated is false. You will work with software and hardware that State colleges just dream or read about using.",
            "score": 4,
            "author": "PartyOnDudes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh really? They primarily focus on Unity instead of Unreal engine. Unity is a pile of shit",
                    "score": 1,
                    "author": "UselessFailure72",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know what courses you're taking, but I'm taking the Game Art courses and I have not used anything other than Unreal 4 in my classes for the engine. Different versions, mind you, as Unreal updates constantly, but Unreal 4 nonetheless.",
                            "score": 5,
                            "author": "Hocata"
                        },
                        {
                            "level": 2,
                            "comment": "Getting caught up on a game engine is your own issue. The programming is more important. Your best bet is to sign up for some online courses (like Udemy, Lynda, etc...) or pick up some books on your own and give it a shot. And just like Full Sail you get out what you put into it. ",
                            "score": 3,
                            "author": "PartyOnDudes"
                        },
                        {
                            "level": 2,
                            "comment": "Perspective is important. A pile of shit in which world and for which purpose? I work in corporate learning and design and Unity is used for developing AR learning activities which are considered cutting edge. I can't speak to it's use in other industries, but can confidently say it's still a desired skill that is sought after by high profile employers for specific purposes.",
                            "score": 1,
                            "author": "learningprof24"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know how you got that from it, I'm upset because the school is outdated and old-fashioned. What I said about them accepting me gives me the impression that they just want to get as much money as possible by letting in as many people as possible, including idiots like me. SCAD on the other hand seems to care more about education as they don't just let in as many people as possible",
                    "score": 2,
                    "author": "UselessFailure72"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The degree is there to teach you principles, not tools.\nYou are not learning Unity, you are learning programming, designing, etc.\n\nA tool is just a tool. If you dedicate yourself you can make awesome games with any tools (or no tools at all).",
            "score": 2,
            "author": "hectorcastelli",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly, I'm just now getting past the prep classes and am into Design Tools and one of the first things the optional reading says is it's pointless to focus on learning the tools, because you will have to learn different tools and such all the time.  Instead they focus on teaching you how to learn different tools quickly.  Like others said in this topic it's all about what you put into it, the more you try the better the results you will get.",
                    "score": 2,
                    "author": "Abbhrsn"
                }
            ]
        }
    ]
}