{
    "id": "a1bb9y",
    "score": 3,
    "title": "Hello! I’m applying to Fullsail for the online Graphic Design program and I had some questions!",
    "author": "the-big-spicy",
    "date": 1543445279.0,
    "url": "https://www.reddit.com/r/fullsail/comments/a1bb9y",
    "media_urls": [],
    "other_urls": [],
    "postText": "This January I’m already going to have my adobe associate’s certification, so I was hoping there won’t be another certification test? Or atleast if so, possibility to get a higher certification?\nI also wanted to know some thoughts on what people thought about the classes and fullsail in general. \nI graduate 2019 and I’m planning on starting in September. \nI know I’ve heard that time management would be a bigger issue, but how many hours do you usually spend either doing classwork or while attending the classes themselves?\nI already know I’m probably going to be paying it off for quite some time even with financial aid.\nIf anyone knows any scholarships that’d be awesome too.\nBut I do think its really cool that they send you the mac with all the stuff you need, and financial aid for me is atleast going to be able to pay for that all.\nAnd since I’m such a hermit the thought of being huddled up in my room all day on the computer sounds grrrreat.\nAnyways any answers or comments would be super. :D",
    "comments": [
        {
            "level": 0,
            "comment": "I am currently attending through the online program for Game Design. The school is great from what I have seen, I am currently in month 11. As far as how much work is put in, I can’t really tell you about other programs but I know in my program, it started out easy around 10-15 hours a week, to know I am putting in over 30-40 hours a week in between lectures and assignments. It is basically the same as having a full time job. Just remember the more work you put in the more you get out of the school.",
            "score": 5,
            "author": "cloudstrife1023"
        },
        {
            "level": 0,
            "comment": "I’m pushing through month 4. I honestly do all of my assignments in 1 day but it’s not advisable. ",
            "score": 1,
            "author": "dquanb",
            "replies": [
                {
                    "level": 1,
                    "comment": "That drastically changes once you hit about the 6 month point. I remember how easy my first four to five classes were. You could do your week of work in a night, if not a couple hours. Be prepared to get kicked in the shins with a greater workload soon. Not saying it's a bad thing, but just be prepared.\n\nMind you, there are a few easy classes sprinkled in, but the school tends to pile those easy classes on top of a class that needs time put into it as well, essentially taking two classes at once.",
                    "score": 2,
                    "author": "Hocata",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How much time do I have doc? I’m at month 4 and I’m not prepared for DBH (death by homework)",
                            "score": 1,
                            "author": "dquanb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Depends on the degree, really. I take Game Art online, got about a month and half until I graduate, and the last year and a half has been torturous with the workload. I would say look at your upcoming classes and expect hell on your first core class.",
                                    "score": 2,
                                    "author": "Hocata",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm in game art, just finishing up Fundamentals 1 (so thats my 5th or 6th class I think? I skipped a few so I'm not sure, but I took 3DF already) and I don't think it's too bad yet. Do you work that makes it hard for you?",
                                            "score": 1,
                                            "author": "DestinyPvEGal",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I do work full time as well, so that could have a major impact on that.",
                                                    "score": 1,
                                                    "author": "Hocata",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ah ok, yeah I can imagine that being a lot harder. Im lucky enough to be able to focus entirely on school so best of luck to you in your final months and congrats on getting so far!",
                                                            "score": 2,
                                                            "author": "DestinyPvEGal"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}