{
    "id": "id06sz",
    "score": 3,
    "title": "Wanting to go to fullsail.",
    "author": "scloud670",
    "date": 1597883952.0,
    "url": "https://www.reddit.com/r/fullsail/comments/id06sz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've (26M) been wanting to go to fullsail since I was a little kid but since my life hasnt been the best case scenario and i have had to postpone my life to work and pay bills.  I am close to paying off my car and am going to move in a few months but I would really love trying to find a way to get to my dream school. If anyone has any wisdom to bestow on me I would be so grateful.",
    "comments": [
        {
            "level": 0,
            "comment": "What is your dream path? Music, art, gaming, business? \n\nI have a daughter almost finished with the computer animation path. We have friends in the  film path. What are your goals?",
            "score": 3,
            "author": "pastdancer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Computer animation. I've been in love with Pixar since I was a kid and I owe it to myself to get there",
                    "score": 2,
                    "author": "scloud670",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awesome! I can put you in touch with students on that path at Full Sail if you want. DM me with your contact info if you’d like.",
                            "score": 1,
                            "author": "pastdancer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "All I did was give them a call and I started a month later. They walked me through everything. They accept anyone who finished high school or has a GED. Feel free to ask me any questions!",
            "score": 1,
            "author": "almndangel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is there any tricks on getting a student loan? My credit was killed bc my parents put medical Bill's on me without telling me first and it killed my credit but I was able to build it back up to a pretty good number.",
                    "score": 1,
                    "author": "scloud670",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely do the FAFSA! You’re over 24 so you don’t have to use your parents information. So far I’m paying for school strictly through government aid and grants. I haven’t had to apply for any private loans so no credit checks.",
                            "score": 4,
                            "author": "almndangel"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also has it been worth it to u?",
                    "score": 1,
                    "author": "scloud670",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is where it gets tricky because it’s different for everyone. If you really apply yourself and truly want to get the most out of the classes it’s totally worth it. They really push networking and give you all the help they can to get your career started. A lot of people don’t take the help though, and those are typically the people that don’t think it’s worth it. \n\nResearch your anticipated degree and really look into jobs in that field. Make sure to look at how many require a degree to really see if it’s a good choice for you. I’m going for Graphic Design and although there are designers without a degree for corporate jobs it’s usually a requirement.",
                            "score": 5,
                            "author": "almndangel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly! People don’t take the free resources given to them. They get by with a score of 60, autonomously rolling by their whole semesters without even consciously engaging in their studies then they go ahead and complain they’re the victims.",
                                    "score": 1,
                                    "author": "Cat_Tits_Bacon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I basically ended up between these folks and the people who took it as seriously as you need to. Those folks have worked incredible gigs- I don't see a lot who do long stints but their resumes look very good.\n\nThe other end of the spectrum, those are the kids that went home, and maybe got a job in that field.\n\nI've been lucky to work in-field or near-field for about eight or so years at four different companies. I make decent money but could always be making more. I don't regret going, but I regret trying to sandwich a \"college experience\" in there, but did meet the love of my life so ayyy.",
                                            "score": 2,
                                            "author": "CrrntryGrntlrmrn"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dude, they teach some pretty good stuff there. I’m in it for the game design bachelors, and all my classes are fun. You have to put your effort tho, you get what you put, you need to strive for 110% to really squeeze out all the juice, you have to look around, become involved, and most importantly be yourself, only then will it truly matter. FullSail has the project launch box, you should check it out. Join clubs and engage with your peers. What is so amazing about it is that your degree program is inter correlated with other programs, so that means you’ll get to work on a project together with someone with a completely different degree, it’s this core element that makes FullSail so engaging.",
                            "score": 1,
                            "author": "Cat_Tits_Bacon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What do you want to do?",
            "score": 1,
            "author": "spidysweb87"
        },
        {
            "level": 0,
            "comment": "I just got through the whole admissions process and backed out last minute. Just be prepared for the price.  As great and modern as their program looked I couldn’t justify the debt right now and am going with another school for the time being. \nWhen I applied I was told if I apply for fasfa and was rewarded the full amount I would most likely be eligible for the Momentum Schlorship which is 25k to a bachelors. What I didn’t realize is your have to fully exhaust all awarded fasfa in order to quality for the 25k. Example I got awarded full pell grant and 9k in Stafford Loans. In order for me to qualify for the scholarship I would have to max out the Stafford loans. And even after that with the scholarship I’d have to pull out an additional $8k+ in loans from else where. Obviously I don’t know your finances so maybe it’s not an issue for you but just incase that would be my only warning is prepare for 17k+ in debt (that was for a bachelors in graphic design btw) \nBest of luck!!",
            "score": 1,
            "author": "jgizzlefosho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. Yeah the main problem is going to b the monetary part of it. Especially now during the pandemic going on working has been a nightmare.",
                    "score": 1,
                    "author": "scloud670",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes if you have the means to float yourself, great time to do the less fast track if they still offer that",
                            "score": 1,
                            "author": "CrrntryGrntlrmrn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If money is an issue I would look elsewhere. The programs cost well over 100 grand with interest and the student loan payments are around $1,000 a month if you are purely paying with loans.",
            "score": 1,
            "author": "TunaPouch311",
            "replies": [
                {
                    "level": 1,
                    "comment": "Downvote me LOL, I graduated from computer animation 10 years ago... I'm the exact person they won't let you talk to LOL",
                    "score": 2,
                    "author": "TunaPouch311"
                },
                {
                    "level": 1,
                    "comment": "1000 bucks a month? You got f’d my friend. You should have just bought a Ferrari and lived in it for the rest of your life. And how do you get the 100k number? I’m going to full Sail currently and my program is a totally of around 50k for a bachelors degree. Most university’s cost more than that per year. Sooooo wtf happend man?",
                    "score": 2,
                    "author": "PoopAndPee13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're not including interest on the loans. Trust me if I had any idea what I would be paying back in student loans I would have never went to the school. They don't tell you these things until after you graduate.",
                            "score": 1,
                            "author": "TunaPouch311",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Man dude. In all seriousness I’m sorry to hear that. I know there are ways you can lower student debit....can your refi student loans?",
                                    "score": 1,
                                    "author": "PoopAndPee13"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}