{
    "id": "io8hhh",
    "score": 4,
    "title": "Tuition",
    "author": "[deleted]",
    "date": 1599489234.0,
    "url": "https://www.reddit.com/r/fullsail/comments/io8hhh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just looking to get clarification on tuition. I spoke with the admissions person yesterday and she said in total the tuition for the degree (cyber security B.S)would be 25k.\n\nis That true? Because the videos I watch it comments I see people saying over 50-60k.",
    "comments": [
        {
            "level": 0,
            "comment": "Not sure about cyber security, but it’s muuuch higher for computer animation.",
            "score": 5,
            "author": "pastdancer"
        },
        {
            "level": 0,
            "comment": "It depends on the degree. I’m in computer animation and it’s 50-60k if not a little more.",
            "score": 2,
            "author": "TallWithSmallPackage"
        },
        {
            "level": 0,
            "comment": "For my Audio Production BSc it’s $60,000",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The tuition is public and available here: https://www.fullsail.edu/admissions/tuition",
            "score": 2,
            "author": "shadeofmyheart"
        },
        {
            "level": 0,
            "comment": "I am in Computer Science Online and including my LaunchBox, my tuition is $56,000",
            "score": 2,
            "author": "zculp4579"
        },
        {
            "level": 0,
            "comment": "Unless they are figuring in your momentum scholarship and saying you will $25k additional (which is still and under estimation) that’s a total lie. Expect to be closer to $55-60k. Are you maybe transferring in some credits?  That could bring it down quite a bit",
            "score": 1,
            "author": "RB3910"
        },
        {
            "level": 0,
            "comment": "I’m also figuring in living expenses in Winter Park. If you’re doing online only it may be more affordable.",
            "score": 1,
            "author": "pastdancer"
        },
        {
            "level": 0,
            "comment": "Apparently \"with scholarships and grants\" IF you qualify/win them, you will only owe 25k.  I looked it up as well and you are correct.  50-60k.  Also has questionable accreditation, so I dodged.",
            "score": 1,
            "author": "pancakeman2018"
        }
    ]
}