{
    "id": "jatcxw",
    "score": 6,
    "title": "So what can I expect from taking the Orientation?",
    "author": "Vurondotron",
    "date": 1602647585.0,
    "url": "https://www.reddit.com/r/fullsail/comments/jatcxw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Like it says, I just want to know what to expect from the test? What type of questions would it have? (I’m not looking for answers I just want to know what to expect)",
    "comments": [
        {
            "level": 0,
            "comment": "If I remember correctly, it’s mostly just info videos and stuff.  They teach you how to use the online platform.  They give you access to Microsoft office and have you make and upload a few mock word documents",
            "score": 2,
            "author": "Girafarigno",
            "replies": [
                {
                    "level": 1,
                    "comment": "Does it depend on what course your taking cause I’m doing Media Communications B.S or is the test just the basics of what you just explained?",
                    "score": 1,
                    "author": "Vurondotron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it’s the same for everyone.  I am computer animation and there was nothing related to the program specifically",
                            "score": 3,
                            "author": "Girafarigno",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just want to get the basis of it so I can prepare",
                                    "score": 1,
                                    "author": "Vurondotron"
                                },
                                {
                                    "level": 3,
                                    "comment": "So what’s the orientation test for exactly, is it to test out what you been reading and watching to see if you paid attention to everything you read/watch?",
                                    "score": 1,
                                    "author": "Vurondotron",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, I wouldn’t even really call it a test.  It’s all information for you.  Pay as much attention as you’d like.  Make sure you give yourself a good amount of time to get through it",
                                            "score": 1,
                                            "author": "Girafarigno",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ahh okay I understand, it’s a test to see what you know about what they are and how to do things. That doesn’t seem that bad. I mean it’s something you have to pay attention to especially because it’s something useful you need. X",
                                                    "score": 0,
                                                    "author": "Vurondotron",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, it’s definitely nothing to stress about.  But, like I said, make sure you give yourself time to go through it all.  I definitely remember it taking much longer than I expected.",
                                                            "score": 2,
                                                            "author": "Girafarigno",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah I did some of the stuff it’s pretty long and it’s not hard because it’s just stuff to get yourself knowledge on what’s available and how to do things with assignments and access resources.",
                                                                    "score": 1,
                                                                    "author": "Vurondotron",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well, cool man.  Getting an education is a very cool thing.  Promise me that you will be serious and stick to it.  Our nation has a high lack of education.  Learn everything you can to your best ability",
                                                                            "score": 2,
                                                                            "author": "Girafarigno",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Ohh I will, it’s something that I always wanted to do and whenever I tried I had roadblocks in the way. So I’m super excited to finally be able to do this and thank you!",
                                                                                    "score": 1,
                                                                                    "author": "Vurondotron"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even though I’m going for mobile development do I have to take the test?",
            "score": 2,
            "author": "redruhm23",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah it’s really simple, it just wants to make sure you under their code of conduct and teaches you a couple things. If you want to remember just keep some tabs open to go over some things that you may forget. I got an 86% on it. Don’t worry it’s simple to get past and just pay close attention to everything you read and watch. You have to pass with a 70 and if you don’t you get one more chance to retake it.",
                    "score": 2,
                    "author": "Vurondotron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So meaning that I would have to take this test, would I need a laptop or tablet because I only have my iPhone",
                            "score": 1,
                            "author": "redruhm23",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I did it on my Tablet. You can also do it on your phone too",
                                    "score": 2,
                                    "author": "Vurondotron",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ok so you go to full sail?",
                                            "score": 2,
                                            "author": "redruhm23",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I go to Full Sail I start in a week",
                                                    "score": 2,
                                                    "author": "Vurondotron",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m going to start on the 26th",
                                                            "score": 2,
                                                            "author": "redruhm23",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Same I start the 26th.",
                                                                    "score": 1,
                                                                    "author": "Vurondotron"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You go on campus or online ?",
                                                            "score": 1,
                                                            "author": "redruhm23"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Online?",
            "score": 1,
            "author": "redruhm23",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I’m doing online. I’m trying to debate if I should wait till they give me the PC themselves or just stick with my tablet and get a keyboard for it. I don’t have a PC.",
                    "score": 1,
                    "author": "Vurondotron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hope we get the iPad because I only have my phone",
                            "score": 1,
                            "author": "redruhm23",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We do but I think we get after semester 1. So I would suggest in two things, call the school to see what options they give you or invest into a cheap tablet or PC like a chrome book. Because I’m sure you don’t want to write out essays or research papers on a iPhone. I’m still debating on what to do or get.",
                                    "score": 1,
                                    "author": "Vurondotron",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well my dreams just got crush don’t have 3,000",
                                            "score": 1,
                                            "author": "redruhm23",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "From what they told me, we'll get the iPad after the first month. The rest of the launchbox will come after fully completing the first four months.\n\nI don't know how covid has affected things around you, but you could always try the computers labs at a local library if they're open?",
                                                    "score": 1,
                                                    "author": "MonstrousQuinn"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "what is a passing score for the ort test",
            "score": 1,
            "author": "SnooJokes3223"
        }
    ]
}