{
    "id": "jb2qhl",
    "score": 6,
    "title": "Getting ready for film",
    "author": "NickNickNameName",
    "date": 1602689050.0,
    "url": "https://www.reddit.com/r/fullsail/comments/jb2qhl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, \n\nI’m 19 years old and I’m moving to Florida from PA (with my GF) next year for full sail. I love creativity and film and have a good work ethic so I think I can do well here. \n\nI just wanted to ask just to know what to expect and what I should do to get ready? Should there be things I should do in this year to get prepared for full sail to maybe get a head of the curve?, what has your experience been like? And what should I expect on my day to day at full sail? \n\nI want to be able to know what to expect and what everything is like at full sail, I took the tour a year ago and it looked really cool. I’m going to full sail because film and cameras are the one thing I’ve always been passionate about and the thing I haven’t lost interest in. I could’ve went to a traditional college but I rather do something ill be happy/driven for. \n\nThe only other question I could think of is what is life like after full sail? \n\nThank you",
    "comments": [
        {
            "level": 0,
            "comment": "Creative Writing Grad here: Start networking as soon as you hit the ground in your first month. Make friends in those first few classes, especially with the writers, as you’ll find that your scripts will need second opinions. \n\nSecondly, start job hunting as soon as you’ve gotten an idea of what it is you want to do. It’ll take you a few months to actually secure a job so be ready for that search. In the meantime, I’d recommend joining one of the departments on site to build up some cash so you can relocate afterwards. Not sure if they’re doing this, but the Behind the Scenes tour is a fairly easy job. One 16-hour day a month where you only really work 4-6 hours in the day. The head of that tour, Travis, is a really nice guy and you’ll like him. Working there is a great opportunity to network with students from other programs as well (when we aren’t sleeping in the break room anyways). \n\nAlso, go to Viet-Nomz just down the street to the East. The Pho is amazing.",
            "score": 2,
            "author": "Calum1219",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm about to move out there myself in a couple of months also. Thanks for the advice",
                    "score": 2,
                    "author": "Sku11socket",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Happy to help. I’d also recommend the UX Labs game tests as well where you go in for video game play tests for around one or two hours. I think they’re doing them mostly virtually, at least from what I’ve done but they have done tests in person before ‘rona showed up. Most of the stuff they work with is *very* pre-alpha to the point of just being blocks and signs at worst. There are a few gems in there but be prepared to break out of your usual game types.",
                            "score": 1,
                            "author": "Calum1219"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can I be honest? Don't waste your time or money. I went into the film program back in 1995. I'm older and wiser now, and I can see the error of my ways when I was 18 years old.  Unless your parents have the money for you to fork over for school DO NOT take on this level of debt!\n\nFirst off, it is not an accredited school and it is WAY over priced. This is not a true film school. UCLA is a true film school, where you can leave with some contacts. There is nothing you are going to learn here that you can't learn online at this point. Placement after you graduate is non-existent, and I would say only 10% of those I graduated still work in the industry in some way. Most do not, including myself. Additionally, the field of film work has way too many unemployed people. There simply aren't enough jobs to go around. It is incredibly hard to break into, and when you do, the hours are long, the people are horrible and the pay is often shit.\n\nDon't get overly enamored with Full Sail's cool toys. First off, technology is ever changing, so whatever you work on there, will be obsolete in a couple years. Also, you don't get that much hands on time with the cool toys anyway.\n\nSorry, but these are just the facts. I say this as a person who has been there, done that! I really wish there were forums like Reddit around when I was looking at colleges. I went into it blindly and learned the hard way.",
            "score": 1,
            "author": "melh22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dude, if all you've got going for you is shit-posting hate for the school that you attended in 1995, I encourage you to re-consider why you graduated top of your class but couldn't find a job. Sounds like you were a hot-headed jackass that expected studios to be begging to hire you.",
                    "score": 3,
                    "author": "FlipTheNormals",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hah! Not even a little bit. I got a job at a post-production house. I was not a hot-head at all. In fact, I'm a very level headed woman who worked very hard making shit wages at that post production house. After working there for several months and talking to numerous people who worked in the industry (through my connections at the post house), I opted to go back to college and get a degree in computer science. I probably could have continued working in it, but to be honest, the pay was never going to be substantial. My first sign-on bonus after leaving college and working for a software company was more than I worked at that post production house for a year! I knew I made the right decision.",
                            "score": 1,
                            "author": "melh22"
                        },
                        {
                            "level": 2,
                            "comment": "Only way to goto fullsail is join the military 1st I know 5 people who did, not only did it prepare them for fullsail insane life style well they are the only fs grads I know that arnt in debt since they protected our county in the early 2000s",
                            "score": 1,
                            "author": "Y_up-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's still occurring, it's not exclusive to military personnel that served in the early 2000s. It's the Post  9/11 GI bill. I finished serving a year ago and am on-campus, most everything paid for.",
                                    "score": 1,
                                    "author": "FlipTheNormals",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s awesome, biggest regret in my life is not serving, I’m 40 now so that shipped sailed. I went to fullsail and graduated.",
                                            "score": 1,
                                            "author": "Y_up-"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’d recommend to these young kids to consider their credit score. The debt to income ratio haunts me to this day. I’m still 80k in the hole. Fullsail in the 90s and early 2000s were the real deal but horribly expensive. Youth these days think you need an fancy paper to get and job, but fail to forget then student debt it real and will destroy their lives unless if the somehow manage to make an huge living. Then again you have crazy people who think that politicians will cancel their debt. Good luck convincing sali Mae and Navient. Private loans are an complete pain in the ass. I had one tell me that even if I live in an tent under an over pass they debt will remain. This is the real world, first job out was Walmart before I managed getting into the industry. I’m still broke",
                    "score": 1,
                    "author": "Y_up-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The amount debt these kids are taking on now is UNREAL! Seriously scary stuff, and I don't think they have a clue. My family had no money to put me through school, so I took out that $18K loan when I was 18 years old. Now, that seems like nothing, but at the time I was seriously stressing over it. Fortunately, I went back to college and worked a job while I attended, so I did not acquire any new debt. When I graduated, I paid off my Full Sail debt with my sign-on bonus for my first job (software engineering job). Pretty stark difference from what the salaries were for the jobs I was coming out of Full Sail. Thank God I made a career change!",
                            "score": 1,
                            "author": "melh22",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People need to understand that most art related jobs don’t pay huge money when your fresh out of school. Esp in the San Fran Cisco or Hollywood areas where rent and cost of living are insane",
                                    "score": 1,
                                    "author": "Y_up-"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A good article for you to read: [https://www.nytimes.com/2015/04/12/education/edlife/film-school-for-profit-or-not.html](https://www.nytimes.com/2015/04/12/education/edlife/film-school-for-profit-or-not.html)",
            "score": 1,
            "author": "melh22"
        },
        {
            "level": 0,
            "comment": "Good luck having an girlfriend at fullsail. My room mate had an bf lord only knows how they made it. Friend got divorced there. I’d be real this school isn’t relationship friendly. I barely had time to sleep and bathe couldn’t imagine being in an relationship",
            "score": 1,
            "author": "Y_up-"
        }
    ]
}