{
    "id": "ld0qnz",
    "score": 6,
    "title": "Game art vs computer animation",
    "author": "cutiee314",
    "date": 1612504478.0,
    "url": "https://www.reddit.com/r/fullsail/comments/ld0qnz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I like to draw and paint characters and have always seen myself as a comic style artist and I'm going to school for graphic design because I figured it was good overall knowledge to make myself marketable but I have been thinking that with full sails hefty price tag I would be cheating myself if I wasn't true to my art, and I've been debating between the  game art and the computer animation degrees. If possible, I think I'd like to work for smaller,  independent studios more then big ones, and freelance if I could swing it, and would enjoy working on either games or cartoons a lot. Which industry is more fun? There seems to be a high demand for animators everywhere and a lot of the artists that I follow online have degrees in animation, but game art inspires me and I like the idea of solving projects and creating world's as a concept artist. \n\nI'm taking the online course, because I need to be able to work and support myself while I complete school, and I'm going on my 3rd month, and I know all the downsides and even agree with them, but I love school and I love learning and creating, and I've tried for years to go it alone and I'm so scattered and need the push, and I'm really excited to be here, so don't try to scare me away with horror stories please ☺️\n\nAlso, I really want to network and make some art friends. Is anyone else hanging around that's pretty new to this too and also wants that?\n\n Thanks guys!",
    "comments": [
        {
            "level": 0,
            "comment": "Game art grad working in the industry here-  \nYou have a lot of interests here, (concept/animation/world building/comic illustration/ cartoons) this is a ton of different fields all with specialized skill sets that dont overlap as much as you would think aside from being artsy.  \nI would encourage you to look deep into what each career would actually entail for day to day life and figure out what you would be best at. All i can say for certain is that you didnt specifically mention graphic design as an interest, and thats a bad thing for someone in a graphics design major. So changing degrees may be a good idea.  \nI can at least give you a little info on the game art and animation programs. Obviously the game art program focuses heavily on art for games, and that means there is a lot of technical stuff to learn about game engines, model creation, and all of the stuff that isnt actually art that game artists have to do. As a working game artist, i can say for certain that half of our time is spent doing things that arent inherently creative but purely technical.  \nThe computer animation degree focuses heavily on animation instead of model making, and the model making you do in the program is slanted toward cinema quality work thats incompatible with video game tech to some degree. both of the programs have a fair amount of technical content that isnt art, but when it comes to the art the animation degree has a lot more animation classes, and the game art degree has a lot more modeling/sculpting classes. So deciding if you want to make 3d models or animate 3d models is the big decider between the two programs.  \nAs far as which industry is more fun, its a bit of a biased opinion, but from what ive heard with friends throughout the game industry and the cinematic and concept worlds, game artists of all forms have the best pay, the best work/life balance, and the best studio culture. But again, a bit biased because i havent ever personally worked outside games, nor have i been to a wide variety of studios to know for sure.",
            "score": 4,
            "author": "NgonConstruct",
            "replies": [
                {
                    "level": 1,
                    "comment": "This an exceptionally awesome reply.. Plus, both of our usernames are cheesy. Listen to this person, OP! :)",
                    "score": 2,
                    "author": "FlipTheNormals"
                },
                {
                    "level": 1,
                    "comment": "Thank you so much for your response! I think I picked graphic design mostly out of marketability, and I'm doing myself a disservice if I'm not honest about that, but freedom to work remotely, or at least not be restricted to LA is really important to me. I have 2 kids and it's already scary enough to change industries and probably definitely have to move to a bigger city. It's a lot to juggle.\n\n I feel like if I go into game art, I'll be greatly restricting myself to only living in a few big cities with major studios, whereas if I go into animation, if I'm not into the studio jobs, I could still carve out a freelance career as a motion designer. Do you feel like there's freelance opportunities in games?",
                    "score": 1,
                    "author": "cutiee314",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its true that most studio gigs for games are in LA, im unfortunately trapped in this hell hole of a city, but there are plenty of ways to work in games wherever you are, lots of art houses that are full remote, some indies are full remote, and some studios post covid are much more open to remote workers joining the team.\nJust be true to your interests and itll be easier to put the time in necessary to succeed.",
                            "score": 2,
                            "author": "NgonConstruct"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stay away from FSU. There isn’t an actual learning structure, so unless you are familiar with how the programs work before hand, you are SOL.",
            "score": 1,
            "author": "CryptographerOwn9183"
        }
    ]
}