{
    "id": "na1ul2",
    "score": 11,
    "title": "Just applied to Full Sail! Currently working, hype though! Anyone else enrolling for this upcoming semester and want to network/ chat? Instagram is dopesmoked420",
    "author": "dasdope420",
    "date": 1620752624.0,
    "url": "https://www.reddit.com/r/fullsail/comments/na1ul2",
    "media_urls": [
        "https://i.redd.it/skdniwi4wiy61.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Congratulations! I'm already a student in the Sim Vis program, but networking is always helpful",
            "score": 2,
            "author": "CrunchyMarshmallows"
        },
        {
            "level": 0,
            "comment": "I'm supposed to be starting Game Development at the end of the month, good luck to you.",
            "score": 2,
            "author": "Jacksbane988",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I'm starting in development for my associates and then going back for my Bachelors or masters in game design. Good luck! Did you look into Armada?",
                    "score": 1,
                    "author": "dasdope420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not sure what you mean?",
                            "score": 2,
                            "author": "Jacksbane988",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Take a Google on it. It's a community that's at Full Sail. They do a lot of LAN tournaments and collegiate gaming. I talked to an alumni and he said it defined his college experience. Thats enough for me to be intrigued",
                                    "score": 1,
                                    "author": "dasdope420"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah they went over it in the vbts tour, unfortunately they dont take remote students on the team XD",
            "score": 2,
            "author": "Jacksbane988",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your doing your degree online? &amp; yeah I was in the vbts tour, I'm in the breakout session now for game design and development. You should move to Florida and get the real experience!",
                    "score": 1,
                    "author": "dasdope420"
                },
                {
                    "level": 1,
                    "comment": "Thats what I'm doing. It's going to be worth the while",
                    "score": 1,
                    "author": "dasdope420"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cant, got a family and a life up here in Michigan... long way to commute lol.",
            "score": 2,
            "author": "Jacksbane988",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats unfortunate..well I'm working on trying to change that. Could be a project. Linking people over states as a team to perform in the same LAN party / tournament. Does that appeal to you? I'm not smart or skilled enough yet to do so, but it could be something long term to work towards",
                    "score": 1,
                    "author": "dasdope420"
                }
            ]
        },
        {
            "level": 0,
            "comment": "jus enrolled too! im excited no matter what haters say. .\ngetting my Masters in Film",
            "score": 2,
            "author": "SirChinkAlot",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's awesome! I'm here now, this is my first week of classes. So far so good! You'll love it here. Are you taking classes online or coming to campus?",
                    "score": 1,
                    "author": "dasdope420"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice. What program are you going for?",
            "score": 1,
            "author": "seeker485",
            "replies": [
                {
                    "level": 1,
                    "comment": "Game Design. I heard it's better to start in development so you can learn to code, but I'm very interested in the design aspect and coding might take me a little to understand. I'm doing my homework on Java throughout this week. What about you?",
                    "score": 1,
                    "author": "dasdope420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Game dev. Ive got some experience with game development engines and coding. Have fun at school",
                            "score": 2,
                            "author": "seeker485"
                        },
                        {
                            "level": 2,
                            "comment": "I'd switch to game dev if you can pass the entry test. There's vastly a greater demand for the skills you'll get out of that program vs. game design and you can always pickup game design on your own along the way and after.",
                            "score": 2,
                            "author": "kittysparkles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Truth. I'm don't know much about coding. I've been watching some stuff on Java the past couple days, I don't understand much until I can implement it",
                                    "score": 1,
                                    "author": "dasdope420",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, it's like learning a regular language...you're going to learn faster when you're actually using it. I'd keep doing free tutorials online. If you think it's something you're starting to pickup alright, then maybe switch over if you can.  Engineers are needed badly in many different industries. Your skills will transfer outside of just game development too.",
                                            "score": 2,
                                            "author": "kittysparkles",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you for the advice. I will keep doing my Java lesson tutorials &amp; I can agree with engineers being needed. Many new projects coming out that need a solid team to follow through. Looks like game development first, then game design for me!",
                                                    "score": 1,
                                                    "author": "dasdope420"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now I was kinda told your supposed to get your associates in game development, then head over to game design for the Bachelors and masters. Would you  agree with that?",
            "score": 1,
            "author": "dasdope420"
        },
        {
            "level": 0,
            "comment": "Networking is always helpful, can't do enough of it.",
            "score": 1,
            "author": "dasdope420"
        },
        {
            "level": 0,
            "comment": "I mean I have no qualms about playing online, they just wont let me play for the team lol",
            "score": 1,
            "author": "Jacksbane988"
        }
    ]
}