{
    "id": "otgi5x",
    "score": 4,
    "title": "Looking for feedback on BS Game development/design and masters in game design",
    "author": "FoulSpud",
    "date": 1627498770.0,
    "url": "https://www.reddit.com/r/fullsail/comments/otgi5x",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am thinking about attending Full Sail and pursuing the game development degree with possibly going into the design master’s. I have seen allot of good and bad reviews about the programs. then there’s princeton review saying full sail is one of the best schools for this field.  I would like to know from any current and recent student’s what your thoughts are during or after taking the  bs game development, bs design, and game design master’s. I plan to take the online version of the courses due to work. I currently work 8-5p M-F so it seems like online is the right move for me because i’ve read on the full sail website taking the on campus course takes around 40 hours a week of schooling where the online is around 17 hours a week. Please enlighten me if these quoted numbers are off. \n\nI currently do not have any art or programming background experience or game design/development experience at all. \n\nI am not worried about getting a job right after graduating because i have a good job right now as a senior tech support engineer for a large SaaS provider but I eventually want to pursue a game development career.  I just want to gather the knowledge necessary to make my own game at first then maybe work for a company in this field afterwards. \n\nLooking into this more is getting me excited about this field because it’s always something i wanted to do since i was a kid but i’m worried about not being creative enough. i don’t draw along with not being an artistic person which is why i want to do development as well. Do i need to be able to make art with any of these degrees? If yes were you like me? A more technical non artistic person wanting to get into this field? if so i would definitely like to hear from you as well. \n\nThe point of this post is to hear from anyone who has taken these degrees. what their thoughts were before, during, and after taking the degree. \n\nThanks to anyone who answers this post!",
    "comments": [
        {
            "level": 0,
            "comment": "Same here I’m going to full sail august 30th and I don’t have no experience at all in computer animation but I’m determined to learn and make something out of it… I wonder what the schedule is like for full sail online",
            "score": 1,
            "author": "Conscious_Work_1764"
        },
        {
            "level": 0,
            "comment": "So, I can't exactly speak to the Game Dev/Design student side of it, but I can give you some insight into the first year of the program in general.\n\nI am a Computer Science student at Full Sail, attending Online. Our curriculum is the exact same as the Game Dev students for about the first 12 months. \n\nFirst, the hourly commitment you stated is wrong. There are some classes that the weekly assignments took me less than 6 hours to do the whole week. The more technical classes, the time required is almost equal to a second 40 hour work week. This school is a full time commitment, whether you are online or on campus. They demand you devote a large amount of time to their program.\n\nSecond, as you stated that you don't have any programming experience, I would immediately start learning C#/C++. Those are the only 2 languages you will use the first year. After that, I'm not sure what they teach. However, I do know they focus heavy on the Unreal Engine, which scripts in C++. They start you at the basic, but it is a quick ramp up and you will spend some nights digging in the Microsoft Documentations for a method or an explanation, so familiarizing yourself with it early is a huge advantage.\n\nThird, what does your math proficiency look like? There is an entrance exam into the Game Dev/Sim Vis/Comp Sci programs. It covers everything from basic algebra to calc/trig. If you have a middle of the row score, they will put you into a Pre-Calc and a Calculus during Months 2 and 3 respectively.\n\nI can answer more direct questions if you have them, let me know.",
            "score": 1,
            "author": "zculp4579"
        },
        {
            "level": 0,
            "comment": "Half way through game dev and trying to keep this short I wish I went somewhere else I feel like you teach yourself everything. Do I regret it not really I still learned a lot. If you go there thinking teachers will teach you then rethink where you are going. Your paying a lot to just teach your self. This is online perspective. Not as bad as a lot of people just expensive and you get what you put in best wishes in your decision.",
            "score": 1,
            "author": "Kainthekiller",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is my take too, I’m 14 months into Game Design B.S. and it’s been a lot of “here’s how it’s done now go do it” the discord can be helpful but they definitely leave a lot to you to figure out. Often times I’ve had YouTube tutorials up right next to my assignments to walk my through how to do what they’re asking. You’re, in essence, paying for the knowledge of how to design and what the industry expectations are. But as far as being taught how to do the things, it’s lacking.",
                    "score": 2,
                    "author": "SeanKushery423"
                }
            ]
        }
    ]
}