{
    "id": "pbnv6j",
    "score": 7,
    "title": "Will the Computer Anim. Program get me industry ready?",
    "author": "rauros-falls",
    "date": 1629936368.0,
    "url": "https://www.reddit.com/r/fullsail/comments/pbnv6j",
    "media_urls": [],
    "other_urls": [],
    "postText": "Heyo everyone!\n\nI've been browsing the threads a bit trying to figure out if Full Sail is a good fit for me. (I'm specifically looking at the computer animation degree.) I know there are lots of similar topic posts, so many apologies.  \nI've talked to some friends in industry and they gave me a list of universities they recommended. Full Sail was on the list, and it was actually on the lower end of the tuition costs. Hahah, fear.  \nIt sounds like there are a fair number of alums in the entertainment industry, but I'm not sure how comparable it is to places like SCAD, RISD, etc.\n\nIt sounds like lots of people are saying you only make it by merit of your side work/ you get what you put into it. Isn't that true with any Uni, or is it even more so at Full Sail? Are there other Uni programs you'd recommend?",
    "comments": [
        {
            "level": 0,
            "comment": "Not too sure about any other Universities but I would have to agree that a lot of what you do outside of school is what's going to get you into a job in any entertainment industry. I think the real benefit of coming to FullSail is being able to learn from people who have worked in the industry for 10+ years and have that real-world experience. Also too it is a great place to meet other people who are doing something similar to you and make connections with other people in the types of industry you are looking towards. Like if you wanted to do computer animation for games there are lots of game dev and game art students here. Things like that. FullSail is just really big on networking and trying to push you to do more outside of school before you graduate.",
            "score": 5,
            "author": "MaforaJP",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have heard it is a great place to network and just be in a community of like-minded people c:  \nThanks!",
                    "score": 1,
                    "author": "rauros-falls",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem! Im currently going to FullSail for Graphic Design and I can say that I haven't had any bad interactions with any fellow students or staff here. Everyone is really passionate about their work and I think it helps facilitate a creative environment :)",
                            "score": 1,
                            "author": "MaforaJP"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "For sure, I guess I should have worded it more towards the question of quality of classes, if that makes sense? Are the classes/ professors engaging, challenging, and relevant vs. throw you a syllabus and watch them struggle during class demos.  \n\n\nI did read your response on another thread, though. Ty.",
                    "score": 1,
                    "author": "rauros-falls"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What do you mean by “industry ready”?",
            "score": 1,
            "author": "bmerice"
        }
    ]
}