{
    "id": "pg7vs4",
    "score": 5,
    "title": "Questions about the online program.",
    "author": "Relic_of_Suns",
    "date": 1630546578.0,
    "url": "https://www.reddit.com/r/fullsail/comments/pg7vs4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Currently, I'm enrolled into he flex program, I'm online for 4-8 months and then on campus. I'm trying to decide if I should switch to the online program entirely because I'm going to need to be working during my degree to afford it and have some questions. (I'm going in for the creative writing BFA)\n\nHow is the attendance counted and is it strict? Do I have to attend every single online lecture at the scheduled time or can I watch a recording of it when I get off and as long as I submit everything I'm fine? Is it different for each instructor/class? \n\nHow does networking work? Since I'm not on campus will it be harder to connect to people or companies willing to take on students or is it about the same?",
    "comments": [
        {
            "level": 0,
            "comment": "Hi there,\n\nI did my entire bachelor’s online. I’m not sure about the creative writing BFA, but in Digital Cinematography, it wasn’t too bad. I never had any worries about attendance. 9 times out of 10, the teacher would just record the lecture with whatever students attend and then would post the recording within the next day online. As long as you’re turning your work in on time, you’ll be fine. \n\nAs for networking, it can be tricky. You’re mostly going to be doing solo projects with peer reviews in the message boards. Networking is really hard online. If I’m honest, I didn’t put nearly enough work into networking while I was taking classes. But if you’re looking for job jobs, Full Sail does have a dedicated staff for helping students and alumni find work. You might have to ask your academic advisor about it. \n\nHope this helped. If you have any other questions, I’d be happy to try and help. Full Sail should really have someone monitoring this board…",
            "score": 3,
            "author": "PolaroidPuffin"
        },
        {
            "level": 0,
            "comment": "Also in DCBS. Attendance isn’t built into the program - they expect every if not most student to be working full time. Lectures are recorded and due dates are usually half way through the week and then Sundays. \n\nNetworking is weird, but if you get an interview somewhere, you can call any instructor and they will give you tips. I found that the Fullsail FB page and my programs FB page are both great networking opportunities.\n\nI’m 8 months from graduating and I already have a job in my field. My next step will need a portfolio revamp so I’m working on that first.",
            "score": 3,
            "author": "CyberTurtle95"
        },
        {
            "level": 0,
            "comment": "So Im on campus but was online due to covid. Attendance is strict on campus.   \nAttendance is broken up into 2 hour blocks if you are 15 minutes late to a 2-hour block it counts as if you were gone for the whole 2 hours. for the first 2 hour infraction, you get -10% from your overall grade for professionalism. If you miss  8 hours ( 2 classes) it is an automatic fail and you need to repeat the month regardless of your grade.   \n\n\nfor online it was a bit different. It is way more relaxed. Assignments are due at the end of the week. I believe the policy is complete/mark as completed at least 1 assignment(even the 0% ones in my case) a week in order to not fail for attendence.   \n\n\nTo speak for the difference between campus and online. Campus offers a lot more in terms of meeting people. Online students I feel tend to find it very difficult to do this. Today I struck up conversations with 3 different groups of people and was able to talk with them easily. I got discord of a few that is just starting in my degree program which is game dev. \n\n&amp;#x200B;\n\nit is a lot easier to look to the person next to you in lab and ask them a quick question instead of sending a message to the instructor and hoping they get back to you in a timely manner. Especially during off-school/non-working hours. Online is more about personal responsibility and finding the answers to your own problems which throws some students off. \n\nside note about networking with grads. they are doing this online right now but usually every month they have a panel of grads flown into the school for you to have talks with them in a more personalized setting. You can attend these panels online yes but you can't personally go up to them after the event and talk with them being online. In fact, there was some coffee and donuts time with only campus students where you can individually talk to each grad on a sunday. However once again this was before covid\n\n&amp;#x200B;\n\nTo speak for the difference between campus and online. The campus offers a lot more in terms of meeting people. Online students I feel tend to find it very difficult to do this. Today I struck up conversations with 3 different groups of people and was able to talk with them easily. I got the discord of a few that is starting in my degree program which is game dev. \n\nSo aye! good luck man if you got questions dm me!",
            "score": 1,
            "author": "Sox2417"
        }
    ]
}