{
    "id": "plbryu",
    "score": 11,
    "title": "Concerns Regarding Full Sail",
    "author": "Nylazir",
    "date": 1631239466.0,
    "url": "https://www.reddit.com/r/fullsail/comments/plbryu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! I’m a prospective new student for Full Sail University aiming to major as BS in Computer Science and taking a full online course.\n\nI did research about Full Sail University to see if it is worth joining this school.\n\nAlthough I’ve seen the pros and cons, I am still worried. Especially with the negative reviews I read about it being a for profit school and that it seemed to be a self learning type of program. \n\nTo also add to that, I do have a job on the side to work in order to pay bills so I am worried about the flexibility of their schedules and if my work may end up holding me back.\n\nI just want to know from actual students attending this university of their current opinions and advices in what they think of this university or how to survive it",
    "comments": [
        {
            "level": 0,
            "comment": "I'm glad to hear that you're doing research before jumping in. Going to school is such a big decision, and I see too many students jumping in and then not realizing how different Full Sail is when it comes to structure and time needed to complete coursework.\n\nI don't know anything about the Computer Science degree, but I did graduate in 2016 (5 years already?!) with my BS in Music Production.\n\nBottom line: Full Sail changed my life. They're like family, and I consider campus a second home. I met some of the most amazing people and some of my best friends for life there. While I understand their education was really expensive, I wouldn't have changed my time there for anything.\n\nAll of their programs are what you make of them. If you're going to sign up for classes, complete your work, and go home, find another school. This isn't that. Full Sail provides countless opportunities for their students outside of the classroom. The Full Sail alumni that I know are doing big things in their industries, like working on Netflix, Disney+, and Hulu shows, and touring with WWE. All of these students went above and beyond their classroom coursework by attending extracurricular events, lectures, and activities.\n\nIf you can, attend a virtual tour of the campus or go to one of their BTS tours (you can ask an admissions guide/rep about them). It's a whole different world when you're on campus, and I think you'd get a better understanding and feel for them.\n\nI'm happy to answer any questions you may have, but I might be a *little* biased. Full Sail is family, and we'd love to welcome you in.",
            "score": 7,
            "author": "ljcihak",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would love to join on campus but I live out of state hence the reason why I chose online learning instead. But I’m just mainly focused on wondering if the classes are worth it since I’m a complete blank when it comes to my major. So I would love to learn new knowledge related to it and hope to have an instructor that could guide me well in that area. \n\nBecause overall, I’m not afraid of taking out a student loan. I just want to know if it is WORTH the loan I took out for it. \n\nBut I am also afraid for what happens after I graduate as well. That’s why I do heavy research even if I was already accepted into this university. Before I throw myself in deeper, I would like to know others’ perspective in this.\n\nThank you for answering though! I’ve noticed as well from positive reviews that Full Sail can become a second home to their students from the friends they made and connections they had.",
                    "score": 2,
                    "author": "Nylazir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're welcome.\n\nThere are a number of really good instructors that have decades of experience (a requirement to teach at Full Sail). But if you decide to go to Full Sail, don't put all of your eggs in the basket of finding \"that one\" instructor. Networking with the students is just as important, if not more important. \n\nOnce students graduate and go on to do amazing things, they're the ones you're gonna want to have connects with. \n\nYour own destiny is up to you, not the educational institution you attend. A lot of people go into Full Sail thinking that they're going to be handed opportunities on a golden platter because they graduated from Full Sail. It's not at all like that. They have a lot of resources, including a career development department, that can help you with your resume, job applications, etc, but you have to work *really hard* to show that you're worth of any job.\n\nUtilize the resources Full Sail has to offer, connect with other students and instructors, and work 10x as hard as your peers. \n\nBest of luck!",
                            "score": 6,
                            "author": "ljcihak"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Currently in the I.T. Program online at full sail. I also work full time. They are awesome about giving extensions if you need extra time for assignments. The instructors are awesome. \n\nI have heard that they have a ton of connections for job placement all across the country so I wouldn’t worry too much about after you graduate.",
            "score": 3,
            "author": "furry_bawls",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve heard about their job connections as well but it made me doubtful for a while when I read a negative review that it was false advertising. \n\nHowever, I still want to try registering even without that. Since getting a job in the end is really up to yourself and Full Sail only offers a bridge for that. If I want to walk that bridge then I understand it’s still up to me to move my feet. \n\nI would be lying if I said I wasn’t skeptical about their benefits that’s why I’m here asking actual students who are attending Full Sail their own opinions about this school and if what was said to them by an admission guide is true.",
                    "score": 2,
                    "author": "Nylazir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was skeptical as well, but they have been nothing but awesome. As long as you do your work you will be fine. I think some people apply thinking it like a normal school, with semesters and 6 month long classes, then freak out when every class is only s month long. I live in Florida, and have visited the campus. They have a HUGE contract with the WWE and film the NXT tapings on campus.",
                            "score": 3,
                            "author": "furry_bawls"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This might be a long shot and sorry for replying to an ancient comment but can I PM you?\n\nI’m a veteran looking to attend Full Sail online while working full time and have some questions about their IT programs. Thanks",
                    "score": 1,
                    "author": "XSnow_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure. Not going to guarantee I have the answers though. Lol.",
                            "score": 1,
                            "author": "furry_bawls"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "you can expect at least 40 hours of class/hw a week. You can take months off but you can't pick and choose your schedule. Some months you will have professors that actually teach you and other's will simply tell you to watch an online video (mostly created by them but still). You will not leave Full Sail knowing your field unless you work on your skills outside of class full stop. If you are really self-motivated you can make great connections. But it is a lot of money to spend if you are uncertain.",
            "score": 3,
            "author": "RunningJedi"
        },
        {
            "level": 0,
            "comment": "save yourself a life time of regret and go to a real university intead of the predatory diploma mill full sail \"university\" https://youtu.be/8OTDEhmaIys",
            "score": 1,
            "author": "Low-Ad-3716"
        },
        {
            "level": 0,
            "comment": "I don't know.  WGU is a lot cheaper, non profit, accredited.   I am in the CS program now... Check it out:\n\n[https://mbsy.co/3vhRRG](https://mbsy.co/3vhRRG)",
            "score": 0,
            "author": "pancakeman2018"
        }
    ]
}