{
    "id": "r2hcaf",
    "score": 5,
    "title": "Curious about enrolling",
    "author": "that_one_slice",
    "date": 1637910331.0,
    "url": "https://www.reddit.com/r/fullsail/comments/r2hcaf",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm graduating from high school soon and I am weighing out my options for different schools and I am considering signing up for Full Sail. I was looking for general feedback on getting a film bachelors degree. I was also wondering if it would be worth the cost, and if doing my classes online would be an issue? Any feedback would be appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "I would recommend trying to go in person for film making since they have a lot of good gear on campus for that degree. With Fullsail you get what you give and it's up to you to make sure you're prepared for the assignments and such.",
            "score": 2,
            "author": "oneofthescarybois"
        },
        {
            "level": 0,
            "comment": "I’m a Audio Engineering grad, so I can’t speak towards the film program. However, I would say my only regret of not being an on-campus student is getting the “studio” experience. I have a family in NE so that wasn’t an option, but I do wish I had more experience in an actual studio and not just the small studio in my basement. \n\nSomething else I would consider is doing gen-eds at the closest community college for a term or semester at the cheaper rate per credit hour. It saved me a few thousand dollars to not have to take those at FS.",
            "score": 2,
            "author": "Fluid_Lecture_70"
        },
        {
            "level": 0,
            "comment": "I’m a Game Art grad and was online but I’ll share what I can. I agree with what others have said, that you get out of the program what you put into it. For film I would definitely go on campus though (not sure if it’s even available online). Degrees are roughly 3 yrs without the usual breaks, and about 40-45k. There are also scholarships available that are worth applying for, so don’t let that intimidate you. I worked full time in IT, and was surprised I got 5k in free tuition.",
            "score": 2,
            "author": "cmh175"
        },
        {
            "level": 0,
            "comment": "I would not recommend Full Sail right out of high school. I did go to Full sail in the film program right out of high school and regret it. There is so much maturing and change that happens between 18-25 years old. I soon realized that film and that career was not for me; even after graduating from Full Sail and working in the field for a year. The pay was low, you had to beg for work, and overall, it was very unfulfilling. It seems much more idealistic than it actually is. After a year of working, I went to a state college and spent the next four years getting a computer engineering degree. I'm happy to have had the true college experience without being overwhelmed with a crazy class schedule like I was at Full Sail. Those years in state college were MUCH more fulfilling and I matured much more; finally landing on the direction I needed to head. I've had a very successful and fulfilling career in software engineering ever since.",
            "score": 2,
            "author": "melh22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey there,\n\nAs someone posted below, not one persons experience will accurately display what is best for you. Just because one matured, and changed their interests does not mean in order for you to mature, you must change or will change your interests. \n\nReality is, my time at Full Sail was decided once I spent a few years weighing my options and deciding what I wanted. As a new grad, the best you can do is trust your gut, get good and sound advice, and make your choice. \n\nFull Sail was a good decision for me. Majored in Graphic Design. Interested in entrepreneurship and it will greatly help me in the future. Although, my plan is to continue my education. And the quality at Full Sail is good, but not the best. \n\nIt is also a national accredited school but not regionally accredited. And if you ever wanted to study for your Master’s you need to be selective about accreditation and be careful.\n\nHowever, if you plan to directly enter your field than you should be fine. Just make sure to network and grow. The online program was perfect for me because it helped me be more focused and productive. And the interface is organized and curriculum well placed.\n\nIt’s worth the cost only if you are willing to put everything you have into achieving excellence great in your field. If you don’t go above and beyond, it will not be.",
                    "score": 2,
                    "author": "archaicmindx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have been thinking about doing Full Sail’s graphic design program online. Do you mind expanding on your experience there?",
                            "score": 1,
                            "author": "yngcrooks_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "First, what are your goals and why do you want to go there? Then I'll be more targeted with my response.",
                                    "score": 1,
                                    "author": "archaicmindx"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go to the military if you don't have a full rhide scholarship",
            "score": 2,
            "author": "NiccoSmith009"
        },
        {
            "level": 0,
            "comment": "Definitely a unique career choice\n\nI've been in school for 6 years and only have $25k in debt to put that into perspective.  I think this is the cost of a half year at Full Sail.",
            "score": 1,
            "author": "pancakeman2018"
        }
    ]
}