{
    "id": "sjvcl2",
    "score": 6,
    "title": "For people that go to full sail",
    "author": "Sea_Archer9251",
    "date": 1643924842.0,
    "url": "https://www.reddit.com/r/fullsail/comments/sjvcl2",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I’m starting full sail in august and as you guys all probably know I’m gonna need a job. How do y’all balance a work-school life down there? Especially with the changing schedules.",
    "comments": [
        {
            "level": 0,
            "comment": "I can't speak from personal experience, I'm in an extremely fortunate situation of not having to pay out of pocket for school or basic living expenses here in central FL. Retelling accounts from peers on-campus, a decent majority of students do manage to juggle a part-time job while attending but it's a struggle.\n\nThe university is pretty much built around the concept of \"this is your full-time job while you're here,\" with the exception of an occasional work-study job available. Many students start with a part-time job like Wawa or Publix due to their potential flexibility around a revolving monthly schedule, but.. I think you'll find a lot more students tend to live off of either student loans or funds from family.",
            "score": 5,
            "author": "FlipTheNormals",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shit I was thinking bout taking a loan but that’s a big risk since I’m going for CS and it’s like a 91k program before Fafsa and scholarships",
                    "score": 1,
                    "author": "Sea_Archer9251"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Getting a job while attending full sail is tricky. The best way of working is doing something like door dash, Instacart, Uber, stuff like that.\n\nJobs around the school usually turn down students so they don't have to deal with a bunch of employees only doing small hours.\n\nJust try to find one that is as flexible as possible.",
            "score": 3,
            "author": "Dizzy-Barnacle-7435",
            "replies": [
                {
                    "level": 1,
                    "comment": "Might have to do DoorDash or sum cuz that tuition ain’t cheap",
                    "score": 2,
                    "author": "Sea_Archer9251",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For real 🤣. I'm gonna sign up as soon as I get my license.",
                            "score": 1,
                            "author": "Dizzy-Barnacle-7435"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work full time and it is very difficult to keep good grades and work 40 hours and there are months I struggle.",
            "score": 2,
            "author": "oneofthescarybois"
        },
        {
            "level": 0,
            "comment": "If you can survive the two years without a job, then do it. Your chances of getting good work ppst grad go way up if you just focus on the schooling.",
            "score": 2,
            "author": "NgonConstruct"
        },
        {
            "level": 0,
            "comment": "If you are on campus, it's impossible.  You won't know your class schedule for the entire month until a few days before they start.  Unless you can find something that actually lets you put school first, it's probably going to be too much.  Plus there are a lot of extracurricular the school expects from you as well.",
            "score": 2,
            "author": "itsnothowitlooks"
        },
        {
            "level": 0,
            "comment": "I personally wouldn't reccomend this school. \nItd be much easier to save up your money and take a course at a community college in your intended field. \nThe university primarily cares about your money. It's for profit. You will be in copious amounts of debt and unless you're genuinely talented you won't get a good job in your field through them. This will not change or improve your life. Save your money go to a local community college. There are a ton of resources that can help you learn your intended trade.\nYou'll hear a lot of students say you'll get out what you put in. What you're putting in is approximately $60,000 for a sub par education. It's a debt trap.",
            "score": 2,
            "author": "DefiningBoredom",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve been thinking about that lowkey. And I live in NYC so it’s pretty easy to get into a community college. But idk 🤷🏾‍♂️.",
                    "score": 2,
                    "author": "Sea_Archer9251",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Look you live in NYC there are plenty of communities for creative development. You can also look for discord communities. Your credits also won't transfer over to a majority of schools if you do decide that you dont like the program. The quality of teaching in my experience is very low and not worth the money.",
                            "score": 1,
                            "author": "DefiningBoredom"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is correct. I'm here on a GI Bill, and it's the only reason I don't care about getting ripped off. They ONLY care about your money.  \n\n\nI get bothered by automated emails all the time. I had to scream at them to get them to stop marketing other crap to me. They will NOT stop calling you.  \n\n\nIf you care about your education, go elsewhere.",
                    "score": 2,
                    "author": "damo1112",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was a lesson that I learned fairly late but something i try to stress to anyone that's young and tries to apply. I'm 23 and I have copious amounts of debts. From this place.",
                            "score": 1,
                            "author": "DefiningBoredom"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm in my first year of my program at Full Sail so take what I say with a grain of salt. I work full time and do online classes. Honestly it's hard, but if you do yourself a favor and plan your weeks out its very manageable. You've got this. If you need anything, don't be afraid to reach out if you would like to.",
            "score": 1,
            "author": "YeahTinyRuck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dude I go to full sail rn online in the digital cinematography program and work a full time editing job and I feel you it’s hard but if you plan your time we’ll you can have good success",
                    "score": 2,
                    "author": "samaugust101"
                },
                {
                    "level": 1,
                    "comment": "Are doing the 20 month or the 29 month track?",
                    "score": 1,
                    "author": "Appropriate_Shirt993",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "29 month",
                            "score": 1,
                            "author": "YeahTinyRuck"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey I'm starting in August as well for game dev, are you looking to get a roommate during your time? That will definitely help with certain expenses.",
            "score": 1,
            "author": "Significant-Jicama-4",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea I haven’t really started my roommate search but I’m gonna PM you later for more info.",
                    "score": 1,
                    "author": "Sea_Archer9251"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not sure how much you're needing every month but I currently work for delivery services and donate plasma. It's actually so helpful because you can make 600$ a month (after your start up bonus which is usually 700$-1100$) for an hour or two of your time each donation. I donate twice a week and make 600$ a month for reference.",
            "score": 1,
            "author": "uzuaria",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you get referral credit, send me the info🌸",
                    "score": 1,
                    "author": "Secret-Stuff-8726"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's very difficult for me honestly. I haven't gone and found a job, even a part time job yet because I wanted to focus on my time at Full Sail. Thankfully we have a safety net from selling our house and we're just renting right now. I know I'll need to get one later but it has to be part time and grave shift so someone is always home with our daughter. It's been hard but I do the best I can. If I can get through my education being a parent, and yes I have worked while in school. \n\nThen you can do it as well. I don't know you're situation but I'll just assume and say.. just be glad that you're not taking care of a child as well as a working and college.\n\nJust do your best. I believe in you, my dude. \\^\\_\\_\\^",
            "score": 1,
            "author": "Clariza-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you 😂 (PS sorry for the late reply)",
                    "score": 1,
                    "author": "Sea_Archer9251"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, Fullsail 'classes' are a joke. So don't worry.",
            "score": 1,
            "author": "damo1112"
        }
    ]
}