{
    "id": "tog8qm",
    "score": 6,
    "title": "How many hours do students work per week?",
    "author": "Rebelbutton",
    "date": 1648266594.0,
    "url": "https://www.reddit.com/r/fullsail/comments/tog8qm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I heard that it’s a solid 40 hours, like a job. I was wondering if that’s true? If it it’s that all cool! Just wondering what the workload was like for everyone. I’m in for computer animation btw.",
    "comments": [
        {
            "level": 0,
            "comment": "The workload varies depending on if you're on or off-campus. On-campus students usually take two courses per month which can be pretty hefty in workload depending on the classes (40/50+ hours).\n\nI'm an on-campus computer animation student that opted for the 'extended' program which spreads the classes out to one per month, much like the online curriculum. It depends on the class, but I've already probably put about 60 hours of work into my homework alone this month with still another 10-15 to go until I'm done. I have no idea how some folks manage two classes per month like this, I applaud them.\n\nFeel free to DM me or comment if you wanna know anything specific.",
            "score": 3,
            "author": "FlipTheNormals",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I’m starting April 4th. Just about to quit my job bc of the workload. I want full sail to have my full attention. Thanks for everything!",
                    "score": 5,
                    "author": "Rebelbutton",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem. Keep in mind, the initial 'core 4' classes can be misleading in terms of course load (they're pretty easy). Once 3D Fundamentals and Model Creation begin, it gets hectic (sometimes extremely hectic if you're not grasping the material), but very rewarding if you enjoy the medium and plan to work in the industry. I've been loving it.\n\nBest of luck!",
                            "score": 4,
                            "author": "FlipTheNormals"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I didn't know you could choose to do an extended program for in person classes, this is good to know, thanks!",
                    "score": 2,
                    "author": "TsukumoYuma"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd like to know this as well, I am considering applying to computer animation too. When I spoke to someone in admissions over the phone they said the earliest classes are usually 8am and the latest ones are usually at 8pm.",
            "score": 2,
            "author": "TsukumoYuma",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m doing online so it might be a bit different if it you where in person. But a lot of the comments helped put things into perspective.",
                    "score": 1,
                    "author": "Rebelbutton"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m in my 10th month of game art (which shares a lot of classes with computer animation). The workload varies heavily from my experience. But generally, any month that involves modeling/animation will be more time consuming. \n\nLast month I was in Project and Portfolio 1 and had to model, UV, texture, light, and render an entire scene from a Pinterest image. My entire month was spent working on it, and I had to miss a day of work to meet my final deadline. On top of that the lectures/labs were required so I had to fit those in my schedule too.\n\nOn the other hand, my current class is Mathematics, and I literally spend 1 day a week working on my assignments. I haven’t attended a single live lecture (not required). The assignments are just straight forward tests and they give you the calculators/tools to solve them. You can also retake tests multiple times, so getting a good score is easy.",
            "score": 2,
            "author": "Bluchacho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! All of this information means a lot!",
                    "score": 2,
                    "author": "Rebelbutton"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a year into my computer animation program. The amount of time you spend on a project really depends on the person themselves. For me I mostly just work on projects on the weekend unless there is one due earlier in the week.",
            "score": 1,
            "author": "Josiemk1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, yeah I’m a fast worker so I just wanted to see how it varies from person to person. Thanks for the insight! It means a lot.",
                    "score": 1,
                    "author": "Rebelbutton"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It definitely varies from class to class. I'm in the computer animation bachelor's program online, and it can be pretty heavy, 40+ hours. Some classes will be a really light work load.",
            "score": 1,
            "author": "spongyruler",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks you for the reply! It’s so nice to get so much feedback lol. Helps me form out my schedule so I’ll have enough time for work and other things.",
                    "score": 2,
                    "author": "Rebelbutton",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course! Good luck!",
                            "score": 1,
                            "author": "spongyruler"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am online and active duty military making it work to put things in perspective",
            "score": 1,
            "author": "Mother_Ad4991"
        }
    ]
}