{
    "id": "wrxc0j",
    "score": 1,
    "title": "financial aid",
    "author": "xenkie_",
    "date": 1660862954.0,
    "url": "https://www.reddit.com/r/fullsail/comments/wrxc0j",
    "media_urls": [],
    "other_urls": [],
    "postText": "Besides College Ave and Sallie Mae, what other lenders could i use to get student loans? every lender i apply to either denies me or asks for a co-signer (which i do not have) someone please help 🥲😅😥",
    "comments": [
        {
            "level": 0,
            "comment": "Have you exhausted your Federal Financial Aid option(s) that are available to you by completing your FAFSA? Most private lenders outside of Sallie Mae will deny you simply because it's not a traditional 4-year college, so it's difficult without a co-signer. \n\nI was in your shoes once like 10 years ago trying to figure out how I could afford Full Sail &amp; receive financial aid without a co-signer, plus I was too young to be considered as an independent applicant at the time for FAFSA. I ended up enlisting for the college benefits and now I'm finally here on campus 10 years later, a few months from graduation. All paid for. DEFINITELY not suggesting that as an option, but rather to express that I understand how seemingly impossible it is to get financial aid for Full Sail. It's tough, but I've seen some students manage to make it work. Don't make crazy life-changing decisions like I did for the sake of an education. lol",
            "score": 2,
            "author": "FlipTheNormals",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can remember what it’s called from the top of my head but i think i did apply for federal loans outside of the ones given on my fafsa. full sail says i have a few loans but i can’t see them in my portal",
                    "score": 1,
                    "author": "xenkie_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you qualify for the Full Sail scholarship, they will help with up to 25k as well",
            "score": 1,
            "author": "theBLEGHNetwork",
            "replies": [
                {
                    "level": 1,
                    "comment": "i’m waiting to hear from them but i hope i can the full 25k. i only have to pay 18k for my first year. i have a few stafford loans and i applied for more",
                    "score": 1,
                    "author": "xenkie_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah I had gotten some assistance from Fafsa and then Full sail financial aid advisor let me know I qualified for the scholarship so nothing is coming out of pocket until I finish school and have to pay back those loans. I'm hoping the excess money I get I can apply towards rent so I can cut my working hours",
            "score": 1,
            "author": "theBLEGHNetwork",
            "replies": [
                {
                    "level": 1,
                    "comment": "so what’s your income like? where you eligible for pell grants? or just federal loans?",
                    "score": 1,
                    "author": "xenkie_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think I had made 30k for the year they requested tax stuff from. I received both Pell grants and loans",
            "score": 1,
            "author": "theBLEGHNetwork",
            "replies": [
                {
                    "level": 1,
                    "comment": "ugh 😣 i was offered loans but not grants. my dad makes too much money now for me to be eligible",
                    "score": 1,
                    "author": "xenkie_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ahh yes, the joys of me being old enough for my parents to no longer being financially responsible for me. I had this issue when I was younger, even though I moved out at 17 and had my own job, place and paid all my own bills they still used my parents income until I was 26. \n\nI would take a look into jobs that offer college help. I think Taco Bell and Best Buy have programs to assist with college as well as others. Might be worth while to look into",
            "score": 1,
            "author": "theBLEGHNetwork",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah i work at taco bell. they do have a scholarship but the deadline was in the beginning of august",
                    "score": 1,
                    "author": "xenkie_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "See if there is an extension at all?",
            "score": 1,
            "author": "theBLEGHNetwork",
            "replies": [
                {
                    "level": 1,
                    "comment": "i spoke with my gm and he said stuff like that is ran by the corporation so they already said it didn’t reopen until fall 2023",
                    "score": 1,
                    "author": "xenkie_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When are you starting or looking to start classes?",
            "score": 1,
            "author": "theBLEGHNetwork",
            "replies": [
                {
                    "level": 1,
                    "comment": "september 26th",
                    "score": 1,
                    "author": "xenkie_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would definitely follow up with full sail financial advisor and see what options you may have. You might have to push your start date back and just bust your ass at work and get a savings going if no family can help or you can't get another game plan",
            "score": 1,
            "author": "theBLEGHNetwork"
        }
    ]
}