{
    "id": "wtie63",
    "score": 4,
    "title": "Incredibly late feedback from instructor? (Online)",
    "author": "Shotbythomas",
    "date": 1661032007.0,
    "url": "https://www.reddit.com/r/fullsail/comments/wtie63",
    "media_urls": [],
    "other_urls": [],
    "postText": "The past few instructors I’ve had have taken a full week and some days to give me some generic copy paste feedback. The main problem is how am I supposed to improve on the next assignment if I don’t get feedback from the last one until the next one is due. Anyone else having that issue?",
    "comments": [
        {
            "level": 0,
            "comment": "FWIW this isn't necessarily unique to Full Sail. Many professors can take a few days to a week for feedback in high-traffic schools. I think the problem with Full Sail is that it's \"fast-paced\" so feedback feels a lot later than a class you attend once or twice a week in another Uni.",
            "score": 3,
            "author": "Seraph_Grymm"
        },
        {
            "level": 0,
            "comment": "I’ve had the same thing happen. The thing is, these instructors probably have more than one class going at a time, and it takes time to grade everything. \n\nThis comes at the cost of actual meaningful feedback. I have gotten the same “Great Job!” feedback for entire months at times.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Takes time/ they usually juggle 2-3 classes, which makes sense since a lot of the teachers are specialized for specific parts of the degrees. For computer science degrees the teacher Lari has a computer graphics as well a 3d CC(or something like that) , which when you take both classes into account is roughly 60 ish students every month very often asking for help and scheduling 1-1 session with the professor and lab instructors, so any feedback you ask from them can be delayed. Typically a week is pretty good time, you only need to worry about it if it's like 2 days away from class deadline and you need to calculate your grade.\n\nIf it's a problem just shoot your teacher a message! I have not had an experience where the teachers didn't say something along the lines of \"sorry, I'll take a look at it when I get the chance\"  and then 2 days later its graded with feedback",
            "score": 2,
            "author": "CrunchyMarshmallows"
        },
        {
            "level": 0,
            "comment": "I can only speak for DCBS online, but it is not uncommon for assignment grading to fall 1-2 weeks behind. I have received various degrees of feedback ranging from boilerplate copy/paste comments to useful, meaningful guidance. So far, I have yet to experience late grading that negatively affected a subsequent assignment. Having said that, I did notice a trend that the final week's feedback is significantly less verbose as the instructors are onboarding their next round of students.",
            "score": 2,
            "author": "VeteranFilmProd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also in DCBS. Always make a note in your course review about late &amp; copy+paste feedback.\n\nFor the amount of money we're paying and all of the University's insistence (in advertising) that having instructors who work in the field enables them to provide valuable insight and feedback, it's a huge slap in the face to receive \"good job\" on a component of a portfolio project.\n\nI have a lot of sympathy for the instructors. They often have close to a hundred students across multiple classes. And in DCBS many of the instructors spend at least a few days a week on film sets doing the exact work they're teaching us to do.\n\nBut the frequency with which my classmates and I have received meaningless, copy+paste feedback from instructors does not reflect well on the University.",
                    "score": 1,
                    "author": "compassion_is_enough"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is very common to get feedback later than expected. I am surprised when I get feedback before Wednesdays for work that is turned in on Sunday. If you need quicker feedback or need your teacher to elaborate on why you received the grade you did you should email your teacher. The best way to successful at this school is to communicate.",
            "score": 1,
            "author": "Capable_Machine_4158"
        }
    ]
}