{
    "id": "xabh93",
    "score": 7,
    "title": "Project Launchbox Never Arrived",
    "author": "Anadanament",
    "date": 1662770713.0,
    "url": "https://www.reddit.com/r/fullsail/comments/xabh93",
    "media_urls": [],
    "other_urls": [],
    "postText": "I started the Game Development course awhile back, and was informed that I'd receive an iPad first and then the Launchbox shortly before my course-specific classes started. I got the iPad.\n\nWell, I was enrolled into Programming 1 and no laptop showed up, and I ended up having to drop out of the class because I had no computer that could handle the class (Visual Studio might not be a heavy program, but you'd be overestimating the capabilities of my laptop). I was reenrolled into it the next month, but still had no laptop, so failed it this time around because I tried to do the class instead of withdrawing for the month again.\n\nIs there a reason the Launchbox never arrived? I called a few times about it in late July but upon calling again, they showed no history that I had called about it. Now I've failed Programming 1 once and withdrawn once and am on the verge of withdrawing from the school because I have no way to do the coursework.\n\nAny advice is appreciated - I've been calling them fairly often, trying to figure out what to do, and I began enrolling in another school that offered a laptop for coursework, but I'd very much rather stay in Fullsail if possible - the accelerated rate of the school is ideal for me and the current job offers I have, which require me to finish a program ASAP for proper pay and benefits.",
    "comments": [
        {
            "level": 0,
            "comment": "When did you start?  You get your iPad after month 1 and your launch box after month 4. They usually send you about 20 emails prior to shipment",
            "score": 5,
            "author": "RB3910",
            "replies": [
                {
                    "level": 1,
                    "comment": "I took off two months after my sister passed and failed the classes immediately preceding that as she passed in the final week of a pair of classes, so that was 3 months gone for me - but otherwise I started in November and did 2 classes a month. My first attempt at PG1 would have been in July.\n\nI got the iPad in the first two weeks of the first class but there were no emails accompanying it, and I wasn't even aware I was getting it at all.",
                    "score": 2,
                    "author": "Anadanament",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So how many classes did you actually complete. The launch box is shipped the final week of your fourth class.  Regardless of any breaks or not. Only way it comes sooner is if you had transfer credits that knocked out a few of the intro classes.",
                            "score": 3,
                            "author": "RB3910",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "6. PG1 would have been my 7th.",
                                    "score": 1,
                                    "author": "Anadanament",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There is a launch box specific email and they are very quick to respond. I would try there.",
                                            "score": 2,
                                            "author": "RB3910"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "robinw@fullsail.edu is in charge of the materials dept launch box program.",
                                            "score": 1,
                                            "author": "RB3910"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My launchbox (Game Art) was delayed by about a month because it got sent to Memphis when they were buried under snow, early 202 I think. I called them a couple times, but they just swapped my class out for one that didn't need the Mac. By the following month, it arrived and I was good to start classes back as scheduled.",
            "score": 3,
            "author": "MonstrousQuinn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here 🙋🏻 the storm made me get it 3weeks late (Nashville-TN) and they put me in art history.",
                    "score": 2,
                    "author": "Dirt_22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think I remember there was a quite a few of us, kinda jumping in, what, halfway through first week - second week. Won't lie I was upset because I had a laptop (*that I had bought for this school, when I was told I could opt out of the Mac, but was later told I couldn't*) that I had just finished getting everything downloaded on to, when they swapped me out.",
                            "score": 1,
                            "author": "MonstrousQuinn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Contact school and they’ll help. \nIts takens 5-7 months to get the full launch box (not time 5months of time passing, 5months of class time filled in) \nAlso if you receive your launch box a bit late like I did, you can ask them to replace your class with one that doesn’t require launch box equipment until you get it. \nFirst you will only get the iPad shipped separately and then the other stuff.\n\nMake sure to communicate your issue with them on the phone, I doubt they wouldn’t help. \n\nFull Sail has never let me down. \n\nEdit: misplaced word",
            "score": 3,
            "author": "Dirt_22"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Alright. I'll call them repeatedly until I get some answers about it. The main thing is that I also just have no idea as to *when* I'm supposed to have gotten the Launchbox - there's so little information available about it other than \"You'll get this at some point,\" that I wasn't sure if I just wasn't far enough along in the course to qualify for it.  \n\n\nBut Programming 1 seems like a class that they would have sent it for, so it's definitely frustrating me because I do genuinely like the school and it could take me far, but the lack of a laptop or anything else is certainly getting on my nerves.",
                    "score": 2,
                    "author": "Anadanament",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'll call Student Advocacy on Monday and talk to them. Hopefully they can figure this out.\n\nOn an unrelated note, is it possible to have it so financial aid refunds get sent to me instead of being pushed back into the balance? I'm working 50+ hours a week on top of this, any extra money I have is less hours at work and more time spent doing schoolwork.  \nIf you've any knowledge about that aspect, at least.",
                                    "score": 2,
                                    "author": "Anadanament"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Its not that you will “get it at some point” it will be sent on time for when you’re taking a class that needs it (unless a storm or shipment issue causes delay like in my case) \nAt the beginning of my classes starting from the 5th month I would ask if Launch Box material is required, if yes, then I would ask Full Sail to swap classes with one that does not require the Launch Box and wait till I received it. \nIf you do not receive your Launch Box on time and have to use it for a class and have no option of changing it with another class, you cannot lose points/grades or have a pay to retake fee for when its a better time because you are not at fault for this issue.",
                            "score": 1,
                            "author": "Dirt_22"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Condolences for your sister, I'm sorry to hear that. \n\n&amp;#x200B;\n\nIn regards to your LaunchBox, you should have been a little more focused on it if it's something you really needed. It's not completely on you, but if you are noticing you haven't received contact or emails about it, you should be bugging the hell out of technical support. Technical Support has hours that are much later than most, if I recall. I'm not blaming you, but in life if you don't make sure it gets done, who will? \n\n&amp;#x200B;\n\nAlso, always send a ticket through prior to calling too. You can do so from the FSO ticketing portal. I believe they use Zendesk, and it's setup automatically message you, letting you know that a ticket has been generated. When you can, screenshot all call records as proof of communication. They document everything, you need to do so too. I don't want to sound like a broken record here, but CYA \\~ Cover Your Ass. \n\n&amp;#x200B;\n\nI hope you are able to get back into class soon, if that's what you want to do. Submit a ticket, and then call them. Wait 3 days. Respond to the ticket, it will add it back to the top of their queue. Then call them again for an update. Take a screen capture of each call, the number dialed, and the length of the convo, along with who you talked to, and when. Not having a computer is capable of doing the course is a fair reason to have failed it, honestly. \n\n&amp;#x200B;\n\nA heads up of something you can use on your laptop you currently have; look into Shadow Gaming. They offer a virtualized computer for about 20.00 a month, that is as good or better then the laptop you will get. I used it when I was rebuilding my desktop, and it's fantastic. From my understanding they use a custom, in house made Hypervisor to bring you a high quality, low latency VM. \n\n&amp;#x200B;\n\nAnyway, I hope something in here was helpful.",
            "score": 1,
            "author": "Cain1989"
        }
    ]
}