{
    "id": "xqyhs9",
    "score": 5,
    "title": "Is it worth it?",
    "author": "[deleted]",
    "date": 1664426576.0,
    "url": "https://www.reddit.com/r/fullsail/comments/xqyhs9",
    "media_urls": [],
    "other_urls": [],
    "postText": "hello i just started attending full sail this week online for recording arts and i will be moving to on campus in 6 months. i really want to have a career in the music industry but full sail is so expensive. i got the pathway scholarship but still i don’t know if i’ll have enough for an apartment even with roommates and the government loans i have to pay back after i graduate. i will have about 24k saved up by the time i move to full sail but i’m just wondering if it worth it to go to this school or should i look for a cheaper option? i want to do music for my career but idk if i can afford this college.",
    "comments": [
        {
            "level": 0,
            "comment": "I've noticed a common denominator with the people posting negative reviews, posts, and videos.\n\n1.   Nearly half my classes cannot follow a rubric and syllabus to save their lives.\n\n2.   A lot or people do the bare minimum thinking the instructors will magically teach them; that's every university and college.    You have to perform and actually take what you're learning to the next level. \nYou are wasting money if you are just going through the motions.\n\n\n3.  Attitude.    Everybody wants to be a Rockstar and talk the talk but a lot of students I've seen have had a bad attitude and immature work ethic.    I see students getting literally hostle and combative to instructors more than willing to help them but they show up honestly not remotely prepared for college level work\n\n\nLiterally every single discussion board instructor asks for 200 words about something,  and a third of the class will write 5 words or 2 sentences saying somethinglike \"I hope you achieve your goals\" adding no value or demonstrating any genuine will to actually be there.\n\n\nIt's honestly the only frustrating part I've noticed about full sail so far.   \n\n\nFS is not meant to be the skim thru party school.   Your experience at fullsail will ultimately be up to you.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Do you *really* want to do this? That’s the question you have to ask yourself. I knew 100%, without a doubt, that I wanted to be a screenwriter. There was no stopping me and I’ve worked my ass off the entire time I’ve been in the program. It’s totally worth it to me. My portfolio is stacked and I’m about to graduate with a 3.9 GPA. There’s no way I don’t acquire a solid job in my field once I move out west this spring. I already have an in at Epic Games as a writer should I choose to go that route.\n\nOn the other hand, more than half of my class should have saved their money because they’re not good writers or creative thinkers. They’ve continuously put in the minimum effort (if even that) and they do not care. They even complain about writing and still have no grasp on grammar or spelling. In their cases, it is *not* worth it and they’ve wasted a ton of money. They will not get jobs in the industry and will probably blame the school for the rest of their lives—stupidity is complaining of misfortune when the fault is your own.",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "wow that’s really cool. i want this more than anything and i want to work my ass off for it. i’m just scared i won’t have enough money to complete my education but i will put 110% into everything i do.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can get financial aid.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Im going for game art and I've heard this sentiment multiple times-- you get what you put into it.\n\nFor context I did college right out of HS with a full ride to get out of an abusive home. Now I *actually* want this so badly. I've thought about it and I'm willing to take the loans out in exchange for the networking opportunities at full sail, plus a stacked portfolio is immeasurably useful. I'm not going to just put in minimal effort, I'm planning on this being my full time job for the next two years.\n\nIdk what my point is lol I just have heard this same thing, and people who have complained seem to have expected a guaranteed job after graduation. The odds of getting a job increase with effort, no?",
                    "score": 2,
                    "author": "SL1MECORE"
                },
                {
                    "level": 1,
                    "comment": "&gt; On the other hand, more than half of my class should have saved their money because they’re not good writers or creative thinkers\n\nThis was the issue with my experience, too. I still can't believe some of the folks that went for the writing degree clearly could not or didn't want to do any of the writing.",
                    "score": 1,
                    "author": "Seraph_Grymm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it got me down for a bit. I’m at the point now where I let them know in peer discussions: “It seems you ignored the entire rubric while throwing this together last minute.”\n\nI can’t wait to graduate so I can privately ask my favorite professors about all of this. An easy fix, despite the loss of revenue, would be to implement an entrance essay for prospective students. I would even volunteer to read applicant’ essays if it meant a better peer experience for others who actually want to be there.",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn't even wait until I graduated, I asked all my writing profs about as much as I could. I'm still friends with some of them from the classes. Being candid about my concerns during class also let me work on some group projects alone and still keep the good grades. I think the transmedia project was the only one where the whole team pitched in.",
                                    "score": 1,
                                    "author": "Seraph_Grymm",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did they help you find a job? I only have two months left.",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I had work before I graduated and took advantage of some internships and popular job boards; so I didn't lean on the professors much other than having people I could reference if I needed to. I haven't had a need and love what I do, but if I ever changed pace I'd probably reach out to them to see what \"ins\" might be able to have or advice on where to look.",
                                                    "score": 1,
                                                    "author": "Seraph_Grymm"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think Full Sail is a good school, and their Grads go on to work on huge projects. I'm going to graduate with my Masters this November. I'm not in the same field, but I've found the teachers I have are amazing, provide quality instruction, feedback, and advice.\n\nYou have to put in a lot to get a lot of it- but if you're willing to put in the work (commit 40 hours a week to your education) it's totally worth it.\n\nETA: [an apt description of full sail](https://www.reddit.com/r/fullsail/comments/xo7hag/hey_guys_i_had_some_questions_about_full_sail/ipzlxmi?utm_medium=android_app&amp;utm_source=share&amp;context=3)",
            "score": 2,
            "author": "PineTreePetey"
        },
        {
            "level": 0,
            "comment": "What cheaper options are there? I find full sail to be a pretty well priced school",
            "score": 1,
            "author": "NgonConstruct",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably state schools? Idk I forget how college works. Full sail has a good price point for the amount of resources and networking opportunities they provide imo. Also I heard elsewhere they don't cancel classes if a small amount of people sign up. I'd love to pick a professors brain in a more personal setting.",
                    "score": 1,
                    "author": "SL1MECORE"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For me it's worth it because I'm older and already have significant professional and academic experience.  I was looking into a much cheaper state university, but the state school will not budge on making me take their general eds that I've already taken most of before. \n\n&amp;#x200B;\n\n I could spend a year and a half torturing myself with breakfast club humanities classes or take a couple nonsense classes and actually get into my program at Full Sail.  \n\n&amp;#x200B;\n\n However general eds do give important college level skills and work ethics that I think get overlooked too often and you will need in the later classes, so as long as your willing to work it's great.    \n\nWriting clearly and effectively is important.  Knowing basic office software for pretty much anything ( power-point, word, excel) is important.  Knowing what to ask and where to look for answers is very important.",
            "score": 1,
            "author": "Invert6Actual"
        }
    ]
}