{
    "id": "17cai2",
    "score": 9,
    "title": "Welcome to the updated r/CNU! ",
    "author": "AphoticAffinity",
    "date": 1359244222.0,
    "url": "https://www.reddit.com/r/CNU/comments/17cai2",
    "media_urls": [],
    "other_urls": [],
    "postText": "You'll notice I've been making some changes to our sub after our small stint of 'internet fame' \n\nI'd like to highlight some of the changes:\n\n1. The CNU logo at the top right of the page will take you to your reddit home page. The smaller /r/CNU will take you to the home page of this sub\n\n2. The side bar has been completely redone. The tabs on the right will pull down when you hover over them and show you information relating to the tab. For example: the Happening This Week tab will tell you what events are going on campus for the given week.\n\nI'll be updating the sub more as time goes on and if anything seems like a good idea. Any suggestions are welcome!\n\n\nEDIT: Hey if there are any events you want me to add to the sidebar just post here or PM me! I can even put it on our announcement bar at the top of the page!\n\nHope you guys like it.\n\n~Aphotic\n",
    "comments": [
        {
            "level": 0,
            "comment": "Thanks! This looks great! ",
            "score": 2,
            "author": "chrisaltosax"
        },
        {
            "level": 0,
            "comment": "I like it",
            "score": 2,
            "author": "xtremelampshade"
        },
        {
            "level": 0,
            "comment": "Looks awesome.  Can we include home athletics events under \"Happening This Week\" ?",
            "score": 2,
            "author": "captain_reddit_",
            "replies": [
                {
                    "level": 1,
                    "comment": "yup! I was only going to put home games/events on sidebar but if I get enough response I can put them all up.",
                    "score": 1,
                    "author": "AphoticAffinity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think just home games will be fine.",
                            "score": 3,
                            "author": "captain_reddit_"
                        },
                        {
                            "level": 2,
                            "comment": "If i send you info about rugby games, can you include these even though we are a club??",
                            "score": 1,
                            "author": "monstar28",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course. Rugby, lax, hockey. All the 'clubs'  are more than welcome to give me their schedules. ",
                                    "score": 1,
                                    "author": "AphoticAffinity"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is pretty cool, nice work.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Don't forget about concerts .-. aka the CNU ones not the separate Ferg ones...",
            "score": 2,
            "author": "Nickster93",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nick do you have a link to the CNU music calendar I'm on my tablet and am too lazy to look it up.  =P buy ill be sure to add wind ensemble/choir/etc concerts. Remember this is still very much a work in progress. ",
                    "score": 1,
                    "author": "AphoticAffinity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have a syllabus with some dates on it (I'm already giving you enough information for you to figure out who I am now, lol oh well).  I'll send them in a message soon for you.  By the way, do you need help moderating the subreddit?  It's hard for a single college student to find enough free time to do all of that, I know from experience &gt;.&gt;\n",
                            "score": 1,
                            "author": "Nickster93"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wheel of Time?",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}