{
    "id": "4m1yb4",
    "score": 1,
    "title": "Global Reddit Meetup-Hampton Roads Edition!-6/25/16-Roger Brown's in Portmouth-6PM-9PM",
    "author": "Nave",
    "date": 1464796658.0,
    "url": "https://www.reddit.com/r/CNU/comments/4m1yb4",
    "media_urls": [],
    "other_urls": [
        "http://www.rogerbrowns.com/menu"
    ],
    "postText": "***\nIf you're coming, do me a favor and reply with the word, \"Uncopyrightable\" for each person in your group, including yourself. So if you and your wife are coming, comment with Uncopyrightable Uncopyrightable. :) This way I can do a quick \"Ctrl-F\" to get a count.\nPlease only comment in one thread. I'm going to post this in multiple subreddits and it has already been posted in the Hampton Roads Facebook group. So RSVP either in on thread on here or on the Facebook group. And please feel free to join the Facebook group. I would like to get as close to an actual number as I can. Please try and RSVP by 6/18. Ok here's the actual post.\n***\nIt's that time everyone!\n\nI'm going to keep this nice and short. Promise! :)\n\nJune 25th is the day of Global Reddit Meetup! The location I've obtained for us is Roger Brown's in Portsmouth in Old Town. Take a peek at their menu here!\n\nhttp://www.rogerbrowns.com/menu\n\nRoger Brown's has shown in the past they can handle large groups such as after the Ghent bar crawl there in the fall. They also have a parking deck next door practically. And after people are done hanging out, there's other restaurants and bars people can head down to all around.\n\nThey are very excited for us and I've been able to reserve a huge section. Since I never have a firm number, try and get there early. The agreement is that we will start filling in one side of the section, if they need the section, they will start filling in the other. Then we will meet in the middle.\n\nI am super excited about this!\n\nI want this to be our biggest meetup ever!\n\nIf you don't know me, look for the guy wearing a cape! That should make it easy to find me. :)\n\nIf you are a socially awkward penguin, that's ok! Come find me. You may ask for a free bear hug, fist bump, or awkward stare from me and I shall deliver it post haste and introduce you to as many people as I can because I think you're a cool person. So please come out and have a fun time!\n\nAs always, three major rules for meetups!\n1) Don't be a jerk.\n2) Treat the staff with respect and tip them. We're invading and I would like to be welcomed back.\n3) Everyone is responsible for themselves. That includes figuring out the getting to and from there, and paying for themselves, and conducting themselves correctly.\n\nIf you are at the meetup and have any problems with anyone or anything, come find me in the cape. I will either do my best to help you!\n\nPlease RSVP by June 18 so I can give them a heads up of a closer number.\n\nSee the top with the \"Uncopyrightable\" instructions.\n\nTHIS IS GOING TO BE FUN! :)\n\nSee :) Short and sweet ;)",
    "comments": []
}