{
    "id": "5oty5w",
    "score": 9,
    "title": "Few questions from a prospective student",
    "author": "Little_Bit_Crazy",
    "date": 1484792922.0,
    "url": "https://www.reddit.com/r/CNU/comments/5oty5w",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I was recently accepted to CNU. I loved the campus when I went for my tour and interview on two separate occasions, however, I got the vibe that the campus is sort of a bubble. What mean is that there doesn't seem like much to do out side of campus, is this true? \n\nWhat do people do for fun at CNU (stay at campus, go out, etc).\n\nHow important is the party scene (if there is one)? \n\nDo you feel academically challenged (specifically in humanities courses)? \n\nThank you! \n\n",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; however, I got the vibe that the campus is sort of a bubble. What mean is that there doesn't seem like much to do out side of campus, is this true? \n\nLike, what do you want to do exactly? It's hard to answer that general question. \n\nNN is a city of about 180k people and close to Williamsburg and Virginia Beach so there are activities. Campus will always have activities as well. It all depends on what you want to do and you can find it. I always found stuff to do and everyone seems content and busy enough.\n\n&gt;What do people do for fun at CNU (stay at campus, go out, etc).\n\nPeople have all kinds of interests so there's really no \"one size fits all.\"\n\n&gt;How important is the party scene (if there is one)? \n\nIf you want to go to parties you can find them. If you don't you don't have to. The residence halls are dry.\n\n&gt;Do you feel academically challenged (specifically in humanities courses)? \n\nThat probably honestly depends on how intelligent the student is and how well their high school prepared them for college as well as what programs s/he is in (Honors, PLP). There are usually only 1-3 4.0s per graduating class if any and several in the high 3.9 range. The average GPA last I knew was about 3.0 so the average student is at least challenged sometimes. ",
            "score": 6,
            "author": "bananars",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nailed it. Campus can feel like a bubble a bit if you don't have access to a car (either own one or befriend someone who has one) but freshman year the only times I really felt the need to go off campus were to hit up Walmart or go to a party. The longer I was there the more I explored NN and beyond, so much that my last semester I lived in Williamsburg and commuted in.",
                    "score": 7,
                    "author": "RevargSTG"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bannanars explained it pretty well, but I'll add a little information too. I can't speak much for the humanities in terms of difficulty but in general CNU is fairly rigorous. There is that \"bubble\" but there are a lot of things to do off campus and there is a party scene. Port Warwick has a decent amount of parties and if you join a fraternity / club / sports team you will find parties. Residence halls are dry but that didn't stop anyone I knew from drinking in them. I loved living in santoro and made a lot of friends in there. If you have any other questions feel free to ask. ",
            "score": 5,
            "author": "applause8777"
        },
        {
            "level": 0,
            "comment": "NN is a great town! Close to other great towns, so bring your car. Compared to other colleges and their towns (Norfolk, Williamsburg, Blacksburg, Charlottesville and others, I think living in Newport News is a pretty good deal. ",
            "score": 1,
            "author": "zunedog31"
        }
    ]
}