{
    "id": "gg85oz",
    "score": 5,
    "title": "Please help me get my PhD! Need Research Participants for Dissertation Study due to COVID-19 halting in-person data collection. It's on Digital Communication!",
    "author": "Tonks55",
    "date": 1588995938.0,
    "url": "https://www.reddit.com/r/CNU/comments/gg85oz",
    "media_urls": [],
    "other_urls": [
        "https://drive.google.com/open?id=1MT0xa1azZ8o7e9sGoWGKD1Pa2cCoRrMa](https://drive.google.com/open?id=1MT0xa1azZ8o7e9sGoWGKD1Pa2cCoRrMa)).",
        "https://ncsu.qualtrics.com/jfe/form/SV\\_d3RO8yx8WPdnaiF](https://ncsu.qualtrics.com/jfe/form/SV_d3RO8yx8WPdnaiF)."
    ],
    "postText": "Summary: Are you bored and looking for something to do during the quarantine? Participate in a research study on digital communication and help out a CNU Alumni (Class 2015) get her PhD! Go Captains!\n\nSo COVID-19 meant I had to halt data collection for my dissertation research which compares different communication mediums (e.g., video chat, chatting via an avatar, and virtual reality) in terms of social interactions, social presence, and feelings of connection. I have altered all conditions to be completely online, but now need participants since my normal participant pool (undergraduates) aren't on campus. If you are running out of ways to entertain yourself during the quarantine, this may be a great option for you as you will get to have a conversation with someone outside your immediate household! :). Additionally, you will help a grad student graduate!! :)\n\nFor a full list of eligibility requirements and what the study entails, please see the recruitment flyer (link here: [https://drive.google.com/open?id=1MT0xa1azZ8o7e9sGoWGKD1Pa2cCoRrMa](https://drive.google.com/open?id=1MT0xa1azZ8o7e9sGoWGKD1Pa2cCoRrMa)).\n\nIf I sparked your interest and you would like to sign up for the study, here is a link to the scheduler survey: [https://ncsu.qualtrics.com/jfe/form/SV\\_d3RO8yx8WPdnaiF](https://ncsu.qualtrics.com/jfe/form/SV_d3RO8yx8WPdnaiF).\n\nStay safe everybody! And feel free to message me if you have any questions!\n\nNote: I've had a couple of people ask me about the 20/20 corrected or natural vision requirement so I'll go ahead and answer that question here. :) Basically, you can participate if you wear glasses or contacts, I just ask that you are wearing them during the study. If your vision doesn't correct totally to 20/20 but it's pretty close and you can still see everything pretty well, that is fine too.",
    "comments": []
}