{
    "id": "hhhser",
    "score": 16,
    "title": "A message to incoming freshmen",
    "author": "maciejake",
    "date": 1593363161.0,
    "url": "https://www.reddit.com/r/CNU/comments/hhhser",
    "media_urls": [],
    "other_urls": [],
    "postText": "If y’all have any questions at all PLEASE feel free to reach out, either posting here or even DMing me personally. I know everything seems strange and hard right now and you can feel nervous about this change (especially with the ongoing apocalypse), but its really going to be ok. You can ask any question, no matter how intricate or how simple and dumb, and I’m sure someone here will be happy to help you out! Especially me, not only am I happy to help, I have nothing better to do!",
    "comments": [
        {
            "level": 0,
            "comment": "Same here, I'm going to be a senior here next year so if you need info or have questions, I can definitely try to help you out",
            "score": 2,
            "author": "chn4",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, I’m a sophomore, though I’m technically one class away from being a junior, so I’m still fresh on what it was like for me, though I didn’t exactly go out of my way to make my place, it still seemed to find me. I think if the school is good for anything, its finding a group, or it finding you",
                    "score": 3,
                    "author": "maciejake"
                },
                {
                    "level": 1,
                    "comment": "Alumni here. Same offer, lmk if any of y’all need anything",
                    "score": 1,
                    "author": "SkyFall___"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mom tells me she heard I need extra long ethernet cable for dorm (incoming freshman). Any idea if most dorms have usable wifi, or is a ethernet cable a good idea? Not a big deal, but so used to wifi at home and HS. Any guidance appreciated, thx",
            "score": 1,
            "author": "hadley_v_baxendale",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wifi is available in all the housing, ethernet will just be faster. I got the fastest internet I’ve ever even seen on ethernet, but wifi was really good too. I don’t think its necessary unless you want to hook up a console or tv.",
                    "score": 1,
                    "author": "maciejake",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Having the faster connection can be especially important twice yearly: When registering for the next semester’s classes &amp; when signing up for the next year’s housing.",
                            "score": 2,
                            "author": "VirginiaRNshark"
                        }
                    ]
                }
            ]
        }
    ]
}