{
    "id": "jureu0",
    "score": 8,
    "title": "Remote learning option for Spring 2021?",
    "author": "cnuremote2021",
    "date": 1605467455.0,
    "url": "https://www.reddit.com/r/CNU/comments/jureu0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I got an email last Saturday (posted below) making it seem like remote learning is out of the question for the spring semester. Does anyone know if this decision is set in stone or are things still liable to change? \n\nI understand that CNU has done a fairly decent job in reducing the spread of the virus and I am definitely not discrediting any of their efforts to make the campus safer.  I'm not even really opposed to going back, even though I did have complications with asthma as a kid. However, it would definitely benefit me financially to stay at home. I feel like I would also find it somewhat disappointing to pay to be on campus when the majority of my classes will be online.\n\n&amp;#x200B;\n\n&gt;Greetings, Captain…We hope this email finds you well and ready to return to campus soon.  \n&gt;  \n&gt;We trust you read the announcement sent by Vice President for Student Affairs Dr. Kevin Hughes on Friday, October 30, 2020 and are looking forward to welcoming you back to campus in January 2021.  \n&gt;  \n&gt;According to our records, you were originally assigned to ------------ for the fall before you decided to opt-out for Fall Semester 2020.  We are pleased to inform you that the space you were previously assigned is still available and you will be able to reside in that room when you return to campus for the spring semester.   \n&gt;  \n&gt;Please let us know if you have any questions or concerns.   \n&gt;  \n&gt;We look forward to welcoming you back.  \n&gt;  \n&gt;Housing Administration",
    "comments": [
        {
            "level": 0,
            "comment": "Since so many classes are going to be online again, I really think you should contact housing ASAP and just straight up tell them you’re not living on campus in the spring.",
            "score": 6,
            "author": "LimeSublimez"
        },
        {
            "level": 0,
            "comment": "Honestly, I don't see CNU offering remote learning unless their hand is forced by the state.\n\nTrible's ego is otherwise too fragile to even think of remote learning.",
            "score": 3,
            "author": "thatsopranosinger96"
        },
        {
            "level": 0,
            "comment": "Honestly I 100% agree with you, all my classes I could easily do at home, and I feel like this semester was a waste of money to come back on campus. But that's just my opinion.",
            "score": 2,
            "author": "ya_boi_01920"
        },
        {
            "level": 0,
            "comment": "Thanks for the comments everyone! I took u/LimeSublimez's advice and emailed the housing administration, although I really wasn't that assertive and I essentially just asked the same question I posed above. They replied pretty quickly and confirmed that they are not planning to provide an option to opt out of housing in the spring. I also spoke with my advisor who was pretty adamant that I take a specific course in person next semester, instead of postponing it. So it ultimately looks like I will be on campus in the spring. I pasted the email from housing below again if anyone is interested in reading it.  \n\n\n&gt;Hey --------  \n&gt;  \n&gt;At this time we will be opening the campus for all residents in the Spring and there is not an option to opt out.  \n&gt;  \n&gt;If you feel you qualify for a medical accommodation, you are welcome to apply through the Disability Services Office.  They can be reached at [DOSA@cnu.edu](mailto:DOSA@cnu.edu)  \n&gt;  \n&gt;Thanks  \n\\-----------",
            "score": 1,
            "author": "cnuremote2021",
            "replies": [
                {
                    "level": 1,
                    "comment": "Core advisors are just trying to make you stay on campus to give cnu money. If I were you I'd just take less than 12 credits at cnu and take some classes at a community college. Same credits but you can opt out of on campus housing to save $$.",
                    "score": 2,
                    "author": "drakerobinson15"
                }
            ]
        }
    ]
}