{
    "id": "10o9vly",
    "score": 3260,
    "title": "Curiously enough, the only thing that went through the mind of the bowl of petunias as it fell was",
    "author": "QuicklyThisWay",
    "date": 1675005099.0,
    "url": "https://www.reddit.com/r/trippinthroughtime/comments/10o9vly",
    "media_urls": [
        "https://i.imgur.com/1aA3RFP.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\"Dream Caused by the Flight of a Bee Around a Pomegranate a Second Before Awakening\" is a surrealist painting by Salvador Dalí. A shorter alternate title for the painting is \"Dream Caused by the Flight of a Bee.\" It was painted in 1944, and the woman in the painting, dreaming, is said to represent his wife, Gala. The painting is currently in the Thyssen-Bornemisza Museum, in Madrid.\n\nIt is an oil painting on wood. In this \"hand-painted dream photograph\", as Dalí generally called his paintings, there is a seascape of distant horizons and calm waters, perhaps Port Lligat, amidst which Gala is the subject of the scene. Next to the naked body of the sleeping woman, which levitates above a flat rock that floats above the sea, Dalí depicts two suspended droplets of water and a pomegranate, a Christian symbol of fertility and resurrection. Above the pomegranate flies a bee, an insect that traditionally symbolizes the Virgin.\n\nIn the upper left of the painting what seems to be a yelloweye rockfish bursts out of the pomegranate, and in turn spews out a pouncing tiger that then spews out another pouncing tiger about to attack Gala and a rifle with a bayonet that is about to sting her in the arm. Above them is Dalí's first use of an elephant with long flamingo legs, found in his later compositions such as The Temptation of St. Anthony. The elephant carries on its back an obelisk, inspired by Bernini's Elephant and Obelisk in Rome's Piazza Santa Maria sopra Minerva.\n\n\\-\n\nI added the whale and the bowl of petunias to make the joke from Hitchhiker's Guide to the Galaxy.",
            "score": 262,
            "author": "QuicklyThisWay",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is not a rifle. It is a single-shot shotgun. Essentially it is one of the cheapest form factors of guns that exist, and to have a bayonet attached to one is frankly unheard of and almost more surreal than the rest of the painting.",
                    "score": 70,
                    "author": "autoposting_system",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Really? More surreal than a tiger with a shotgun coming out of another tiger coming out of a karp coming out of a pomegranate, and an elephant with towering stilts for legs? I feel like the bayonet on the shotgun is the most realistic thing in that painting... well, that, and that spectacular bosom.",
                            "score": 47,
                            "author": "SheepH3rder69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean at least tigers and women and so forth are things that exist. I've literally never heard of a single-shot shotgun with a bayonet mount before.",
                                    "score": -19,
                                    "author": "autoposting_system",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tigers and karp exist, but I'd say the chances of a bayonet on a shotgun in real life are much higher than a tiger being spit out of a karp in real life...",
                                            "score": 36,
                                            "author": "SheepH3rder69",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's probably true. But of course they're all kind of flying around in the air, too",
                                                    "score": -5,
                                                    "author": "autoposting_system"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Like [this one?](https://www.gunauction.com/buy/16365073)",
                                            "score": 5,
                                            "author": "Tyranith",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep. That's the first one I've ever seen. And it's a custom job.\n\nI don't get the point, pun entirely intended. Bayonets are weapons of war; who would use a single-shot shotgun as a weapon of war, except insurgents making their own shotguns? Slam fire shotguns are a thing; I feel like I could build one myself at Home Depot without leaving the store, and I've never built a gun. I could see putting a bayonet on one of those, but it would probably be pretty rough looking. This is, like, a simple hunting shotgun, like for birds or rabbit or squirrel.\n\nWeird",
                                                    "score": 2,
                                                    "author": "autoposting_system",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah even early trench guns were lever or pump action.I still think they're more realistic than elephants with 100ft legs though",
                                                            "score": 5,
                                                            "author": "Tyranith",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ok, sure, you know what, that's a total fantasy element and I didn't even include it in my calculations.\n\nI guess it was the first thing I looked at and so I forgot about it by the time I was done looking and hit the back button.",
                                                                    "score": 3,
                                                                    "author": "autoposting_system"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s not a ~~knife~~ rifle!",
                            "score": 14,
                            "author": "QuicklyThisWay"
                        },
                        {
                            "level": 2,
                            "comment": "gunbros when the gun depicted in the art/cartoon/whatever is unrealistic, when everything else depicted is equally unrealistic",
                            "score": 6,
                            "author": "Dracorex_22",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I do this with motorcycles also.\n\nI don't really consider myself a gunbro. More just a fan of engineering who sometimes reads history",
                                    "score": 1,
                                    "author": "autoposting_system"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for the hitchhiker's guide reference. Definitely a great movie.",
                    "score": 2,
                    "author": "YaboyBlacklist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Movie?!",
                            "score": 1,
                            "author": "Federal_Remote_435",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes. There was a movie adaptation of the book made back in 2005.",
                                    "score": 1,
                                    "author": "YaboyBlacklist"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dali (and OP) the original AI",
            "score": 25,
            "author": "boot2skull",
            "replies": [
                {
                    "level": 1,
                    "comment": "^BEEP boop",
                    "score": 9,
                    "author": "QuicklyThisWay"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes!  Hitchhiker's guide!!!",
            "score": 50,
            "author": "InCONTROLfreak"
        },
        {
            "level": 0,
            "comment": "\"What im suddenly going to call my head\"",
            "score": 7,
            "author": "dude_wells"
        },
        {
            "level": 0,
            "comment": "Looks like a Monty Python animation",
            "score": 6,
            "author": "Organic-Kick-3916"
        },
        {
            "level": 0,
            "comment": "Wasn’t there also a whale?",
            "score": 5,
            "author": "ViviTheWaffle"
        },
        {
            "level": 0,
            "comment": "Is this a Pratchett reference?",
            "score": 3,
            "author": "Unflattering_Image",
            "replies": [
                {
                    "level": 1,
                    "comment": "Close! Douglas Adams - Hitchhiker’s Guide to the Galaxy. I was listening to some Discworld on audiobook, finished Going Postal (so good!) and started the Colour of Magic but never finished it. My goal is to listen to them in order and I’m looking forward to Mort the most.",
                    "score": 20,
                    "author": "QuicklyThisWay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's why it was ringing my bells!  I'm not mad about it! Hitchhikers Guide to the Galaxy is just beautifull.\n - Never heard the Discworld in order but maybe I should! Going Postal is awesome. Hogfather is, too! Everything witch related, my goodness, I'd say go for everything you can get, but you're on it already. Have fun, Dude!",
                            "score": 6,
                            "author": "Unflattering_Image"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dali wanted to represent his peanut alergy on this one.",
            "score": 3,
            "author": "Fern-ando"
        },
        {
            "level": 0,
            "comment": "Eyyyy! Love the movie. Have only gotten through the first book though.",
            "score": 3,
            "author": "Dra9onDemon23"
        },
        {
            "level": 0,
            "comment": "The guy that did my first tattoo had this framed in his livingroom",
            "score": 3,
            "author": "TheElvenWitch777"
        },
        {
            "level": 0,
            "comment": "Is this a version where they button mashed the improbability drive?",
            "score": 3,
            "author": "Chaosshepherd"
        },
        {
            "level": 0,
            "comment": "my dad has this painting in his house. i’ve known it since i can remember. i did not expect to see this",
            "score": 2,
            "author": "the_guy_under_ur_bed"
        },
        {
            "level": 0,
            "comment": "That elephant definitely has arthritis in those joints.",
            "score": 2,
            "author": "iRambes"
        },
        {
            "level": 0,
            "comment": "That elephant needs to take leg day more seriously",
            "score": 2,
            "author": "ImARetPaladinBaby"
        },
        {
            "level": 0,
            "comment": "Honestly I just want whatever Dali was on",
            "score": 2,
            "author": "Empfindsam"
        },
        {
            "level": 0,
            "comment": "This looks like a Beetles album cover lmao",
            "score": 2,
            "author": "The_One_True_Goddess"
        },
        {
            "level": 0,
            "comment": "I love it!",
            "score": 2,
            "author": "loganthor1"
        },
        {
            "level": 0,
            "comment": "Thanks, I hate Eldritchphant.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "If only we knew why the petunias thought that, we would know so much more about the universe than we do now.",
            "score": 2,
            "author": "Somehow-Still-Living"
        },
        {
            "level": 0,
            "comment": "I don't recall the pomegranate, but the rest of this is accurate.",
            "score": 4,
            "author": "sentient_petunias"
        },
        {
            "level": 0,
            "comment": "Second favorite poster in college",
            "score": 2,
            "author": "raindownthunda",
            "replies": [
                {
                    "level": 1,
                    "comment": "What was the first?",
                    "score": 3,
                    "author": "QuicklyThisWay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tie between [The Elephants also by Dali](https://en.m.wikipedia.org/wiki/The_Elephants) and [Body Movin’](https://m.imdb.com/title/tt9870952/mediaviewer/rm3667843841/?ref_=tt_ov_i)",
                            "score": 5,
                            "author": "raindownthunda"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did Dali never see a vulva or is that supposed to be a very long strand of hair?\n\nEdit: u/KeepTangoAndFoxtrot got it in another comment. \"The thigh skin folding over the pubis mons\"\nObvious now after the fact.",
            "score": -2,
            "author": "wty261g",
            "replies": [
                {
                    "level": 1,
                    "comment": "I kind of assumed that was the skin on the thigh folding over the pubis mons.",
                    "score": 8,
                    "author": "KeepTangoAndFoxtrot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now that you say it that's 100% it.\n\nGood observation, beautiful woman.",
                            "score": 5,
                            "author": "wty261g"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's his mustache.",
                    "score": 6,
                    "author": "SirRevan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course, I should've known",
                            "score": 3,
                            "author": "wty261g"
                        },
                        {
                            "level": 2,
                            "comment": "[That makes perfect sense.](https://i.imgur.com/BdbfTsP.jpg)",
                            "score": 3,
                            "author": "QuicklyThisWay"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There is a tiger jumping out of a fish, out of a pomegranate and that is what caught your attention?!",
                    "score": 9,
                    "author": "QuicklyThisWay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, so?",
                            "score": 0,
                            "author": "wty261g"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Most likely including the vulva would have been considered obscene at the time. He may have felt pressure to censor for commercial reasons, patron’s’ sensibilities, or even his own hang ups. I can’t say I know this for a fact - just an educated guess.",
                    "score": 3,
                    "author": "Blagues_Blanca",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seems legit, good guess",
                            "score": 2,
                            "author": "wty261g"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shitpost is older than I thought",
            "score": 1,
            "author": "emireymarBv"
        },
        {
            "level": 0,
            "comment": "Gojira reference?",
            "score": 1,
            "author": "GuitarChump3324"
        },
        {
            "level": 0,
            "comment": "Wrong whale",
            "score": 1,
            "author": "Gossguy"
        },
        {
            "level": 0,
            "comment": "42",
            "score": 1,
            "author": "Zebracorn42"
        },
        {
            "level": 0,
            "comment": "Pomegranate tiger gang",
            "score": 1,
            "author": "Djaguar"
        },
        {
            "level": 0,
            "comment": "Man, Dali really had a thing for those long-legged elephants.",
            "score": 1,
            "author": "DwayneTheBathJohnson"
        },
        {
            "level": 0,
            "comment": "It's not impossible. Just highly improbable.",
            "score": 1,
            "author": "Chubby_Bub"
        },
        {
            "level": 0,
            "comment": "Why is this nsfw?",
            "score": 0,
            "author": "Fiberrig"
        }
    ]
}