{
    "id": "10uxwkx",
    "score": 5947,
    "title": "Thou is tax season",
    "author": "C20H25N3Oh",
    "date": 1675658855.0,
    "url": "https://www.reddit.com/r/trippinthroughtime/comments/10uxwkx",
    "media_urls": [
        "https://i.imgur.com/j4jRwzc.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah, money doesn’t bring happiness but lack of money for sure brings sadness",
            "score": 69,
            "author": "jp_1896"
        },
        {
            "level": 0,
            "comment": "A statement made almost exclusively by people with money.",
            "score": 185,
            "author": "Deranged_Kitsune",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah money doesn't make you happy. But not having money makes a lot of people really sad",
                    "score": 84,
                    "author": "Canye_East"
                },
                {
                    "level": 1,
                    "comment": "Research suggests happiness correlation with income is real but levels off after around $75k/year in the US (obviously would need to be adjusted based on cost of living).\n\nSo yeah a lot of people have problems that money would solve but it's more about being stable and not having to stress about one surprise car repair. or the price of milk, probably less than people imagine being the threshold.",
                    "score": 46,
                    "author": "frenchtoaster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We need an inflation-adjusted income for happiness.\n\nEdit: this had me curious. The $75k cited is from a Princeton study in 2010. The following results are from a quick google search. \n\n$75,000 in 2010 is equivalent in purchasing power to about $102,082.84 today, an increase of $27,082.84 over 13 years. The dollar had an average inflation rate of 2.40% per year between 2010 and today, producing a cumulative price increase of 36.11%.",
                            "score": 26,
                            "author": "IGotSoulBut",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So pretty much what I thought, more money doesn't necessarily mean more happiness but having enough money to be comfortable and safe in an emergency makes people a lot happier than being broke.",
                                    "score": 1,
                                    "author": "Mr_WAAAGH"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "“Happiness isn’t an outside job, it’s an inside job.”",
                            "score": 6,
                            "author": "Consol-Coder"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Money absolutely does make you happy, but with diminishing returns. 10 times more money doesn't mean 10 times happier",
                    "score": 23,
                    "author": "_mortache",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "10 times 0 is still 0",
                            "score": 1,
                            "author": "cjwazjustthere"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Money might not make you happy but it sure as shit keeps away sadness.",
                    "score": 2,
                    "author": "Ehh_littlecomment"
                },
                {
                    "level": 1,
                    "comment": "Ok but if you have no money how would you know… you prefer to listen to people talking out of their asses?",
                    "score": 6,
                    "author": "KodjoSuprem",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone who grew up very poor at one time was living on their own at $10/hr, ~35 hours a week but now is making about $90k, I can tell you that money can buy things that make you smile. It can provide a way to buy things for others, which makes me smile. But I'm still horribly unhappy, I am just not living off credit cards anymore. My salary has provided stability and that can (and does) mean a whole hell of a lot, but I still struggle every day and don't know how to make it better. \n\nI used to think that people who said money can't buy happiness were just not shopping in the right places. But - in my case, at least - doesn't bring you peace or self-worth. It doesn't take away a lot of the issues I have with myself, my past, or with other people. I can just afford to drink and eat away the emotions, which is of course just a vicious cycle to further mental problems. You can call this me talking out of my ass, I'm a total internet stranger. But just a short anecdote has been in both of the proverbial boats.",
                            "score": 4,
                            "author": "disusedhospital",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean its the most basic thing... Human beings Always want more and get bored quickly....but heh kids want their ps5 so i guess a shitty video game console is the pinacle of happiness when you are 13yo",
                                    "score": 1,
                                    "author": "KodjoSuprem"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imagine what happens when you finally receive your paycheck and all bills are paid off.\n\nYeah, it brings happiness for sure. And the more you get the more happiness you receive.",
            "score": 43,
            "author": "DweEbLez0",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s not true tho, it’s been well documented many many times that once you’ve reached a certain income threshold your happiness doesn’t scale with your money. In other words once your basic needs are met and you no longer worry over lack of money, money will become meaningless. In real terms what can 10 million not buy that 100 million can? What an island? As if anyone needs that to be happy.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You is tax season?",
            "score": 9,
            "author": "EternamD"
        },
        {
            "level": 0,
            "comment": "Me with money: black tar heroin",
            "score": 7,
            "author": "yauc-OIC"
        },
        {
            "level": 0,
            "comment": "What’s that “thou” there? Did you just hear it in Shakespeare or KJV Bible and thought it sounded old timey cool? Because it is the informal second person singular pronoun if you didn’t know, as opposed to the formal “you”. So following the verb conjugation of “to be”, the title should say “Thou art tax season”, which of course still makes little sense.",
            "score": 7,
            "author": "Piskoro"
        },
        {
            "level": 0,
            "comment": "Money can't buy happiness, that is true - but it does alieviate one source of stress allowing a little happiness to creep back in to your life on it's own.",
            "score": 5,
            "author": "ideasplace",
            "replies": [
                {
                    "level": 1,
                    "comment": "Money doesn't bring happiness, but no money sure brings sadness",
                    "score": 1,
                    "author": "Mr_WAAAGH"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are receiving that much in a tax refund it means the government is getting an interest free loan for keeping more of your money than they should. Adjustments should be made to your withholding. \n\nhttps://www.1040.com/tax-guide/taxes-and-your-job/adjust-your-withholding/",
            "score": 8,
            "author": "baddecision116"
        },
        {
            "level": 0,
            "comment": "Overposted and reminds me every time that Reddit is for teens and I’m clearly too old mom for meme subs…",
            "score": 17,
            "author": "KodjoSuprem",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was old for someone when you first saw it",
                    "score": 5,
                    "author": "_mortache"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And a loot of food  and beer",
            "score": 3,
            "author": "jhony_94"
        },
        {
            "level": 0,
            "comment": "money brings in material indulgement and escapism, apparently",
            "score": 3,
            "author": "Natours"
        },
        {
            "level": 0,
            "comment": "Just so she can complain how she doesn’t actually have the time to play anything in her enormously backed up library.",
            "score": 2,
            "author": "Stoney-McBoney"
        },
        {
            "level": 0,
            "comment": "No but that's literally my computer case!",
            "score": 2,
            "author": "Ancientghostwolf",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I no longer have access to the Amazon account I bought it with so I can't look up the exact model. But here's a couple that are very similar. They may have just changed the design.\n\n[Case1] (https://www.amazon.com/Dpofirs-Desktop-Chassis-Tempered-Transparent/dp/B09S9TPTWH/ref=mp_s_a_1_63_sspa?adgrpid=118248075345&amp;gclid=Cj0KCQiA54KfBhCKARIsAJzSrdrGpQeOruK1zexLfQUPOcvbcmETVT83GeQLLewT_QvBgg_qH0G2NssaAqptEALw_wcB&amp;hvadid=557323576222&amp;hvdev=m&amp;hvlocphy=9023808&amp;hvnetw=g&amp;hvqmt=e&amp;hvrand=6456439649119068799&amp;hvtargid=kwd-321256299497&amp;hydadcr=11149_13463765&amp;keywords=weird+pc+cases&amp;qid=1675712431&amp;sr=8-63-spons&amp;ufe=app_do%3Aamzn1.fos.f5122f16-c3e8-4386-bf32-63e904010ad0&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUExRkJLU0RZV0hMV0s1JmVuY3J5cHRlZElkPUEwOTgxODQ5M1BaQ1VBOUkzN01MJmVuY3J5cHRlZEFkSWQ9QTA1ODk1NzQ2SkpaSUNaOUlZMU8md2lkZ2V0TmFtZT1zcF9waG9uZV9zZWFyY2hfbXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ==)\n\n[Case2] (https://www.amazon.com/MechWarrior-Computer-Support-Motherboard-Lighting/dp/B08S3DF6QQ/ref=mp_s_a_1_50?adgrpid=118248075345&amp;gclid=Cj0KCQiA54KfBhCKARIsAJzSrdrGpQeOruK1zexLfQUPOcvbcmETVT83GeQLLewT_QvBgg_qH0G2NssaAqptEALw_wcB&amp;hvadid=557323576222&amp;hvdev=m&amp;hvlocphy=9023808&amp;hvnetw=g&amp;hvqmt=e&amp;hvrand=6456439649119068799&amp;hvtargid=kwd-321256299497&amp;hydadcr=11149_13463765&amp;keywords=weird+pc+cases&amp;qid=1675712562&amp;sr=8-50&amp;ufe=app_do%3Aamzn1.fos.c3015c4a-46bb-44b9-81a4-dc28e6d374b3)",
                            "score": 1,
                            "author": "Ancientghostwolf"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Money doesn’t buy happiness” I guess I’ll have to rent it.",
            "score": 2,
            "author": "General-Advice-6331"
        },
        {
            "level": 0,
            "comment": "I’ve made 2k every year since I filed 20 years ago. This year I owe. Shit sucks",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "idk what you meant by “thou is tax season” but this is just a reminder that taxes are taken from your income, not a bonus given to you in a return from the gov",
            "score": 2,
            "author": "Murph_Tha_Smurf"
        },
        {
            "level": 0,
            "comment": "What is the original painting?",
            "score": 2,
            "author": "hikariseeker147"
        },
        {
            "level": 0,
            "comment": "“Money doesn’t bring happiness” is a myth to keep dumb people poor",
            "score": 4,
            "author": "HotNubsOfSteel",
            "replies": [
                {
                    "level": 1,
                    "comment": "This implies dumb people choose to remain poor because they don’t think they’ll be happier if they aren’t poor",
                    "score": 3,
                    "author": "Dragmire800"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Overposted but still funny",
            "score": 1,
            "author": "Refried__Dreams"
        },
        {
            "level": 0,
            "comment": "Cant buy happiness, but it can buy me a boat.",
            "score": 1,
            "author": "Salty_Nectarine3397"
        },
        {
            "level": 0,
            "comment": "Money may not bring happiness but it sure gives you the freedom to pursue what makes you happy",
            "score": 1,
            "author": "sagittariisXII"
        },
        {
            "level": 0,
            "comment": "Money can't buy happiness, but it does buy lots of things that make happiness possible.",
            "score": 0,
            "author": "endlesschasm"
        }
    ]
}