{
    "id": "10y9vgm",
    "score": 3320,
    "title": "The future looks awesome",
    "author": "QuicklyThisWay",
    "date": 1675985446.0,
    "url": "https://www.reddit.com/r/trippinthroughtime/comments/10y9vgm",
    "media_urls": [
        "https://i.imgur.com/WKNn9QX.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "You assume horses will still exist by then?",
            "score": 53,
            "author": "GundamGuy564",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s actually a mutated cat.",
                    "score": 33,
                    "author": "duaneap"
                },
                {
                    "level": 1,
                    "comment": "horses are gonna be the dominant species by then.",
                    "score": 9,
                    "author": "uberguby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No one expects the shark of the Land. THE MOOSE!!!",
                            "score": 2,
                            "author": "baphosam"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't get it",
            "score": 27,
            "author": "MartinOToole683",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -31,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Where the fuck did you get that. This is obviously pointing at the same pose and them both being on horseback",
                            "score": 3,
                            "author": "Golden_Thorn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "OP writes \"the future looks awesome\"... hinting that the change is better. Is that so strange of an interpretation?",
                                    "score": 1,
                                    "author": "BelieveInDestiny",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The way I read it is that society as we know it will be gone completely and we’d be back to using horses as our main means of transportation and instead of high-tech weapons of war, it’s back to hand to hand combat on horseback.",
                                            "score": 1,
                                            "author": "kelliboone617",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "also possible; in fact I'll admit that's probably what OP meant. I still think my interpretation of mild anti-white racism wasn't too far-fetched, though. People acting as though I got it out of nowhere",
                                                    "score": 2,
                                                    "author": "BelieveInDestiny",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You are actually correct according to the artists comment on her artwork. Not racism, though, but placing power where power never was. But it’s a reimagining of Napoleon as black.",
                                                            "score": 1,
                                                            "author": "kelliboone617"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Literally one black person and one white person depicted as equals and homie’s like “I’ve been robbed.” You ain’t Napoleon, moron. You’re his cannon fodder.",
                            "score": 2,
                            "author": "alphabets00p",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "OP writes \"the future looks awesome\"... hinting that the change is better. Is that so strange of an interpretation? You also imply that I feel robbed. For real? I don't care about someone changing Napoleon and making him black; I do slightly care that someone implies that the change is better, hinting at casual anti-white racism\n\nedit: I forget that anti-white racism isn't possible according to redditors",
                                    "score": 0,
                                    "author": "BelieveInDestiny",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The fact you think he changed Napoleon and made him black is pretty funny. That’s a whole other person. Crazy, right? Napoleon’s completely safe and unchanged, bet that’s a relief!",
                                            "score": 1,
                                            "author": "alphabets00p",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't give a flying fuck what the artist did. I'm talking about OP.\n\nedit: also, considering that the ~~background~~ foreground and pose is exactly the same, it is not an unfair conclusion to think that the artist did in fact turn Napoleon black.",
                                                    "score": -1,
                                                    "author": "BelieveInDestiny",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Seems like you do give a flying fuck. You think Napoleon is black now and that scares you. That’s okay. He isn’t! No one will turn you black either, it’s going to be okay. The future might have cool dudes in camo wearing capes riding war horses and that might be awesome or it might not be awesome or it might not happen! You can relax!\n\nEdit: *foreground is the same. The background is notably different.",
                                                            "score": 1,
                                                            "author": "alphabets00p",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dude chill, the artist literally makes a point of making him black",
                                                                    "score": 1,
                                                                    "author": "throwaway-20701",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Who did the artist make black? The subject of his painting is a black man. It’s not Napoleon Bonaparte.",
                                                                            "score": 1,
                                                                            "author": "alphabets00p",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The artist made made a deliberate point about drawing napoleon as a black man.",
                                                                                    "score": 1,
                                                                                    "author": "throwaway-20701"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The future is mixed like it or not. Sorry if you feel but hurt about it but yeah In almost 1000 years people will probably look closer to that than napoleon unless there is a mass white takeover. I’d say that if there are still people that look napoleon in year 3000 then white people would have to go Uber racist between now and then.",
                                            "score": 0,
                                            "author": "ghostoftheai",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You missed my point. I'm not butthurt over the future being mixed (I'm mixed myself; white latino, with German great grandparents). My point was that OP was casually being racist by implying that being black or mixed is better than being any other color. It's not better; it's the same.",
                                                    "score": 1,
                                                    "author": "BelieveInDestiny"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ngl the year 3000 has banging wallpaper.",
            "score": 18,
            "author": "8orn2hul4"
        },
        {
            "level": 0,
            "comment": "Not so awesome, if we still have to fight",
            "score": 102,
            "author": "clovisdebostas",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s okay, he’s just slaying figuratively. As a great woman once said Love is a Battlefield.",
                    "score": 48,
                    "author": "QuicklyThisWay"
                },
                {
                    "level": 1,
                    "comment": "[World War IV will be fought with sticks and stones](https://www.snopes.com/fact-check/einstein-world-war-iv-sticks-stones/)",
                    "score": 18,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can also be bolters and lasguns",
                            "score": 14,
                            "author": "durz47",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And axes! Blood for the Blood God!",
                                    "score": 8,
                                    "author": "SumerWar"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "India and China are on it:\n\nhttps://www.reddit.com/r/ADVChina/comments/10xwbjo/india_and_china_are_developing_medieval_combat/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf",
                            "score": 2,
                            "author": "prince-pauper"
                        },
                        {
                            "level": 2,
                            "comment": "And who could've thought WW4 would begin on the Sino-Indian border.",
                            "score": 1,
                            "author": "AcidActual"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not much has changed but they live underwater",
            "score": 15,
            "author": "Dambuster617th",
            "replies": [
                {
                    "level": 1,
                    "comment": "What are your thoughts on their great-great-great-ganddaughter?",
                    "score": 5,
                    "author": "Dax9000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She’s pretty fine",
                            "score": 5,
                            "author": "Dambuster617th"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why is this the first thing I thought of when I saw the year 3000",
                    "score": 2,
                    "author": "kingweet1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The founder of Dubai, Sheikh Rashid, was asked about the future of his country.  He replied, \"My grandfather rode a camel, my father rode a camel, I ride a Mercedes, my son rides a Land Rover, and my grandson is going to ride a Land Rover…but my great-grandson is going to have to ride a camel again.\"",
            "score": 8,
            "author": "BenjiMalone",
            "replies": [
                {
                    "level": 1,
                    "comment": "And they all loved slavery ☺️",
                    "score": 6,
                    "author": "throwaway-20701",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Still do!",
                            "score": 3,
                            "author": "BenjiMalone"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kehinde Wiley, an African-American artist, strategically re-creates a French masterpiece from two hundred years before but with key differences. This act of appropriation reveals issues about the tradition of portraiture and all that it implies about power and privilege. Wiley asks us to think about the biases of the art historical canon (the set of works that are regarded as “masterpieces”), representation in pop culture, and issues of race and gender. \n\nHere, Wiley replaces the original white subject—the French general-turned-emperor Napoleon Bonaparte — with an anonymous black man whom Wiley approached on the street as part of his “street-casting process.” Although Wiley does occasionally create paintings on commission, he typically asks everyday people of color to sit for photographs, which he then transforms into paintings. Along the way, he talks with those sitters, gathering their thoughts about what they should wear, how they might pose, and which historical paintings to reference.\n\nRead more about this piece [here](https://www.khanacademy.org/humanities/art-history-for-teachers/xeaa3470a:teaching-with-images/xeaa3470a:go-deeper-oppression-and-resistance/a/kehinde-wiley-napoleon-leading-the-army-over-the-alps)\n\nHere’s an interesting tidbit: The background is also infused with tiny paintings of [sperm](https://cdn.kastatic.org/ka-perseus-images/c37b28238c07c99007cbd7b140a9c7bd01993641.png)—Wiley’s way of poking fun at the highly charged masculinity and propagation of gendered identity that are involved in the Western tradition of portraiture.",
            "score": 102,
            "author": "QuicklyThisWay",
            "replies": [
                {
                    "level": 1,
                    "comment": "What issues does this reveal exactly?\n\nHe was an emperor, it was quite important for him to seem larger than life just to keep his position.\n\nI don't see how just inserting a black guy and pretentiously claiming that this really makes you really think about society makes much logical sense. \n\nSure it's nice to look at, and could be considered a parody, but why would this be so thought-provoking?",
                    "score": 40,
                    "author": "HIV-negativator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Napoleon was a real, powerful person who fought real battles and rode real horses. But the original painting isn’t real, is it? It’s propaganda meant to glorify him. With that in mind, how is this not thought provoking? Why is it trivial or parodic to glorify “a black guy?” Maybe he’s a great father or a warrior in his own right like the camo implies? Or maybe he simply isn’t someone who waged total war across a continent? Why don’t we glorify more people who aren’t conquerors?",
                            "score": 6,
                            "author": "alphabets00p",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I meant it's parodic from the artist in the sense that his twist to the painting is that there's a black man where the audience would presumably not expect someone black.\n\nIt's still weird to me that otherwise it's explained as if any white American today could very much relate to a 200 year dead French general, who laid waste to most of Europe. I think people in general shouldn't be romanticised even like we romanticise celebrities today, but to each their own. In the case of Napoleon he really needed that to be the case so he could stay in power for as long as he did.\n\nIf you want to romanticise militaristic black people, there are plenty of actual Africans that achieved a lot in that way and it'd be more meaningful than this.\n\nIf you'd put any random white guy into this painting, I'd react the same way. It just seems weirdly pretentious to explain it that way. I like the art though.",
                                    "score": 2,
                                    "author": "HIV-negativator",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is that the twist? Where’s it set? That’s not the Alps, it’s indoors and arranged. More like a studio. But the painting is still called “Napoleon Leading the Army over the Alps.” Jacques-Louis David wasn’t with Napoleon when he crossed the Alps. He was in a studio. but that’s not what his painting depicts. Which one’s more realistic or closer to truth? Neither. They’re both lies. They’re both pretentious! And honestly the racial component is most interesting because it’s the only thing some people seem to see. Horse is a different breed, or at least a different color. Why? Why are the modern subject’s clothes different if all he changed was the race of the subject? Class, race, gender (masculinity and militarism), it’s all there if you ask it questions. Won’t get answers, of course, but plenty of thoughts to be thought",
                                            "score": 2,
                                            "author": "alphabets00p"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's meant for the non-white gaze and it is meant to empower the non-white viewer. It's also subversion, because he literally walked around impoverished neighborhoods, like the one he grew up in here in Chicago, to find his subjects and paints them in the clothes that they are wearing. He literally walks up, introduces himself, and asks them to be his muse. So not only is he subverting expectations by inserting \"peasants\" into the iconography of the oligarchs, he's empowering basic men and women by making them his muses and cementing their likeness into art history, and he's also empowering viewers by inserting their likeness into a portion of history, and art history, that vehemently rejects and torments us. But don't fret, it's not for everyone but anyone can enjoy it, this is the nature of art.",
                            "score": 3,
                            "author": "AyPeeElTee"
                        },
                        {
                            "level": 2,
                            "comment": "There is a tradition of depicting black people in positions of power and leadership to make progressive statements. This isn't new, and will probably continue for a while still. If it's bizarre to you that the idea of a black person leading an army would be considered transgressive, that's good for progressives. That's what we want.\n\nBut we also want it to be known (at least for a little while longer) that this was and is still considered transgressive in some places. Well... I mean I don't know about *this,* Napolean is like 200 years old. He might have chosen a more contemporary example.\n\nI'm also not deeply ingrained in race conflict. It's just that this is fundamental knowledge about american society, and if you're an american you have a right to know it. Depictions of black people in positions of leadership and power is an ongoing conversation which has been continuing for decades. Where you fall in that conversation is up to you, but you should know the conversation exists, and it's probably been going on for longer than you've been around, and will almost certainly continue long after we're both gone.\n\nIf you're not an american then I can't make any statements about your society, and you might be able to disregard this, but I can't guarantee it. I'm saying I don't know.",
                            "score": 13,
                            "author": "uberguby",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm not American, but I feel like it would make more sense to just promote a wider history of the world be taught in schools then.\n\nOf course people that were never taught anything about African history, wouldn't know about empowered Africans, same goes for all races.\n\nI feel like if it's meant to provoke blatant racists who don't want to see a black in power, then it's kinda counterproductive.",
                                    "score": 5,
                                    "author": "HIV-negativator",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's meant for the non-white gaze, not to provoke racists...",
                                            "score": 6,
                                            "author": "AyPeeElTee"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The Detroit Institute of Arts has another piece of his on display, and the summary on the site explains it nicely in my opinion.\n\n[Officer of the Hussars](https://dia.org/collection/officer-hussars-98007)\n\nIn summary, portraiture has always been a symbol of status and power.  In the US, black men haven’t had that status or power historically, so inserting them with a mix of traditional and contemporary elements challenges how we perceive portraiture, and by extension, who we (as a society) value and revere.",
                            "score": 2,
                            "author": "queseraseraphine"
                        },
                        {
                            "level": 2,
                            "comment": "The whole thing sounds pretty stupid, tbh.",
                            "score": 6,
                            "author": "Weird_Cantaloupe2757"
                        },
                        {
                            "level": 2,
                            "comment": "Without OP (or the artist i guess) full context I would just see it as a cool reimagining of a classic portrait. With the context I’m just confused and it feels like a “We live in a society” thing thats over explaining a non-existent issue.\n\nI understand the target audience is different which is cool and very apt but the explanation feels condescending as if I’m unable to understand the physical context around a piece of art. Ultimately the point is lost on me, great paint though. I do like how the artist finds his subjects. I think that is really neat",
                            "score": 1,
                            "author": "Cman1200",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "~~Without OP (or the artist i guess) full context I would just see it as a cool reimagining of a classic portrait. With the context~~ I’m just confused ~~and it feels like a “We live in a society” thing thats over explaining a non-existent issue.~~\n\n~~I understand the target audience is different which is cool and very apt but the explanation feels condescending as if~~ I’m unable to understand the physical context around a piece of art. Ultimately the point is lost on me, ~~great paint though. I do like how the artist finds his subjects. I think that is really neat~~",
                                    "score": 1,
                                    "author": "alphabets00p",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So can you explain the point better than instead of just being an ass?",
                                            "score": 2,
                                            "author": "Cman1200",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just seeing a lot of people in this thread saying “this isn’t thought provoking cause I don’t like the thoughts it’s provoking.” There isn’t one point, there are countless. I’d rather you articulate what you mean by “non-existent issue.” This painting was from 2005, maybe the “issue” you’re referring to has been fully addressed since then? The logistics of crossing the alps on horseback to conquer Europe could be regarded as a “non-existent issue.” Does that make the original version less interesting?",
                                                    "score": 1,
                                                    "author": "alphabets00p",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I didnt say it wasn’t thought provoking. I just think the artist/OPs explanation of it was pretentious.\n\nAs far as the issue, i dont see how inserting a POC is making a statement. Not every piece of art has to be for an issue or make some profound statement. The art itself and the way the artist made it is really cool I think but the paragraph explnation OP included is dumb. Feel free to disagree but thats just my 2c",
                                                            "score": 1,
                                                            "author": "Cman1200",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Art is pretense. Both paintings are pretentious.",
                                                                    "score": 1,
                                                                    "author": "alphabets00p"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Wiley asks us to think about the biases of the art historical canon, representation in pop culture, and issues of gender and race.\n\n\nEh… how?",
                    "score": 9,
                    "author": "duaneap",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why does the painting of Napoleon exist? Who deserves to be represented so heroically? What’s changed between 1801 and 2005 and what hasn’t? Where would Napoleon be in modern times and where would the subject in the modern painting have been in Napoleonic times?",
                            "score": 2,
                            "author": "alphabets00p",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because he was Emperor of France and won a shit load of battles? What does that have to do with race or gender?",
                                    "score": 0,
                                    "author": "duaneap",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Artist: “asks us to think”\n\nYou: No.",
                                            "score": 4,
                                            "author": "alphabets00p",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s such a fucking vague answer though, you can apply that to absolutely anything. *Everything* asks you to think, where is the relevance to gender or race? Just cos it’s a black guy in place of a French… also guy?",
                                                    "score": 2,
                                                    "author": "duaneap",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Just gonna be annoying and say some French people are also black people, even during Napoleon’s lifetime!\n\nThe original painting, I agree, it has nothing to do with race and gender…unless you want to use it to make a point about race and gender. The painter of the modern painting decided to use the original painting to make a point about race and gender and I think he did a good job. If you’d like to better understand that point, you’re gonna have to ask yourself questions that have no answer. And that’s called “thinking.”",
                                                            "score": 1,
                                                            "author": "alphabets00p",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And what exactly *is* the point, then?",
                                                                    "score": 2,
                                                                    "author": "duaneap",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Hell ya, dude. You’re on the right track 👍",
                                                                            "score": 1,
                                                                            "author": "alphabets00p",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Wtf does this even mean?",
                                                                                    "score": 2,
                                                                                    "author": "duaneap"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ya bruh, this 2005 painting by an artist who has since painted an official presidential portrait is just worthless woke trash for white girls. You’re so smart and good at thinking original thoughts, someone should paint a heroic portrait of you!",
                                    "score": 1,
                                    "author": "alphabets00p"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm pretty sure 1800 and 200 years before is not 3000.",
                    "score": 6,
                    "author": "lefttheovenoff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You see, the painting is from 200 years before now (1800). The right painting is current. As you probably know, this is not a painting comparison sub, so the \"going to battle in 3000\" bit is supposed to be the meme part of the post.",
                            "score": 13,
                            "author": "KoirMaster"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You just know he gets high on his own farts",
                    "score": -8,
                    "author": "MrSloth1"
                },
                {
                    "level": 1,
                    "comment": "I can appreciate taking a stand and having something to say, but I can imagine a handful of ways off the top of my head to do it better.",
                    "score": -4,
                    "author": "proglysergic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "🎶 IN THE YEAR THREEE THOOUUUSSS-AAAND🎶",
            "score": 4,
            "author": "SirDigbyChickenC-Zer"
        },
        {
            "level": 0,
            "comment": "You think there will be breathable air by the year 3000? What an optimist you are!",
            "score": 7,
            "author": "lonewolf143143",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not much has changed, but we live underwater.",
                    "score": 2,
                    "author": "Dax9000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What was that quote from Einstein about ww4 being fought with sticks and stones?",
            "score": 3,
            "author": "gh0sty11"
        },
        {
            "level": 0,
            "comment": "Neat.\n\nThis is not a battle. It's the crossing of the Alps.",
            "score": 3,
            "author": "Unpacer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why was he crossing the Alps? If he wasn’t “going to battle” he must’ve wanted to ask the Austrians to borrow a lawnmower or a cup of sugar or something",
                    "score": 3,
                    "author": "alphabets00p",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cause I read wrong",
                            "score": 3,
                            "author": "Unpacer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Napoleon 3000 looks a lot more comfy tbh",
            "score": 2,
            "author": "BabserellaWT"
        },
        {
            "level": 0,
            "comment": "The Jonas brothers told me not much would change except they live under water.",
            "score": 1,
            "author": "spruceymoos"
        },
        {
            "level": 0,
            "comment": "Honestly Napoleon's a Lil' power-drunk to put himself above Caesar and Hannibal but like, dude- the future can read, we know all about Egypt and Russia dawg.",
            "score": 1,
            "author": "-Minne"
        },
        {
            "level": 0,
            "comment": "Giddy-up Emperor 3000.",
            "score": 1,
            "author": "Good_Juggernaut_3155"
        },
        {
            "level": 0,
            "comment": "First as tragedy, then as farce",
            "score": 1,
            "author": "RyanPendell"
        },
        {
            "level": 0,
            "comment": "So by the year 3000 we'll have blasted ourselves back to the pre-industrial age? \n\nWouldn't surprise me at all.",
            "score": 1,
            "author": "JustAnotherJoeBloggs"
        }
    ]
}