{
    "id": "11hk1jz",
    "score": 3,
    "title": "anyone familiar with the kifaru E&amp;E ? looking for an almost identical bag, just a little bigger ??",
    "author": "joeyfuture",
    "date": 1677889487.0,
    "url": "https://www.reddit.com/r/Survival/comments/11hk1jz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I love the E&amp;E, but it's just a little too small for a patrol style bag. Anyone know of anything almost identical but just a little bigger ? I have the direct action gear, ghost bag.. it's awesome, just not the right size for the system I want. I also have the crossfire DG1, which would probably be perfect if it didn't have the helmet pouch. So what's in-between these two, and the Kifaru E&amp;E ?",
    "comments": [
        {
            "level": 0,
            "comment": "Check out the pack offerings at Tactical Taylor.  They have a few that might meet your needs.",
            "score": 2,
            "author": "SaltyEngineer45"
        },
        {
            "level": 0,
            "comment": "I love my 5.11 rush pack. That things holds everything and a kitchen sink. I’ve had the same bag for 6 years and countless adventures and it’s still awesome. Lots of pockets and storage.",
            "score": 1,
            "author": "bAssmaster667"
        },
        {
            "level": 0,
            "comment": "Kifaru e and e with pockets attached to the molle panels is the best I could muster from all my years of searching for what you're searching for. Still I was kind of left wanting sadly\nI stuck a couple of nalgene pouches to the sides and multi-purpose to the front.",
            "score": 1,
            "author": "carbonndeathh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey guess what, I found something really similar last night. The only thing different besides some additional inside pouches is that it doesn't have the ability to dock to my main ruck sack like the E&amp;E. I've got another attachment system, so that's not a deal breaker.\n\n[almost identical to the E&amp;E](https://www.varusteleka.com/en/product/sarma-tst-cp15-combat-pack-main-bag/62218?country=US&amp;variant=33916&amp;gclid=Cj0KCQiA0oagBhDHARIsAI-BbgcgH1lLNQ8I7jGv30NH7XIJRAGQG0Jd5OMImm5ctjFq8lBS6ZEiL1oaAtkAEALw_wcB)\n\nThe dimensions are just a couple inches bigger, which just might be exactly what I'm looking for. Might still be too small, but it's a risk I'm willing to take.",
                    "score": 3,
                    "author": "joeyfuture",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very nice find mate\n\n*edit spelling*",
                            "score": 3,
                            "author": "carbonndeathh"
                        }
                    ]
                }
            ]
        }
    ]
}