{
    "id": "11ks9vk",
    "score": 113,
    "title": "Desalination using beach litter that is actually commonly available?",
    "author": "After-Cell",
    "date": 1678172917.0,
    "url": "https://www.reddit.com/r/Survival/comments/11ks9vk",
    "media_urls": [],
    "other_urls": [],
    "postText": "I want to test this on the next remote beach I visit. The issue is that many designs use materials that aren't actually available on the beaches that I've seen. The more commonly available stuff tends to be:\n\n- fishing gear\n- plastic bottles\n- TORN plastic bags\n\nThe plastic bottle method is very slow, but does it actually work at all? \nThe covered dug hole requires plastic sheeting that I've rarely seen available. \n\nI believe the key in any design is the differentiation of hot and cold. Thus, you can let a bottle sit in the blazing midday sun, but you need some shade to move the water to. That requires a tube, yet rarely seen tubing wash up on the beach. \n\nLikewise, heating water in metal over a fire is a much more reliable plan, but again, finding metal is a bit rare. \n\nThat said, I'll take a closer look on next beach trips.",
    "comments": [
        {
            "level": 0,
            "comment": "You should be able to dig a hole far from the water but still on the sand and get unsalty water.",
            "score": 27,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is it…even a hole 100feet from shore will give you fresh water to drink…by the buckets and relatively easily…the condensation method is thimbleful amounts in hours…I’ve done this on the outer banks (sand bar islands of North and south carolina) and confirmed the water was fresh with some specialized equipment…",
                    "score": 38,
                    "author": "nato2271",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How does one sanitize the water after?",
                            "score": 7,
                            "author": "IdahoSavage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There is a group of horses living in on island near the outer banks that have been there for a long time (since a ship wreck) and they survive by drinking water from holes they dig with their hooves…",
                                    "score": 20,
                                    "author": "nato2271",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So you sanitize it by filtering it through horses? Not sure I agree with that logic but you do you.",
                                            "score": 8,
                                            "author": "Jumpy-Shift5239",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Once the horses drink the water you can drink their urine…thought that next step was obvious…",
                                                    "score": 7,
                                                    "author": "nato2271",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah. It was. Lol",
                                                            "score": 2,
                                                            "author": "Jumpy-Shift5239"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Condensation is as clean as the container it condenses onto and doesn't contain water borne pathogens because there wasn't liquid water there before.",
                                    "score": 4,
                                    "author": "Cardabella"
                                },
                                {
                                    "level": 3,
                                    "comment": "Well that’s the great thing about sand it’s a natural filter…the water is good to drink straight out of the hole you dig but if you want to clean it up the run it through a plastic bottle full of sand…put a small hole in the lid, cut the bottom off, fill with sand and the place over a container…water is filtered…",
                                    "score": 2,
                                    "author": "nato2271",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sand isn’t fine enough to filter out the things you would actually want to filter out (bacteria and such).",
                                            "score": 6,
                                            "author": "ChemTrades",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In a survival situation it's fine. Would you choose to die of thirst because you're afraid water might be contaminated?\n\nIt takes 2-3 weeks for giardia symptoms to appear if you drink contaminated water. But you die in 3 days without water.\n\nEvery survival expert will tell you to drink whatever water you have available because it'll keep you alive. Worry about the infections when you are rescued or get back to civilization.",
                                                    "score": 6,
                                                    "author": "medium_mammal",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think if we can add some charcoal, that's ideal. However, if that's lacking, maybe earth can be helpful in some way?",
                                                            "score": 5,
                                                            "author": "After-Cell"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Had to Google bc I had no idea giardia takes that long. You were closer than my guess. \n\nCDC SAYS\n\n\"Symptoms of giardiasis normally begin 1 to 2 weeks after becoming infected.\"",
                                                            "score": 1,
                                                            "author": "IdahoSavage"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It actually is…maybe not viruses but the spaces between sand particles get small enough that it actually does trap bacteria and parasites…I would use at least a foot of sand to be safe but I’ve done it with groups of students and no one has got sick…",
                                                    "score": 1,
                                                    "author": "nato2271",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There is a difference between \"no one has got sick from it\" and \"you can't get sick from it\". Just because no one has is not evidence.",
                                                            "score": 0,
                                                            "author": "Jumpy-Shift5239",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Then maybe this will help you:\n\nhttps://www.sciencedirect.com/topics/engineering/slow-sand-filter",
                                                                    "score": 2,
                                                                    "author": "nato2271",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah. Much better. Thank you.",
                                                                            "score": 0,
                                                                            "author": "Jumpy-Shift5239"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Assuming its sunny out you can distill it with minimal garbage or equipment.\n\nOr boil by dropping hot rocks in the water.",
                                    "score": 1,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "You could filter it through charcoal or boil it.",
                                    "score": 1,
                                    "author": "falconvision"
                                },
                                {
                                    "level": 3,
                                    "comment": "Boiling it. Charcoal doesn’t kill bacteria",
                                    "score": 1,
                                    "author": "DamnImBeautiful"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "TIL the coyote well method works as a desalination filter if you're a little distance from the sea shore. \n\nThanks!",
                    "score": 9,
                    "author": "No_Sympathy_1915",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not so sure. I believe the water in this method can actually be fresh water sitting on top of salt water, and that its not related to the sea, but to fresh water sources on its way to the sea. I will try at the weekend. \nI don't think it's as reliable as digging anywhere. It will be interesting to try. Digging a hole can get a person even more dehydrated, but if it's less risky than searching for a river mouth, that'll be very useful to know.",
                            "score": 2,
                            "author": "After-Cell"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you call find a plastic bag and there are trees in leaf, you can catch and condense transpiration  from a branch",
            "score": 3,
            "author": "Cardabella",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll try that with some plastic bottles this weekend. It will also be interesting to see how many plastic bags I can find. I usually notice them more in the sea",
                    "score": 2,
                    "author": "After-Cell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty straightforward. You need a bucket, a smaller container that can fit in the bucket (like a jar), some sort of waterproof cover that fits over the bucket, and a rock. You put the jar inside the bucket and add salt water until it's partially submerged but not floating. Place the cover over the top. Put a stone in the middle of the cover to create an indent over the jar. Then you just wait.",
            "score": 9,
            "author": "SpeaksDwarren",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ive been beach combing for decades and it is pretty unlikely  i would find all that stuff in a usable state. Lucky to get a bucket without a hole let alone an intact flexible cover. Never seen an intact non floaty jar (by their nature they don't tend to wash up).",
                    "score": 12,
                    "author": "Neocon69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You've never found a bucket at the beach? I genuinely find that hard to believe. Also note I said \"a smaller container that can fit in the bucket (like a jar)\" which can be anything from another bucket to a water bottle. You can do it with large enough leaves if you want. Plastic sheets were literally in the OP and a rock is incredibly easy to find. The point is the condensation not finding the exact specific items in perfect conditions.",
                            "score": 1,
                            "author": "SpeaksDwarren",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Might be able to use plastic food containers. Those are pretty common. Will have a look for more stuff at the weekend",
                                    "score": 2,
                                    "author": "After-Cell"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ive found plenty of smashed buckets but i don't recall finding a good one.\nA floaty jar would have to be held down. With contaminated rock? Or some kind of braced stick contraption, but those aren't the main issues.\nLike you said, getting and funnelling condensation is the key. To get any kind of condensation, whatever membrane you use for the top is going to have to be sealed and not damaged with holes. To get it to drip to a certain place above a container needs faitly soecific angles. It is pretty unlikely to find anything suitable for that purpose on a beach. There aren't many big leaves around here either, definitely none bigger than two containers in a hole.\n\nI know how to set it up and can easily do it with household items, just saying from my experience at the beaches I've been to it would be hard to find stuff that would actually work, let alone give you enough water to live on.",
                                    "score": 1,
                                    "author": "Neocon69"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's straight from Mr. Wizard if anyone remembers that show.",
                    "score": 8,
                    "author": "Fun-Coast-7525"
                },
                {
                    "level": 1,
                    "comment": "The whole point was being able to do it with stuff that may be readily available to scavenge from the beech.",
                    "score": 8,
                    "author": "These_Hair_3508",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right, which is why I explained an easy way to do that",
                            "score": -1,
                            "author": "SpeaksDwarren"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A nice 8 inch clay plant pot with drainage, fill it with layers of rocks and sand, pour water on top for filtered water on the bottom",
                    "score": 1,
                    "author": "gibusyoursandviches",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can't drink salt water nor filter out the salt though",
                            "score": 0,
                            "author": "Cardabella",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also where are you finding the clay pot?",
                                    "score": 1,
                                    "author": "Cardabella",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sorry I'm thinking less in terms of survival and more in terms of sustainability and low tech. Depending on the beach and sustainability, you could use coconut as containers, the husk as filtering and wait for rainfall. \n\nYou could also find heavy rocks, dig out a hole way before the high tide line, surround the perimeter with rocks, you dig deep enough you should find crystal clear water. The rocks are for adding pressure underwater to bring out the moisture trapped within the sand.",
                                            "score": 2,
                                            "author": "gibusyoursandviches"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Apparently(?), earth can filter salt eventually. Will be interesting to try",
                                    "score": 1,
                                    "author": "After-Cell"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just watched a YouTube video of a guy that burned and scraped a bowl into a log, then put water in the bowl part. Then he kept heating rocks and putting them in the water and reheating the rocks in the fire until he got the water boiling ( one of 8 rocks blew up in the fire so he did it with 7 i think) You still have to catch the steam though. I don't know if you could make a hood from torn plastic bags peaking to the side of the hot rock bowl and sluice from your torn plastic bags or big leaves, and stick bottles together for a tube away from the hood? Totally just throwing stuff out there. Might work better if you did that at night when the air was cooler?  I'm guessing and never tried it, don't even know if it makes sense, just trying to brainstorm.",
            "score": 5,
            "author": "capt-bob"
        },
        {
            "level": 0,
            "comment": "A teenager in Indonesia survived *49 days* before being rescued when the floating fishing shack he was working on became unmoored and drifted out to sea.\n\nHe had some fuel to boil water and cook, so didn't start using this method until that ran out, but for apparently an extended period of time he was using his shirt as a filter to remove some of the salt from the water, and it worked.\n\nYou don't need to remove all of the salt (in fact, you might die if you actually remove all of it - we can't survive without some salt intake), you just need to remove enough salt for your kidneys to be able to process it. How much that is probably depends on how long you need to survive.\n\nAnyway... a shirt isn't the only way to filter water. On land you'd have more options, soil for example works really well. The more soil you run the water through the more salt you'd remove. Most harmful things in water need a surprisingly small soil filter to make the water safe to drink. Salt probably needs more, I'm not sure how much more but I imagine if a t-shirt removes enough (for a short term emergency) then you wouldn't need a massive soil filter to make seawater at least safe enough to survive off, if not taste great.\n\nAll you really need is a container full of soil with an opening at the top and bottom. Which you can make with clay (you will need to fire the clay, so it'll be a lot of work... but it can be done. A plastic bucket would definitely be less work).\n\nAlternatively, just dig a hole. This'd be a good short term solution.",
            "score": 4,
            "author": "sesame_dukes0j",
            "replies": [
                {
                    "level": 1,
                    "comment": "That doesn’t sound right. The salt is dissolved in the water.  I don’t see how a fabric mesh could possibly filter the salt.  It would be useful to filter particulate, but nothing beyond that.",
                    "score": 6,
                    "author": "botanica_arcana"
                },
                {
                    "level": 1,
                    "comment": "Idk about this. Salt disassociates in water into sodium and chlorine ions. The filter would have to be very very fine to remove the ions from the water molecules which are basically the same size. Cloth might be able to remove some bacteria but bacteria is much larger than the disassociated salt ions. Google tells me that a sodium ion is roughly 227 picometers in radius, whereas E-coli is roughly 500,000 picometers",
                    "score": 2,
                    "author": "Ten__Percent"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So most of the time I’m able to find plastic bottles and a mixture between soda cans and glass bottles. Soda or glass you can boil the water pretty easily , have plastic bag above catching the steam and have it drip down into another bottle. Should be safe enough then. That combined with other sources of fluids such as coconuts and vegetation.",
            "score": 2,
            "author": "Teliotex"
        },
        {
            "level": 0,
            "comment": "As others have said, digging a hole far enough inland will usually yield sufficiently desalinated water so long as the soil and silt is sufficiently compacted. \n\nThat said if you can find a couple old bottles and maybe a tote or tub plus some tarp or plastic sheeting you can make a solar still.",
            "score": 2,
            "author": "gaurddog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Last week I had a go and it didn't work. I was digging on an old dry river bed that led onto the sea. I got down 2' and got exhausted pretty quickly. \n\nSo, I had a look on YouTube and found a couple of examples of people digging holes like this. In one, (I forget the link), they used shovels and tools from 100's of years ago and needed to go deeper than head height. \nIn another, the guy dug in mud right next to a river. He then reinforced the sides of the hole with bark. That looked much easier. The hole filled pretty quickly. It only needed to be bailed about 3 times before it looked pretty clear. However, he still recommended boiling the water. \n\nI want to actually use this instead of buying bottled water at the beach, which is $5 for 2 liters. That's another immediate goal. \n\nSo, I'm going to go back to that beach and try 2 things:\n\n1) Go around the corner where I know there's a stream. I'll dig a hole by that and line it with an scrap plastic I can find, stones at the bottom. I'll test it with my lifestraw only. \n\nThen, I'll try the solar still _as well_:\n\n2) I found that glass bottles are actually more common than I first thought. I'll try heating one of those in a fire and catch the steam in a plastic bottle, washed in the sea. I'm confident to drink this direct. \n\nThen I'll also try another method, if I get time with the solar still. I found that plastic sheeting is rare on the beach in tact. However, I noticed that there's plenty on the seabed. If I can get some of that up, I'll dig a hole and try the solar still. \nLast time, the plastic material I found was too tough to cut with a bad knife. That was interesting. \n\nThere's quite a lot of details to actually work through. It seems easy, until it's not. \nGetting the hang of plastic is pretty useful. It burns toxic, but reliably as well.",
                    "score": 2,
                    "author": "After-Cell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why can't you use  a rip cord like the old child toy.  Have the tide pull it to create heat friction much like a lighter.",
            "score": -1,
            "author": "ctusa73",
            "replies": [
                {
                    "level": 1,
                    "comment": "This needs further explanation",
                    "score": 2,
                    "author": "After-Cell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok remember those old rip cord toys?  I always wondered why you couldn't put an object in the ocean that would get pulled up by tidal waters and pushed down by  gravity.",
                            "score": 1,
                            "author": "ctusa73",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think you're talking about a rachet effect.\n\nWhat is the anchoring point in your example?\n\nAnd how does this related to desalination?",
                                    "score": 1,
                                    "author": "After-Cell"
                                },
                                {
                                    "level": 3,
                                    "comment": "I like where your head’s at but I think it might be too slow to generate usable heat.",
                                    "score": 1,
                                    "author": "hamboy315"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}