{
    "id": "11zsy8v",
    "score": 292,
    "title": "What’s the best single survival/homesteading book I can buy?",
    "author": "AHSQU1RR3L",
    "date": 1679596197.0,
    "url": "https://www.reddit.com/r/Survival/comments/11zsy8v",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "More of a homesteading book than survival  . . . but Dick Proenneke was the real deal and the book by Sam Keith called \"One Man's Wilderness\" is pretty good.",
            "score": 89,
            "author": "ank___",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is it good for a kid to read?  My preteen son is very interested in wilderness.",
                    "score": 8,
                    "author": "HereIam06",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The book “Hatchet” is pretty amazing. One of the most influential books of my childhood.\n\nIt’s about a boy who survives a plane crash in the Canadian wilderness with nothing but a hatchet.\n\nI’ve read it with my daughters and they absolutely loved it.",
                            "score": 18,
                            "author": "ElJeffe263",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My side of the mountain is an awesome little book too",
                                    "score": 3,
                                    "author": "rogue21me",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So good",
                                            "score": 1,
                                            "author": "tossaside555"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Was literally mandatory reading from my father growing up.\nGreat book.",
                                            "score": 1,
                                            "author": "Djakk-656"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh man read this back when I was a kid in school. Core memory for me. That book was amazing",
                                    "score": 2,
                                    "author": "nogonigo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "All\\* books are great for kids to read. If it's too hard and interesting they will naturally skill up while reading it :)  \n\n\n\\*Obviously not all books are \"suitable\", what I mean is, there's no such thing as a kids book. Any book is a kids book if they want to read it :)",
                            "score": 24,
                            "author": "richardathome",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hear that last sentence always in Mitch Hedberg's voice.",
                                    "score": 2,
                                    "author": "Kwickening"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes, absolutely!  It is not difficult to read.  \n\nI remember watching the PBS special on Mr. Proenneke when I was probably around 12 years old and I was hooked on this mans grit and fortitude (and ingenuity).",
                            "score": 2,
                            "author": "ank___"
                        },
                        {
                            "level": 2,
                            "comment": "I think it’s perfect for a kid his age to read. There’s also a movie.",
                            "score": 1,
                            "author": "redisherfavecolor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Proenneke is a legend. I remember watching some of his video. Basically he just went to a spot in the woods, built a log cabin and lived there for almost the rest of his life.\n\nGet the book and watch the videos about him. Very inspiring.",
                    "score": 4,
                    "author": "Sharp_Discipline6544"
                },
                {
                    "level": 1,
                    "comment": "This.",
                    "score": -1,
                    "author": "Environmental_Noise"
                },
                {
                    "level": 1,
                    "comment": "Proenneke is a legend. I remember watching some of his video. Basically he just went to a spot in the woods, built a log cabin and lived there for almost the rest of his life.\n\nGet the book and watch the videos about him. Very inspiring.",
                    "score": 1,
                    "author": "Sharp_Discipline6544"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The SAS survival guide by John 'lofty' wiseman is chock full of direct knowledge , they're many others but his guide is a classic.",
            "score": 108,
            "author": "jahmycos",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree wholeheartedly. Best Survival book I have read so far.",
                    "score": 14,
                    "author": "trackersurvival"
                },
                {
                    "level": 1,
                    "comment": "I still take my pocket edition with me whenever I go somewhere scary!\n\nLast year we went out into the desert and I felt so much safer knowing that I had it in my pack.",
                    "score": 21,
                    "author": "the_hucumber",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To quote any and all .com nerds out there, “There’s an app for that”…. Think it’s about $6. Haven’t bought it but it might be interesting. I’m going to check out the lite version.",
                            "score": 3,
                            "author": "bAssmaster667",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But how will I check the app after I smash my phone to Macgyver a fish hook and a signalling mirror?",
                                    "score": 21,
                                    "author": "the_hucumber",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tel tsk tsk… that’s why you always hike with a friend. In an emergency you can use their bones, teeth and in some cases, kidney stones as emergency fish hooks and you can use the rendered fat to set a signal fire that, due to the high bacon related cholesterol, will be highly Smokey and seen for hundreds of miles around.  Always hike with a friend fatter than you. There’s your P.S.A. For today kids. The more you know is half the battle with dementia.",
                                            "score": 23,
                                            "author": "bAssmaster667"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Open source one called Survival Manual. I have it, although im not qualified to tell you if its any good.",
                                    "score": 1,
                                    "author": "Nodlek0",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for the tip, I’ll check it out. I love knowledge from different sources to compare techniques and tips to find what works for me. (It helps with the scenarios of survival I make up in my head at night when I should be sleeping… the airplane crash in the jungle and open water at sea is my favorite…)",
                                            "score": 2,
                                            "author": "bAssmaster667"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Amazing book",
                    "score": 3,
                    "author": "slowthanfast"
                },
                {
                    "level": 1,
                    "comment": "What are the odds I just found that on a mall trip. Good to see this book get the recognition it deserves! Was a great first purchase.",
                    "score": 2,
                    "author": "Sufficient_Ad5566"
                },
                {
                    "level": 1,
                    "comment": "Yep. Bought mine in the mid 90s.",
                    "score": 1,
                    "author": "Jas_G_111"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There’s one called “Back to Basics” that I believe was published by Readers Digest in the 1980s. It’s away be a bit dated but the basics don’t really change that much",
            "score": 40,
            "author": "davegrohlisawesome",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely the most DIY of those listed here",
                    "score": 8,
                    "author": "YardFudge"
                },
                {
                    "level": 1,
                    "comment": "I loved this book! Practically memorized it.",
                    "score": 8,
                    "author": "BrentOGara",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s in 4th edition so not dated …",
                            "score": 5,
                            "author": "DeFiClark"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's hard to find a book that would encompass both things since homesteading would be the next step after survival. Homesteading and survival don't really cross over unless you're looking for post apocalyptic advice stuff like on r/preppers\n\n\nYou might have some luck looking at bushcraft books. Those are going to give you information that would help making homesteading-ish things in a survival environment",
            "score": 18,
            "author": "anexiledone",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is the whole problem with using the ***Foxfire bo******oks***, (*which recount life and skills applicable to Appalachia*), while damned interesting don't do you any good if you are lost in the Sonoran desert, or the wilds of Canada.  Likewise knowing when to plant corn, or where to look for *ginseng* is nice, you are concerned with survival, not establishing a colony. Nor are you likely to put together a quilting party with the mothers. . . \n\nNor are some of the skills practical. . making moonshine is great in theory, assuming you have the time, energy and materials, but in a survival situation, you clearly do not.  \n\nThey are a great retelling of a lost way of life, but as survival manuals?  Maybe you could use the pages to start fires with?",
                    "score": 3,
                    "author": "whorton59",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have one of the Foxfire Books and I cherish it. Must be 40 or 50 years old? \n\nAnyway, came here to make the comment you made. There is a lot of practical knowledge, and many old stories. But I do feel like the stories give context to the practical knowledge. \n\nLike, it shows you how to butcher a hog, but also the dude doing it is explaining exactly how he holds the knife since he's been doing it for roughly 90 years (since he was 10 lol)",
                            "score": 3,
                            "author": "Still-Spend6742",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Without a doubt, the ***Foxfire books*** are worth having. I highly recommend them to anyone with an interest.  They capture a mostly gone style of life for the people that lived in the Appalachian's in the 70's.  I suspect most of those people who told the stories have passed, and at this point, many of the reporters are passing as well.\n\nCertainly, the material is not available anywhere else! I had been given Foxfire 1 by an aunt.  According to the inscription in the front cover, \"***Merry Christmas, 1973***.\"  \n\n**YEP, 50 YEARS OLD NOW!** \n\nOf course the same aunt gave me a copy of the **Last Whole Earth Catalog** a year or two before.\n\nThe other thing that is really sad is that whole paradigm of 1970's scholarship and enterprising spirit to bring new material such as *Firefox books* and the *Whole Earth Catalog,* has been absent for far too long now.\n\nI hate to say it, but the damn generations since are too involved historically with Nintendo, X box, and now ***tic toc*** to even consider what is going on in the world around them.  The internet has been great, but man, it sucks too!",
                                    "score": 1,
                                    "author": "whorton59"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes! This. Homesteading isn’t really survival. \n\nSurvival is SAS by wiseman.\n\nHomesteading is everything from making your home to gardening/canning.\n\nThere won’t be one book to cover it all. It’s best to pick a topic and go from there. Want to know how to can? YouTube and books are the best way to learn unless you have someone you know who does it.\n\nAnd survival is best studied by hiking and camping and using those times as practice. Bring along a book for identifying plants in the area you’re hiking/camping in. YouTube and books here too. Don’t watch survival channels. Watch camping channels. Get into camping and backpacking. Then start watching good survival YouTube channels.",
                    "score": 1,
                    "author": "redisherfavecolor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Foxfire book series",
            "score": 29,
            "author": "kutzy14",
            "replies": [
                {
                    "level": 1,
                    "comment": "So good. My mother was buying me one book each year for my birthday. I got like 8-10 or so before she forgot about them. I should try to find the rest.",
                    "score": 10,
                    "author": "liketrainslikestars",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The higher the number, the harder to find, I wish you luck on your journey!",
                            "score": 6,
                            "author": "mr-death",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you, friend!",
                                    "score": 3,
                                    "author": "liketrainslikestars",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There are whole sets on Amazon.",
                                            "score": 2,
                                            "author": "JarheadSFMF",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I suppose I could do that, and just gift the ones I already own. Thanks!",
                                                    "score": 1,
                                                    "author": "liketrainslikestars",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Need my address? Lol",
                                                            "score": 1,
                                                            "author": "JarheadSFMF"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This just unlocked a core memory. My mom had these books when I was a kid and I had completely forgotten about them. I don't know what ever happened to them but now I'll have to order them.",
                    "score": 4,
                    "author": "average_texas_guy"
                },
                {
                    "level": 1,
                    "comment": "While Foxfire books have some great skills most of them are not really applicable to outdoor survival. \n\nFor a beginner, I still recommend Cody Lundin's \"***98.6 DEGREES, Keep your ass alive***.\"\n\nIt is one of the better new generation books with illustrations, and he has written it in a casual style, not the boring recitation of factoids you find in Military Survival manuals.",
                    "score": 5,
                    "author": "whorton59"
                },
                {
                    "level": 1,
                    "comment": "Yeah, but maybe leave out foxfire 7.",
                    "score": 2,
                    "author": "the_admirals_platter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why, please?  I have a few in my library but can’t remember which ones right now.  Always meant to finish the set.",
                            "score": 1,
                            "author": "persistedagain"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How old of a kid can read these? My son is 10",
                    "score": 1,
                    "author": "HereIam06"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely the SAS book like everyone say!  Huge book full of info. Great source of information on alot of topics\n\nI would also say \"Bushcraft 101\" and if you are into growing food \"The Self-Sufficient backyard\"",
            "score": 10,
            "author": "dgillott"
        },
        {
            "level": 0,
            "comment": "US Army Survival Manual. The one with a TM/FM #",
            "score": 7,
            "author": "AceInTheX",
            "replies": [
                {
                    "level": 1,
                    "comment": "No need to buy, all declassified FM are on army digital library",
                    "score": 8,
                    "author": "DeFiClark",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And many on archive.org. I forgot about the digital army library.",
                            "score": 5,
                            "author": "AceInTheX"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ON YOUR OWN in the WILDERNESS by Townsend Whelen and Bradford Angier\n\nBradford and Vena Angier have lived survival and homesteading in the Canadian Rockies...",
            "score": 5,
            "author": "Ancient72",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Bradford Angier\n\nPassed way back in 1997,  He left many great books though.  Vena passed in 2011.",
                    "score": 2,
                    "author": "whorton59"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have an oversized paperback with a green cover that was put out by the editors of Stackpole Books. Looks like it was published in 2007. Don’t know if it’s the ‘best’, but it’s very cool…\n\n“Survival Wisdom &amp; Know-How”\n7845 useful skills and step-by-step instructions.",
            "score": 5,
            "author": "fascinatedobserver"
        },
        {
            "level": 0,
            "comment": "Survival and homesteading are very different.  For survival books, of which I have a dozen, I’d say SAS Survival Handbook is the most comprehensive. For homesteading, there are too many topics that require too much depth for a single publication - at least in my search. Best to find excellent books on individual topics.",
            "score": 6,
            "author": "Keppadonna"
        },
        {
            "level": 0,
            "comment": "Mother Earth magazine put out a homestead book back in the 80s or 90s. I have a copy, some where. Hope that points you in a good direction.",
            "score": 12,
            "author": "Bulwy_"
        },
        {
            "level": 0,
            "comment": "Depends where you live and how much time you have… my daughter just bought me the book: “Create Your Own Florida Food Forest” by David T Good\nWe have a lot of fruit and citrus planted but this goes into many more plants to feed a family from a small homestead.",
            "score": 4,
            "author": "hikerdude606",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m on the west coast but looking for something with a good collection of general knowledge about homesteading and survival. Off grid stuff.",
                    "score": 3,
                    "author": "AHSQU1RR3L",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would imagine there are similar writers in your area. We are off grid here in FL for over a year now. We have learned a lot about solar and minimalism. \nDo you have a plot of land that you can grow food on?",
                            "score": 1,
                            "author": "hikerdude606"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "John Seymour books",
            "score": 4,
            "author": "sophie_random"
        },
        {
            "level": 0,
            "comment": "Survival: Wiseman Homesteading: Seymour",
            "score": 4,
            "author": "DeFiClark"
        },
        {
            "level": 0,
            "comment": "Preparing for some backlash:\n\nWhat do folks think of the Worst Case Scenario Survival Handbook?",
            "score": 4,
            "author": "Dad-Baud"
        },
        {
            "level": 0,
            "comment": "\"The Complete Wilderness Training Book\" by Hugh Mcmanners is my favorite. It got me into the whole survival thing when I found it on my 4th grade teachers shelf. She eventually just gave it to me since it lived at my desk. I probably have 3 copies now.",
            "score": 3,
            "author": "mooxwalliums"
        },
        {
            "level": 0,
            "comment": "\"Back to Basics\" is a good one to have for a breakdown of homesteading practices and how to achieve them with hand tools. It's really cool because you can get all these hand tools now, diagrams in full color, and has everything from raising a barn to animal husbandry, to canning and recipes. H8ghly highly recommend it.",
            "score": 3,
            "author": "liners123"
        },
        {
            "level": 0,
            "comment": "\"Bushcraft\" by Mors Kochanski and equally important \"Deep Survival\" by Lawrence Gonzales\nOne is actual long term wilderness survival skills and the other is about the psychological means of survival through anything life throws at you.",
            "score": 3,
            "author": "Markdphotoguy"
        },
        {
            "level": 0,
            "comment": "The Boy Scout Handbook",
            "score": 9,
            "author": "RhoPrime-"
        },
        {
            "level": 0,
            "comment": "One Second After",
            "score": 3,
            "author": "Intubater69"
        },
        {
            "level": 0,
            "comment": "“Naked Into the Wilderness” Primitive Wilderness Living and Survival Skills by John and Geri McPherson. There’s significant information to be had from this book. I spent a few summers and did everything in it other than tan a hide, knap stone tools, and make a friction fire. If you can do what’s in this book then you can develop the foundation to build so many other skills.",
            "score": 2,
            "author": "SuperBaconjam"
        },
        {
            "level": 0,
            "comment": "FOXFIRE series",
            "score": 2,
            "author": "bodee1487"
        },
        {
            "level": 0,
            "comment": "Foxfire",
            "score": 2,
            "author": "In-Cod-We-Thrust"
        },
        {
            "level": 0,
            "comment": "2 wildly different topics.   For homesteading  my vote goes to 5 Acres and Independence.   Classic, solid overview.",
            "score": 2,
            "author": "Rocksteady2R"
        },
        {
            "level": 0,
            "comment": "my favorite is Back to Basics , by readers digest,  (yellow cover) the brown cover some material was removed,  but it is a ton of great info.",
            "score": 2,
            "author": "AlertAbility8044"
        },
        {
            "level": 0,
            "comment": "Great recommendations and great thread!",
            "score": 2,
            "author": "RiiniiUsagii"
        },
        {
            "level": 0,
            "comment": "You can but the forest (game)it has a full story and lore\nPretty cool if you like survival(of course) and horror (sorry for Bad english)",
            "score": 2,
            "author": "Jotar025",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha not quite what I’m looking for but it was a good game! Played it a while ago.",
                    "score": 1,
                    "author": "AHSQU1RR3L",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok cool",
                            "score": 1,
                            "author": "Jotar025"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know how survival and homesteading overlap but Carla Emery's Encyclopedia of Country Living is  pretty handy homestead resource.",
            "score": 2,
            "author": "popsblack"
        },
        {
            "level": 0,
            "comment": "The Bible",
            "score": -39,
            "author": "maryupallnight",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People are downvoting the Bible.",
                            "score": -12,
                            "author": "maryupallnight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The Koran/Islam is one of religions of Abraham.  Judaism and Christianity being the other two.",
                                            "score": -4,
                                            "author": "maryupallnight",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Read it and find out.",
                                                            "score": -7,
                                                            "author": "maryupallnight",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I bet you haven't read the bible if you think it teaches survival skills",
                                                                    "score": 6,
                                                                    "author": "Burgdorf",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You did not understand it if you read it.",
                                                                            "score": -1,
                                                                            "author": "maryupallnight"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not hating on The Bible but I’m looking for how to survive if left in the wilderness or trying to set up a long term shelter. I’ll worry about being “saved” if that stuff fails.",
                    "score": 1,
                    "author": "AHSQU1RR3L"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got this book and it’s got a TON of stuff in it. Showed my dad recently too when I had my parents over for dinner/movie night and he read the book the entire time. Didn’t talk, didn’t watch the movie, just read the book. \n\nhttps://a.co/d/9m5JfKa",
            "score": 1,
            "author": "jsm1095"
        },
        {
            "level": 0,
            "comment": "urban survival?",
            "score": 1,
            "author": "Perfect-Street-1648"
        },
        {
            "level": 0,
            "comment": "I believe this has an English translation roughly called \"Where There Is No Doctor\". I only have the copy called \"Donde No Aye Doctor\". I am not sure which came first and I only read it in spanish.\n\nHaving been a medic in the US army, I found this book to be pretty impressive. It discusses how far latrines should be from a sleeping or cooking site, how to build them hygenically.  It also discusses herbal remedies and basic life saving measures. It teaches many of the things the US army teaches about basic survival skills in a comprehensive way. Whether preparing for SHTF or you have a rural emergency that will take first responders time to respond to, most people can benefit from the information in this book.",
            "score": 1,
            "author": "sole_survivor88"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is that a book or the letters on a zipper!",
                    "score": 1,
                    "author": "AHSQU1RR3L"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Les Stroud aka Survivorman has a book that’s pretty comprehensive. It’s just called “Survive” it’s got a good good collection of info.",
            "score": 1,
            "author": "Just_Ayrton"
        },
        {
            "level": 0,
            "comment": "Bible",
            "score": -16,
            "author": "Nuwen-Pham",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The thin pages would probably help with starting fires? \n\nBring on the downvotes",
                            "score": 10,
                            "author": "SaintEyegor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is the most important",
                    "score": -10,
                    "author": "Upper-Razzmatazz176"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live by a moto, Book smarts fail in comparison to ethical and practical smarts, in other words ask old Bushmen, survivalist or even soldiers as they have all had to learn these skills themselves and it can help you learn what works and what doesn't work",
            "score": -6,
            "author": "Intense_Pretzel"
        },
        {
            "level": 0,
            "comment": "The Bible and Book of Mormon. But after that The lost ways is a good one.",
            "score": -16,
            "author": "Upper-Razzmatazz176",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And rolling papers",
                            "score": 9,
                            "author": "glittervan206"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Crazy garden stuff? I’m listening…",
                    "score": 2,
                    "author": "AHSQU1RR3L"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get a library card",
            "score": -1,
            "author": "kightfite"
        }
    ]
}