{
    "id": "121fbvz",
    "score": 122,
    "title": "What kind of tarp would you recommend?",
    "author": "tallboiiy",
    "date": 1679732427.0,
    "url": "https://www.reddit.com/r/Survival/comments/121fbvz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm wondering if the tarp you bring must be able to withstand the ground if you sit on it? I've seen some folding/building schematic where you sit or lay on the tarp. I'm wondering what type of tarp withstand that? I'm thinking a tarp that i will just carry with me for the day mostly but at some point I would like to progress and actually sleep under it. I'm very new to all of this",
    "comments": [
        {
            "level": 0,
            "comment": "I carry a small (6x8) fiber reinforced, grommeted mylar tarp. It's main purpose is for a rain fly.",
            "score": 21,
            "author": "occamhanlon"
        },
        {
            "level": 0,
            "comment": "[DDHammocks](https://www.ddhammocks.com/products/tarps) if you want the best.",
            "score": 15,
            "author": "cykovisuals",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree on that",
                    "score": 4,
                    "author": "voidxy"
                },
                {
                    "level": 1,
                    "comment": "My rainfly and hammock are still going strong 10yrs later!",
                    "score": 4,
                    "author": "Better_Surround5636"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It doesn’t need to be very thick fabric to be strong enough to sit or lay on. The floors of many lightweight tents are only thin polyester or nylon.  \nFor making a shelter with a floor you need quite a large tarp and the lighter it is the more likely you are to want to carry it and the more other useful gear you can carry too.  \nThere’s lots around and you might find a used one on eBay but a rip stop silicone impregnated lightweight polyester or nylon will be suitable.  \nIf you think you might sage the floor part you can use a piece of thin tyvek as extra protection.",
            "score": 8,
            "author": "carlbernsen"
        },
        {
            "level": 0,
            "comment": "Start with a cheap blue, brown or silver tarp from a hardware store / Harbor freight / Walmart.\n\nUse, play, experiment, push, beat the crap outta it.\n\nLater, get a better tarp once you know what you want\n\nThis is what our Scouts have done for decades",
            "score": 72,
            "author": "YardFudge",
            "replies": [
                {
                    "level": 1,
                    "comment": "This applies to a lot of things lest you end up with something expensive that doesn't exactly meet your needs.",
                    "score": 11,
                    "author": "WhittlingDan"
                },
                {
                    "level": 1,
                    "comment": "There is a level of wisdom in the comment that could be applied to the acquisition of anything.",
                    "score": 4,
                    "author": "Dangerous_Forever640"
                },
                {
                    "level": 1,
                    "comment": "The home cheapo tarps are also labeled in durability. I believe it’s MIL they use to measure thickness and most tarps actually have a little piece of it stuck on the outside of the package so u can feel the thickness",
                    "score": 1,
                    "author": "Why_Ban"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where are you in your tarp journey? Something to play with, or part of an emergency shelter / bugout kit? Get Tyvek house wrap or polycro for a ground sheet under the tarp. It's cheap, light, reasonably durable, and very compact. Getting a cheap tarp for practice purposes isn't bad. The minimum size for a person is 5'x8', but I would say go 6'x9' or 8'x10'. Standard paracord or bank line for tie-outs isn't bad for practice. 1.1 to 1.9oz/sqyd silnylon or silpoly is the sweet spot for an emergency tarp, around 20d to 30d denier thickness is good. This is lighter, more packable, and longer lasting than cheaper but thicker and heavier polyurethane alternatives... Unless it's just for practicing to see if you want a tarp to begin with. [Here's a good starter kit in one place](https://www.shop.backpackingadventuregear.com/Multi-Use-Survival-Tarp-Kit-MUST-starting-at-MUST.htm).",
            "score": 7,
            "author": "Magical_Savior",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a complete noob. I saw a discount on a tarp that was 3 x 3 för 30 bucks so o got that. I saw it was made of the material that many recommend so I thought I'd start out with that to practice with. But reading the comments further it seems like I've should have gotten a bigger one xD",
                    "score": 3,
                    "author": "tallboiiy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "3x3 (meters) isn't bad for one person. A square tarp has a lot of options. I prefer 8'x10'. Flexible size, good for hammocks or shelters, one or two ppl. I only use a couple pitches and don't get fancy with it.",
                            "score": 1,
                            "author": "Magical_Savior"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm going to recommend a tarp from Aqua Quest. Good company that produces durable lasting gear.\n\nhttps://ca.aquaquestwaterproof.com/products/guide-lightweight-tarp-ca?variant=39501949468749",
            "score": 6,
            "author": "Environmental_Noise",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second Aqua Quest tarps. I have two and they're great.",
                    "score": 3,
                    "author": "BasenjiFart"
                },
                {
                    "level": 1,
                    "comment": "Number three on this. Love mine and has held up rain and shine.",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "https://www.kelty.com/noahs-tarp-12/ \n\nNoahs tarp is another good option at a similar price point",
                    "score": 2,
                    "author": "Burgdorf"
                },
                {
                    "level": 1,
                    "comment": "$150? I could buy a full tent for that price",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My GF and I both use and carry these in our cars/bags and we've been pretty happy with them. \n\nhttps://www.amazon.com/gp/product/B01IL6H9L2/",
            "score": 5,
            "author": "Kilo353511",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll second this. I have a very similar tarp in the orange option that I carry with me whenever I'm hunting or backpacking. I went with orange because, if I'm using it,  things have gone poorly and I  want to be found.",
                    "score": 1,
                    "author": "and_i_mustGO"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I am sure that is to appeal to the Meal-team six fudds that think they are going to be the Chris Kyle of the Zombie Apocalypse.\n\nI've had good luck using it to keep heat in my tent and as an extra rain fly. It also worked pretty well to make a lean-to near a fire.",
                            "score": 1,
                            "author": "Kilo353511"
                        },
                        {
                            "level": 2,
                            "comment": "Ha! I dont know if it's better or worse, but my first thought was using it for cryptid hunting. Maybe they see in IR, and that's why I haven't been able to sneak up on them!",
                            "score": 1,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Depends on the situation. I was winter camping and slept wrapped in one of these around my 0degree bag and wool blanket. My ex boyfriend came round with IR goggles trying to find me and couldn’t. Probably saved my life that night.",
                            "score": 1,
                            "author": "AlyKhat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://getexcess.com/products/military-surplus-ammo-tarp-tan-12-x-17-tie-ropes-and-grommets-cover-tent-trailer\n\nI ised one of these in Iraq and several years of field exercises in Ky and Hi. Cut it to the dimensions I wanted and added some more grommets. It's heavy but extremely durable.",
            "score": 7,
            "author": "DesertFoxydf18"
        },
        {
            "level": 0,
            "comment": "The [Arcturus ](http://Arcturus Heavy Duty Survival Blanket - Insulated Thermal Reflective Tarp - 60\" x 82\". All-Weather, Reusable Emergency Blanket for Car or Camping. Thermal Barrier Blocks Infrared Signature https://a.co/d/29EcEw2) is the strongest tarp I've ever owned, doesnt make crinkling sounds, and is inulated with a mylar lining inside. It is on the bulky side but I love it. I also carry a simple parachute material rainfly to sleep under because it's lighter and the easiest and quickest thing for me to hang, personally. Parachute rainflies are also quieter than their plastic counterparts so theres less noise pollution in the wind.",
            "score": 5,
            "author": "One-Blacksmith-4855",
            "replies": [
                {
                    "level": 1,
                    "comment": "^(I have one of these also. Works really well as a winter groundcloth when I want to keep my tent out of the snow/mud/etc/)",
                    "score": 2,
                    "author": "mynonymouse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.varusteleka.fi/fi/product/dd-hammocks-4x4-tarp-laavukangas/30482\n\n\nI use this one almost exclusively, but I also have the smaller 3x3. The 4x4 is great for hammock camping, but you can make pretty much any shelter out of it.",
            "score": 2,
            "author": "PettyAddict"
        },
        {
            "level": 0,
            "comment": "There is a whole science and craft behind using a tarp.  If you fold it over you, you will wake up wet.  a tarp will add up to 5 degrees F to your shelter if closed in.  Ideally you want a shelter lifted off of you but folding it over you like a clamshell will work if it starts to rain in the middle of the night. Before laying on the end of your tarp ready to clamshell if it rains or you need extra warmth, you'll want to fold the corner doen at your head and the corner up at your feet. Otherwise the rain drips off the tarp above you back inside the tarp and it will roll under you and collect and soak you.  The tarp has a cleanside (toward you) and a dirty side toward the ground.  Fold the tarp a little differently each day, don't make holes by reusing the same fold seems daily. You will learn all this on your own.",
            "score": 2,
            "author": "elfof4sky",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;If you fold it over you, you will wake up wet.\n            \nCan you clarify on this please?",
                    "score": 2,
                    "author": "WhittlingDan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Silnylon and silpoly are great materials. They can be tightly packed/stuffed without damage unlike dcf or other materials prone to bending fatigue. Silicone coated fabrics are more reliable for long term storage than pu or other organics that degrade. The stretch of silnylon makes it resistant to punctures, easy to pitch, and quiet in the wind. Main downside is that it sags when wet. Silpoly doesn’t have the sagging problem but is a bit more susceptible to punctures due to less stretch. Silpoly for shelter and silnylon for groundsheet is a pretty good combo. 30d is a good balance of lightweight but still durable.",
            "score": 2,
            "author": "SlumD0gPhillionaire"
        },
        {
            "level": 0,
            "comment": "I've been using this [Ground Cover](https://www.rivercountryproducts.com/product/ground-cover-camping-tarp/) and it's been holding up fine.  \nI can stack it down. I've stepped on it.. walked all over it. Best of all .. it's only $8.95 too.",
            "score": 2,
            "author": "Eat_Carbs_OD"
        },
        {
            "level": 0,
            "comment": "Don’t waste your money on any of these simple designs. Find a construction site and ask for a huge piece of Tyvek. When at home cut it to your desired length, remember to leave it a little longer than what you measure by a couple of inches. Buy some grommets and gorilla tape too. Once you’re set on measurements, stuff it in your washer machine for two cycles. Hang to dry. Then stuff it in your dryer for 1 cycle. It will come out soft and durable. Works great as a ground cover and a tarp, even an emergency blanket! On the extra 2 inches go all the way around the parameter with gorilla tape. Then fold that piece over, and sew it in place. (The gorilla tape gives a little support and thickness to the tyvek) then flip it over once and sew it in place. Now you have the perfect edge. When you’re ready place the grommets and boom you have yourself a multi-purpose ground cover/tarp that’s super lightweight and durable. With a value of $75-$100",
            "score": 2,
            "author": "fatbikeamerica"
        },
        {
            "level": 0,
            "comment": "I've been using a big thick sheet of Tyvek for years.",
            "score": 2,
            "author": "iamnotazombie44"
        },
        {
            "level": 0,
            "comment": "A very cheap yet durable item to use is construction Tyvek underlayment for a house. The Tyvek paper is extremely light, thin, yet durable. And it comes in a big roll so when you wreck one piece, you just cut yourself a new piece and throw the old one away.",
            "score": 2,
            "author": "BananaApePrivateClub"
        },
        {
            "level": 0,
            "comment": "I didn’t read the subreddit name on this and my mind immediately went to an “earl had to die” situation.  Whoops",
            "score": 3,
            "author": "SleepyBearClaire"
        },
        {
            "level": 0,
            "comment": "Its best to get a leaf layer, ETC going inside most designs like that, further insulation and protects the tarp from things like your boots",
            "score": 1,
            "author": "Reasonable_Long_1079"
        },
        {
            "level": 0,
            "comment": "Alternatively buy a cheap one that's massive and fold it over as many times as suits, only problem is storage after so you need to fold it again carefully after use.",
            "score": 1,
            "author": "Specialist_Alarm_831"
        },
        {
            "level": 0,
            "comment": "Tyvek...youre welcome",
            "score": 1,
            "author": "ForsakenHyena8368"
        },
        {
            "level": 0,
            "comment": "DD 3x3 is a classic bushcrafter’s tarp for a reason. It’s light and holds up great. In a survival situation id go with that or a legit bivvy like an outdoor research one. Just depends on your application",
            "score": 1,
            "author": "FarmerHunter23"
        },
        {
            "level": 0,
            "comment": "I picked one form Bushcraft Outfitters a few years ago, mostly as a graphed tarp from my tent in the field, and to make a hooch when tents weren’t allowed. \n\nhttps://bushcraftoutfitters.com/operational-camouflage-pattern-ocp-5x8-mest/\n\nStill in great shape, no holes or anything. And it has spent a lot of time on the ground.",
            "score": 0,
            "author": "cricketofdeth"
        }
    ]
}