{
    "id": "122u9jw",
    "score": 61,
    "title": "Clean water.",
    "author": "Ok_Art_3020",
    "date": 1679853752.0,
    "url": "https://www.reddit.com/r/Survival/comments/122u9jw",
    "media_urls": [],
    "other_urls": [],
    "postText": "In the event that there has been a chemical spill and my local water supply is contaminated what steps can I take to provide my family with clean drinking water.",
    "comments": [
        {
            "level": 0,
            "comment": "You in east Palestine?  Norfolk southern really fucked up",
            "score": 30,
            "author": "AHAdanglyparts69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nope Philadelphia. They fucked up here too.",
                    "score": 44,
                    "author": "Ok_Art_3020",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If only there was ramifications",
                            "score": 19,
                            "author": "AHAdanglyparts69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“The earth is not dying, it is being killed, and those who are killing it have names and addresses.”\n\nUtah Phillips",
                                    "score": 48,
                                    "author": "Ok_Art_3020",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They’re also generally completely flammable. Just throwing a fun and unrelated fact out there.",
                                            "score": 17,
                                            "author": "Sebenbillion"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What do mean? Consequences?  Like , for rich people?  C'mon.  Get real. Only us poors face consequences.",
                                    "score": 21,
                                    "author": "F-around-Find-out",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Birth, old age, disease, and death are the repeated consequences, both for rich, poor, or animal.",
                                            "score": 6,
                                            "author": "kissakalakoira",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There’s more old age for the wealthy, more disease and premature death for the poor.",
                                                    "score": 1,
                                                    "author": "botanica_arcana",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Death is for everyone, premature or not. Trees live hundreds of years, whats so significant in long age if the content and goal is not significant?\n\nIn India there is old age eventho everyone is very poor. The ages ain't much even documented in poor places. How would you know? Rich go to doctor every year to get documented. Poor not, we don't have enough data to even compare accurately.",
                                                            "score": 6,
                                                            "author": "kissakalakoira"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Consequences. There are definitely ramifications, but not for the spillers, unfortunately.",
                                    "score": 0,
                                    "author": "BayouGal"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same here. Philly botched things bad. Bucks closed off treatment plant inlets for the river immediately. PWD waited 2 days and now we have 3 chemicals in water supply. I can't help feeling like we aren't getting the full info on this event. Things aren't adding up on how much, severity and exposure risks.",
                            "score": 3,
                            "author": "No_Power_8210",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m sure we will be able to get financial compensation when we are in our 60’s for the rare cancers we have from this.",
                                    "score": 7,
                                    "author": "Ok_Art_3020",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly. They are doing double speak to try to cover thier asses while they know we will be long dead before the accident is exposed.  Maybe pay some grandkids. Such BS",
                                            "score": 3,
                                            "author": "No_Power_8210"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We use bottle water. The county I live in raised the bar for arsenic so that the water could be drank. Still the same. They just raised the threshold. It still does the same thing to your body as it always did. (Kern County. California.)",
            "score": 19,
            "author": "dewpointcold",
            "replies": [
                {
                    "level": 1,
                    "comment": "A few years ago i had to do a public health assessment of health determinants in Kern County. Holy shit is it fucked up what industrial scale agriculture and oil contaminants can do to a community’s health outcomes. Some of the worst rates of respiratory diseases and cancer in the country",
                    "score": 12,
                    "author": "I4Vhagar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What, exactly, did you find?  No vagarities, what did you find? It was not until the 70s, I think, till people became aware it wasn’t good to dump used oil on the ground.",
                            "score": 2,
                            "author": "dewpointcold",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People are still not aware they shouldn’t dump used oil on the ground. Or put it on their cows. I used to teach non-point source pollution prevention in east Texas.",
                                    "score": 2,
                                    "author": "BayouGal",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A lot of people have the intelligence of cows. So, it no surprise. 🤣😂",
                                            "score": 3,
                                            "author": "dewpointcold",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I feel like you’re not giving cows the credit they are due. Many are vastly more intelligent than some people.",
                                                    "score": 3,
                                                    "author": "BayouGal"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you drink the public water in Philly already I’m pretty sure nothing can hurt you at this point.",
            "score": 12,
            "author": "RatherBeRetired",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s what I tell my girlfriend because I almost never get sick. I say it’s from drinking the “Philly juice”",
                    "score": 13,
                    "author": "Ok_Art_3020"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you still have tap water, then\n\nUndersink Reverse Osmosis (RO) systems provide best value for most and a backup to other treatments.     \n\nLook for independent test results &amp; brands that have been around awhile.  Consumer Reports gave GE high marks for a low price.",
            "score": 28,
            "author": "YardFudge",
            "replies": [
                {
                    "level": 1,
                    "comment": "Depending on the contaminant though - RO systems don't remove everything.",
                    "score": 16,
                    "author": "Neocon69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Correct \n\nWithout specifics it’s only the best bet for many problems",
                            "score": 11,
                            "author": "YardFudge"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Water.   Diversity is key:\n- Case of water in yer car trunk\n- 70 gallons for 2 person-weeks at home, say in 1-7 gallon jugs, to cover typical suburban conserved drink, cook, wash, and flush needs\n- Blue, used, 55 gallon barrels (~$15) sanitized w/ pool shock.  \n- Rotate all above yearly.\n- Bathtub, trash bins, sinks, or other large, hasty-tap-filled containers\n- Local, bulk source (stream, lake, swimming pool, well, rain collectors\n- Sawyer filter w/ Micropur tablets backup (or similar combo, see:\n- https://www.outdoorgearlab.com/topics/camping-and-hiking/best-backpacking-water-filter\n- https://www.wideners.com/blog/water-filter-tests-for-survival\n- To *really* get into this, watch GearSkeptic on YouTube",
            "score": 19,
            "author": "YardFudge",
            "replies": [
                {
                    "level": 1,
                    "comment": "I save vinegar, bleach &amp; laundry detergent jugs for flush water, &amp; hand washing",
                    "score": 6,
                    "author": "KB-say"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is wilderness survival. You'll probably get better answers in r/preppers",
            "score": 17,
            "author": "Haywire421",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you",
                    "score": 6,
                    "author": "Ok_Art_3020"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Drive to a friends house whose water isn’t contaminated  and fill up a large container or hire one of them water truck companies who fill up rural peoples water tanks.\n\nNot a long term solution but it will keep you happy till the news forgets it happened &amp; no one cares about your blight anymore.",
            "score": 5,
            "author": "Apprehensive-End6219"
        },
        {
            "level": 0,
            "comment": "Removing biological contaminants virus, bacteria, fungus, other organisms is relatively simple. Even radioactive particles and heavy metals in water can largely be removed by distilling. Chemicals are a much more difficult problem, especially since you might have a soup of nasty things in there. Even gasoline which when pure has a boiling point lower than water, has many other chemicals inside. Cleaning a toxic soup of chemicals can be difficult to impossible in the field with no way to prove it is clean. Even nuclear water could be tested with a Geiger counter",
            "score": 3,
            "author": "Limp_Service_2320"
        },
        {
            "level": 0,
            "comment": "If the water supply is contaminated with chemicals, there isn't realistically a way to remove chemicals at home. You also have verify few ways to check for chemicals and heavy metals without sophisticated equipment. There are multiple test that should be ran, different test methods are for different contaminants (VOCs, metals, etc). \n\nHave some drinking water in reserve, or go some place where you can purchase a large amount.\n\nI worked in environmental engineering for years working with sampling and removal/remediation. There were some places we worked I would never drink or use the water.",
            "score": 4,
            "author": "RaleighAccTax"
        },
        {
            "level": 0,
            "comment": "Leave or use bottled water. Unless you know exactly what chemical it is contaminated with, you cannot be certain the filter will remove it.",
            "score": 3,
            "author": "TacTurtle"
        },
        {
            "level": 0,
            "comment": "If you’re in an area with contaminated water LEAVE!!! Whatever reason you have for staying isn’t worth the declining health of your family. Think Flint MI. You should always have enough water on hand for 3 days. Not just for drinking but for sanitary. And keep in mind water is filterable and distillable. It’s endlessly recyclable. The space station reclaims moisture from the air and waste. Given that’s an extreme rationing scenario. This isn’t dune. But have enough to get you family out of dodge and find a clean water source. Our water doesn’t come from the water treatment plant. It’s comes from all around us.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Bottled water is how flint Michigan handled the lead",
            "score": 3,
            "author": "capt-bob"
        },
        {
            "level": 0,
            "comment": "The nature of the containment is the big question. \n\nFor some chemicals you won't have much for options. I think a distillery, multi stage might be your only surefire option. But then it depends on the boiling points of the chemicals. So you may have to boil it down a couple of times and distill the moisture through separate, clean systems. \n\nThink I saw someone talk about multiple sources - this is key along with ability to move and move quickly. You may have to drive four hours to clean water, stock up and then head home if moving the family isn't viable.",
            "score": 6,
            "author": "happydirt23"
        },
        {
            "level": 0,
            "comment": "Unless bottled water is available, collect wood, burn lots of wood half a way, make charcoal, get tons of clean socks to fill with charcoal, filter through charcoal multiple times by gravity. Last step: boil it. There you have it. Not a reverse osmosis subsitute but in survival situation will work.",
            "score": 4,
            "author": "RedOxFilms",
            "replies": [
                {
                    "level": 1,
                    "comment": "Will this remove harmful chemicals? Such as those found in the recent chemical spills?",
                    "score": 1,
                    "author": "Ok_Art_3020",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably not. You'd need to be an environmental engineer to know solubility and permiability of industrial poisons to give definitive answer. If you deal with a massive spill, you are always better off with bottled water. Getting as far away as possible from the disaster zone should be everyone's priority. I wouldn't stay in proximity to it and try to filter this condemned water. That would be plain stupid.",
                            "score": 4,
                            "author": "RedOxFilms"
                        },
                        {
                            "level": 2,
                            "comment": "Solubility of chemicals in water is what will get you.\n\nExample: salt water. \n\nNo matter how many times you filter it, it's still going to be salt water. Have to distill it so the minerals stay in the boil and the water evaporates then condensed pure.\n\nOnly problem with chemicals instead of salt - they evaporate too",
                            "score": 5,
                            "author": "tossaside555",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn guess I’ll die then.",
                                    "score": 4,
                                    "author": "Ok_Art_3020"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I keep about 20 gallons of RO water on hand. I use 5 gallon containers like for Sparklets. We drink from a ceramic carafe (from Whole Foods). Works great, keeps the water cool &amp; clean &amp; no waste. I just rinse them with bleach &amp; refill. 5 gallons costs $1.25.",
            "score": 2,
            "author": "BayouGal",
            "replies": [
                {
                    "level": 1,
                    "comment": "What does RO and Sparklets mean?",
                    "score": 1,
                    "author": "capt-bob",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reverse osmosis. Sparklers is/was? a company that would deliver water to home/office in 5 gallon bottles. Am I really that old? 😂",
                            "score": 2,
                            "author": "BayouGal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks! We have an old bottled water delivery in the big jugs called Culligan. My dad had an old glass water jug he made wine in when I was a kid, all I see are plastic now, much easier to lift on the dispenser I'm sure. We have bottled drinking water dispenser at church, the tap water tastes terrible.",
                                    "score": 1,
                                    "author": "capt-bob"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keep a supply of clean drinking water on hand and/or install rain water catchment.  You could simply filter, treat  or boil the rain water for drinking.",
            "score": 2,
            "author": "Puzzled_Engine4136"
        },
        {
            "level": 0,
            "comment": "Electric water distiller is your best  option , around $100 on Amazon",
            "score": 2,
            "author": "wmslave25"
        },
        {
            "level": 0,
            "comment": "Collect it from your roof.",
            "score": 2,
            "author": "Stormy_witch"
        },
        {
            "level": 0,
            "comment": "https://lifestraw.com/products/lifestraw\n\nHave a few of these in the basement. Can’t hurt!",
            "score": 2,
            "author": "splitopenandmelt11",
            "replies": [
                {
                    "level": 1,
                    "comment": "No. Get a sawyer.",
                    "score": 3,
                    "author": "mr-death",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Would a Sawyer filter be sufficient to remove chemicals like those found in the recent chemical spills",
                            "score": 2,
                            "author": "Ok_Art_3020",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unfortunately not, but it's still a better/easier/more efficient and more user friendly than a life straw for the same price.\n\nA Life straw is better than nothing for sure, but if you're going to buy/carry something to filter water than the sawyer is leaps and bounds better.\n\nYour only real option for removing those kinds of toxins is distillation or maybe reverse osmosis, but neither are (as far as I know) easily achieved in a survival or wilderness situation.\n\nI'd love to be proven wrong, though!\n\nEDIT: Details",
                                    "score": 3,
                                    "author": "mr-death"
                                },
                                {
                                    "level": 3,
                                    "comment": "Unfortunately,  most water filtration for home use may remove some heavy metals but chemicals are a different animal due to solubility - which was mentioned before -   I am not a chemical engineer but I think even RO systems won’t remove organic compounds very well if at all from what I have heard.       Has your State/Province offered water testing?",
                                    "score": 3,
                                    "author": "SchwabianToaster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They haven’t that I’m aware of. I’m also not sure how much I would trust the state test anyways",
                                            "score": 2,
                                            "author": "Ok_Art_3020",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Most states have a resource where you can just send in a sample and they will test it.   Or you can find EPA certified water testing lab.   I think most of them test for a large variety of organic compounds.     I had the displeasure of sitting on a water board for a small town I live in.   I can say most water systems take contamination fairly seriously,  mostly because the EPA fines and possible criminal liability can be pretty serious.      I think the question is if they are testing for chemicals that were in the spill or possible other uncommon ground water contaminates.",
                                                    "score": 2,
                                                    "author": "SchwabianToaster"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can pull water from the moisture in the air",
            "score": 2,
            "author": "superiorusername999",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not sure how to do this is there a reliable way to do this?",
                    "score": 1,
                    "author": "Ok_Art_3020",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "By doing this: https://www.survivalkit.com/blog/get-water-from-a-hole-in-the-ground/",
                            "score": 2,
                            "author": "SpiritualL30",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Best comment yet",
                                    "score": 2,
                                    "author": "begrudginglydfw",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks!",
                                            "score": 1,
                                            "author": "SpiritualL30"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is very helpful thank you",
                                    "score": 1,
                                    "author": "Ok_Art_3020",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're welcome!",
                                            "score": 1,
                                            "author": "SpiritualL30"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "#ohio",
            "score": 0,
            "author": "kevsterkevster"
        }
    ]
}