{
    "id": "12tdaqq",
    "score": 8,
    "title": "High altitude california foraging?",
    "author": "barre-chords-ugh",
    "date": 1682020795.0,
    "url": "https://www.reddit.com/r/Survival/comments/12tdaqq",
    "media_urls": [],
    "other_urls": [],
    "postText": "What is there to eat in the sierras? (About 7000 feet)",
    "comments": [
        {
            "level": 0,
            "comment": "Probably not a whole lot. I used to spend summers above 7000 in the sierras. Plenty of game, but not a whole lot of food that grows in abundance that you coul rely on for forages. If you were interested in farming something, the only thing that would be successful would be ground plants like onions and what not.",
            "score": 4,
            "author": "Dense-Row-604",
            "replies": [
                {
                    "level": 1,
                    "comment": "This will be in the summer and I’m a vegetarian 😭",
                    "score": -1,
                    "author": "barre-chords-ugh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not to be offensive but it’s hard to survive vegetarian in a traditional lifestyle depending upon where you are it maybe impossible i.e. Inuit people who survived mainly on fat rich cetaceans and other marine animals. The Pacific Northwest larger mammals (who weren’t grazing) depend on fat rich salmon and other fish and other game for calories",
                            "score": 2,
                            "author": "Mkumj12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve thought about it and I’ve decided that in my opinion, hunting is far more ethical than buying meat at the store. You see what the animal goes through and use resources as intended rather than being blind to where your food comes from",
                                    "score": 3,
                                    "author": "barre-chords-ugh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "100% that is a profound difference to point out. In that sense you, and others current and past who take wild game(not a great term) are thankful for the sacrifice of this animal I really applaud your openness in this way",
                                            "score": 2,
                                            "author": "Mkumj12",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hunters are strong people. They work for what they eat. Shoppers are weak-minded; they couldn’t kill an animal but they can eat it",
                                                    "score": 2,
                                                    "author": "barre-chords-ugh",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well said",
                                                            "score": 1,
                                                            "author": "Mkumj12"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://backpackinglight.com/forums/topic/105534/\n\nSeems there’s also a book called “the sierra forager”\n\nI’ve got a book called Survival Plants of Colorado and the majority of the hundreds of edible plants featured in it are found all throughout the mountain west. it’s a relatively homogenous biome.",
            "score": 2,
            "author": "grelth"
        },
        {
            "level": 0,
            "comment": "Gooseberries if you’re lucky. Pine nuts in the late summer and fall but the timing is tricky…there’s usually a ~2 week window per grove and it’s a lot of work. Maybe mullein. There’s a reason the indigenous people only went that high in the summer to hunt/fish or gather pine nuts. Not much food otherwise.",
            "score": 2,
            "author": "Magic_Cubes"
        },
        {
            "level": 0,
            "comment": "Bing' ~ \"There are some wild edibles that you can forage in the high sierras at about 7000 feet elevation. Some of the most common and easy to identify ones are:\n\nWild berries such as blackberries, raspberries and rose hips. Be careful to avoid any white or unknown berries and test them on your lips before eating1.\n\nWild plants such as dandelions, clover, miners lettuce, cattails and pine nuts. These plants are abundant and nutritious and can be eaten raw or cooked12.\n\nBark from willow, birch, pine, basswood, spruce, fir and tamarack trees. The inner layer of the bark can be eaten raw or boiled1.\n\nHowever, you should always be careful when foraging for wild food and follow some basic guidelines:\n\nProper identification of wild edibles is essential. Find a mentor, get a good book or use a reliable app to help you recognize the plants2.\n\nSustainable foraging means taking only what you need and leaving some for the wildlife and future harvests. Avoid picking rare or endangered plants2.\n\nForaging safely means avoiding plants that have been sprayed with pesticides or herbicides, or that grow near roads or polluted water sources2.\n\nAlso, keep in mind that cooking at high elevation may require some adjustments in time and temperature, as water boils at a lower point and air is thinner3.\n\n\"\n\nThere are also some edible roots that you can forage in the high sierras at about 7000 feet elevation. Some of the ones that I found are:\n\nDaylily roots (Hemerocallis sp.) - These are the roots of the orange-flowered daylilies that grow in gardens and along roadsides. They are edible raw or boiled and have a nutty flavor12.\n\nCattail roots (Typha sp.) - These are the roots of the tall plants with brown cigar-shaped flower heads that grow near water. They are edible raw or cooked and can be ground into flour31.\n\nQueen Anne’s lace roots (Daucus carota) - These are the roots of the wild carrot, which has white umbrella-shaped flowers and a hairy stem. They are edible raw or cooked and taste like carrots, but be careful not to confuse them with poison hemlock, which has smooth stems and purple spots1.\n\nArracacha roots (Arracacia xanthorrhiza) - These are the roots of a plant native to the Andes, which has yellow or purple flesh and a celery-like aroma. They are edible cooked and have a starchy texture4.\n\nAs always, be sure to properly identify any wild root before eating it and avoid any that look suspicious or unfamiliar. Also, wash them well and peel off any tough skin before consuming them.",
            "score": 2,
            "author": "psynthesys"
        },
        {
            "level": 0,
            "comment": "i think youd have better luck on a different subreddit",
            "score": 1,
            "author": "Extreme-Evidence9111"
        },
        {
            "level": 0,
            "comment": "Don't forget your Diamox! Altitude sickness can be deadly...",
            "score": 1,
            "author": "pdindetroit",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do extremely well at altitude. Hydration is the secret",
                    "score": 1,
                    "author": "barre-chords-ugh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I used to as well, until I didn't. It happens...",
                            "score": 1,
                            "author": "pdindetroit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve had problems before with nausea at altitude,  and for other reasons I’ve needed emergency medical care in the backcountry. It’s scary shit, sorry you had to go through that",
                                    "score": 2,
                                    "author": "barre-chords-ugh"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In addition to what others have mentioned, there's likely trout,in the creeks. Probably crawdads, too, but there's not a lot of calories in crawdads.",
            "score": 1,
            "author": "mynonymouse"
        }
    ]
}