{
    "id": "12te33t",
    "score": 36,
    "title": "Survival essentials",
    "author": "Emotional_Juice69",
    "date": 1682022475.0,
    "url": "https://www.reddit.com/r/Survival/comments/12te33t",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone,\n\nI'm planning a trip to a forest and I want to be well-prepared. What are the essential things I need to know about surviving in a forest? This includes understanding the necessary conditions and factors for survival, such as water sources, shelter, and other important considerations. Any insights or advice would be greatly appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "Tell someone where you’re going, and when to expect you back. Survival skills are great for the short term, but you will not survive forever.\n\n\n1 in the wild is fire, unless you’re in a desert, in which case it’s water and shelter. Learn to make fire from what you plan to bring out, and from the resources available to you in the wild. I’d recommend learning to shave wood, working your way towards feathersticks (named because the shavings make the stick look like a feather). This is one of the easiest ways to make tinder from your surroundings. You’ll want to be able to make sparks or embers, sparks are often going to be from ferrocerium rods like those found in a lighter, or ‘flint and steel’ firestarters and embers you can make using wood drill methods (bow drill is most common). Wood drill methods require knowing the types of wood in your area, which are hardwoods and which are softwoods, and where they’re used in the drill setup.\n\n2 is water sources. Bring water. If you end up lost out there, remember all water runs downhill. If you go downhill too, you’ll find a stream/river. *I will NOT recommend drinking straight from the stream*, giardia, e. Coli, or something else will wreak havoc on you. But if you *absolutely* need to drink runoff water, find the fastest, highest stream you can. The higher, the less ground it’s come in contact with since it fell as precipitation. The faster it’s moving, the less tolerable it is for parasites, or for insects to lay eggs.",
            "score": 22,
            "author": "bepiswepis",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also heard you can dig a hole next to a river, wait a while, let it fill up and settle, then scoop out the 'clear'water on top. The process of the water filtering up from the dirt allows for filtration..not guaranteed no Guardia but in a life and death thing, it's pretty safe. But I'm not sure if I'm remembering the steps perfectly...wonder if there's supposed to be small rocks added to the bottom?? If anyone knows, please share, thx!\n***Oh, I remember where I heard about it! It was the YouTube channel Coalcracker Bushcraft🙂",
                    "score": 5,
                    "author": "AdventureismynameD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Clay Hayes does it better IMO https://www.youtube.com/watch?v=2ySppSWeDrY",
                            "score": 3,
                            "author": "K-Uno",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, I love that, thx so much for the info! I think lining the hole is an excellent way to go, the water is soo much clearer that way.",
                                    "score": 1,
                                    "author": "AdventureismynameD"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "First rule of survival is minimise risk.   \nKnow how to mark your trail and navigate so you don’t get lost.   \nDon’t take stupid risks like rock climbing/bouldering alone.  \nTell someone where you’re going to be and when to expect you back and to call the police/forest service if you’re 12 hours late.  \nCarry adequate shelter and insulation to stay warm and dry in a storm.  \nCarry a 1st aid kit that will enable you to deal with minor foot/leg injuries that would stop you walking out. Anti inflammatory gel, support bandage, blister pads.   \nIf you’re going far from other people and out of cell phone reception consider buying or renting a PLB.  \nDon’t play with hatchets.",
            "score": 8,
            "author": "carlbernsen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good stuff. Ever read the Missing 411 book series by David Paulides ?",
                    "score": 4,
                    "author": "TheGreatNoSugarKing"
                },
                {
                    "level": 1,
                    "comment": "thanks",
                    "score": 1,
                    "author": "Emotional_Juice69"
                }
            ]
        },
        {
            "level": 0,
            "comment": " Forest where? That one bit of info changes sooo much about the answer",
            "score": 7,
            "author": "Actaeon_II",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spain",
                    "score": 3,
                    "author": "Emotional_Juice69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I may take a holiday in Spain, leave my wings behind me.-Adam Duritz Counting Crows Holiday In Spain",
                            "score": 1,
                            "author": "TheGreatNoSugarKing"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Folding saw. It will help you process firewood &amp; clear obstacles in and around camp.\n\nSome sort of defensive item. A bow &amp; arrows, firearm, pepper spray, etc. Even if you don't end up using it, it will be a huge psychological boost for you.",
            "score": 8,
            "author": "Environmental_Noise",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks",
                    "score": 3,
                    "author": "Emotional_Juice69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "10+ C's\n1) Combustion device - used for making fire, fire is life\n\n2) Container - something you can boil and store water in\n\n3) Cutting tools - knife, multi-tool, hatchet, axe, and/or machete\n\n4) Cordage - used for fashioning conveniences, shelter building, trapping/snaring (550 cord, tarred backline, steel wire, etc.)\n\n5) Cover - tarp/bivvy/poncho something to provide some shelter to get you out of the rain\n\n6) Cotton cloth - used for pre-filtering water, sun/heat protection, bandages, etc.\n\n7) Cargo tape - useful for shelter building/repair, first-aid, fire starting, etc.\n\n8) Candling - something to help you see in the dark\n\n9) Clothsail needle - used for repairing gear or stitching yourself up\n\n10) Compass - used for navigation\n\n+1) Clothing - proper attire for expected and some unexpected conditions\n\n+2) Comfort/Cheer - items to keep your spirits up, e.g. - pillow, deck of cards, book, chocolate, etc.",
            "score": 6,
            "author": "badOedipus",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you",
                    "score": 2,
                    "author": "Emotional_Juice69"
                },
                {
                    "level": 1,
                    "comment": "Also remember the 5 W's when selecting a camp site.\n1) Widowmakers - steer clear of areas with dead trees or limbs directly overhead\n2) Wood - You don't want to have to walk miles to fetch wood, somewhere with some downfall nearby usually works well\n3) Water - close to a water source because water weighs 8lbs/gallon you don't want to be lugging that stuff very far\n4) Weather - be aware of potential issues should you have a major weather event, i.e. - don't be in a low spot or where rain will naturally flow towards rivers or streams, also don't be so close to your water source that you'll be caught by surprise by flash flooding\n5) Wildlife - be aware of game trails, hornet's nests, wild critter burrows, caves, etc. in or around your camp site.",
                    "score": 1,
                    "author": "badOedipus"
                },
                {
                    "level": 1,
                    "comment": "I also advise learning and knowing several knots. I'd start with these:\n1) Bowline\n2) Canadian Jam knot\n3) Tautline hitch\n4) Trucker's hitch\n5) Prusik knot\n6) Clove hitch\n7) Lashing\n8) Alpine butterfly",
                    "score": 1,
                    "author": "badOedipus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live by a national park sometimes i vanish in there. I usually have something to cook (pan or pot, something to make faster drinking water then boiling (filter or tabs), something to sleep (sleeping bag and bivak cover or tarp or small tent), somethibg to make fire (small cooker or firestarters&amp;lighter), something to make things smaller (Leatherman and something bigger), something to wash (towel, etc), something to change (clothes in a plastic bag so they dont get to wet), maybe some fishing hooks&amp;line. Something for 1st aid (the standard small bag and assortment medication to get in good enough shape to get back. Something to make light in the dark (cause it makes everything at night easier)\n\nI know hardcore survivalists would consider tjis glamping, but i like it. Maybe i forgot sth i usually have everything in a closet and rdy to pack up.",
            "score": 19,
            "author": "CountingDays0815",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much",
                    "score": 4,
                    "author": "Emotional_Juice69"
                },
                {
                    "level": 1,
                    "comment": "  Also: Cat-hole Trowel and butt wipes. Please LNT and follow park regulations.\n\nMost places these days you'll need some kinds of permit to primitive/dispersed camp.\n\nhttps://www.fws.gov/project/leave-no-trace-principles",
                    "score": 2,
                    "author": "Negative_Mancey"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No disrespect but please don't get in over your head. Just the fact that you are asking these basic questions tells me that you're not ready to strike out on your own.  Some good advice in these responses about having a plan and telling people where you'll be. Please be careful and understand your limitationsIt's.  a lot harder than it looks on TV.  Best of luck.",
            "score": 6,
            "author": "ScourgeWisdom",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks",
                    "score": 1,
                    "author": "Emotional_Juice69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "To add to the other good advice here. I would also search around and see if you can find a book or two on medicinal and edible native plants for your area. Not necessarily needed to survive for 5 days. But it’s fun to forage around and see what you can find. Also developing this skill set could come in handy in the future.",
            "score": 4,
            "author": "BrandtCharlemagne",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks",
                    "score": 1,
                    "author": "Emotional_Juice69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t go out and try to suffer. Go camping. Practice your survival stuff while you camp. Bring gear for camping and the stuff you’re going to practice survival. Bring food, a tent, a lighter, a sleeping bag, etc. \n\nLet others know where you’re going.\n\nPractice the “leave no trace” philosophy.\n\nHave fun.",
            "score": 4,
            "author": "redisherfavecolor",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks",
                    "score": 1,
                    "author": "Emotional_Juice69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How long do you intend to stay?",
            "score": 4,
            "author": "Lucien_Wolf",
            "replies": [
                {
                    "level": 1,
                    "comment": "5 days more or less",
                    "score": 1,
                    "author": "Emotional_Juice69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Stay warm, and more importantly stay dry because you don't stay warm if you're not dry. Don't wear new shoes, wear something that is already \"broken in\". You can do five days without food, but not without water. Yet, you take a big risk drinking from streams, so get one of those survival filter straws so you can drink from streams safely if you run out of your carry water. Trying to go on with only small sips of simply too little water might help with thirst, but not with collapsing down the road: too little water intake is too little, no way around it. Shelter from cold, shelter from direct sun (need a hat??).\n\nHow will you clean up after shitting? Uncomfortable topic to many, important question. You want to dig a hole for whenever you have to go, though you can do this with a stick from the woods, and cover up after. But you do need to clean yourself, so perhaps (fully biodegradeable!!!!) wipes and disinfectant gel. I recommend also carrying a bar of soap.\n\nOh, and fires. Put them out. Like seriously put them out. The fire can go on without a flame, smoldering inside of the ground under where you had a utility fire, spreading then into a wildfire after you're gone.",
                            "score": 5,
                            "author": "thousandpinecones",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thanks",
                                    "score": 1,
                                    "author": "Emotional_Juice69"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.mountaineers.org/blog/what-are-the-ten-essentials",
            "score": 5,
            "author": "YardFudge"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks",
                    "score": 1,
                    "author": "Emotional_Juice69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shelter, water, food, in that order. That’s it. Everything else is secondary. Generally speaking, you can die within 3 hours of exposure, 3 days without water, and 3 weeks without food. It all greatly depends on the environment and you personal health and skill. \n\nIgnore anyone here recommending specific methodologies or gear. Ask 100 survival specialists how to survive in the same specific climate and you’ll get 100 different answers. \n\nTell someone whereabouts you’ll be going and when to expect you back. If you don’t have anyone, tell a park ranger or local law enforcement officer. \n\nGo out and try things, see what works, learn skills, FAIL!!!! Failure is the best teacher.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Failure is an important teacher in bushcraft indeed as in any sport, but in bushcraft it requires you absolutely must have an easy and quick evacuation route (say, civilization/apartment nearby etc) coz the wrong kind of failure will leave you to perish. Nothing wrong about having a quick escape route, just a part of slowly acquiring the kind of independence survival skills allow - in the beginning, it is an essential part of those very survival skills:)",
                    "score": 2,
                    "author": "thousandpinecones"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do not drink any animal pee. Do not molest any alligators",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "1. Local laws-IE have a fire permit or you won't be in the forest long.\n\n2. 3 forms of fire, 3 ways to purify water, 3 ways to have light.\n\n3. 3 days of food if you're going to be foraging after that, or hunting. \n\n4. Make sure your gear is tried and true before disembarking long term.\n\n5. Have a few means of defense. Don't have to believe in whatever societal political sphere, but having reasonable means against predators should they decide you look like a lunchable is sound.\n\n6. Wear durable clothes, wool base layers are antimicrobial. More than one set, 2 or 3 might be good, with a sewing set and patch kit on hand.\n\n7. Don't cheap out on footwear, ever.\n\n8. A good multitool in capable hands goes a long way.",
            "score": 3,
            "author": "Nightwatch12909",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd go on to say a book on survival would be handy, a deck of weatherproof cards, knowledge on bushcraft and field craft is a bonus, but a packable tent might be easier if you packed light enough.",
                    "score": 2,
                    "author": "Nightwatch12909"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We always bring a bag of fritos because it's a great fire stater and you can eat it if you get really hungry.",
            "score": 3,
            "author": "Horacegumboot"
        },
        {
            "level": 0,
            "comment": "In addition to all the brilliant answers, please bring a first aid kit of bandages, plasters and basic medications: antihistamine for allergies, loperamide for diarrhoea and paracetamol and/or ibuprofen for fever/pain.\n\nStudy the area you plan to go to: where’s the nearest hospital, police station, exit points. Contact numbers too. What are the wildlife too: any poisonois snakes, wolves, etc\n\nIf you can, learn/write down basic Spanish words you may need to use in emergencies: help, water, food, warm clothes, pain, etc. \n\nPlease don’t eat anything in the wild unless you’re absolutely sure what you’re looking at. \n\nIf you feel that you need to go back earlier than expected, there’s no shame in that. A real outdoorsman will not let his ego get the best of him and knows Nature can be treacherous. \n\nHave a happy trip!",
            "score": 3,
            "author": "Hour_Ad_7797",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you",
                    "score": 1,
                    "author": "Emotional_Juice69"
                },
                {
                    "level": 1,
                    "comment": "I'm Spanish btw",
                    "score": 1,
                    "author": "Emotional_Juice69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A way to navigate is essential. Most people use their phones (which work great) but you'll at least want a way to charge it while out there, and I would also highly recommend a mirrored compass as well. You can use it to figure out your bearings, and the mirror can double as a signaling method if you find yourself in a position to do that. I've got a Suunto, but Silva also makes good ones. Learn how to use the compass before you go. (If you get lost it really is best if you just stay put, just make sure you tell people where you're gonna go and stick to your plan.)\n\nYou're gonna want a way to get water if you end up being out longer than expected. You will need a filter, iodine tablets, or you can just boil it. Pretty simple. I like Sawyer Squeeze filters, but there are UV filters and all sorts of options out there.\n\nSpeaking of boiling, you will also want to bring a lighter (or two) and a ferro-rod or matches as a backup. Keep a ziploc bag with these things and as much dryer lint as you can compress into it. Dryer lint combusts really well and is easily available.\n\nYou will want synthetic clothing. **Do not wear cotton**, especially if there is an expectation that you will get wet/sweaty. Synthetic fabrics wick away moisture, cotton holds it. Merino socks. I'd pack extra clothes just in case you get wet. Learn about proper layering.\n\nYou will also need some sort of shelter. A tarp is easy enough, even the blue ones that are available at most stores will work. You'll want some cordage (paracord is what I use) to tie it off in order to secure it and make it into a shelter. Speaking of your shelter, am emergency bivvy, emergency blankets, or some kind of synthetic/down sleeping bag/quilt.\n\nA first aid kit is a pretty smart idea. I'd throw some sunscreen and bug spray in there for good measure.\n\nFood's nice, but you can go a long time without it. That's your call. Never hurts having some extra, but I personally take minimal amounts of food. I like to make pb&amp;j rolls (just pb&amp;j on tortillas) if I take food at all. Some candy isn't a bad idea either, maybe some electrolyte powder.\n\nA headlamp or flashlight is nice as well. Extra batteries are also good to have. If you do find yourself stranded out there, it's probably best if you just hunker down overnight, but you're still gonna be glad you have a light source, just in case.\n\nHighly recommend a fixed blade knife or folding saw, but I wouldn't necessarily say that they are essential. There is potential for injury when using them, so weigh your options.",
            "score": 3,
            "author": "the_void_hungers",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you very much",
                    "score": 2,
                    "author": "Emotional_Juice69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course! I hope you have a great time!",
                            "score": 2,
                            "author": "the_void_hungers"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's Forests and then there's Forests and forests.\n\nClimate zone ? Latitude ?. Rainfall ?\nElevation ?\n\nA Forest is much more than a bunch of trees.\n\nNarrow down your question.",
            "score": 2,
            "author": "Logical-Coconut7490",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't really know what forest I will go to",
                    "score": 1,
                    "author": "Emotional_Juice69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe start by learning what a Forest really is...",
                            "score": -1,
                            "author": "Logical-Coconut7490"
                        },
                        {
                            "level": 2,
                            "comment": "Like I said, it makes a big difference.\nNarrow it down.",
                            "score": 0,
                            "author": "Logical-Coconut7490"
                        },
                        {
                            "level": 2,
                            "comment": "I wouldn't take the same things to a northern Boreal forest as I would to a tropical rainforest.",
                            "score": 0,
                            "author": "Logical-Coconut7490"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Essentials? Firemaking. Half of your survival is based around being able to make and keep one",
            "score": 2,
            "author": "Reasonable_Long_1079",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some places in the world you aren't allowed to have campfires while camping, so knowing local rules about fires is a good thing too!",
                    "score": 1,
                    "author": "jlt131"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some sort of camping stove (I personally use trangia)\n\nFood. Anything works\n\nA swiss army knife (or another multitool)\n\nWarm enough clothing\n\nA tent or hammock\n\nA warm enough sleeping bag\n\nExtra clothing\n\nWater\n\nThat's what I always have with me on longer trips",
            "score": 2,
            "author": "simba_kitt4na"
        },
        {
            "level": 0,
            "comment": "If you are this green, my first suggestion would be to not go alone.",
            "score": 2,
            "author": "jlt131"
        },
        {
            "level": 0,
            "comment": "Google \"hiking 10 essentials\" and also \"leave no trace\". Both are very important things to know when heading into the woods. And make sure someone knows where you'll be and when to expect you home. Be careful but have fun!",
            "score": 2,
            "author": "jlt131"
        },
        {
            "level": 0,
            "comment": "Before any excursion, tell someone exactly where you will be, when you plan to leave, and when you plan to return. \n\nReview topo maps. Learn big landmarks, and get a general lay of the land.\n\nIn advance, learn to identify native poisonous/venomous insects and reptiles. Avoid them.\n\nOther Priorities go in order of what will kill you fastest.\n\nExposure: death in minutes to hours. Mitigate this with shelter and fire. Make sure you can maintain body temperature.\n\nDehydration: death in 2 to 4 days. always boil water. Don't rely on just filters. Viruses can screw you up to and most filters don't screen viruses.secure a clean source of water and have a pot or canister for boiling.\n\nStarvation: death in 2 to three weeks. Identify edible plants, especially starches. \n\nIn forests leaf litter can be amazing or dangerous. Wet leaves on slopes are very slippery. But, it's very easy to whip up a debris shelter. \n\nIf it's raining and you need a fire, find dead branches hanging vertically or dead standing. Ground contact wood is always moist, off Ground vertical branches tend to be less saturated.\n\nInner bark of many trees is edible. About 500 calories per pound. It'd an amazing resource in a pinch. Eat raw, bake, or boil.",
            "score": 2,
            "author": "FelTheWorgal",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you so much",
                    "score": 1,
                    "author": "Emotional_Juice69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meh, well hang on - what does a trip to the forest mean?  Are you going hiking or backpacking ot what?\n\nIf your going on a weekend trip then go have fun ......\n\nOr are you going out for the specific purpose of practicing survival skills?\n\nThey're not the same thing- if it's backpacking or something like that then just go, but when you get there don't open the pack and use stuff in it. \n\nPretend you lost all your gear - thats survival.......\n\nIf you have a bunch of stuff with you and you use it, that's just camping IMHO  !",
            "score": 2,
            "author": "Brain_Sample",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks",
                    "score": 1,
                    "author": "Emotional_Juice69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks",
                    "score": 1,
                    "author": "Emotional_Juice69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "10c’s",
            "score": 1,
            "author": "RangerReject"
        },
        {
            "level": 0,
            "comment": "Remember the rule of 3. And then have 3 different ways to accomplish life-saving tasks. Always bring more than one in case that one fails. Hear it all the time here in New Hampshire. Everywhere, someone needs rescuing from a simple hike that went wrong, and they were unprepared. \nExample: 3 days without water. Get a survival straw. They filter 10,000 gallons. If you lose or break it. Have iodine tablets. And in case you lose or drop those, bring some bleach tablets. And as another way pot, fire starting and boil water.  Also bring several types of fire starters, etc. 2=1 and so on.",
            "score": 1,
            "author": "warmongerKill"
        },
        {
            "level": 0,
            "comment": "I recommend taking a 406 MHz Distress Beacon with you: https://en.wikipedia.org/wiki/Emergency_position-indicating_radiobeacon\n\nThey're primarily used by boats (almost every boat in the world has one) but smaller/cheaper ones are available for land use as well, and they work pretty much anywhere in the world. If your life is in danger (broken leg, run out of drinking water, etc) you just flip the switch and wait for help to arrive.\n\nIn many countries (not sure about Spain) it's essentially the same as calling an ambulance, except you don't need a cell tower nearby, and it tells them where you are (reliably, even in situations where a GPS or satelite phone will not function).",
            "score": 1,
            "author": "sesame_dukes0j"
        },
        {
            "level": 0,
            "comment": "First, make sure you understand the rules and regulations of where you are going. There may be regulations surrounding dispersed camping, fires, etc. Research the area. Understand the terrain. Is it mountainous?  Is it flat?  Will it be difficult to hike it?  Is it something you can handle?  Also research the local weather conditions, and pack appropriately for the weather and temperatures you’ll expect. \n\nIf possible, stick to established marked tails, especially if you’re not really used to wandering the forest. Understand how to navigate a marked trail, both on the ground and on a map. \n\nMap your course. Know where you want to camp and where potential water sources are located on a map. Understand how to read the terrain and features on a map. \n\nLearn how to use a compass for navigation but also bring some other navigations aid. Phone GPS apps that are designed for outdoor recreational use such as AllTrails. GIA GPS, or whatever seems most useful in Spain can be good choices - otherwise a dedicated GPS like Garmin could also work and could give you some peace of mind for communications if you’re outside of cell service range. \n\nAlways keep track on where you are and what geographic features are around you.  And in the event something does go wrong and you feel like you’re lost, know the directions to hike to get to your nearest and easiest to follow terrain feature (maybe a road, maybe a stream or river, etc) that will allow you to navigate back to civilization.",
            "score": 1,
            "author": "MrBoondoggles"
        },
        {
            "level": 0,
            "comment": "In this day and age, the best essential for survival is a pair of shoes and knowledge of the way home. If you have these in place, you are good.  \n\nMost thirst and other discomforts are magnified by anxiety. Remind yourself, that you don't need water for 24 hours if you find yourself without it. Then get to water as you are able, not all panicky and thirsty.  \n\nIf morale goes, it all goes.  Keep everything in perspective. I've been going on dayhikes without water lately to train my mind out of anxiety. If I know there is water to drink I am way less thirsty than if I don't know where the next water is.",
            "score": 1,
            "author": "elfof4sky"
        },
        {
            "level": 0,
            "comment": "If you are asking this question maybe just go car camping….",
            "score": 1,
            "author": "cuddly_carcass"
        },
        {
            "level": 0,
            "comment": "What kind of forest? That makes all the difference",
            "score": 1,
            "author": "Treestandgal"
        },
        {
            "level": 0,
            "comment": "Go with an expert guide the first time. They can instruct you. There is a ton to know, and a lot of it depends on the location, duration, altitude, rescue access, and season of year.",
            "score": 1,
            "author": "Intrepid_Train3277"
        },
        {
            "level": 0,
            "comment": "Know your outs. Look at the area from Google earth. Find where you are going and see the roads.  Remember the roads that are close to you and their direction from where you will be. A road on the east, even though its 3 miles away and your hiking in from the south. Know that in bad circumstances, you can go east to the road for help.",
            "score": 1,
            "author": "Pooper-of-poo"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Battlebox, or any variation of it, is a dirty word on this sub. Go spam your terrible service elsewhere.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Survival) if you have any questions or concerns.*",
                    "score": 0,
                    "author": "AutoModerator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "* Small hiking axe/hatchet is worth its weight in gold. I find knives more dangerous and more likely to cause an accident.\n\n* So is a smaller (plastic) bucket (about 7-10L). If you use forest water, you can carry it with a bucket. If you're making fire and it's very dry or ground is mostly dry turf, you can fill bucket with sand or water so you can douse the fire if something goes wrong. If it rains, you can collect rainwater, and if ground is damp, you can keep your need-to-reach-often stuff in it - like tools or whatever so they won't get wet. Bucket also helps with collecting tinder and smaller firewood, mushrooms, whatever. And you can take your trash away after you're done - in a bucket. If you decide to buy a bucket, make sure it has quite thick walls and well-attached, non-bending handle that won't come off if bucket is full of water or sand. There's all sorts of cheap Chinese shit at the stores that break at first chance. Bucket like this looks like [a total piece of crap](https://imgur.com/a/KkCP7yf) - thin handle and weak handle connection, while [this](https://imgur.com/a/4p8PQmt) looks much sturdier.\n\n\n* Don't chill nor put your shelter under dead trees\n\n* Don't sit under a tree during a lighting storm\n\n* Don't put your tent or shelter in a hole or lower part of the ground. It'll get wet if it rains or if ground is wet in \ngeneral\n\n* Don't try to turn your life into a dumb reality show and make shelter under trunk of a big fallen tree\n\n* After setting up shelter/tent and making your bed, *lie* on it for good 10 minutes, and try to turn from side to side. To make sure it's *actually* soft and good. You can't fix a bad bed in the middle of night and sleepless night will ruin your next day.\n\n* The water boiling stuff you see on endless survival shows and from other \"experts\" usually refers to some dead ass desert in Arizona or wild jungle in Indonesia with parasites or pollution levels little known to science, but still applies to most natural water sources. \nGenerally in Europe - if water comes from a spring in the ground in a clean, nice forest in a huge national park, it's likely quite safe. If from river, not so much, since it collects pollution from farms, highways and factories it passes. Lakes are questionable and so are swamps. Stagnant water is always very dangerous. Also natural water tends to be cleaner the higher you are, since pollution mostly collects at the bottom (valleys, flatlands, such). Act accordingly.\n\n* Spare nature. Don't cut or hack live trees if you have no need to\n\n* When messing with any tree, always first look up, to make sure you're not knocking down a wasp, bird or or any other sort of nest.\n\n* It applies to everything else, too. Check before you act. Stomp on things, thy to shake them violently, so forth. Before you make a move, make sure you won't get screwed by physics and bad luck. No matter if you're building a shelter, trying to cross a stream via fallen log or whatever. Check first.\n\n* Use landmarks. Camp somewhere, where you can see a landmark (a mountain, a radio tower, whatever) so you always know where you are and about which way is back. Or at least could call for help and they can orient by that landmark.\n\n* Don't leave any food out for night! The smell will attract every living being in the area, including all the insects\n\n* It's a good idea to know where you're going and what the typical wind direction is at the place and time of year. It's quite annoying to set up a campfire, only to find all the smoke coming towards your tent or whatever. If you still mess up, you can build some sort of makeshift wind wall safe distance away from fire.\n\n* I don't know how weather is in Spain, but in five days, a lot of things could happen. I'd bring a bath-sized towel in a plastic bag (packed so it survives heavy rain or falling into river). You can use it to dry yourself, as extra cover if your legs are cold, makeshift pillow or scarf, bandage, mosquito screen, whatever.\n\n* If you go alone, bring a power bank and put your phone in battery saving mode. At no time should you be without chance to call for help.\n\n* Don't climb on shit. There's absolutely nothing you need in steep, rocky areas. There's no foraging, no firewood, no pretty plants to look at. Only about million chances to break your leg, twist your ankle, scrape your knee or fall badly.",
            "score": 1,
            "author": "Bang_Bus",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you so much for all that",
                    "score": 1,
                    "author": "Emotional_Juice69"
                },
                {
                    "level": 1,
                    "comment": "I thought this was a serious, comment, until I saw the towel.\n\nFord Prefect and Roosta taught us well the importance of a towel.",
                    "score": 1,
                    "author": "47ES",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not really. Being wet with nothing to do about it is worst way to be.\nI hike a lot in northern temperate climate during spring and a big, warm and dry towel has saved a bad day more than once. One time I went too early, wearing only short trunks and a light jumper, and had to spend night in a windy bus shelter in the middle of nowhere, while temperature dipped below 0°C (which isn't normal in May, but happened). About 4AM, woke up hell of a hypothermia, and my body refused to move, brain was pretty much giving up and I didn't have anything to wear, other than towel I packed in hopes of trying to dip in a lake somewhere. Wrapped it around my neck like a scarf and warmed up. Survival, more or less. I was quite amazed how hypothermia took nearly all of my willpower and brain was really ready to die.\n\nI don't know who Roosta is or whatever you referenced here.",
                            "score": 1,
                            "author": "Bang_Bus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The towel is from Douglas Adams, Hitchhiker's Guide to the Galaxy, Book / Movie / TV Series / Radio Series. \n\nhttps://hitchhikers.fandom.com/wiki/Towel\n\nBeing wet sucks, I have spent months in the wilderness, with many days being wet in near freezeing temperature. There is no such thing as bad weather, just bad gear. A towel wasn't going to help. Start dry, stay dry, know how to dry out. \n\nA towel bag is actually helpful gear. A small trash bag will keep stuff dry that needs to stay dry like a sleeping bag, down jacket, and sacred socks, etc.. Cut a head hole a large bag and it's a poncho to keep you dry. I never go to the wilderness without one. \n\nI have witnessed hypothermia in others, it made them stupid, and they were no longer able to help themselves.\n\nI'm not going to start on the bucket as survival gear as I'm not convinced that this entire subreddit the robots discovered for me last night isn't /s",
                                    "score": 1,
                                    "author": "47ES",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bucket - well, I don't carry it as \"survival gear\". When I go to forest, it's usually to forage mushrooms and/or just chill and drink beer with my friends while tenting for couple days. Forests around my home are made of super dry turf, that can ignite even underground and burn for months and there's fuck all you can do about it if you let it happen. \n\nSo I usually do take a bucket, for reasons I explained. Most likely, it starts out filled with ice, barbecue meat and beer bottles :) and ends up with our trash or mushrooms on the way back. In-between, it works as emergency fire extinguisher. You can also sit on it if you turn it over or use as a table surface for preparing food, and keep metal stuff in it (a good camper wouldn't drop axe in  wet moss). It can also save a backpack if it suddenly starts to rain and you have no shelter to hide the backpack in yet. It's also more comfortable for firewood, because sticks and twigs aren't most uniform objects and it's easier to carry them in a bucket, rather than awkwardly try to carry them in hands and spill them all around. And, plastic is easy to clean and waterproof. A wonder material. Try it!\n\nHypothermia is crazy as fuck. You know what's happening, you know that you're fucked, and **yet** your body and brain is like \"fuck it\". And you *know it's wrong and DO DO DO SOMETHING* but your hands and feet just won't move. I don't suggest serious hypothermia to anyone. It's awakening and conscious-expanding experience, but unlike LSD, it rarely ends well.",
                                            "score": 1,
                                            "author": "Bang_Bus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Never had Hypothermia myself but my friend got really stupid and worthless when he had it. \n\nMulti use items are a backcountry principle.\n\nAnd I just realized I do carry aound a bucket with me most of the time. \n\nIt doesn't have a handle, it is normally full of food, does make a great seat, it's my bear can.\n\nIf I ever need to make a big water carry, I now realize I could take the food out and fill it with water. I knew I didn't come to this sub reddit just for the humor, I did learn something.\n\nI also found a new use for my aluminum sheet, so two new things.",
                                                    "score": 1,
                                                    "author": "47ES"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Find a place you feel comfortable primitive camping and practice, staying a night or two and hone your skills a little at a time making notes on best practices and things to bring the next time.",
            "score": 1,
            "author": "militaryguy6996"
        },
        {
            "level": 0,
            "comment": "What forest are you planning to do this and at what time of year.",
            "score": 0,
            "author": "maryupallnight",
            "replies": [
                {
                    "level": 1,
                    "comment": "In summer probably, but I still don't know what forest will I go to",
                    "score": 1,
                    "author": "Emotional_Juice69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should talk with your freinds.\n\nSummer in Spain can be very hot and dry.",
                            "score": 1,
                            "author": "maryupallnight"
                        }
                    ]
                }
            ]
        }
    ]
}