{
    "id": "132d5w9",
    "score": 184,
    "title": "Survival education games?",
    "author": "mothonalog",
    "date": 1682724548.0,
    "url": "https://www.reddit.com/r/Survival/comments/132d5w9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Are there any wilderness survival games that teach or simulate with great detail various aspects of survival? For example, not just click a fire and ignite but learning how to make a hand-drill, finding suitable tinder or wax, or learning how to tie a rope to secure a rock to a stick, learning plants and trees and what sort of wood is suitable for tool-making.\n\nI’ve played Green Hell and The Long Dark and wonder if there are games even more realistic. Obviously I can just do it in real life, but learning through a game is more fun and it’s like a simulation for the real thing.",
    "comments": [
        {
            "level": 0,
            "comment": "The long dark is about as good as you're going to get as far as realism is concerned",
            "score": 108,
            "author": "weasel5134",
            "replies": [
                {
                    "level": 1,
                    "comment": "and then go outside for the real thing",
                    "score": 16,
                    "author": "workerbee12three"
                },
                {
                    "level": 1,
                    "comment": "It's pretty much my favourite game, but it's really not the most realistic. I would say that Unreal World is by far the most realistic, it's basically a simulation.",
                    "score": 7,
                    "author": "thetarget3"
                },
                {
                    "level": 1,
                    "comment": "This 100%",
                    "score": 2,
                    "author": "alphagaia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jump on steam and search survival games. \n\nThe long dark, green hell, and the forest are a few off the top of my head. It's not gonna show you how to do everything but it might give you a super generalized idea of things.",
            "score": 23,
            "author": "eccy55",
            "replies": [
                {
                    "level": 1,
                    "comment": "the forest has honestly taught me a lot when i used to play it, i mean the freaky canabals and shit can be turned off and it’s just you and the wilderness. They also just came out with sons of the forest which might be better. \n\nIf you know nothing about the wilderness i’d say definitely check out the forest or sons of the forest on steam. and if you don’t like scary things just turn it to peaceful mode, you’ll build a fire to stay warm and build a shelter outta the trees you cut down. you kill animals and make certain clothing or equipment and even get meat and have to cook it on the fire. You will learn how to survive if you crash on an island like the movie cast away with wilson",
                    "score": 12,
                    "author": "Madeupsky"
                }
            ]
        },
        {
            "level": 0,
            "comment": "DayZ - Zombies aside you need to craft tools,  fires, shelters, avoid sickness, wring your clothes when it rains, hunt and cook, purify water, eat, drink, and stay warm etc.",
            "score": 22,
            "author": "cluckmuckchuckapluck",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was just going to recommend it",
                    "score": 5,
                    "author": "Spare_Economy4879"
                },
                {
                    "level": 1,
                    "comment": "Play on namalsk for hardcore version lol. Good luck surviving (my fave map)",
                    "score": 1,
                    "author": "LiquidBear_"
                },
                {
                    "level": 1,
                    "comment": "You can also learn reallife star patterns to navigate and learn that the sun rises in the east and settles in the north.\n\nAlso to always wash your hands and not drink dirty water haha",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it’s a great idea. I know you’re getting flack here but I’d be into that too when I want something productive to learn in the middle of the night.",
            "score": 41,
            "author": "nah2daysun",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah or just to scratch the itch when I can’t get out (which is quite often).\n\nThe physical skills may be hard to mirror with a good analog but things like tracking, plant and tree identification, picking a good shelter location, properly insulating and waterproofing that shelter are all things I could see realistically represented in a video game. \n\nIt might not be the most exciting game but there’s a market for farming sims and truck driving sims, why not survival sims?",
                    "score": 16,
                    "author": "justmerriwether",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're looking for Unreal World.",
                            "score": 1,
                            "author": "SecretAgentVampire",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well shit, never heard of this, thanks for the rec!",
                                    "score": 2,
                                    "author": "justmerriwether"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why would they be getting flack? Reddit is dumb",
                    "score": 2,
                    "author": "cokeofthecolavariety"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oregon Trail hands down!",
            "score": 8,
            "author": "nu_trader",
            "replies": [
                {
                    "level": 1,
                    "comment": "Taught me how to ford a river!",
                    "score": 4,
                    "author": "Random9502395023950",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "😂😂😂 everytime i had to cross a river my wagon would break and i’d lose like half of my stuff",
                            "score": 3,
                            "author": "Madeupsky",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Annnnd you didnt hire the guide. Sure it was only 2” deep, but still…",
                                    "score": 2,
                                    "author": "Random9502395023950",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think I couldn’t afford one or trade with anything 😂 had to risk it. the mobile version was worse, the water level was always super high and the current was fast. i’d wait a couple days and nothing would change and i’d be running out of food",
                                            "score": 3,
                                            "author": "Madeupsky",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "“ if you continue to hunt game in this area will become scarce”\n\n- not my problem, Im Oregon bound!",
                                                    "score": 3,
                                                    "author": "Random9502395023950"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "and that i dont want to die of dysentery",
                            "score": 1,
                            "author": "bolanrox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lets not rule anything out…",
                                    "score": 1,
                                    "author": "Random9502395023950"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't Starve on Steam/XBox/Switch",
            "score": 8,
            "author": "walksalot_talksalot"
        },
        {
            "level": 0,
            "comment": "I think this is exactly the aspect games are missing. An ultimate game would connect realism with entertainment and make it accurate enough where you could learn and take something away from the game. \n\nSo apparently, survivorman vr is good. Developed by Les Stroud; a prominent survival expert. One of my favorite in terms of survival. Look him up on YouTube. Derelicts seems interesting. Not yet released but is under development.",
            "score": 8,
            "author": "RealSlavGod"
        },
        {
            "level": 0,
            "comment": "I’ve put 100s of hours into different survival games and the “most realistic” I’ve found are the two you’ve mentioned. Project Zomboid has a level of detail I haven’t seen in many games, but it’s brutally difficult, and there are zombies. Also it looks like the sims. With that said you can find canning material to can the food you grow for long term storage. There are also an insane number of mods for it. You might be able to get closer to realistic with Project Zomboid.",
            "score": 7,
            "author": "nerdrageofdoom"
        },
        {
            "level": 0,
            "comment": "Orienteering is one game you can use to help build navigation skills. Check out meetup.com for orienteering meetups: People will organize contests for fun.",
            "score": 5,
            "author": "FartsWithAnAccent"
        },
        {
            "level": 0,
            "comment": "It's been mentionned just once.\n\nGreen Hell.\n\nYou are basically stranded in the brazilian jungle and have to find foods, medicine, purify water, fight sicknesses and parasites, craft realistic shelters and devices with available resources amd patterns. Survival wise, it's been developped to match reality so much that peple from the brazilian amazon were amazed at how realistic it is.",
            "score": 13,
            "author": "popotheviking",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very realistic methods for making fire and shelters as well, with food focusing on the different macronutrients as opposed to just calories",
                    "score": 7,
                    "author": "goeiemakker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, the devs are doing things right survival wise with this one",
                            "score": 3,
                            "author": "popotheviking"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i have “The Worst-Case Scenario Survival Game” [here](https://www.ebay.com/itm/125647094452?chn=ps&amp;_trkparms=ispr%3D1&amp;amdata=enc%3A1Xk1LaU1lRx-gXsFmmh_-VA51&amp;norover=1&amp;mkevt=1&amp;mkrid=711-117182-37290-0&amp;mkcid=2&amp;mkscid=101&amp;itemid=125647094452&amp;targetid=1583904486362&amp;device=m&amp;mktype=&amp;googleloc=9003798&amp;poi=&amp;campaignid=15275224983&amp;mkgroupid=131097072938&amp;rlsatarget=pla-1583904486362&amp;abcId=9300697&amp;merchantid=113601741&amp;gbraid=0AAAAAD_QDh_1iZGO7lbHEmDs8GTVeS8OP&amp;gclid=Cj0KCQjw3a2iBhCFARIsAD4jQB1WBWr0q2vutIHAo7lixbhmRMghv_O5P0PQnuJw8AswFDI1wp_pUhQaAkeQEALw_wcB)",
            "score": 4,
            "author": "kvnczr",
            "replies": [
                {
                    "level": 1,
                    "comment": "any good",
                    "score": 1,
                    "author": "SigueSigueSputnix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it’s fun &amp; informative. 90% of the prompts are great, 10% are goofy. it will definitely prepare people for situations they may not know anything about, ie snow blindness, wound care, etc. this game is hard to find &amp; can be expensive—not sure if it is being produced anymore.",
                            "score": 3,
                            "author": "kvnczr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ok cheers. thanks.",
                                    "score": 1,
                                    "author": "SigueSigueSputnix"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Give the Long Dark a shot.",
            "score": 14,
            "author": "OmegaPrecept"
        },
        {
            "level": 0,
            "comment": "Project zomboid with no zombies is basically just survival sims 1.",
            "score": 3,
            "author": "CharlotteChaos"
        },
        {
            "level": 0,
            "comment": "The Flame in the Flood",
            "score": 3,
            "author": "BrokilonDryad"
        },
        {
            "level": 0,
            "comment": "No.\n\nGo outside.\n\nStart your own fire.",
            "score": 3,
            "author": "Mundane_Librarian607"
        },
        {
            "level": 0,
            "comment": "Sir, did you just ask if you can learn how to start a fire from a *video game*",
            "score": 31,
            "author": "Own-Stress-6474",
            "replies": [
                {
                    "level": 1,
                    "comment": "it’d be great for people who don’t wanna do any survival shit unless it’s like… life or death. learn about how to do all the shit so you don’t immediately die when u get stuck in a bad situation. \n\nsure you might not be *good* at it but basic preparedness is better than none",
                    "score": 6,
                    "author": "OrganicHoneydew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "rlly not the same as an educational video game. \n\nthat’d be something i’d do after i learn a bunch of survival shit. if i were to play that game rn it would just be me sitting by a fire until i get bored bc that’s all i know how to do so far. \n\nthe alternative to learning by video game would be reading or watching youtube videos which just aren’t as fun 🤷",
                                    "score": 1,
                                    "author": "OrganicHoneydew"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People learn from books, why not something more interactive like a game? As long as the mechanics are true, it's entirely possible to learn.",
                    "score": 2,
                    "author": "Sonova_Vondruke"
                },
                {
                    "level": 1,
                    "comment": "Hahaha it’s crazy I know",
                    "score": 8,
                    "author": "mothonalog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Might I suggest going out to the actual woods? Best game out there",
                            "score": 16,
                            "author": "Own-Stress-6474",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 35,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ahhhh!",
                                            "score": 7,
                                            "author": "Ok_Highlight281"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Now that's a good point!",
                                            "score": 2,
                                            "author": "SuddenlyRussiann"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well yea that's why the 1st rule of camping is whittle a spear... hard to level up without stabbing some spiders",
                                            "score": 2,
                                            "author": "Grinch420"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Using a hand drill to make fire is something that I really doubt you can learn from a video game. Hell, it was terrible to do in person, with all the supplies, ready to go, and trying for half an hour live. Nothing replaces working with an expert and actually doing it out there. Maybe a video game can get you some of the knowledge, but the actual technique is more nuanced for drills at least. Striking a metal match - sure. Flint and steel, a little harder, but could be represented. Bow drill? Make sure in the video game that you work on it for at least 15 minutes just spinning the spindle back and forth before you get that tiny little ember and watch it go out before you work another 15 minutes.",
                                    "score": 3,
                                    "author": "alwaysaneagle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hand drill has got to be my absolute least favorite way to start a fire that I’ve successfully accomplished. Happy I can say I’ve done it and don’t plan on ever doing it again lol. Everything I own has lighters with it and multiple magnesium’s, I hate not having an easy fire.",
                                            "score": 2,
                                            "author": "sadetheruiner"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Is that what OP asked for? What is this thread supposed to be about?\n\n\"Hey guys, where can I buy a shirt?\" \n\n\"Shirst are LAME! Have you heard of pants?!\"",
                                    "score": 2,
                                    "author": "SecretAgentVampire"
                                },
                                {
                                    "level": 3,
                                    "comment": "r/outside",
                                    "score": 1,
                                    "author": "FireRetrall"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sir, have you played a video game in the last 15 years",
                    "score": 1,
                    "author": "Ieatadapoopoo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I heard green hell was a good one",
            "score": 2,
            "author": "RouGEkila"
        },
        {
            "level": 0,
            "comment": "Survivorman is releasing a VR game",
            "score": 2,
            "author": "bones_bn"
        },
        {
            "level": 0,
            "comment": "Project zomboid but with no zombies on.",
            "score": 2,
            "author": "Samathura"
        },
        {
            "level": 0,
            "comment": "DayZ has all those things, plus navigating other players, and zombies lol. But the immersion is incredible when it comes to foraging, keeping hydrated, injuries, broken legs, making splits, hand drills, starting fires, building shelters, scavenging.",
            "score": 2,
            "author": "ClickClack24"
        },
        {
            "level": 0,
            "comment": "Have you tried playing Stranded Deep? It's not as good as Green Hell but can be somewhat fun. Also scary cause the sharks come after you!!!",
            "score": 2,
            "author": "NowYouKnowBro"
        },
        {
            "level": 0,
            "comment": "The forest is fun",
            "score": 2,
            "author": "alphagaia"
        },
        {
            "level": 0,
            "comment": "Arid",
            "score": 2,
            "author": "BigHeavySlav"
        },
        {
            "level": 0,
            "comment": "If you want *actual* realism, [UnReal World](http://www.unrealworld.fi/) is by far the most realistic out of any recommendation on here. But it's one of those niche Dwarf Fortress style games that are super dense and not very visually pleasing. But it will beat every single other recommendation here if you're looking for \"great detail\".",
            "score": 2,
            "author": "rljlc"
        },
        {
            "level": 0,
            "comment": "The forest! It'll teach you how to survive and interact with local populations! Also, it has caves.",
            "score": 5,
            "author": "deerdanceamk"
        },
        {
            "level": 0,
            "comment": "There are no games that’ll teach you more than researching and practicing these skills.",
            "score": 4,
            "author": "Three0hHate"
        },
        {
            "level": 0,
            "comment": "Bruh.... get your ass outside and touch some grass",
            "score": 1,
            "author": "Unusual_Influence_82"
        },
        {
            "level": 0,
            "comment": "Roblox",
            "score": 3,
            "author": "Ok_Highlight281",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "csgo ain’t nothing like it 😂 you might learn a thing or 2 about cheaters and unfair match making",
                            "score": 1,
                            "author": "Madeupsky"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Red dead redemption 2",
            "score": 1,
            "author": "Blunt7"
        },
        {
            "level": 0,
            "comment": "Rust",
            "score": 1,
            "author": "Chungalolz"
        },
        {
            "level": 0,
            "comment": "Bro, just go outside and punch trees!",
            "score": 1,
            "author": "mustard_samrich"
        },
        {
            "level": 0,
            "comment": "I’ve always enjoyed Giardia Roulette.",
            "score": 1,
            "author": "ranger69danger"
        },
        {
            "level": 0,
            "comment": "Valheim. Lots if mosquitoes.",
            "score": 1,
            "author": "big_airliner_whoa"
        },
        {
            "level": 0,
            "comment": "Stranded deep.",
            "score": 1,
            "author": "aBellicoseBEAR"
        },
        {
            "level": 0,
            "comment": "Day Z",
            "score": 1,
            "author": "cubanohermano"
        },
        {
            "level": 0,
            "comment": "Scum. Just one of the many mechanics of scum is making sure not to put your raw meat too close to the fire otherwise it burns. You have to manage your vitamin intake, overall it is, without a doubt, the most realistic game I have ever played.\n\nThough the game is mostly oriented towards fitness and nutrition realism.\n\nThe issue stems from the fact that it's a lot to worry about with little reward.",
            "score": 1,
            "author": "natiplease"
        },
        {
            "level": 0,
            "comment": "Oregon Trail is the only survival game you need.",
            "score": 1,
            "author": "Budget_Llama_Shoes"
        },
        {
            "level": 0,
            "comment": "dayz lol",
            "score": 1,
            "author": "LiquidBear_"
        },
        {
            "level": 0,
            "comment": "Ive learned a lot about fortifications, trapping and efficient use of resources from the game Ark: survival.",
            "score": 1,
            "author": "chickencharizard"
        },
        {
            "level": 0,
            "comment": "What you need is Hand Simulator: Survival",
            "score": 1,
            "author": "WonderfulGreen9823"
        },
        {
            "level": 0,
            "comment": "If you want real life immersion, real life is a good choice. Joking aside, most survival games usually have a zombie element to it be DayZ and Project Zomboid. Rimworld is a good colony sim, will teach you about farming to a degree and will learn leadership and management qualities. \nIf colony sims are your thing and want to learn something educational, try Oxygen Not Included. Learn about gasses and engineering \n\nIf you want to learn to make a fire, just go camping. Find a nice trail near you and see if there is a campsite or private land that would let you do campfires.",
            "score": 1,
            "author": "SurvivorPickles"
        },
        {
            "level": 0,
            "comment": "Did Les Stroud's VR survival game come out yet?",
            "score": 1,
            "author": "bolanrox"
        },
        {
            "level": 0,
            "comment": "Yes.\n\nIt's called going outside.",
            "score": 0,
            "author": "UlyssesKeys"
        },
        {
            "level": 0,
            "comment": "Redditors will do anything except watch a video on the topic &amp; going outside to try it yourself.",
            "score": 0,
            "author": "Apprehensive-End6219"
        }
    ]
}