{
    "id": "134l4pb",
    "score": 171,
    "title": "Best deal for a genuine case of MRE's ?",
    "author": "joeyfuture",
    "date": 1682944102.0,
    "url": "https://www.reddit.com/r/Survival/comments/134l4pb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "Personally I would just buy a case of Mountain House meals instead. They actually taste good. Yes, you need to boil water but if you can’t do that you’ll probably die anyway 🤓",
            "score": 211,
            "author": "AmmotheDoberman",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can have them with cold water as well, just needs to absorb twice as long.",
                    "score": 72,
                    "author": "PNWoutdoors",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha. Not the pasta.\n\nYou'll wished you had hot water in the next couple days.",
                            "score": 8,
                            "author": "Suprspike",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It may not be ideal but if boiling water isn't available, their instructions literally say all of their meals can be rehydrated with cold water.",
                                    "score": 1,
                                    "author": "PNWoutdoors",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I've eaten just about every MH that's stomachable, anf I can tell you one thing about the mac &amp; cheese. You'll never get it rehydrated.\n\nAnd eating non hydrated freeze dried food will (I was try not to say it)... Plug you up.",
                                            "score": 1,
                                            "author": "Suprspike"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes!",
                            "score": 10,
                            "author": "AmmotheDoberman"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 56,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Keep an eye out at REI…recently, I got 25% off a huge bucket. I think it might have been an annual sale. All I know is I’ve never seen a sale like that on Mountain House. If anyone knows of others please chime in.",
                            "score": 15,
                            "author": "AmmotheDoberman"
                        },
                        {
                            "level": 2,
                            "comment": "All right, guys. Mountain house is made not far from me. Go to Bi Mart online shopping. Dont know if they deliver online orders out of Oregon. But nobody beats their prices on Mountain House buckets. Under 100.00 for classic bucket.",
                            "score": 8,
                            "author": "ligh10ninglizard"
                        },
                        {
                            "level": 2,
                            "comment": "Very subjective. \n\nI enjoy both mountain house meals and MREs. I stock pile mostly MREs because I don’t need hot water to have a hot meal and can just use cold water to produce a hot meal. \n\nI keep Mountain House meals for easy camping and hiking meals.   I enjoy both very much.",
                            "score": 19,
                            "author": "2wheels_up"
                        },
                        {
                            "level": 2,
                            "comment": "But they are so low calorie….",
                            "score": 5,
                            "author": "wmzyboy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "lol you can't survive a couple v days under calorie?",
                                    "score": -2,
                                    "author": "supernettipot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's about value. If you can get a poor tasting meal that's 1500 calories for $5, or a fairly delicious (comparatively) one for $3 that is only 490 calories, that's an obvious value difference. That difference wouldn't be enough to justify eating unpleasant food if you're just ultralight backpacking every third weekend. \n\nOn a survival forum, the concept of bulk comes into play. You need *lots* of food stored. Food isn't your only expense if you really are prepared. So you have to make financial decisions that might affect comfort, pleasure, preference, and ... flavor. \n\nFor a family of four,  if you manage to get a days worth of food down to the low cost of $3 per person, a years food is $4380. \n\nAt $5 a person, it goes up to $7300.  \n\nI could do the math to connect the caloric values, and how it's an exponential amount, but I think y'all get it. \n\nPeople who are into survival usually aren't wealthy. So they have to buy bang for their buck, value first, for things that have to bought in high quantities.",
                                            "score": 5,
                                            "author": "BeardsuptheWazoo"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’m just saying that an MRE is like 1000 calories and the Mountain House is like 220-320.",
                                            "score": 9,
                                            "author": "wmzyboy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "dude then supplement or eat something else. this isn't that complicated.",
                                                    "score": -6,
                                                    "author": "supernettipot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The Reddit is called r/survival, the point is to survive….it’s better to carry less weight and more calories…..this isn’t that complicated",
                                                            "score": 12,
                                                            "author": "wmzyboy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "you can live about 40 days without food.  most wouldnt last that long for other reasons. take their food.",
                                                                    "score": -5,
                                                                    "author": "supernettipot",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I see your point, but it’s clear that you don’t understand the mental and physical toll a lack of proper nutrition has….yes, you can live a long white without food, but you cannot continue to reason and work to survive….you just won’t die for 40 days.",
                                                                            "score": 8,
                                                                            "author": "wmzyboy",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "it's clear to me you shouldn't rely on MREs to sustain life. I already said look to supplement.",
                                                                                    "score": 0,
                                                                                    "author": "supernettipot"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "of course, but the whole point of storing food is for the energy/calories. if i just wanted my stomach to be full, id drink water",
                                            "score": 3,
                                            "author": "DrunkensAndDragons"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; MREs taste like shit\n\nThis is actually intentional if we're talking about emergency supplies. It means you're less likely to use it up when there isn't an emergency and you're just kinda hungry.",
                            "score": 2,
                            "author": "IdealDesperate2732"
                        },
                        {
                            "level": 2,
                            "comment": "3 day is $100? Geez. I bought a 30 day/45 day conservative with water filter and some kind of fire logs crammed in a 5 gallon bucket from Sam's in 2010 for $99.99",
                            "score": 1,
                            "author": "ponchtheponce",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah and that's why I put the year in my comment dipshit. Since your to dumb to understand I'll explain. I'm exclaiming the price difference between them and now. Get it?",
                                            "score": -2,
                                            "author": "ponchtheponce",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ratio'd",
                                                    "score": 0,
                                                    "author": "BluDude2020"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nah the pork maple ones taste amazinf",
                            "score": 1,
                            "author": "darth_musturd"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Costco has [tubs of food](https://www.costco.com/.product.4000104137.html) like this too, 30 days for one person for $190 — very good deal and it’s in a convenient package.",
                    "score": 2,
                    "author": "dufflebagdave",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes I’ve seen that, thanks.",
                            "score": 1,
                            "author": "AmmotheDoberman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go to town close to ANG training camp in June. Swap even for a case of beer. Make sure MRE case is sealed or you'll get nothing but the hotdog menu.",
            "score": 54,
            "author": "RJMqueereyes",
            "replies": [
                {
                    "level": 1,
                    "comment": "I struggled to eat them so I would collect them like cards…..alright, whose got #4 or #11 I’ll trade ya, then I’d make complete cases and bring home…..still got them, 1994 vintage.",
                    "score": 7,
                    "author": "wollier12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My kids opened all of mine for the Skittles and M&amp;M's. Made them eat the entrées for supper for a week. The statue of limitations has run out if that was child abuse.",
                            "score": 11,
                            "author": "RJMqueereyes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You got skittles? Hell all we got was these nasty pieces of gum. And a little bottle of Tabasco….I liked the freeze dried peaches though.",
                                    "score": 3,
                                    "author": "wollier12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep. Late 90's production. The M&amp;M's turned funny colors from being in deep freeze for so long. Skittles were unaffected. I read they're stopping the little Tabasco bottles and going to a dry spice pack from here out.",
                                            "score": 2,
                                            "author": "RJMqueereyes"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "We used to joke that the winning sweepstakes ticket was in the MRE. It would be found after long the contest ended.",
                                            "score": 1,
                                            "author": "Appropriate-Law5963"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fuck the hotdogs. Fuck the omelette. Fuck that sausage gravy. And fuck the stupid new pizza. \n\nBut the chicken and noodles and tuna ones could be worse.",
                    "score": 1,
                    "author": "LoosieLawless"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 31,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s because the queen died",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She ate an MRE.",
                            "score": 2,
                            "author": "Capt_Myke"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "20$ for an entire day of food ain’t that bad. IMP’s don’t even taste bad. Accept the salmon one. Fuck that shit",
                    "score": 1,
                    "author": "your_local_recruiter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bx sells them.  Like $12 each.  Somehow they aren't any cheaper by the case.",
            "score": 20,
            "author": "Spheresdeep"
        },
        {
            "level": 0,
            "comment": "FB marketplace in a base town.",
            "score": 7,
            "author": "we_go_on_three"
        },
        {
            "level": 0,
            "comment": "Got mine from a church house after a hurricane as a teen. Then I joined and ate more mres.",
            "score": 5,
            "author": "Educational_Bet_6606"
        },
        {
            "level": 0,
            "comment": "Shipping is cheap and he’s always running free shipping codes and 10% off codes if you sign up for his newsletter. I’ve bought a good many cases.\n\nhttps://www.raygunworksllc.com/product-page/us-military-surplus-mre",
            "score": 4,
            "author": "MrSmitty556x45",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, that's a pretty solid deal!",
                    "score": 3,
                    "author": "joeyfuture"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The best deal I ever got:\n\nAgree to join the network organization established by the distributors of MREs for 4 years (you can do it on a part time basis), and they'll give you an M.R.E. for free several times a month.",
            "score": 11,
            "author": "StoopidestManOnEarth",
            "replies": [
                {
                    "level": 1,
                    "comment": "how do i do this?",
                    "score": 3,
                    "author": "DrunkensAndDragons",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You gotta go to MEPS and then just raise your right hand…..",
                            "score": 1,
                            "author": "LoosieLawless",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "im an idiot, shit. thank you, haha.",
                                    "score": 2,
                                    "author": "DrunkensAndDragons",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not an idiot, just gullible with a great username 😎😎😎",
                                            "score": 1,
                                            "author": "LoosieLawless"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is truly the best way to get MREs.\n\nAt one point they were giving me free MREs 3x daily for a couple of months.  It was awesome.",
                    "score": 3,
                    "author": "fordag",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too! And all the bottled water I could drink!",
                            "score": 2,
                            "author": "SuperTopperHarley"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Free if you join military isn’t it?",
            "score": 4,
            "author": "TallowGuy",
            "replies": [
                {
                    "level": 1,
                    "comment": "They usually just feed you normal food. You only get them if you are in the field far from any facilities. Also joining the military for free mres isn't the smartest idea.",
                    "score": 5,
                    "author": "jbash080",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seems like a drill sergeant would have fun with a recruit who states this is the reason for joining the military.",
                            "score": 2,
                            "author": "SuperTopperHarley",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm picturing the jelly donut scene from full metal jacket but it's refried beans and shitty coffee.",
                                    "score": 2,
                                    "author": "jbash080"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah neither is eating MREs in general",
                            "score": 1,
                            "author": "TallowGuy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You start eating MREs on the regular you’ll never need to shit again",
            "score": 5,
            "author": "MisterPimpus"
        },
        {
            "level": 0,
            "comment": "I don't understand this sub's obsession with MREs. They're shitty food produced by the lowest bidder for the purpose of keeping soldiers barely alive when they're not near a mess hall. There are so many better and cheaper options out there. Do people just like LARP'ing as a soldier or what?",
            "score": 56,
            "author": "medium_mammal",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have (in)volunatarily used MREs extensively for a couple years. I obviously switched to the other civilian survival/backpacking foods after I lost my \"free\" access to MREs. After about 7 years out, I still haven't found a great replacement for MREs. \n\nAnd some of them are actually pretty delicious. Maybe its because I ate them so much, but there are a few of them that I'd eat over some fast food chains.\n\nBut its hard to beat out such a highly researched meal plan, with a great spread of minerals, vitamins, nutrients, that can sustain the average adult for several days on just one MRE, that's lightweight and can easily be packed on an individual load.",
                    "score": 75,
                    "author": "StoopidestManOnEarth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah i fuckin love MRE's, although I've never served and haven't had to eat them every day either so there's that.\n\nI'm a forester so I'd love to find what OP is asking for, they make a perfect packable woods lunch.",
                            "score": 27,
                            "author": "MechanicalAxe"
                        },
                        {
                            "level": 2,
                            "comment": "Man, the ratatouille MRE is fucking awesome. They are expensive though.",
                            "score": 6,
                            "author": "-TokyoCop-"
                        },
                        {
                            "level": 2,
                            "comment": "I've had MREs from the turn of the century, and I've had current ones. All the current ones I've had are pretty good. The earlier ones my dad used to bring home... Not so much.\n\nAnd a qualifier on the several days with one MRE thing... There's usually somewhere around 1200 calories in an MRE. I've survived almost a week on three MREs and a tiny bit more food I came across elsewhere, but it's not pleasant and I lost some weight.\n\nSo don't go out there thinking it's lembas or something. It won't fill you, but it'll give you enough to push on if you're determined and you're willing to take some time regaining weight after.",
                            "score": 12,
                            "author": "Tanstaafl2415"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They are more heavily fortified in vitamins than any backpacking food, the barely alive comment is either ignorant or just plain stupid.\n\nWhy is everything such a dumbass extreme? It's not great or horrible. It's in the middle.",
                    "score": 42,
                    "author": "Unicorn187",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Vitamins are cheap, light, and ubiquitous if that's your primary goal of getting MREs. Plus, the fancy (but still way cheaper) freeze dried meals aren't exactly lacking in nutrients given the kinds of foods they're made with. \n\nIf you're going to favor the middle path, I can't imagine MREs fall into that category of \"reasonable non extreme thing\".",
                            "score": 4,
                            "author": "Kowzorz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The freezedried stuff I've seen at Walmart, like Mountainhouse and others, are (per calorie) about three-four times as much as I'm accustomed to spending on MREs. MREs are expensive enough, I don't need to pay more for less.\n\n[$12 for 400 calories](https://mountainhouse.com/collections/entrees/products/beef-stew-pouch), or $8-$12 for around 1,200? I'll stick with MREs until I get around to trying homemade pemmican or something.",
                                    "score": 8,
                                    "author": "Tanstaafl2415",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My research and experience with pouch meals puts them closer to 5-700/pouch for a typical pouch meal and closer to $8-$10. Here's one https://readywise.com/products/hunting-breakfast-and-entree-kit that prices out to $7/pouch.  There is lots of price gouging bougie people like your example, but let's not pretend those are your only options. And if you're willing to spend hundreds (or long term: thousands) on MREs, you have even more long term options to make them yourself for comparable prices.\n\nAlso keep in mind the MRE is a kit. The comparable item within the MRE, the single pouch of \"entree\", has less than half the calories of a typical camping pouch-meal. It is then supplemented with food that you, as a camper/postapocalypticroleplayer could easily acquire yourself for cheaper than MRE prices such as crackers, raisins, candy, PB+J, etc. That's where the bulk of the calories come from in an MRE.\n\n280 calories per entree pouch on average according to this page citing HPRC-online.org - https://www.ruckformiles.com/mre/how-many-calories-in-an-mre/",
                                            "score": 2,
                                            "author": "Kowzorz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not trying to argue that those are the only options, just that they're what I've seen. I admittedly haven't looked around much. And I agree, the MRE is a kit. But it's still priced as a unit, doesn't require any water to eat and requires only a small amount of water to heat.\n\nMost of the time when I'm camping I bring normal food that I can cook. Cheaper than an MRE or anything pre-prepared. But I have a couple MREs on hand that I can throw in a bag for a spontaneous trip.\n\nIt's not perfect for every use-case, but it is good for certain use cases. For long term survival, your best bet is likely dried and canned goods, because bugging in is typically a better option than bugging out. I'm not stocking up on massive quantities of MREs, freeze drieds, or any other \"backpacking\" solutions for an actual emergency, so realistically either way I go I'm spending at most $100 a year on this type of item (typically much less). And I find MREs more convenient, so I use them.",
                                                    "score": 6,
                                                    "author": "Tanstaafl2415"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes people like LARPing as a soldier. You can thank 20 years of war and propaganda for it.",
                    "score": 14,
                    "author": "Vomitus_The_Emetic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can thank war that people like to re-enact wars.... what? No shit?\n\nAnd propaganda is why people like to play war? Lol, what?",
                            "score": -5,
                            "author": "FelinePrettyJava",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;no shit?\n\nNo shit. \n\n&gt;lol, what?\n\nPropaganda is why people like to play war",
                                    "score": 1,
                                    "author": "Vomitus_The_Emetic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ehhhhhh humans and men in particular have always had a drive for warlike behavior. It’s ingrained in our nature. It’s also why the war propaganda is even effective.",
                                            "score": 1,
                                            "author": "14InTheDorsalPeen"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Do you think girls like dolls because of propaganda too?",
                                            "score": 1,
                                            "author": "FelinePrettyJava"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm doing a combination of MRE's and [these ](https://www.amazon.com/dp/B091MFB1MQ?ref_=cm_sw_r_apann_dp_EBBEW6VRGPR3A0VEG6W5) MRE's are just proven, period. They really aren't any worse than the processed chemical ridden food buy at the grocery store.. let's face it, even the highest quality food available to us today is probably compromised in one way or another. Example: a free range chicken farm, couple miles away from a farm spraying chemicals to control weed's, those chemicals are more than likely going to affect the free range farm.. basically, pick your poison.",
                    "score": 9,
                    "author": "joeyfuture",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Proven to keep you from shitting for a week in the field and make you a fat fuck when you’re not in the field.",
                            "score": 8,
                            "author": "Accidental-Genius",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good news is I have never once in my life been able to get over 170lbs no matter how much I eat. I'd welcome a little weight 🤣",
                                    "score": 4,
                                    "author": "joeyfuture",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ahh I remember those days. Wait a couple decades and be amazed. I was always eating pasta and trying to load calories, I couldn't even gain mass in weightlifting, just got stringy. Now wondering what happened to my size 29 waist lol.",
                                            "score": 2,
                                            "author": "capt-bob",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not sure it's Ever going to catch up with me. My dad's in his 60s now and still as skinny as a twig. I'm almost 40 and have never fluctuated more than 15lbs. Years ago I had this fence job. After two years I was so excited to finally have some muscle. 2 months after moving on from the job I lost it all 🤣",
                                                    "score": 5,
                                                    "author": "joeyfuture",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I still have to use weight gain powder when my job hours from summer to winter duties and back, but a got a little spare tire. Maybe they are right about corn syrup",
                                                            "score": 2,
                                                            "author": "capt-bob"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; a free range chicken farm, couple miles away from a farm spraying chemicals to control weed's, those chemicals are more than likely going to affect the free range farm.. basically, pick your poison.\n\nChemicals are expensive - the farms spraying them don't do it on windy days, so there's not much overspray. What little overspray there will be is generally covered by the buffer zones that they're required to have.\n\nPlus they're routinely audited with soil samples/etc to check for chemicals.\n\nFinally at least where I live, most of the organic farms are surrounded by other organic farms. Because they tend to be about 50% more profitable for the farmer than the same farm selling produce with chemicals. If the farmer knows how to grow organic food, then they will. And if there's a farm next door showing them how to do it, then they sure as hell are going to copy them.\n\nYou're kidding yourself if you think a tiny bit of roundup overspray (enough that the certifiers will still consider the produce organic) is worse for you than an MRE which contains about *four times* more salt than you should be eating in a meal. The roundup *might* kill you. We absolutely know salt will kill you (heart attack) if you eat too much regularly, and four times the recommended amount is definitely too much.",
                            "score": 0,
                            "author": "sesame_dukes0j",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're kidding yourself - [link](https://www.google.com/amp/s/amp.theguardian.com/us-news/2022/jul/09/weedkiller-glyphosate-cdc-study-urine-samples) the CDC study is in the article. I don't even trust the CDC, so it's probably closer to 100 percent than 80 percent...",
                                    "score": -1,
                                    "author": "joeyfuture"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But OP doesn't want an alternative, he wants genuine MREs. That was the purpose for this post. I believe that he can eat whatever he wants, especially in a survival situation, but if you want to argue against his preference in favor of not helping the conversation, that is your prerogative",
                                    "score": 4,
                                    "author": "KnowOneDotNinja",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well stated",
                                            "score": 1,
                                            "author": "Remote-Client-4577"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've ate them in the army and they are\nNot that bad. Too bad I sold all my boxes. They actually have a lot of nutrients. Not barely keep you alive. But if I can get my hands on them I'd definitely eat them when out hunting or camping. I would stick with what I know",
                    "score": 1,
                    "author": "GeneralBlumpkin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The constipation is it’s own reward.",
            "score": 17,
            "author": "Oliveritaly",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've heard that so often, but in 16 years active and guard I don't know anyone who ever really experienced it.",
                    "score": 12,
                    "author": "Unicorn187"
                },
                {
                    "level": 1,
                    "comment": "Thats what the strawberry milkshake is for.",
                    "score": 10,
                    "author": "hawkmanly2023"
                },
                {
                    "level": 1,
                    "comment": "I've heard that so often, but in 16 years active and guard I don't know anyone who ever really experienced it.",
                    "score": 3,
                    "author": "Unicorn187"
                },
                {
                    "level": 1,
                    "comment": "That’s why you chew the gum that comes with it.",
                    "score": 5,
                    "author": "UnicornGlitterFart69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kind of an urban legend. If you're sensitive to the sweetener or chew a ton of it you'll have a problem, but two pieces won't affect anyone not sensitive to it. \nThinkmkf the famous Amazon review of the sugar free Gummi bears.",
                            "score": 3,
                            "author": "Unicorn187"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "50-100 for a case",
            "score": 5,
            "author": "Moonlit_Hearth"
        },
        {
            "level": 0,
            "comment": "Going rate after shipping is about 12.50 per meal. 1st inspection date Nov or Dec 2023 \n\n\nhttps://mremountain.com/products/usa-mre-inspection-date-2022-full-case-of-12?variant=32712083669078\n\nThese are cleaner with a better tti than most bases and certainly better than any army navy",
            "score": 2,
            "author": "wats6831",
            "replies": [
                {
                    "level": 1,
                    "comment": "Second for MREmountain... and here in the EU, they have av variety of other countries' rations. \n\nFrench is delicious, Italian is out of this world but difficult to come by.",
                    "score": 0,
                    "author": "tomtermite"
                }
            ]
        },
        {
            "level": 0,
            "comment": "if you're really interested in MREs, get the French, Estonian, Spanish, or Polish ones.  sometimes Russian, depends on the menu\n\nAmerican MREs are kind of trash",
            "score": 2,
            "author": "CapsaicinFluid"
        },
        {
            "level": 0,
            "comment": "By far the cheapest you can get is cases of humanitarian daily rations on ebay. They come 10 to a case and are less than $50 per case, and each MRE has 2 mains and is meant to last an adult for 1 day. Downsides are they don't have many menu choices and they aren't particularly appetizing. Also vegetarian,halal,kosher etc",
            "score": 2,
            "author": "Dylan5546"
        },
        {
            "level": 0,
            "comment": "Join the National guard, they’re giving them away!",
            "score": 2,
            "author": "LoosieLawless"
        },
        {
            "level": 0,
            "comment": "Why would you even want that trash. I have like 7 cases you can straight up have. The commercial alternatives are so much better.\n\nSource: 9 years in the Marines Corps",
            "score": 9,
            "author": "Accidental-Genius",
            "replies": [
                {
                    "level": 1,
                    "comment": "Downvotes for an opinion based on first hand experience? Sounds like Reddit",
                    "score": 6,
                    "author": "RockyMountainSup"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Several of the Canadian IMPs are very good but they are extremely difficult to find retail.  One of the very oddest things is that unlike America the process of the Canadian public obtaining the their equivalent is almost impossible, which is a shame as I would have to think it would both improve manufacturing economy of sale and the IMPs are mostly extremely good and edible.",
            "score": 2,
            "author": "CaptainSur"
        },
        {
            "level": 0,
            "comment": "I buy ReadyWise from Costco. It only costs $60.00 for a case and has 128 servings. It comes with meals, beverages, fruits, and desserts.",
            "score": 1,
            "author": "Herbiethelovebug",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've never seen it for that price! Is this in store or online?  On sale or regular price?  Maybe I'm missing something....",
                    "score": 3,
                    "author": "dratdrat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was $60 in store at my Costco. Looks like it's $100 online. I have bought 4 of them this year.",
                            "score": 2,
                            "author": "Herbiethelovebug",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People really should take a look at the nutritional information on those bucket deals. They are like life raft rations - they will keep you alive but you won't enjoy the experience one bit. Heavy on cheap ingredients like rice and oatmeal, that you can source cheaper elsewhere.\n\nNow look at the \"serving size\" and divide by how many calories you expect to eat in a day. An adult on the move uses around 3000 calories. Some of those bucket deals (\"100 days worth of food in one bucket for $50\") are giving you 800 calories per day. That's not even starvation rations.\n\nCaveat emptor. Most of those are not great.",
                                    "score": 2,
                                    "author": "bananapeel"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unless it’s for a BOB, you don’t really need portable food. Stock up rice and beans; they’ll last indefinitely under the right conditions. And canned food doesn’t even have to be cooked to eat. \n\nThe brands that sell the camping food produce things that will travel well and be much more palatable than MREs.",
            "score": 3,
            "author": "Telemere125"
        },
        {
            "level": 0,
            "comment": "You can look into freeze drying your own foods. My folks just invested in a harvest time freeze dryer… they went in on it with a few different people because it’s about $3k, but now running it costs about $3 in electricity every time they use it, and the food lasts for 25 years. They keep it running and have food constantly being freeze dried. Definitely not a cheap option, but if you find some other people who are interested in investing together, this is the best way to store food for a long time without losing nutrients or having to heat up water.",
            "score": 1,
            "author": "Wificrusin"
        },
        {
            "level": 0,
            "comment": "The best deal would be not to buy. I ate them for 7 years. I wouldn't pay a single  cent for them. There's a reason  why we called them Meals Rejected by Ethiopians.",
            "score": 1,
            "author": "popasean"
        },
        {
            "level": 0,
            "comment": "https://armynavyoutdoors.com/mre-emergency-food/\n\nThis is a good site. Free shipping on orders over $99. A few months back I snagged 30 days worth of food (2000 cal/day) for like $150 including tax and shipping. Just watch for sales or get what they have now. I got the Humanitarian Daily Rations. They actually say “food gift from the United States” on them. Supplies might be lower now due to needing them for Ukraine and other conflicts.",
            "score": 1,
            "author": "jsm1095",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh god, those humanitarian rations are brutal. We had to eat em after a bad hurricane here. Enough hot sauce would get them edible, but they were nasty.",
                    "score": 2,
                    "author": "HeresYourHeart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ehhh I didn’t mind them too much, it’s supposed to be bland so it’s not offensive to most peoples pallets. But it’s def not as tasty as mountain house. But it’s also like 10x cheaper and doesn’t require any prep. I’d rather have a month of food that doesn’t need cooking than 4 days of freeze dried food that tastes better but needs me to use my rationed water to cook/hydrate. \n\nMilitary MRE’s are actually pretty dank and have that heat packet but they’re twice as expensive at least. \n\nI have some freeze dried food but that’s my long term if I really need to dip into food. Also have access to a freeze dryer to make my own bags of chili, soup, and meat. Rotisserie chickens from Costco are great for it! Get urself a bunch of seasoning, rice and beans and freeze dried chicken and you can have a party, just don’t forget copious water preps/filtration.",
                            "score": 1,
                            "author": "jsm1095"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a winco here that sells the heater bags and make my own with those ready to heat meals like the pastas, ramen, other bagged ready to eat/heat foods. So much cheaper.",
            "score": 1,
            "author": "deoxy75"
        },
        {
            "level": 0,
            "comment": "If you have a surplus store, check there. On base, they're typically about $12 each, with no discount for bulk. I've seen them at surplus stores for anywhere from $8-$20, and you can check Amazon as well.\n\nOccasionally someone will bring them to gun shows. A friend bought a case at a show for a ridiculously small amount, but some of them were expired due to poor storage practice. So that's more of a gamble.",
            "score": 1,
            "author": "Tanstaafl2415"
        },
        {
            "level": 0,
            "comment": "Amazon has the real deal for 100$ for 12.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Mmmmm. MRE’s…with rice that crunches",
            "score": 1,
            "author": "smokechecktim"
        },
        {
            "level": 0,
            "comment": "Keep an eye on r/preppersales they find deals on this kind of stuff",
            "score": 1,
            "author": "Web_Trauma",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! 🙂",
                    "score": 1,
                    "author": "joeyfuture"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They go on sale at Swiss Link Military Surplus sometimes -- I've seen $99 for a case of 12.",
            "score": 1,
            "author": "nullus_72"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "They expire every 5 years at normal room temp storage",
            "score": 1,
            "author": "sardoodledom_autism"
        },
        {
            "level": 0,
            "comment": "You can get a case of 10 US humanitarian meals on Amazon right now for 50 bucks. They are essentially the same as the MREs without the ration heaters or condiments, but each meal is over 2,000 calories. They are only about 3 years old too, so a heck of a deal",
            "score": 1,
            "author": "redditlike5times"
        },
        {
            "level": 0,
            "comment": "Good supplies already mentioned.\nBut if your stocking up on food, unless your the US government which is fine paying the prices because the supply chain is more important. Don’t stock up on them.\n\nSure, you will get your vitamins &amp; calories 100%. But if you research what the body needs, you’ll be able do it your self with canned goods for cheaper.",
            "score": 1,
            "author": "Apprehensive-End6219"
        },
        {
            "level": 0,
            "comment": "Date a wildland firefighter.",
            "score": 1,
            "author": "nooneofconsequence90"
        },
        {
            "level": 0,
            "comment": "As an owner of the beat deal on mres... don't.",
            "score": 1,
            "author": "reddit_eats_tidepods"
        },
        {
            "level": 0,
            "comment": "Any one you walk away from lol. You clearly haven't eaten many of them XD",
            "score": 1,
            "author": "Wishful_Thinking826"
        }
    ]
}