{
    "id": "13qq9dy",
    "score": 7,
    "title": "First aid kit recommendations",
    "author": "shrub-queen",
    "date": 1684945551.0,
    "url": "https://www.reddit.com/r/Survival/comments/13qq9dy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all - I'm not a regular in this sub but I'm hoping some of you will have recommendations that can help! \n\nI have WFA training, and I'm going through my first aid kit - appropriate for a few days of backpacking. I backpack with my older parents and lead younger inexperienced college students. \n\n1. I just threw out tons of expired OTC meds and I don't want to buy full bottles of \"just in case\" meds. What's the best place to buy individually packaged doses? I have a relatively new first aid kit and all the meds expired within ~1 year of buying it. \n\n2. What's the recommended non-aspirin, over the counter heart attack medication?\n\n3. I have a tourniquet and a Sam splint. Is there anything else you carry that's not in a \"typical\" weekender wilderness first aid kit that you've found helpful? \n\n4. I don't have any experience calling emergency services from a wilderness area. What's the best/most efficient way to report your location when you call? Lat/long? If I have cell service and im just calling 911 (I'm in the US) I've heard they aren't always great with lat/long coordinates. If I call from a sat phone (which I'll definitely be getting for future outings) who does the call go to? \n\n5. Last, friends used to rent sat phones from REI but it sounds like they don't necessarily do that anymore. Any recs for a broke grad student?",
    "comments": [
        {
            "level": 0,
            "comment": "1- your pharmacy might be able to blister pack for you, there may be a few\n2- ASA is THE medication, nitro is another but not OTC\n3- nail clippers. Best tool in the world for removing splinters\n4- whatthreewords is an excellent app for reporting location. Lat/long is another good reporting method, or MGRS if your GPS allows for it. If you're in the US, you'll likely be in a national park or something similar. Before you set out, check with the local ranger or Sherrif station about how they want to receive information\n5- same as above. There aren't a lot of places now that cellphones don't cover. A battery pack and a solar charger will get you FAR into the wilderness",
            "score": 2,
            "author": "hereigoawandering",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn't know pharmacies would do that! Thank you!",
                    "score": 1,
                    "author": "shrub-queen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some do. Some offer it as a free service, others paid, but it's an option",
                            "score": 1,
                            "author": "hereigoawandering"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The best place I've found for individual packs is either a dollar store or liquor / convenience store.\n\nThe satphone call goes to whoever you call.  A better choice might be a Reach or similar device.",
            "score": 1,
            "author": "Doc_Hank"
        },
        {
            "level": 0,
            "comment": "Since I think 2011 all cell phones send location data to 911, it's accurate to within ~30 meters for phones with GPS, and within a few hundred yards for those without (not many of those anymore).\n\nThe iPhone 14 has emergency satellite messaging capabilities, if you have one or can upgrade look into it as that's the cheapest. Next to that is a rescue beacon, which start at about $300, but if you ever need it it's worth it's weight in gold.\n\nWhy no aspirin? For a heart attack there is nothing that comes close that you can get without a script and even then some of those require special handling. Aspirin is a wonder drug for heat attacks.\n\nSingle dose meds are kinda all over the place. I just buy small bottles of regular stuff and change it out every few years. \n\nIf you dig into medicinal expiry dates, most common household meds are still [some level of usable](https://www.livescience.com/65052-why-do-medicines-have-expiration-dates.html) generally for about ten years after the printed expiration just likely not as effective after about 5 (it varies per med, sometimes by a lot). There's not a lot of research on this that I'm aware of but I was told by a doctor who works with Doctors Without Borders that they often take large quantities of \"expired\" meds to places where there are none to be had generally.",
            "score": 1,
            "author": "Sandman0",
            "replies": [
                {
                    "level": 1,
                    "comment": "And I was told to carry an aspirin alternative because apparently aspirin allergies are becoming more common :/",
                    "score": 2,
                    "author": "shrub-queen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've not heard that about aspirin allergies, and unfortunately there aren't any good alternatives for aspirin when it comes to heart attacks (at least that I am aware of), especially outside the hospital/ambulance.",
                            "score": 2,
                            "author": "Sandman0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had no idea about the iPhone 14! That's rad. I'll definitely look into it!",
                    "score": 1,
                    "author": "shrub-queen"
                }
            ]
        }
    ]
}