{
    "id": "141mnkk",
    "score": 68,
    "title": "Good lined poncho?",
    "author": "warcand",
    "date": 1685987811.0,
    "url": "https://www.reddit.com/r/Survival/comments/141mnkk",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was wondering if anyone had any recommendations on a good lined poncho. \n\nI have been seeing some ads for some that seem like they may be cheaply made, but got me thinking about them.",
    "comments": [
        {
            "level": 0,
            "comment": "Helikon-Tex makes the swagman and poncho combo. I love mine. Super versatile",
            "score": 27,
            "author": "Nihil-011",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah, excellent. A bit pricey, but again if you have used one and are pleased that's great feedback. Thanks",
                    "score": 10,
                    "author": "warcand",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " No problem. I’ve used mine in all seasons the past three years. It’s warm enough to Ranger roll with a space blanket until winter comes. And is super comfy as an actual poncho",
                            "score": 5,
                            "author": "Nihil-011"
                        },
                        {
                            "level": 2,
                            "comment": "Swagman basic is cheaper",
                            "score": 1,
                            "author": "RenThraysk"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Came here to say this.",
                    "score": 3,
                    "author": "Lunker42"
                },
                {
                    "level": 1,
                    "comment": "Do you know how the half the price knockoff is? I think its a thermarest Honcho Poncho. I was hesitant but eventually need to get something. \n            \nAm I better off getting a poncho that will fit over me with a backpack on or should I get a backpack cover and then wear that? Im worried about the straps damaging a poncho.",
                    "score": 1,
                    "author": "WhittlingDan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wear my ponchos over my pack, when I’m using my day pack. If I’m doing longer trips I have a 55 liter bag that I put a cover on. I haven’t noticed any extra wear with the poncho under the straps. \n\nI have no experience with the thermarest, however I do have a few thermarest products which are great, so it’s likely a good choice.",
                            "score": 1,
                            "author": "Nihil-011"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most ponchos tend to get very sweaty on account of them not being breathable. This goes double if you're wearing a backpack over it.\n\nUnless you have a very good reason, I would consider getting a normal poncho (and, if you want to fit a backpack under it, get a big one) and a poncho liner separate. Wilderness Innovation AFAIK makes the best out there.",
            "score": 14,
            "author": "Ketherkenosis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just to say, it’s best to wear a poncho _over_ a pack to maximise ventilation. That’s the poncho’s key advantage over a waterproof jacket.",
                    "score": 17,
                    "author": "carlbernsen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes. A problem is that it's rare to find ponchos meant to do this.\n\nThe Packa is one. Wilderness Innovation is another. Others are pretty rare, especially if the pack is big.",
                            "score": 0,
                            "author": "Ketherkenosis"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I asked this elsewhere but you touched upon it so I'll ask you here.\n              \nAm I better off getting a poncho that will fit over me with a backpack on or should I get a backpack cover and then wear that? Im worried about the straps damaging a poncho.\n              \nAny recommendations on a rip stop poncho preferably under $50 but definitely under $100?",
                    "score": 1,
                    "author": "WhittlingDan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Much better to get a poncho that covers the backpack than a separate cover. If you put a backpack over a poncho, it's going to be sweaty, so much so that you might think your poncho is letting rain in.\n\nI'm not aware of any ponchos that would fit the bill under a hundred bucks, sorry.",
                            "score": 1,
                            "author": "Ketherkenosis"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just get a surplus USGI one from a surplus store, usually pretty, great quality and I always keep one as BII for each vehicle.",
            "score": 5,
            "author": "Middle-Profile8244"
        },
        {
            "level": 0,
            "comment": "Ah the good old days of the stinky military Vietnam era pancho!",
            "score": 2,
            "author": "whorton59"
        },
        {
            "level": 0,
            "comment": "Sears, definitely a Sears Poncho.",
            "score": 3,
            "author": "xabit1010",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wrap a newspaper around my head, as well.",
                    "score": 3,
                    "author": "ClownShoeNinja",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I used to use a plastic grocery bag on my head when I had long hair and rode a 50cc scooter. My poncho was Blue. The grocery bag was white. I thought nothing of it until the guys at work saw me before taking it off. They said I looked like a Smurf and by the next day everyone in the kitchen was calling me smurf, which annoyed me a little bit until the ladies in front turned it into papa Smurf which soon became just Papa. I was in my late thirties.",
                            "score": 3,
                            "author": "WhittlingDan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So you loved it when they called you big papa?\n\nNot a Frank Zappa song, but still a B. I. G. play. The judges love it! \n\nUpvote for you, daddy smurf!",
                                    "score": 2,
                                    "author": "ClownShoeNinja"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh yes! So id look like I was Deep! If you know, you know! #frankzappa",
                            "score": 1,
                            "author": "xabit1010"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Check wiggys. They make top quality stuff",
            "score": 1,
            "author": "Busy-Town-6348"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought you were serious at first lol",
                    "score": 1,
                    "author": "KLR01001"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you looking for waterproof or insulation?\n\nThe military makes a poncho that snaps together along one edge. That also can have a poncho liner tied into it using the eyelet’s. Good light weight sleeping bag and you can take the liner out to have a rain poncho.\n\nMilitary Poncho Liner Woobie Blanket Nylon https://a.co/d/4Hre3eV\n\nUSGI Industries Military Style Poncho Multi Use Rip Stop Camouflage Rain Poncho https://a.co/d/fIixs4X",
            "score": 1,
            "author": "Ok_Path_9151"
        },
        {
            "level": 0,
            "comment": "got mine from outback trading and it's fantastic. highly recommend their stuff, well made and durable",
            "score": 1,
            "author": "officialnzbm"
        },
        {
            "level": 0,
            "comment": "Insulated Sarma TST Thermal cloak or Jerven Fjellduken Hunter would be my end game.",
            "score": 1,
            "author": "Think_Cat7703"
        },
        {
            "level": 0,
            "comment": "I love my gatewood cape. In addition to being a rain poncho, it's also a tent and pack cover. You could pair it with a wearable down blanket.",
            "score": 1,
            "author": "OccularPapercut"
        },
        {
            "level": 0,
            "comment": "The Snugpack Enhanced Patrol Poncho and liner are a good option. Not as well made as the Helikon but much less expensive. My only problem with it until I lost the poncho, stupid forest green, was the arms are a bit short. Still better arm coverage than traditional ponchos.",
            "score": 1,
            "author": "kdubtrx"
        },
        {
            "level": 0,
            "comment": "Sounds terrible.  Why not just a poncho over the coat you’ll already have on?",
            "score": 1,
            "author": "FuckChipman1776"
        },
        {
            "level": 0,
            "comment": "In Vietnam, I used the standard issued poncho, poncho liner, and jungle sweater to stay warm on cold nights, and it worked like a champ.\n\nLater, I bought a hammock made from a parachute panel by a Vietnamese woman.\nI'd secure the hammock between 2 trees, then run a piece of paracord over the hammock and use the poncho as a tent.\n\nWhile I was occasionally accused of making myself an easy target, once in the hammock with my rucksack and M16, the poncho was about a foot above my face and my butt was only about 6\" above the ground.",
            "score": 1,
            "author": "Old_Fossil_MKE"
        },
        {
            "level": 0,
            "comment": "2-part ponchos work better - let you use the poncho as a rain shelter / tarp while still wrapping up in the liner to stay warm.\n\nHands down the best poncho liner I have ever used is a Wiggy’s liner.",
            "score": 1,
            "author": "TacTurtle"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -12,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean a  poncho + insulated poncho liner is USGI standard issue, and in its various forms an insulated poncho has been standard outerwear for travelers since humans started making clothes because they work well. Keeps you warm and dry, and can also be used as a tarp/bedroll etc.\n\nBut I get what you mean, the liner and the waterproof layer absolutely need to be separate pieces.",
                    "score": 10,
                    "author": "TriangleOfDiscovery",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I literally made a similar comment about a USGI poncho lol why try and reinvent the wheel on that.",
                            "score": 1,
                            "author": "Middle-Profile8244"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok bub, you’re not Logan and this isn’t a Marvel movie, if you don’t like the content, then hmmm let me guess make the community better or stfu and unfollow, real complicated genius",
                                    "score": 8,
                                    "author": "Middle-Profile8244",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -8,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hmmm, maybe because you’re being a condescending jerk to someone in the subreddit asking a serious question, I think your aggro should have another outlet",
                                                    "score": 7,
                                                    "author": "Middle-Profile8244",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": -8,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Which is funny because it’s obvious you’re deflecting, but I’d guess you don’t what that means, gl with that troll",
                                                                    "score": 4,
                                                                    "author": "Middle-Profile8244",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 0,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Lol, no instant reply that time, you had to look up deflection which explains everything, you’ve already jumped the shark and launched into ad hominem attacks aka your an idiot, so do everyone a favor and shut up",
                                                                                    "score": 4,
                                                                                    "author": "Middle-Profile8244",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You're being the rude asshole here.\n             \nYou probably think the world is full of assholes. If you tend to run into assholes everywhere perhaps the common denominator is you?",
                                                                    "score": 3,
                                                                    "author": "WhittlingDan",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The fact that you ride a 50cc scooter says it all. Your global overlords approve with you along with being vegan and eating bugs.",
                                                                            "score": 1,
                                                                            "author": "Middle-Profile8244"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}