{
    "id": "5qobfw",
    "score": 1883,
    "title": "Just bought all 4 at a garage sale for a quarter. They were all published in 1969.",
    "author": "[deleted]",
    "date": 1485620300.0,
    "url": "https://www.reddit.com/r/Survival/comments/5qobfw",
    "media_urls": [
        "https://i.reddituploads.com/a6b3f69ab0c34e96b532fe526048257e?fit=max&amp;h=1536&amp;w=1536&amp;s=c38df465aacc4fc2c0d8c3a00921a342"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "They are probably out of copyright you could probably be able to scan them and offer them out to the group. Materials published before 1978 have a 28 year protection unless renewed, else they fall into public domain. Check with the US copyright office to see if they renewed.\n\n I know for one I'd love a copy. ",
            "score": 130,
            "author": "Any0nymouse",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Renewal was made automatic in 1992 for all works after 1963.](https://en.wikipedia.org/wiki/Copyright_Renewal_Act_of_1992)",
                    "score": 48,
                    "author": "sclereids"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That only comes in after 1978 when the laws changed, before 78 it was 28 with ability to renew. So if they didn't renew it's possible that it dropped into public domain. you have to check with the US copyright office to see if they were renewed though.",
                            "score": 16,
                            "author": "Any0nymouse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The way it should be\n\n",
                                    "score": 5,
                                    "author": "maxillo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But never will be again",
                                            "score": 4,
                                            "author": "Blinkskij",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Only until the collapse. Then anything is possible. \n",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "under current copyright law, refer to section 301 which stated content before 1978 you must refer to circular 92, section 106 which stated fair usage laws, that allow copying as long as there is no financial gain (i.e. free copies) as long as they have not renewed the copyright to prevent it from falling into public domain. but I'm no lawyer, so check with the copyright office first. but then you can hand out copies as long as they are free...",
                            "score": 5,
                            "author": "Any0nymouse"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow I came in for a survival guide and found a lesson on copyright law. Not that I'm complaining. Need to survival tips against those shark lawyers.",
                    "score": 8,
                    "author": "shdhfsnbdjdndb"
                },
                {
                    "level": 1,
                    "comment": "I'll see what I can find and make a digital copy of them if I find out it's ok.",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well?",
                            "score": 2,
                            "author": "wtcc16",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can't confirm I wouldn't be violating some copywrite law.",
                                    "score": 4,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Please do this! Would love to get a peek inside those.",
                    "score": 5,
                    "author": "Notleontrotsky"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man, those edible plants volumes are going to be outdated. Nature 2.01 changed the plant api to set all plants to edible by default. You no longer have to specify the edibility in your request. ",
            "score": 137,
            "author": "kublaiprawn",
            "replies": [
                {
                    "level": 1,
                    "comment": "So glad nature has a RESTful interface now",
                    "score": 16,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "/r/outside is leaking ",
                    "score": 45,
                    "author": "clr257"
                },
                {
                    "level": 1,
                    "comment": "Many botanical names will be wrong/different in these old guides.",
                    "score": 19,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would highly recommend not relying solely on these books if youre planning on doing soem kind of mccandleless thing or something. The medical first aid is certainly out of date, and there may be more modern ideas that will help you survive. Plants should be alright though. \n\nAwesome find and probably cool just to read, but be careful especially with the medical one. ",
            "score": 30,
            "author": "5HINY5HEEP",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"For compound fractures rub some dirt into the wound, then smoke a cigarette.\"",
                    "score": 52,
                    "author": "stanfan114",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You left out the bit about having a drink. ",
                            "score": 10,
                            "author": "ryanmercer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And walking it off",
                                    "score": 9,
                                    "author": "tytycoon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Got to balance the humours.",
                                            "score": 1,
                                            "author": "rogerthelodger"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "that's in the preface",
                                    "score": 1,
                                    "author": "Nick-A-Brick"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, but look at the condition, those will make some really cool decorations",
                    "score": 4,
                    "author": "BeanTacos"
                },
                {
                    "level": 1,
                    "comment": "So ugh what would be out of date about first aid?",
                    "score": 1,
                    "author": "Bigredone424",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably things like imobalization, treating blood loss, how to deal with anaphylactic reactions.  Im not sure, I haven't read the book to be able to say whats out of date, I'm just advising that they check out modern stuff as well before trying things. On the bright side i bet the books have great examples of splints and stretchers.  ",
                            "score": 3,
                            "author": "5HINY5HEEP",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I doubt that there's anything completely wrong in that book. One of my friend's dad is a retired doctor, a while back I noticed he had some very old books about physiology etc. lying around (~1960) and we talked about them for a bit. He basically said most of the old stuff is still very much relevant, if anything it's rather small details that have changed. So I think that sure, modern treatments may be a *tad* more effective or safe, but in general that book is probably gonna be good enough. Nothing in there that's gonna kill you.",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My personal recommendation is that if you want to get really into foraging then you need to pick up the three books that I consider the foragers holy books:\n\n[Wild Edible Plants](https://www.amazon.com/Edible-Wild-Plants-Foods-Adventure/dp/1423601505/ref=sr_1_2?ie=UTF8&amp;qid=1485636063&amp;sr=8-2&amp;keywords=wild+edible+plants) by John Kallas\n\n[The Foragers Harvest](https://www.amazon.com/Foragers-Harvest-Identifying-Harvesting-Preparing/dp/0976626608/ref=sr_1_3?ie=UTF8&amp;qid=1485636126&amp;sr=8-3&amp;keywords=samuel+thayer) and [Nature's Garden](https://www.amazon.com/Natures-Garden-Identifying-Harvesting-Preparing/dp/0976626616/ref=sr_1_1?ie=UTF8&amp;qid=1485636126&amp;sr=8-1&amp;keywords=samuel+thayer) by Samuel Thayer\n\nBoth of these books focus on North American foraging (but I assume that's OK with you considering that your books are US based). \n\nI believe that John Kallas is from Oregon and as such many plants are based around that area and just generally west of the Mississippi. I have been able to find some of the plants that he listed in the book (I am from SE part of US), but some are not native/introduced so I will never find them while walking around.\n\nSamuel Thayer is from Michigan area if I remember correctly and so his books focus on my side of the country. His two books are identical in style, but Nature's Garden was written after and contains more plants in number compared to his first. They are both fantastic resources to own.\n\nThe reason I prefer these three books is because they do not skip important information and contain many pictures, harvest date ranges, look-alike information, recipes/procedures, and a lot more. These books go out of their way to make sure you forage confidently and with plenty of information. \n\nIf you want to get into this hobby, as I have too recently, now is the perfect time to pick up these books and start getting familiar with plants because spring is right around the corner.\n\nHope this helped and good luck!\n\nedit: grammar",
            "score": 7,
            "author": "thegamesensei",
            "replies": [
                {
                    "level": 1,
                    "comment": "In Texas. Spring started some time about two weeks ago. ",
                    "score": 3,
                    "author": "Otistetrax"
                },
                {
                    "level": 1,
                    "comment": "Any suggestion for Europe?",
                    "score": 1,
                    "author": "amrakkarma",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm really sorry, but I have no experience with European foraging as I only recently began learning about local flora myself. I do know that these books list a few edibles that were introduced from Europe such as Dandelions (*Taraxacum officinale*), Chickweed (*Stellaria media*), Lamb's Quarters (*Chenopodium album*), Bitter Dock (*Rumex obtusifolius*), Oxeye Daisy (*Leucanthemum vulgare*), and Garlic Mustard (*Alliaria petiolata*). \n\nThose are some that I know of from the books I listed as well as a few more I found online. Dandelion, Chickweed, and Lamb's Quarters are personally some of my favorite foraged foods I have been able to experience so far. I have no personal experience with any of the others, but I figured it might help you get started somewhere. \n\nI would recommend that you try to get a taste for foraging by learning to ID the first 3 plants I listed and researching their edible parts and how to prepare them (Chickweed and Lambsquarters require no preparation, they are good salad greens). \n\nIf you enjoy those plants then ask around online (try r/foraging or r/foraginguk) for more resources in your area. Also, try out mushroom hunting if you can. I've heard there is a strong tradition of mushroom hunting in Europe (especially Eastern Europe) so I am sure there are likely many books on the topic for your area.\n\nI hope that helped! Let me know if you have any more questions or anything.  ",
                            "score": 3,
                            "author": "thegamesensei",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thanks!",
                                    "score": 2,
                                    "author": "amrakkarma"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a fantastic haul. You'll be able to eat at least two book s a week if you stretch it, adding a full half-month to your survival plans at least. ",
            "score": 7,
            "author": "ciabattabing16"
        },
        {
            "level": 0,
            "comment": "I'm jealous ",
            "score": 2,
            "author": "Kinganderson28"
        },
        {
            "level": 0,
            "comment": "Cool find dude. ",
            "score": 2,
            "author": "TheFonzDude"
        },
        {
            "level": 0,
            "comment": "What a steal!!",
            "score": 2,
            "author": "SkullOfAchilles"
        },
        {
            "level": 0,
            "comment": "Those would be cool to have for historical value alone.",
            "score": 2,
            "author": "xanxer"
        },
        {
            "level": 0,
            "comment": "I bought these when I was a kid; maybe 10 or 12.  Still have them.  But I paid more than a quarter!",
            "score": 2,
            "author": "rifleshooter"
        },
        {
            "level": 0,
            "comment": "Hey I have the same books! Or ones very similar. You're missing the one about poisonous plants, and mine have a sleeve that holds all 5 together. Mine are from 1974 though, so maybe the 5th book wasn't added until then",
            "score": 2,
            "author": "Greasypuss",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have the save 5 volume set.",
                    "score": 1,
                    "author": "redwalker"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Should be two more books. I have a set of six iirc. I will try and dig it out of my pack. ",
            "score": 2,
            "author": "thewoollybully"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Two of them can get you a coke, bro.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice score!",
            "score": 1,
            "author": "Everglot_Vantassle"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nobody will deny real books are better than epub but epub is far more convenient. I've got an entire library online that only cost me a few dollars.",
                    "score": 4,
                    "author": "toga-Blutarsky"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a set of these years ago.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Nice get",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Very cool books.\n\nBut I feel like some of this information has been updated over the past 45 years or so.\n\nI think these are best as collectible items, and a bit of interesting old info. ",
            "score": 1,
            "author": "thegumptiontrap",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really it depends. If you are going in with a zero technology will survive when SHTF mindset then these are gold.  Same reason the foxfire books are so popular. ",
                    "score": 1,
                    "author": "k7eric"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Back in those days you could prob drink out of the lake!",
            "score": 1,
            "author": "Potbrowniebender"
        },
        {
            "level": 0,
            "comment": "Those look awesome",
            "score": 1,
            "author": "guywhosaysyeah"
        },
        {
            "level": 0,
            "comment": "Nice find!",
            "score": 1,
            "author": "Tater450"
        },
        {
            "level": 0,
            "comment": "My dad had those!  I should go and find them.  I'm sure he still has them. ",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I have that set, used to use it for scout type outings, eating off the land for a couple days at a time.",
            "score": 1,
            "author": "A_Following_Sea"
        },
        {
            "level": 0,
            "comment": "Why is this the most upvoted item on the sub?  I don't get it.  It's neat but... of all time? ",
            "score": 1,
            "author": "slimyprincelimey"
        }
    ]
}