{
    "id": "frxs5v",
    "score": 1954,
    "title": "My first friction fire!",
    "author": "JCEssentials",
    "date": 1585597659.0,
    "url": "https://www.reddit.com/r/Survival/comments/frxs5v",
    "media_urls": [
        "https://v.redd.it/3na06y5s1vp41"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Congrats the first is a bitch..... so is the second.... so is almost every time but it does get slightly easier 😂😂 but again congrats it’s not something many people can do",
            "score": 160,
            "author": "sinlesspainter"
        },
        {
            "level": 0,
            "comment": "Awesome!! But shit you had me nervous with how long you were spending on the cone of kindling lol. I was like dude hurry it's gonna go out!",
            "score": 130,
            "author": "wildstolo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed.  The drama was intense.  When OP decided for the third time to fold the cone the other way, I was thinking, \"dude, don't lose your ember.\"  Made for a fun watch.",
                    "score": 46,
                    "author": "Macktologist"
                },
                {
                    "level": 1,
                    "comment": "lol it did take me a bit, but you actually have a few minutes, especially if you have extra punk to add. i was definitely nervous, too! this was my third try today, after i failed to blow the cone the other two times, so I really wanted to get this cone perfect. somehow lucked into not having to blow this cone at all.",
                    "score": 19,
                    "author": "JCEssentials"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck ye bud!",
            "score": 59,
            "author": "torontorebel",
            "replies": [
                {
                    "level": 1,
                    "comment": "For all the Canadians out there",
                    "score": 51,
                    "author": "JCEssentials",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sick job man. Are you Canadian? What woods were that you were in?",
                            "score": 1,
                            "author": "GiantSequoiaTree",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks! Nope, upstate New Yorker living in Vermont now. This is in Green Mountain National Forest!",
                                    "score": 5,
                                    "author": "JCEssentials"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fucken' eh rights bud",
                    "score": 11,
                    "author": "durose0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My first and last took me 8 hours. I just decided that if I ended up in the wild without flint or a lighter that I will die...I’m ok with that logic",
            "score": 24,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Always keep a couple bics around. Would rather have one just in case. And it'd take the guesswork out of it for me. \n\nHowever, this skill is wild and amazing. Both are great.",
                    "score": 7,
                    "author": "orlicker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "After reading enough comments about how difficult this sounds I bought a ten pack of Bics. My wife thought I was nuts. Packed them into every backpack, glove compartment, etc. hoping I'll never need them.",
                            "score": 8,
                            "author": "LowerChallenge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's exactly right. But I'd rather have it and not need it than need it and not have it. And bics are BIFL for sure haha",
                                    "score": 2,
                                    "author": "orlicker"
                                },
                                {
                                    "level": 3,
                                    "comment": "Get a hacksaw blade and break it into thirds. Scrape the paint off the back (smooth side) of the blade. The ends with the hole fit the key ring nicely. Use a sharp flint, quartz or chert rock and practice making sparks. Afterwards use char cloth on top of the rock and get sparks to fall on the cloth, igniting it. It will glow red.\n\nPut this into a tinder bundle and blow it into flame. Practice repeatedly.\n\nYou have now learned 50% of the process. Next get a bow drill set and a hand drill set. Once you get a coal the rest you already know.\n\nGo easy at first and make a lot of low speed dust. Then go harder at higher speed and get smoke. You will have the coal shortly.\n\nThe more you practice the easier it will become. Then experiment with different kinds of wood. Enjoy the journey and keep your Bic dry.",
                                    "score": 2,
                                    "author": "visionque"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It does get easier. I used to teach the skill to children as young as ten. There are lots of small details and finesses that can make it easier. At my peak of being an instructor I got a “septacrown” which is seven embers burning at once. Also did a blindfolded, non-dominant, wet set challenge. I don’t say this to brag, just to demonstrate how much of bow drilling is muscle memory and how once it clicks for you it becomes quite easy. And once you’ve learned to do it well it’s a really hard skill to lose.",
                    "score": 3,
                    "author": "GuruBushHippie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well done! Is that in fact a flat piece of rock you're using as a handblock?",
            "score": 13,
            "author": "Eindkaas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! It's a piece of schist with a notch drilled in with quartz rock. Easy to make, serves as a super consistent handblock with (I imagine) less friction than wood.",
                    "score": 22,
                    "author": "JCEssentials",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Easy to make you say? I've got to try this! Got any tips in advance as to the shape of the notch in the rock? And any special way you finish the spindle top that connects to it?",
                            "score": 4,
                            "author": "Eindkaas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://m.imgur.com/a/KwyEySl\nThis is my top rock and spindle",
                                    "score": 7,
                                    "author": "JCEssentials",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks so much! Gonna keep an eye out during dog walks for a suitable rock. Cheers!",
                                            "score": 4,
                                            "author": "Eindkaas"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Did you go to/ work at a wilderness program? The top rock is still not that widely known about.",
                                            "score": 1,
                                            "author": "GuruBushHippie",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I work at one!",
                                                    "score": 1,
                                                    "author": "JCEssentials",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Haha nice! I worked at a program in western NC for several years.",
                                                            "score": 1,
                                                            "author": "GuruBushHippie",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh great! Interesting how the top rock seems to be most widely used in these programs. I haven't come across anyone using a toprock online before",
                                                                    "score": 1,
                                                                    "author": "JCEssentials",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "They just last longer. Constantly finding top blocks for ten people would get old really fast.",
                                                                            "score": 1,
                                                                            "author": "GuruBushHippie",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Oh that does make sense!",
                                                                                    "score": 1,
                                                                                    "author": "JCEssentials"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s great! But maybe next time clear the surrounding area of loose brush and dead leaves.",
            "score": 41,
            "author": "wanderingvagrant42",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fair comment. Everything is soaked right through, so I'm not concerned about accidental fire. But I hear you and definitely will be more aware of this in the future!",
                    "score": 45,
                    "author": "JCEssentials"
                },
                {
                    "level": 1,
                    "comment": "Normally I wouldn't make this comment because people are often super over aggressive about it.\n\nBut in this case... dude there is leaf litter and underbrush EVERYWHERE. Get a clear area to work, lol. Running around with the cone of flame was unfortunate.",
                    "score": 7,
                    "author": "gerbilshower",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hear you. Everything is super wet so not concerned about accidental fire but that's definitely a fair criticism. I had a leather on so no fear with holding the flame. Thank you for the comment!",
                            "score": 23,
                            "author": "JCEssentials",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For sure man I figured it was wet given your attire it looks chilly too. Congrats on the accomplishment.\n\nA lot of people on the sub will tear you a new one over it. Figured I'd love ya up! Haha\n\nEdit: ya the was supposed to say lube you up...realize now that isnt any better...lol",
                                    "score": 18,
                                    "author": "gerbilshower"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not to knock the accomplishment though. Really cool.",
                            "score": 9,
                            "author": "gerbilshower"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My dad made me video him trying to do this for a Survivor audition tape when I was 8... it took him nearly two and a half hours. \n\nGood work, dude.",
            "score": 7,
            "author": "dorkforshort"
        },
        {
            "level": 0,
            "comment": "proud of you!!",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Nice!",
            "score": 4,
            "author": "DMVboi",
            "replies": [
                {
                    "level": 1,
                    "comment": "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/nicespammer666` at **6984 nices**\n\n**2.** `u/AmishMuffin` at **5542 nices**\n\n**3.** `u/RepliesNice` at **4287 nices**\n\n**...**\n\n**31041.** `u/DMVboi` at **3 nices**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)",
                    "score": 3,
                    "author": "nice-scores"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome job! I’ve been trying on and off for years to be able to do this. Never had success. What kind of wood were you using?",
            "score": 3,
            "author": "jill-of-many-trades",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I used a red spruce spindle and a white pine fire board. The bow is from striped maple.\n\nFrom my limited experience (and from learning from many others recently), the most important thing is good materials. If the spindle and fireboard are solid and very dry, it will certainly happen with enough practice.  Once I knew I had good materials, it was about getting the mechanics down and creating a nice hole with a proper notch for the punk.",
                    "score": 5,
                    "author": "JCEssentials",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Solid as in a hardwood? And thanks for the tips! Dryness is definitely a challenge, I live in southern US and we get a lot of rainfall. \nThis might also be a dumb question, but did you get the wood via cutting off a branch or picking one up from the ground?",
                            "score": 2,
                            "author": "jill-of-many-trades",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sorry, I was using solid as in \"good.\" \n\nTo be clear, I collected the spindle and fire board weeks ago and have allowed it to dry. Ultimately, I'd like to learn to go into the woods with nothing a make a fire, but for now I'm here!\n\nThe spindle came from a dead but still standing spruce. Fire board is from a split piece of white pine.",
                                    "score": 4,
                                    "author": "JCEssentials"
                                },
                                {
                                    "level": 3,
                                    "comment": "The first time I saw it done, I asked the guy what wood it was. He didn’t tell me and said to try different woods out, experiment. I didn’t know much at the time so I used some kiln dried oak. I must have tried for months to get a coal but to no avail, not thinking about the different hardness and suitability of various wood types. I certainly have learned since then though :) I appreciate he didn’t tell me because it forced me to get curious and learn over time. \nThat being said, cedar, willow, and Basswood have been great here in the Oak Savannah of southern Ontario.",
                                    "score": 3,
                                    "author": "starsofalgonquin"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Exiting right at the end.",
            "score": 3,
            "author": "AuriumD"
        },
        {
            "level": 0,
            "comment": "I would love to see someone do this in the PNW in January. I have scoured the internet for years and can't find anyone being able to do this except in summer here.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "i'd like to see that, too!",
                    "score": 1,
                    "author": "JCEssentials"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats. My first came after nearly a month of trying. Now I can do one in under a minute (hand drill).",
            "score": 3,
            "author": "AaronGWebster",
            "replies": [
                {
                    "level": 1,
                    "comment": "i'd like to learn hand drilling eventually too!",
                    "score": 1,
                    "author": "JCEssentials"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get in there nice and deeplike",
            "score": 3,
            "author": "Elderchicken948"
        },
        {
            "level": 0,
            "comment": "Cool!  This is the kind of stuff I was hoping to see when I joined this sub!",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Man I haven't seen someone pull that off in years.  Great job! That is really hard to learn to do well.",
            "score": 3,
            "author": "primeathos"
        },
        {
            "level": 0,
            "comment": "Lol I thought you were going to take out a lighter and just light up the piece of wood",
            "score": 3,
            "author": "cqmille",
            "replies": [
                {
                    "level": 1,
                    "comment": "I honestly thought this too! When he pulled out the knife, I thought it was one of those long-barreled grill starters with the little trigger, and I had to look back up at the sub to check if it was in \"funny\" or \"unexpected\" lol. But great job OP!!",
                    "score": 2,
                    "author": "lainiezensane"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like your hat",
            "score": 2,
            "author": "CaballeroCrusader",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, 5 bucks at Walmart a few years ago... Still going strong lol",
                    "score": 2,
                    "author": "JCEssentials"
                }
            ]
        },
        {
            "level": 0,
            "comment": "On a side note what flannel is that? My Walmart one is starting to fall apart :(\n\nCongrats on the fire!",
            "score": 2,
            "author": "ZakaryLakota",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!\nIt's a Filson Mackinaw",
                    "score": 3,
                    "author": "JCEssentials"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's awesome! All of those years as a teenager pays off.",
            "score": 2,
            "author": "phooka"
        },
        {
            "level": 0,
            "comment": "I had a weird sensation when you pulled out the knife that you were going to stab the fire or something, lol.  Very cool though!  I was never able to get it to work when I was in scouts so big kudos to you!",
            "score": 2,
            "author": "blurryfacedfugue"
        },
        {
            "level": 0,
            "comment": "\"LOOK WHAT I HAVE CREATED!\" *punches chest* \"I! HAVE CREATED! FIRE! *waves burning branch in the air*",
            "score": 2,
            "author": "Dalcadan"
        },
        {
            "level": 0,
            "comment": "I love that little laugh of excitement when it catches flame. Really cool video!",
            "score": 2,
            "author": "Glantons_dog"
        },
        {
            "level": 0,
            "comment": "Sounds exactly like my washing machine",
            "score": 2,
            "author": "BYFS37"
        },
        {
            "level": 0,
            "comment": "This brought a smile to my face. Not the same, but I remember the first time I started a fire with flint and steel. Such satisfaction!!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Stay Strong",
            "score": 2,
            "author": "jbdb68"
        },
        {
            "level": 0,
            "comment": "For those of you interested in bow drilling, but don’t know where to start or you just can’t quite get it; I made an instructional video a year or two ago:\n\n[Part 1](https://youtu.be/OFPZPhCdkUs) Materials collection and setup\n\n[Part 2](https://youtu.be/ACS1-PKK0FM) Technique and ember \n\nAnd just for fun here’s me busting five coals in a row, all burning simultaneously [Pentacrown](https://youtu.be/60YKvkAFpPU)\n\nI’m really goofy, but I can bowdrill with the best of em.",
            "score": 2,
            "author": "GuruBushHippie"
        },
        {
            "level": 0,
            "comment": "Impressive! Congratulations. OP had me squirming in my seat with how cavalier he was in getting those shavings lit.\nObligatory safety note: clear the area of leaves and dead fall before setting up a fire. The world's had enough forest fires for awhile. Seriously, congratulations on the feat. It's got me wishing I was out in the bush this am.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I was trying to make the birch cone and birch tinder as neat as possible, because I had just failed to blow the cone into flames twice! Didn't even have to blow this one, through some grace of nature. \n\nAnd fair warning on the brush, I will definitely be considerate of that next time. It was raining and everything is damp from snow melt, but still I should be more careful about this. \n\nCheers!",
                    "score": 2,
                    "author": "JCEssentials"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's hard going but you seem to have nailed it pretty quickly. :)",
            "score": 2,
            "author": "CaughtMaple792"
        },
        {
            "level": 0,
            "comment": "First time I was able to use a bow drill to start a fire I was in our furnace room with a snapped off wooden spoon handle (cause finding straight sticks in your backyard is hard!) for a drill... Took me longer than this!\n\nI also immediately freaked out over the open flame in the house, and threw it into the furnace, but the coal was totally worth it!!\n\nCongrats! It's the only time I've done it, and I'm still convinced it's a really great skill to have... But as a smoker, having a good old Bravo 1 Charlie around is pretty indespensable.",
            "score": 2,
            "author": "Jam_E_Dodger"
        },
        {
            "level": 0,
            "comment": "damn i hope i can do this someday ! + the little \"hoo-HOO!\" at the end when you get it going is so endearing aw",
            "score": 2,
            "author": "softseraphic"
        },
        {
            "level": 0,
            "comment": "I was wondering where you were from. Then you spoke lol!",
            "score": 2,
            "author": "lhjmq"
        },
        {
            "level": 0,
            "comment": "Woo Hoo!",
            "score": 1,
            "author": "centeredsis"
        },
        {
            "level": 0,
            "comment": "is that a filson mackinaw haha",
            "score": 1,
            "author": "nhh311",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's Filson, I believe the Mackinaw, found it used at a gear store a few months back. I work in the woods and it's really the perfect jacket for being out there.",
                    "score": 3,
                    "author": "JCEssentials",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agree! I like mine too but havent had a chance yet to take it outdoors :(",
                            "score": 2,
                            "author": "nhh311",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love how rugged they are. I know it'll take a beating and be around for a long long time. A winter of everyday wear and it looks new, and I bought it used!",
                                    "score": 4,
                                    "author": "JCEssentials"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Curious if you happen to work for a youth treatment center doing work outdoors?",
                            "score": 1,
                            "author": "starsofalgonquin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i do actually! how'd you guess?",
                                    "score": 2,
                                    "author": "JCEssentials",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol, is it PRI?",
                                            "score": 1,
                                            "author": "starsofalgonquin"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Because the cone method of tinder bundle wrapping is something that I haven’t seen much of in my time but for some reason it became part of the woods culture at Pine River Institute. I never fully adopted it myself. \nBesides that, just a hunch :)",
                                            "score": 1,
                                            "author": "starsofalgonquin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "ahhh that makes sense. i work for a program in VT, not PRI. thanks for your comment!",
                                                    "score": 3,
                                                    "author": "JCEssentials",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ah, I thought I saw a comment that said you were Canadian. We here have a lot to learn from your wilderness programs. It can be thankless work for the most part but I have youth/clients from 7 years ago I still talk to. A little bit of nature based mentoring can change a life. If you haven’t come across it yet, check out the Art of Mentoring in Vermont. An incredible community of nature educators/mentors. Cheers to you and your work!",
                                                            "score": 1,
                                                            "author": "starsofalgonquin",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "that is really incredible. are you still doing wilderness therapeutics? i'm fairly new to the work myself; it is the most challenging and also most rewarding thing i've ever done. i will look more into the Art of Mentoring, it looks like a wonderful opportunity. thank you for reaching out!",
                                                                    "score": 3,
                                                                    "author": "JCEssentials",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Not so much wilderness based anymore, working as a social worker and therapist in the city of toronto, but incorporate so much of what I learned in the wilderness into my work. I try to take my clients into nature as much as possible. \nI am sure you will learn so much about yourself and about the strength and humor of the kids you work with. I can’t tell you how often friction fire making was the basis for my therapeutic relationship with clients, boys especially. \nThe Art of Mentoring (when it was held here in Ontario) changed my life. It’s a 5 day nature connection event that is held in different regions all around the world.  Truly, tremendous work. The community in Vermont is perhaps one of the most solid in the world when it comes to nature mentoring. A few of the main instructors there would come to Ontario and share their wisdom. You’ll meet lots of people who do the same work as you and rites of passage with youth. Check out the 8 Shields Institute and the book the Coyote’s Guide. The coyotes guide might have lots of ideas for you about how to continue to spark the curiosity of your clients and give you some amazing ideas for games and activities out in the bush. \nI’m very excited for you and the journey you’re on!\nKeep your knife sharp and your tinder dry! ;-)",
                                                                            "score": 2,
                                                                            "author": "starsofalgonquin",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "this has me so excited and motivated for my next shift! thank you so much for your kindness and guidance! best of luck to you!",
                                                                                    "score": 3,
                                                                                    "author": "JCEssentials",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well done!",
            "score": 1,
            "author": "Tiltedcrown83"
        },
        {
            "level": 0,
            "comment": "I heard bud and knew right away you’re Canadian!\n\nGreat video btw!",
            "score": 1,
            "author": "Lake_3242",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol! i live in VT so i've picked up some of them north country ways!",
                    "score": 1,
                    "author": "JCEssentials"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good job!",
            "score": 1,
            "author": "Wolfmaan01"
        },
        {
            "level": 0,
            "comment": "When you reached for your knife, I thought you had pulled out a lighter.",
            "score": 1,
            "author": "A_New_Dawn_Emerges",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol that's the real move right there",
                    "score": 1,
                    "author": "JCEssentials"
                },
                {
                    "level": 1,
                    "comment": "Back when I was a skills instructor for at risk teens I had a kid try and cheat his way to an ember using his glasses to igniter the punk. I told him I couldn’t count the ember, but I also didn’t bust him to his therapist because I felt it was excellent survival strategy and utilization of what he had on him.",
                    "score": 1,
                    "author": "GuruBushHippie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Vermont, US! Mostly hemlock, white pine, oak, paper birch in this forest",
                    "score": 3,
                    "author": "JCEssentials"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there a setup for this that uses something to stabilize the stick in the right hand?",
            "score": 1,
            "author": "Real_Working"
        },
        {
            "level": 0,
            "comment": "I’ve always wanted to learn how to do that but I can barely start a fire with gasoline so I don’t think that’s happening",
            "score": 1,
            "author": "NinjaMayhem6989"
        },
        {
            "level": 0,
            "comment": "How did you make the hearth board.",
            "score": 1,
            "author": "Harland0830",
            "replies": [
                {
                    "level": 1,
                    "comment": "Split a piece of white pine, let it dry, shape it how you want. I made these materials over a matter of weeks, not the day I busted the fire. Lotsa prep",
                    "score": 2,
                    "author": "JCEssentials"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats dude",
            "score": 1,
            "author": "Celestial_Requiem"
        },
        {
            "level": 0,
            "comment": "Can I make a guess that you’re a wilderness therapy guide?",
            "score": 1,
            "author": "ndelpino00",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am! How'd you know?",
                    "score": 1,
                    "author": "JCEssentials",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also a “woop woop!” For the coal!",
                            "score": 2,
                            "author": "ndelpino00"
                        },
                        {
                            "level": 2,
                            "comment": "The crazy creek and tinder bag! I’m going to assume at TN. Say hi to Ty and Evan for me!",
                            "score": 1,
                            "author": "ndelpino00",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nailed it! Lol! Will do, cheers!",
                                    "score": 1,
                                    "author": "JCEssentials"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, you make a friction fire look easy!",
            "score": 1,
            "author": "release_the_hounds_"
        },
        {
            "level": 0,
            "comment": "Nice work",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Congrats!",
            "score": 1,
            "author": "KotoriZip"
        },
        {
            "level": 0,
            "comment": "&gt;Birch Bark\nThat's fire-making on easy mode, don'tchaknow?",
            "score": 1,
            "author": "WeeklyImpact",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sure is bud, why make it hard em I right?",
                    "score": 1,
                    "author": "JCEssentials"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great work on the friction! At the end there though it looks like you’re sprinkling sawdust on the shavings. Having both sawdust and shavings with you (wonderful for starting a fire) is a bit unlikely in the wilderness....",
            "score": -3,
            "author": "sorgunner",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dry punk wood abounds in most forests",
                    "score": 2,
                    "author": "Bananamcpuffin"
                },
                {
                    "level": 1,
                    "comment": "Thanks!\nNo saw dust, just birch and the punk from bow drilling.",
                    "score": 2,
                    "author": "JCEssentials"
                },
                {
                    "level": 1,
                    "comment": "How is it unlikely? Maybe he shaved that sawdust and shavings while prepping the wood??\nEdit: Sarcasm",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}