{
    "id": "mv0oen",
    "score": 2342,
    "title": "Maple Syrup",
    "author": "Alarost",
    "date": 1618953492.0,
    "url": "https://www.reddit.com/r/Survival/comments/mv0oen",
    "media_urls": [
        "https://i.imgur.com/ZzWMufW.gifv"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Fun thing to do if you're homesteading...can't imagine this is too practical in survival situation though",
            "score": 126,
            "author": "theNomadicHacker42",
            "replies": [
                {
                    "level": 1,
                    "comment": "The sap is sterile and drinkable right out of the tree. At least useful to know what the trees can provide",
                    "score": 53,
                    "author": "bjorkhem"
                },
                {
                    "level": 1,
                    "comment": "Survival situation for canadians",
                    "score": 39,
                    "author": "aleqqqs"
                },
                {
                    "level": 1,
                    "comment": "Never know when you might have a bucket, hammer, nails and a maple tree ready",
                    "score": 72,
                    "author": "Alarost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha fair enough",
                            "score": 7,
                            "author": "theNomadicHacker42"
                        },
                        {
                            "level": 2,
                            "comment": "But, exactly WHICH maple tree? Also, how do you find them in February when you have to tap them?",
                            "score": 7,
                            "author": "jet_heller",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sugar maple. They’re not too hard to tell apart from red and silver maples—check the leaves on the ground and bark.  Most common in temperate forests in northeastern North America. Many deciduous trees can be tapped for sap, but sugar maples have the highest sugar concentration. So even if you tap the wrong maple, you can always boil it longer.  I’ve heard of, but never tried birch syrup.",
                                    "score": 15,
                                    "author": "Tetrazene",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah. Interesting. Now that you've said it it'll be super easy for everyone to figure out. Thanks.",
                                            "score": 2,
                                            "author": "jet_heller",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I had birch syrup once. For some reason I thought that the sugar was added, not derived from the tree.",
                                                    "score": 3,
                                                    "author": "jmysl",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Birch Sap is less sweet than maple. It takes 40 gallons of maple sap to make 1 gallon syrup. With  birch it's 100 gallons of sap to make 1 gallon of syrup.",
                                                            "score": 3,
                                                            "author": "RelevantTalkingHead",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I ended up reading more after I made this comment. Kind of interesting.",
                                                                    "score": 2,
                                                                    "author": "jmysl"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sap has numerous practical uses, especially as an adhesive, which can have a *ton* of applications in a survival situation. Syrup isn't a bad option either if you go to the trouble of boiling it, as that can mean a lot of extra calories that you're bound to need, even if the nutrtition is lacking. Where there's trees there's water *somewhere*, so in all likelihood you wouldn't need to drink raw sap to hydrate, though it is an option",
                                                    "score": 3,
                                                    "author": "Homura_Dawg",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There are almost no survival situations in which you wouldn't want a fire anyway.",
                                                                    "score": 1,
                                                                    "author": "Homura_Dawg",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "i don't know who you think you're talking to but you're typing entire paragraphs that ultimately agree with what I'm saying, lol",
                                                                                    "score": 1,
                                                                                    "author": "Homura_Dawg",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Beats me,  ask OP lol",
                                                    "score": 1,
                                                    "author": "Tetrazene"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s the one on the left, next to the other tree",
                                    "score": 19,
                                    "author": "Alarost"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Funny story, my bug out bag is actually an 80 gallon copper kettle",
                            "score": 17,
                            "author": "rollinoutdoors"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Clearly you don’t understand the importance of properly topped pancakes in a survival situation.",
                    "score": 9,
                    "author": "tycr0"
                },
                {
                    "level": 1,
                    "comment": "100%\n\nI tap a few trees on my property every spring. The amount of energy required to boil maple water down to maple syrup (minimum 4-5 hours) would be a waste in a survival situation. Plus you're boiling (losing) water that could be essential later on.",
                    "score": 3,
                    "author": "Farminwithoutharmin"
                },
                {
                    "level": 1,
                    "comment": "You *can* make a tap out of other hardwood or potentially even a rock, and nature is rich with hammers. And even if you don't process it for syrup (which isn't the most nutritiously sound option anyway, though probably good calories) you can use it as an adhesive which could have a hundred applications. Supposedly you can even use it to waterproof a shelter",
                    "score": 2,
                    "author": "Homura_Dawg"
                },
                {
                    "level": 1,
                    "comment": "You can do this with other trees for different resources, do it to a pine tree for pine sap to make glue",
                    "score": 1,
                    "author": "Avery-Inigo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s unlikely you’d be unable to find any water around maple trees but if you were...that’s good drinking water there.",
            "score": 23,
            "author": "WangusRex",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed, hence why you might consider using it for other purposes. Sap can be used as an adhesive, which causes the imagination to run wild trying to come up with all the possible applications",
                    "score": 6,
                    "author": "Homura_Dawg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow no wonder real maple syrup is so expensive",
            "score": 9,
            "author": "we_are_already_dead",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah man, it doesn’t grow on trees..\n\n*or does it?*",
                    "score": 9,
                    "author": "Alarost"
                },
                {
                    "level": 1,
                    "comment": "Let alone that, it's freaking tree blood!! Next time I have pancakes I'll ask for the boiled blood of trees!",
                    "score": 6,
                    "author": "bad-r0bot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "it takes like 40 gallons to make 1 gallon of syrup.  You have to love the process to make carrying and cooking it all worthwhile.",
            "score": 8,
            "author": "lightspeeed",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is really fun, actually. I really love lighting the fire on the crisp early mornings to start a boil... it is a beautiful time of year and for me it is the best way to focus on something productive while passing through the final weeks of a long winter. \n\nThis year was a short season for us and I only ended up making just short of 3 gallons of syrup, but it was another damn fun project!!",
                    "score": 5,
                    "author": "jnux",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That makes sense.  Almost a meditative ritual.  I suspect your consumers are friends and family.  If your motive was profit, it would be torture.",
                            "score": 2,
                            "author": "lightspeeed",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It actually is much easier if you’re doing big scale. At that point you have a vacuum line running to all of the trees with centralized collection into a reverse osmosis system. From there, you move it into your huge (and hugely efficient) boiler with integrated pre-heater, baffle system, and filter.\n\nAt my size, it just doesn’t make sense to buy into many of those systems, and I pay for that with my time and effort. So the amount of time/effort I put in to run 25 taps is probably not all that much different than someone running 250 with all the bells and whistles.",
                                    "score": 3,
                                    "author": "jnux"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tell me about it. I boiled down about 800 gallons of sap with my FIL this year. Was definitely ready to be done with it by the end.",
                    "score": 3,
                    "author": "RelevantTalkingHead"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man I really wanted to go to Canada someday. Bummer.",
            "score": 14,
            "author": "HostileHabanero",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do this, not in canada... Central, NY... maybe close enough.",
                    "score": 5,
                    "author": "debugrr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the guy in the OP is in central NY too",
                            "score": 2,
                            "author": "DontFuckWithDuckie"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I live here.  Wanna trade for a day? Where do you live?",
                    "score": 3,
                    "author": "tayfife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I live in the mountains of Colorado. Hell yeah we could trade. But I hear Canada is becoming a police state",
                            "score": -33,
                            "author": "HostileHabanero",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Only some please refuse to follow those orders right? Check out this link right here this is where I got this. https://toronto.ctvnews.ca/mobile/ontario-gives-police-authority-to-stop-people-vehicles-ask-purpose-of-travel-1.5390805",
                                            "score": 2,
                                            "author": "HostileHabanero"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Homie, I hate to break it to you but you live in America. It’s already a police state.",
                                    "score": 33,
                                    "author": "TomBoysHaveMoreFun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't know what you mean about that and I definitely don't agree.",
                                            "score": -17,
                                            "author": "HostileHabanero",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How can you disagree with something you don't understand?",
                                                    "score": 14,
                                                    "author": "Giantstink",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You ain't from arounds these parts, are ya?",
                                                            "score": 6,
                                                            "author": "foilntakwu"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Our educashun sistem here in the USA ain't so good.",
                                                            "score": 1,
                                                            "author": "the_friendly_one"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I live in Colorado. I know what they mean and I definitely agree.",
                                                    "score": 1,
                                                    "author": "RelevantTalkingHead",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No you don't live in Colorado, you live in the Denver area. You get what you f****** deserve",
                                                            "score": 3,
                                                            "author": "HostileHabanero",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Who hurt you? Also, how old are you if you feel the need to censor swear words? You're a joke.",
                                                                    "score": 0,
                                                                    "author": "RelevantTalkingHead",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm a professional butcher, I stabbed the base of the thumb with a 9 inch butcher knife. So I can't text, I'm using my voice chat to write out the words. And it censors curse words, you stupid idiot, now who's the f****** joke?",
                                                                            "score": 0,
                                                                            "author": "HostileHabanero",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Pshh only 9in?",
                                                                                    "score": 1,
                                                                                    "author": "RelevantTalkingHead",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You can go to your options and turn off the censorship for curse words.",
                                                                                    "score": 1,
                                                                                    "author": "Ov3r9000midg3ts",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Still you.",
                                                                                    "score": 0,
                                                                                    "author": "ReallyLongLake",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -14,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don't watch any mainstream news. But you should start paying attention to the news because you obviously have no idea what you're talking about.",
                                            "score": -12,
                                            "author": "HostileHabanero"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Really?? How so??",
                                    "score": 2,
                                    "author": "tayfife",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[this right here. ](https://toronto.ctvnews.ca/mobile/ontario-gives-police-authority-to-stop-people-vehicles-ask-purpose-of-travel-1.5390805) I dont understand why I'm downvoted. No one seems to be paying attention to the world.",
                                            "score": 1,
                                            "author": "HostileHabanero",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh ya, I dunno if that makes all of Canada a police state. I thought you were maybe going to link to the internment camp thing that’s happening if you cross the border and try to get back in. Either way, it’s pretty chill here tbh.  Generally people are staying safe and making smart decisions... a few people are anti masking and causing shit, but perhaps the media is in the USA is making it seem like our country is in fire",
                                                    "score": 5,
                                                    "author": "tayfife",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well yeah there is the encampments too. No I don't think our media is making it look like Canada is on fire, I just worry about you guys that's all.",
                                                            "score": -1,
                                                            "author": "HostileHabanero",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thanks buddy... we worry about you guys too tbh! We’ll all pull through. :)",
                                                                    "score": 2,
                                                                    "author": "tayfife",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah either Canada will move to America or America will move to Canada. You guys have pretty good beer so that's cool",
                                                                            "score": -3,
                                                                            "author": "HostileHabanero"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Question for those that have done this: how much does this damage the tree? I have several maples but I don’t want to kill them after a few years of doing this.",
            "score": 14,
            "author": "pokemon-gangbang",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would check somewhere online for better info, but ive filled many  2L bottles from maple and berch, and they didnt have any problems after 3 years.\n\nI used clean tools, sealed the wound and didnt tap the tree all growing season, just the first month or 2",
                    "score": 15,
                    "author": "McSnek"
                },
                {
                    "level": 1,
                    "comment": "Most folks I know have been using the same trees for decades. There’s only one or maybe two taps per tree, and only trees of a certain size/age are used. I’m not aware of any evidence that it’s lethal or leads to diseases",
                    "score": 15,
                    "author": "Tetrazene",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you. I knew it didn’t kill them after the first time or something, I just didn’t want to cause damage and reduce its life so I have to cut them down in ten years.",
                            "score": 4,
                            "author": "pokemon-gangbang",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No worries. I’m no expert, just a dude who knew some sugarfolk up yonder",
                                    "score": 2,
                                    "author": "Tetrazene"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not at all, as long as you keep your equipment clean. The biggest risk is if you introduce bacteria under the bark where you drill the hole.",
                    "score": 5,
                    "author": "jnux"
                },
                {
                    "level": 1,
                    "comment": "&gt; Question for those that have done this: how much does this damage the tree? I have several maples but I don’t want to kill them after a few years of doing this.\n\nWell you've got ten months or so to figure it out.  Season's over this year.",
                    "score": 3,
                    "author": "The_camperdave"
                },
                {
                    "level": 1,
                    "comment": "It doesn't. Sap run all throughout the tree. You're probably taking 5% of its total sap. Not a bad idea to alternate trees each year to give some a year off though.",
                    "score": 1,
                    "author": "RelevantTalkingHead"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tree blood never tasted so damn good",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I generally prefer more natural versions of foods. How disappointing it was to discover I definitely prefer cheap fake maple syrup. The real stuff tastes like bark to me",
            "score": 3,
            "author": "Putridgrim"
        },
        {
            "level": 0,
            "comment": "Ignore the 219F thing.  It's more about specific gravity.  Just boil it down until it looks like syrup.  Boil it even further, and youbhave maple sugar crystals.  Way easier to transport and store.\n\nYou can also do this using a hatchet to cut a groove in the tree and using some bark to funnel the sap into a container.  The water can also be cooked off in a birch bark container using hot rocks put right into the sap.",
            "score": 5,
            "author": "TrapperJon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good to know! Sounds like that would make a tedious process even longer though. Great info if tools are unavailable.",
                    "score": 2,
                    "author": "RelevantTalkingHead"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You might be surprised how many trees will produce edible water/sap:\nMaple\nButternut\nBlack Walnut\nBirch Alder\nSycamore\nLinden\nHickory\nElm\n[27 trees you can tap for syrup ](https://practicalselfreliance.com/trees-species-tap-syrup/)",
                    "score": 7,
                    "author": "ilbub"
                },
                {
                    "level": 1,
                    "comment": "Don’t think so, some sap is poison I think",
                    "score": -1,
                    "author": "Alarost"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maple syrup comes from sap, which is essentially a trees blood. So does that mean canadians are just vegan vampires?",
            "score": 2,
            "author": "LiteSarcasm",
            "replies": [
                {
                    "level": 1,
                    "comment": "*Vegan Vampire* \n\nYou’ve started something",
                    "score": 1,
                    "author": "Alarost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm sorry",
                            "score": 1,
                            "author": "LiteSarcasm"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You say that like your diet *isn’t* the standard 99.97% maple syrup.",
                    "score": 4,
                    "author": "Alarost"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is that really all their is to it?  Collect sap in bucket, boil off water, strain into a bottle.  We have a bunch of maple trees; I'd like to try it.",
            "score": 2,
            "author": "macetheface",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, it is that simple. The issue is the ratio is 40:1. You need 40 gallons of sap, boiled down to get 1 gallon of syrup.",
                    "score": 2,
                    "author": "Reelair"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tree cum 😳",
            "score": 2,
            "author": "NoiceMango",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice mango, dude",
                    "score": 5,
                    "author": "Alarost"
                },
                {
                    "level": 1,
                    "comment": "Actually, that would be the pollen.  For about a week every spring everything around here (and in our house) gets covered by a yellow-green layer of pine spooge.",
                    "score": 3,
                    "author": "oswald_dimbulb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pine spooge 😳",
                            "score": 1,
                            "author": "NoiceMango"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very cool.....needs more bacon.",
            "score": 1,
            "author": "soonershooter"
        },
        {
            "level": 0,
            "comment": "Uh, dude. That’s a kerosene tree, not a maple. Look at the bark. Do not put that on pancakes.",
            "score": 1,
            "author": "FatDickGreg",
            "replies": [
                {
                    "level": 1,
                    "comment": "No worries, it gets boiled off in the evaporation",
                    "score": 1,
                    "author": "alucarddrol"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did this inside and literally everything in my house was sticky for weeks... dont be like me",
            "score": 1,
            "author": "TheCoyoteGod"
        },
        {
            "level": 0,
            "comment": "Nice 👍",
            "score": 1,
            "author": "AllDadsAreHobos"
        },
        {
            "level": 0,
            "comment": "Does this hurt the tree? Or is it good?",
            "score": 1,
            "author": "ReVo5000",
            "replies": [
                {
                    "level": 1,
                    "comment": "not if you don't leave it in permanently and you only do it to trees of sufficient age. It's not \"good\" when you lose blood, but like a tree, you can lose a certain amount without any real complications and allow it to reconstitute itself.\n\nEDIT: I googled and apparently a maple should be *thirty* years old before you tap it, that's nuts. But surely the bulk of maples you come across will be pushing that age, deforestation not withstanding",
                    "score": 2,
                    "author": "Homura_Dawg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dang.. now I want pancakes.",
            "score": 1,
            "author": "Quantum-Enigma"
        },
        {
            "level": 0,
            "comment": "what does it taste like pre boil?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Almost like water, with just the tiniest hint of earthy flavor. It's not like diluted syrup if that's what you're thinking.",
                    "score": 3,
                    "author": "jsat3474"
                },
                {
                    "level": 1,
                    "comment": "In elementary school we would go to a sugar bush every year. The first year I went my cousin was there too, he taught me to bring a McDonald's straw (any straw really) and flip the lids open and drink the sap. Fucking kids!",
                    "score": 1,
                    "author": "Reelair"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People get lost in the finger lakes looking for sugar maples",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I miss upstate NY 🍁",
            "score": 1,
            "author": "succulentsucca"
        },
        {
            "level": 0,
            "comment": "Might be a silly question, but why dont we make syrup from other types of tree? How come maple is the main one?",
            "score": 1,
            "author": "BioCuriousDave",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sugar content in the sap is lower in other trees. Like it takes 40 gallons of maple sap to make 1 gallon of syrup but 100 gallons of sap from birch to make 1 gallon of syrup.",
                    "score": 4,
                    "author": "Ov3r9000midg3ts"
                },
                {
                    "level": 1,
                    "comment": "I've had birch syrup before. It wasn't something I'd try a second time.",
                    "score": 1,
                    "author": "Reelair"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anyone else not a fan of maple syrup?",
            "score": 1,
            "author": "Moshibeau",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's wrong with you?",
                    "score": 1,
                    "author": "Reelair"
                }
            ]
        }
    ]
}