{
    "id": "11icote",
    "score": 29506,
    "title": "This is a coalescence cascade. When droplets of water contact the surface of water, it gradually bounces up and down until it is absorbed.",
    "author": "esberat",
    "date": 1677962687.0,
    "url": "https://www.reddit.com/r/educationalgifs/comments/11icote",
    "media_urls": [
        "https://i.redd.it/3kazo0ahasla1.gif"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "So beautiful and calming...",
            "score": 1163,
            "author": "jmblo1976",
            "replies": [
                {
                    "level": 1,
                    "comment": "I could watch this all day!",
                    "score": 149,
                    "author": "hikenmap",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is really cool to see the droplets diminish in size to a point so that air movement pushes the smaller droplets to the side",
                            "score": 117,
                            "author": "The_DaHowie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is there a mathematical equations to represent how much water can be absorbed during a single bounce? probably could  get one by take the area of each drop at the time of absorption. Would it be surface tension?",
                                    "score": 29,
                                    "author": "Cantbelosingmyjob",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's a great question for r/theydidthemath. I'm curious too",
                                            "score": 15,
                                            "author": "cassiclock"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's also cool that it looks like Megaman teleporting when it transitions to the smaller droplet size.",
                                    "score": 18,
                                    "author": "dern_the_hermit"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Great, cause you'll be watching that for eternity from first-person perspective when the technological singularity happens and that drop of water is your consciousness infinitely trying to absorb into the resulting metamorphosis of nature!",
                            "score": 11,
                            "author": "Seakawn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s what Death is",
                                    "score": 5,
                                    "author": "Eudamonia"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Would be cool to get a zooming in never ending loop video",
                            "score": 18,
                            "author": "samTheSwiss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We're gonna need a bigger droplet.",
                                    "score": 7,
                                    "author": "_stoneslayer_"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "liar",
                            "score": 4,
                            "author": "Fast-Vehicle2883"
                        },
                        {
                            "level": 2,
                            "comment": "I'm 7 hours in, only 17 more to go.",
                            "score": 3,
                            "author": "bicameral_mind"
                        },
                        {
                            "level": 2,
                            "comment": "I oddly feel the opposite, lava lamps give me the same ick. Idk why",
                            "score": 2,
                            "author": "IslandIntheSkies"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are you kidding! I’m on the edge of my seat! Every time I’m like, “There’s no way it can get smaller….IT GOT SMALLER”",
                    "score": 19,
                    "author": "OlriK15"
                },
                {
                    "level": 1,
                    "comment": "We didn’t deserve that last tiniest drop.",
                    "score": 16,
                    "author": "ElderDeep_Friend",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We definitely didn't deserve the bounce from that last tiniest drop.",
                            "score": 4,
                            "author": "probable_ass_sniffer"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is without a doubt one of the coolest things ever",
                    "score": 8,
                    "author": "no2K7"
                },
                {
                    "level": 1,
                    "comment": "I feel like this drop when I fall asleep on my mate's couch after the party.",
                    "score": 3,
                    "author": "jwkdjslzkkfkei3838rk"
                },
                {
                    "level": 1,
                    "comment": "I kinda zoned on it for about 6 runs. Good stuff",
                    "score": 2,
                    "author": "Mind_on_Idle"
                },
                {
                    "level": 1,
                    "comment": "There's an app in here somewhere. For someone with more skills than me.",
                    "score": 2,
                    "author": "stYOUpidASSumptions"
                },
                {
                    "level": 1,
                    "comment": "I read a thing that our universe might be like a drop formed from energy from another, much bigger universe, like this drop formed from the splash. And when that energy is gone it'll get reabsorbed into the other universe.",
                    "score": 2,
                    "author": "EastwoodBrews"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so cool to see! I’m surprised how small it gets before it is fully absorbed",
            "score": 587,
            "author": "misterboris1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Makes you wonder if we saw it be absorbed or if it continued to bounce past a microscopic scale.",
                    "score": 327,
                    "author": "knownaim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Surface tension can be thought of as water disliking being at the surface instead of surrounded by other water molecules. So as the drop gets smaller, it's even less happy about being in a drop instead of with the rest of the water because the ratio of surface area to volume is higher with a smaller drop. You can see this with how the water drop ends up sitting on the surface for shorter and shorter periods of time as it gets smaller. So forming an even smaller drop is probably not the case.",
                            "score": 17,
                            "author": "SmartAlec105",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Isn't that the opposite. More surface area means more surface tension and less volume means less gravity. Surface tension would help them to remain in a drop while gravity resists it being in a drop. That's why we have small balls/drops of mercury on ground but is in liquid form in a thermometer.\nI'm rusty on this, somebody please confirm...",
                                    "score": 2,
                                    "author": "AdishJain84275",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When droplets of water contact the surface of water, it doesn’t actually get absorbed straight away like you may think it does. What happens is it gradually bounces up and down until it is absorbed.\n\nUnderneath the droplet is a very thin layer of air, which allows it to sit temporarily above the surface. The air layer takes a bit of time to be pushed aside by the droplets weight. As the air moves from under the droplet, the surface of water pinches at water for a split second absorbing it. However it happens so fast that the connection is cut off between them and so a smaller droplet which hasn’t been absorbed bounces up.\n\nAs contact is made, waves are generated at the point of contact which surround the droplet, and go up the sides. This produces a force which allows the water droplet to leap up into the air. As it leaps up into the air, air fills the space underneath and the droplet once again sits on the thin layer of air. This process repeats until the mass of the droplet is so small it can just be absorbed by the water.\n\nhttps://thekidshouldseethis.com/post/12162224250",
                                            "score": 4,
                                            "author": "FreddoMac5"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That you for satisfying my query",
                                    "score": 1,
                                    "author": "highbrowshow"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Does it make sense? Like my naive understanding is the water forms a sphere due to gravity. If it gets to smaller and smaller scales that would be wierd",
                            "score": 53,
                            "author": "tehlolredditor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "afaik the water forms the sphere due to one having the least amount of surface area, its \"easiest\" for the water to be spherical, hence fluids on the ISS also forming bubbles. it getting smaller and smaller would definetly be interesting tho yea, definetly something to look into\n\nedit: just looked it up and if I, with my limited understanding of the english language, understood [the paper](https://aip.scitation.org/doi/10.1063/1.870380) correctly, the drop gets smaller up to six times. interesting",
                                    "score": 35,
                                    "author": "jfislslf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "First shalt thou drop the Holy Droplet. Then shalt thou count to six, no more, no less. Six shall be the number thou shalt count, and the number of the counting shall be six. Seven shalt thou not count, neither count thou five, excepting that thou then proceed to six. Eight is right out. Once the number six, being the sixth number, be reached, then coalesceth thou thy Holy Droplet of Antioch into thy water, who, being water in My sight, shall absorb it fully.",
                                            "score": 20,
                                            "author": "Zaros262",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "r/unexpectedMontyPython/",
                                                    "score": 7,
                                                    "author": "shepherdmoon1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No one ever expects the python exposition!",
                                                            "score": 2,
                                                            "author": "metalmaori"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "yeah sounds about right, eventually the viscosity of the water becomes an overwhelming force compared to its mass, volume, or any other factors and instead of continuing the cascade, the larger body just absorbs it.",
                                            "score": 2,
                                            "author": "SpaceEngineX"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "it forms a sphere because of its surface tension and cohesion. Gravity tries to make it flat.",
                                    "score": 143,
                                    "author": "Sasmas1545",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "_Flat_ while in mid-air? That does not compute.  Gravity just attracts every atom of a droplet downwards, so it shouldn't have an effect on the shape of an object.. unless it's a gravitational gradient from a nearby neutron star black hole...\n\n\nEdit: Show me a source of anything, a simulation, anything, of a liquid with no tension and cohesion forces, being affected by gravity and becoming totally flat. Until then, I stand by what I said.",
                                            "score": -26,
                                            "author": "ThirdEncounter",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The bottom of the water droplet falls faster, so with no surface tension the space between the water molecules would keep increasing until it's a single stream of H2O particles.\n\nThe surface tension allows for water droplets to exist",
                                                    "score": 24,
                                                    "author": "Rpgwaiter",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "How is the bottom of the water droplet falling faster? In classical physics, all the water molecules are falling at the same velocity.\n\n\nEdit: Good discussion.  You are right. Not all components of an object will fall at the same velocity at the same time, especially if they're not that rigid.  I meant to say with the same acceleration, but ultimately, what I wrote was wrong; so I stand corrected.",
                                                            "score": 3,
                                                            "author": "ThirdEncounter",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "How would the upper molecules start falling when there's water underneath already\n\nFor a good example, watch videos of people dropping slinkys\n\nEDIT: You can extrapolate this for yourself. Watch any stream of water fall from a tall place. The stream will break up into smaller and smaller droplets until they reach terminal velocity and the force between the top and bottom of the droplet isn't enough to overcome surface tension.\n\nIf there were no surface tension, the \"droplets\" would get as small as possible given enough time in freefall",
                                                                    "score": 17,
                                                                    "author": "Rpgwaiter",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The upper part starts falling because its getting pulled on by gravity just as hard as the bottom part is, they both fall at the same rate. The thing that breaks up water droplets isn't gravity, its the air rushing past. If you have water droplets falling in a sealed container so the wind isn't buffering them, like in a \"vomit comet\" plane doing a parabolic arc, [the water droplets stay big.](https://youtu.be/SAQ-iIJkLzA?t=192)",
                                                                            "score": 11,
                                                                            "author": "Earthfall10",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I’m pretty sure the slinky drops would suggest the opposite of what you’re saying, but they’re also a bad example because they are demonstrating how the elastic force counteracts gravity, which is not really a factor with water droplets.",
                                                                            "score": 10,
                                                                            "author": "ImNumberTwo"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "If an object is dropped, gravity impacts the entire object at the same time throughout the object (unless you are holding one end longer). Imagine dropping a bundled rope. It doesn't straighten out. If in a vacuum it will maintain its shape through the fall.",
                                                                            "score": 2,
                                                                            "author": "konqrr",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt;How would the upper molecules start falling when there's water underneath already\n\nSimultaneously with the rest of the water.\n\n&gt;For a good example, watch videos of people dropping slinkys\n\nIf you drop the slinky all at once, it falls together.\n\nIf you stop supporting the bottom before the top, you get the opposing forces of gravity pulling down and the force of the spring pulling it together, and it oscillates because the spring force varies with the current length of the spring but the force of gravity is constant.\n\nAs explained in another comment, it's the air resistance that pushes on the water from the bottom as it falls. The amount that gravity varies over small distances is too small to measure.",
                                                                            "score": 2,
                                                                            "author": "Tarantio"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The bottom of a slinky doesn’t fall because the spring tension pulls it up against gravity until the spring can’t compress any further.  Water isn’t very compressible like a spring and gravity or really general relativity effects all atoms of a water droplet virtually equally.  It flattens only on the bottom because of air resistance.",
                                                                            "score": 2,
                                                                            "author": "DragonEngineer"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That's not how gravity works.  I swear there is no negativity in the question I'm about to ask you:  How old are you?  Because depending on the age, I can determine if you've already studied gravity in your Physics courses or not.\n\n\nEdit: It was a genuine question, and the answer is, OP knows waaaaay more than I do, and I've been schooled. And I'm okay with that.",
                                                                            "score": -8,
                                                                            "author": "ThirdEncounter",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The irony in this statement is that you believe you are right due to your knowledge level that matches up with what I recall learning in 7th grade whereas the concepts being discussed are higher level physics that would more likely be discussed in college-level education. \n\nYou probably think gravity is a constant as well.",
                                                                                    "score": 8,
                                                                                    "author": "BigDaddyPapa58",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The moment when it switches from civilized discussion to popcorns out",
                                                                                    "score": 3,
                                                                                    "author": "HighSociety4"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "you cant just counter with \"thats not how gravity works\".",
                                                                                    "score": 3,
                                                                                    "author": "rajaselvam2003",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Don't be so fucking condescending, they just properly described the normal force what you got against the normal force??",
                                                                                    "score": 3,
                                                                                    "author": "Barley12",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They aren’t all falling at the same velocity, they all have the same force accelerating them downward at the same rate (gravity). \n\nIf there’s something in the way still, like another water molecule that also hasn’t begun accelerating downward, it’s not going to move. As an example, you, right now, are being pulled downward by gravity at a constant rate of acceleration, but whatever you’re sitting/standing/laying on is in the way and holding you up, so you don’t fall closer to the earth. \n\nThe water molecules at the bottom of the sphere only have the chemical concoction commonly called air in the way, which is less volume to push out of the way due to being a gas, so they accelerate downward first. \n\nThey free up space for the water above them, so gravity can pull those molecules too.\n\nSurface tension, caused by hydrogen bonds, are the primary factor that keeps the whole mass of water falling roughly in an orb shape, as this bond tries to force water into the shape that maximizes the amount of water molecules touching each other. \n\nEven then, wind resistance when water’s moving at high speeds (like terminal velocity) can push the sides upward into a tail of sorts, forming the classical raindrop.",
                                                                    "score": 5,
                                                                    "author": "MegaKabutops",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Because a water drop is a collection of molecules. Its not one object.\n\nAlso the top of water droplet is further from the direction of gravity than the top, do the top gets more rounded and the bottom gets more flat, due to the speed difference. until terminal velocity that is.",
                                                                    "score": 2,
                                                                    "author": "rajaselvam2003"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This is right. You're not crazy.",
                                                                    "score": 2,
                                                                    "author": "Tarantio"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Upvote for your excellent attitude :)",
                                                                    "score": 2,
                                                                    "author": "metalmaori",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thanks! It's the only way to live!",
                                                                            "score": 2,
                                                                            "author": "ThirdEncounter"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Same reason that, were you to drop in to a black hole, your feet would become atomized before your head did called spaghettification. The black holes immense gravity can overcome your meat suit.\n\nIn the case of water droplets, surface tension overcomes gravities pull on the bottom of the droplet on earth.",
                                                                    "score": 3,
                                                                    "author": "uCodeSherpa",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The tidal forces here on earth are negligible though. The difference between the strength of gravity between your head and your feet is thousands of a percent, it doesn't noticeably effect the shape of water drops much. And even if it was noticeable the effect of tides is to stretch the drop out not make it flat. The thing that causes water drops to flatten out as they fall is them slamming into the air.",
                                                                            "score": 3,
                                                                            "author": "Earthfall10"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Einstein's Theory of General Relativity - not only is the bottom falling faster, it's travelling on a greater curve  through spacetime and thus experiencing relatively slower time in comparison to the top (relative to each reference frame). Classical mechanics are what we see in estimate, much like how we generalize to see a splash of water instead of an increasingly smaller bouncing ball. Try to imagine this droplet is a spagettified human falling into a black hole, the gravitational effects are greatly diminished but still present here. [A good summary about this fascinating topic.](https://www.wtamu.edu/~cbaird/sq/mobile/2013/06/24/does-time-go-faster-at-the-top-of-a-building-compared-to-the-bottom/)\n\nEdit: Oops I was too quick to respond. This visual is more accurately described by /u/Triton_64 below. GR is happening to all matter, regardless of size, but we wouldn't be able to see it in this video.",
                                                                    "score": 1,
                                                                    "author": "shittycupboardAMA"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I did not mean flat while in mid air, you're right. But without cohesion you wouldn't have a *sphere* in mid-air either. And you still have spheres in microgravity, see water on ISS.",
                                                    "score": 5,
                                                    "author": "Sasmas1545",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; And you still have spheres in microgravity, see water on ISS.\n\n\nYes, that part you had already explained:\n\n&gt; it forms a sphere because of its surface tension and cohesion.\n\nBut then you tripped me up with your second sentence, which I interpreted it as: \"if it wasn't because of tension and cohesion,\" those water droplets, even the micro ones, would be flat.\"\n\n\nSo, even the micro quantities of water wouldn't make spheres is they lacked tension and cohesion, correct?",
                                                            "score": 1,
                                                            "author": "ThirdEncounter",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Well, that fella had plenty of time to respond.\n\nIf they lack what is basically hydrogen bonds, you couldn't even call it water. But a lack of surface tension would mean instead of \"shaking\" on the upward bounce they'd just violently explode.",
                                                                    "score": 2,
                                                                    "author": "The_bestestusername",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "No the flatness when falling is cuz air, the flatness on the ground of a big drop is cuz gravity.",
                                                    "score": 4,
                                                    "author": "Triton_64",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In space, dust comes together as a result of gravity, but even that it overselling it. Gravity is a really weak force. Two pieces of dust kind of close together are not destined to collide. Stars form in nebulae because of a lot of space dust in a reasonably concentrated area (simplified). \n\nThese droplets are moving fast enough to overcome gravity. They are held together by other things.",
                                    "score": 3,
                                    "author": "uCodeSherpa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yeah thats why i felt like it was a confusing comment in retrospect. at the scale it would be too weak like you said. its something at the chemical and atomic level from what someone else said.",
                                            "score": 1,
                                            "author": "tehlolredditor"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "also yeah, i used to be more into space and astronomy and watching documentaries and shit and i even tried majoring in it before dropping out lmao. but i could only recall this concept about how shit comes together in space, but it was obviously oversimplified and just vague.",
                                            "score": 1,
                                            "author": "tehlolredditor"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The bonds that happen between the atoms is what makes droplets. Hydrogen likes bonding with other hydrogen and oxygen atoms.",
                                    "score": 2,
                                    "author": "Cedric182"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean I dunno for sure but my thoughts are it did that until it was a molecule!",
                            "score": 2,
                            "author": "ChazJ81"
                        },
                        {
                            "level": 2,
                            "comment": "Some would say, it’s still bouncing to this day.",
                            "score": 2,
                            "author": "ZeitgeistArt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wonder if there is a mathematical expression that will accurately state how much smaller each droplet will get during the cascade.",
                    "score": 23,
                    "author": "yapperling",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like a PhD thesis to me!",
                            "score": 17,
                            "author": "OldHippie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sure as hell ain't writing that, I failed highschool math and 15 years later it can still bring me to tears.\n\nI think I might just be as dumb as a box of rocks.",
                                    "score": 10,
                                    "author": "yapperling",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I doubt that, since it was your idea!\n\nSome people just don't get along with certain math concepts. Doesn't mean they're stupid AT ALL!",
                                            "score": 6,
                                            "author": "OldHippie"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You mean you're bad at arithmetic.\n\nAddition, subtraction, multiplication and division are as central to being a mathematician as good spelling is to being a Stephen King-level writer. \n\nWe have spell check for a reason.",
                                            "score": 2,
                                            "author": "TheOneTrueTrench"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "B^2+C^2=D^EEz NUtz",
                            "score": 10,
                            "author": "Iowafield",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Give this man a Nobel Prize in Physics.",
                                    "score": 2,
                                    "author": "CurveOfTheUniverse"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "https://aip.scitation.org/doi/10.1063/1.870380\n\nThis article was posted above and I can't read the whole article but according to the abstract the answer to your question is yes.",
                            "score": 2,
                            "author": "Oneuponedown88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So essentially, its repeatability is dictated by its viscosity. We must experiment with something with a super low viscosity. Although, now I'm thinking about how super fluids react...",
                                    "score": 1,
                                    "author": "Zakkimatsu"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Pure bs from my side but the height it bounces up to reminds me of a motion of a spring when nonconservative forces are in effect.  Like a sinusoidal curve that slowly decreases in amplitude.  The actual volume of the sphere could just be a simple exponential decay function",
                            "score": 1,
                            "author": "Squishyfood"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s what she’s s…",
                    "score": 10,
                    "author": "rhymes_with_chicken"
                },
                {
                    "level": 1,
                    "comment": "&gt;I’m surprised how small it gets before it is fully absorbed\n\ntitle of your sex tape",
                    "score": 3,
                    "author": "Lady__Dee",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The fourth drop was a surprise!",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How fast is this process? Would love a counter on this video, I have a hard time imagining the actual speed of this.\n\nEdit: [Destin has it covered. ](https://youtu.be/KJDEsAy9RyM) Thanks to u/Ngineer07 for posting that clip.",
            "score": 111,
            "author": "thedudefromsweden",
            "replies": [
                {
                    "level": 1,
                    "comment": "7 fast",
                    "score": 48,
                    "author": "Cdr_Peter_Q_Taggert",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, it is 2 fast for me, so let's settle at 4.5 fast, deal?",
                            "score": 8,
                            "author": "eleven_me_2s",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How about Fast X.",
                                    "score": 2,
                                    "author": "ChumbaWambah",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Funniest comment I've seen today. I told my wife about it. She also laughed.",
                            "score": 3,
                            "author": "God_of_Thunda"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Probably all happens over the course of about a second, likely less given how small it would appear to be",
                    "score": 4,
                    "author": "Lildyo"
                },
                {
                    "level": 1,
                    "comment": "Here is some coffee I brewed where this seems to be occurring. https://youtu.be/6_hekJSzNEM",
                    "score": 5,
                    "author": "joshthewaster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That looks like an air bubble to me",
                            "score": 5,
                            "author": "Unusual_Variation771",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes but we can't measure distance unless we know the measurements",
                            "score": 5,
                            "author": "GodzeallA"
                        },
                        {
                            "level": 2,
                            "comment": "I know you want to sound smart, but not only is your sentence just wrong, it’s also note useful in the slightest. Objects have the same acceleration, not the same “speed.” Without any accurate measurement of scale, it’s impossible to figure out what speed this playback is at.\n\nSo not only did you not answer the question, you just sound like an arrogant smartass.",
                            "score": 2,
                            "author": "Ahnixlol",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd love to see one of those channels with access to million-frames-per-second cameras do another go at this. I wanna see the absorption happen at slower speeds, in this it's still essentially instantaneous.",
            "score": 48,
            "author": "Pirwzy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here ya go:\nhttps://www.youtube.com/watch?v=ynk4vJa-VaQ\n\n1:09 mark.",
                    "score": 23,
                    "author": "ThirdEncounter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish they redid this with the ridiculous cameras they have now with much higher FPS. This was nine years ago.",
                            "score": 7,
                            "author": "thedudefromsweden"
                        },
                        {
                            "level": 2,
                            "comment": "that roughly the same FPS as this gif was",
                            "score": 3,
                            "author": "Pirwzy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bloop boing boing bloop boing boing bloop boing boing bloop.",
            "score": 235,
            "author": "Piddles78",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm feeling like there might be a blop and a blip as well.",
                    "score": 9,
                    "author": "cccmikey"
                },
                {
                    "level": 1,
                    "comment": "My brain took the bloop as more of a _schlurp_ but maybe that’s just me.",
                    "score": 7,
                    "author": "whistling_klutz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I never thought a drop of water would be fun",
            "score": 74,
            "author": "blacbird",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let me introduce you to r/hydrohomies",
                    "score": 34,
                    "author": "Muddy_Mids"
                }
            ]
        },
        {
            "level": 0,
            "comment": "But how can we use this to make money?",
            "score": 117,
            "author": "ryansteven3104",
            "replies": [
                {
                    "level": 1,
                    "comment": "Post on reddit to get karma, then sell account to highest bidder.",
                    "score": 77,
                    "author": "PerfectPercentage69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;\tPost on reddit to get karma, then sell account to highest bidder.\n\ndo people do that?",
                            "score": 3,
                            "author": "Doublespeo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I paid $20 for mine, but found out all my post history is about raping furries.\n\nI guess you get what you pay for.",
                                    "score": 7,
                                    "author": "kikipi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;\tI paid $20 for mine, but found out all my post history is about raping furries.\nI guess you get what you pay for.\n\nhahaa what a mess, but why paying for karma?\n\nSome sub limit you if you have low karma but that is not much of a problem",
                                            "score": 4,
                                            "author": "Doublespeo"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Microdroplets have been found to catalyze (= make cheaper) many useful chemical processes. They're generally created using a fine mesh though.",
                    "score": 6,
                    "author": "o11c"
                },
                {
                    "level": 1,
                    "comment": "I feel like there was a popular phone or pc game that had something like this in it",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "3.2.1.  Contact",
            "score": 24,
            "author": "Peaceoorwar",
            "replies": [
                {
                    "level": 1,
                    "comment": "is the answer, is the reason",
                    "score": 7,
                    "author": "CMDR_Paul_Atrades",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's why everything happens!",
                            "score": 8,
                            "author": "thrashego",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lets make coooooontact",
                                    "score": 3,
                                    "author": "Stang1776",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://youtu.be/KJDEsAy9RyM \n\nhere's an actual video about it so you can learn what you're talking about before you just look at a cool picture and think you know what's going on",
            "score": 18,
            "author": "Ngineer07",
            "replies": [
                {
                    "level": 1,
                    "comment": "Check this out, reddit scroller",
                    "score": 5,
                    "author": "nou38"
                },
                {
                    "level": 1,
                    "comment": "I love Destin. He has been able to keep the excitement for things you have as a kid into adulthood. Even his giggles are childlike. Absolute treasure of a human.",
                    "score": 2,
                    "author": "thedudefromsweden"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is why the moon craters have a little mountain in the middle.",
            "score": 38,
            "author": "wohsedisbob",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here's an actual explanation:\n\nhttps://space.stackexchange.com/questions/44141/why-are-there-mountains-mounds-in-the-centre-of-craters-on-the-lunar-surface",
                    "score": 34,
                    "author": "rosettastoned02"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So that’s what it looks like when water splashes up my bum eh ?",
            "score": 5,
            "author": "73GTX440",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Coalescence cascade new band name called it",
            "score": 5,
            "author": "wb420420",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dick... I came here to say that. I'm sure there's 50 more first below us though... nah.",
                    "score": 1,
                    "author": "DebaucherousHeathen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "r/oddlysatisfying",
            "score": 3,
            "author": "crazyguyunderthedesk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is mind altering information",
            "score": 6,
            "author": "Tattozoo"
        },
        {
            "level": 0,
            "comment": "I saw this on /r/interestingasfuck the other day, I think it was. Only it was crystal clear without wording. Where did you find such a terrible gif copy?",
            "score": 6,
            "author": "Androxilogin"
        },
        {
            "level": 0,
            "comment": "Looks like it goes on forever with increasingly smaller drops…",
            "score": 5,
            "author": "therealdivs1210",
            "replies": [
                {
                    "level": 1,
                    "comment": "it goes on about on average 6 times before the viscosity of the water overwhelms the minuscule forces in its surface area and mass, and the tiny water droplet just gets absorbed by the larger body of water",
                    "score": 6,
                    "author": "SpaceEngineX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This was my first question.  I thought  \"surely this cannot go on until there's only one molecule left. \"",
                            "score": 3,
                            "author": "Grongebis"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everytime I see this I always wonder if there's one other smaller particle that our eyes can't see",
            "score": 2,
            "author": "Dr_Silk"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "r/shockwaveporn",
            "score": 2,
            "author": "Loljebeck",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hate all those *porn subs.\n\n\nI like porn, but I don't want to think about porn all the time.",
                    "score": 1,
                    "author": "ThirdEncounter",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shit like this always makes me think about how much stuff is really going on when humans only perceive a small amount of time. We think half a second is really short, but that’s because human brains can’t perceive anything shorter than a few milliseconds. The speed of signals moving through neurons is slower than the speed of copper wire. But on the microscopic scale, everything is so much faster, the molecules that make up air are moving hundreds of miles per second. Even insects process more information per second than us because of their tiny brains. From the perspective of an atom, humans are laggy machines made out of trillions of tiny cogs trying to move each other. A second is forever compared to planck time.",
            "score": 2,
            "author": "outer_spec",
            "replies": [
                {
                    "level": 1,
                    "comment": "An interesting way to think of how a molecule experiences time is to consider our solar system to be an atom and consider how long it would take to go from our solar system to another. Then consider that is happening all around you near instantaneously as electrons move and atoms bond with each other etc.",
                    "score": 2,
                    "author": "throwaway901617"
                }
            ]
        },
        {
            "level": 0,
            "comment": "B2+C2=DEEz NUtz",
            "score": 0,
            "author": "CalebEvans_Evans"
        },
        {
            "level": 0,
            "comment": "Oddly beautiful",
            "score": 1,
            "author": "Apprehensive-Stop347"
        },
        {
            "level": 0,
            "comment": "My coffee dripper does this every morning.  Always wondered if there was a name for the phenomenon.",
            "score": 1,
            "author": "awfullotofocelots",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same! I’d post a vid but you can see my face in the reflection, lol",
                    "score": 1,
                    "author": "kickerofbottoms",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wear a mask and/or large frame dark glasses",
                            "score": 1,
                            "author": "navilapiano",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is this a superman joke?",
                                    "score": 1,
                                    "author": "ppprrrrr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Only if OP is Clark Kent",
                                            "score": 1,
                                            "author": "navilapiano"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "2 bounce rule",
            "score": 1,
            "author": "snorkiebarbados"
        },
        {
            "level": 0,
            "comment": "Some say it's still bouncing to this day",
            "score": 1,
            "author": "Moist-Salamander-195"
        },
        {
            "level": 0,
            "comment": "I see droplets skate around the surface in my mr coffee almost every time i brew a pot of coffee.",
            "score": 1,
            "author": "stealthxstar"
        },
        {
            "level": 0,
            "comment": "Now imagine how many times this is happening all over the earth, which is one planet amongst how many bodies in the universe where beautiful things like this are continuously happening.\n\nWhat a magnificent system",
            "score": 1,
            "author": "Valiantay"
        },
        {
            "level": 0,
            "comment": "That was adorable.",
            "score": 1,
            "author": "christiancocaine"
        },
        {
            "level": 0,
            "comment": "Poseidon’s kiss",
            "score": 1,
            "author": "kektothebone"
        },
        {
            "level": 0,
            "comment": "3-2-1 CONTACT!",
            "score": 1,
            "author": "Casio_Tone"
        },
        {
            "level": 0,
            "comment": "Guess it's time for me to start up Bubble Trouble again",
            "score": 1,
            "author": "The_Old_Moloko",
            "replies": [
                {
                    "level": 1,
                    "comment": "Holy shit I thought I was going to throw out an og comment but u beat me to it",
                    "score": 1,
                    "author": "AhoyShitLiner2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s amazing!",
            "score": 1,
            "author": "mefistophallus"
        },
        {
            "level": 0,
            "comment": "Did anyone else make the “boing” sound in their hea…out loud?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "So THAT'S why it does that...",
            "score": 1,
            "author": "Shifter25"
        },
        {
            "level": 0,
            "comment": "Does this have anything to do with the Doppler effect?",
            "score": 1,
            "author": "MathematicsLearner"
        },
        {
            "level": 0,
            "comment": "The say that drop is still bouncing to this day, a few atoms in size",
            "score": 1,
            "author": "mauromauromauro"
        },
        {
            "level": 0,
            "comment": "The elders tell of a young ball much like you. He bounced three meters in the air, then he bounced 1.8 meters in the air, then he bounced four meters in the air. Do I make myself clear?",
            "score": 1,
            "author": "pork_fried_christ"
        },
        {
            "level": 0,
            "comment": "FAAAAKE NEEEEWS!",
            "score": 1,
            "author": "CRT_Teacher"
        },
        {
            "level": 0,
            "comment": "I bet the small one went subatomic!",
            "score": 1,
            "author": "tom-8-to"
        },
        {
            "level": 0,
            "comment": "u/savevideo",
            "score": 1,
            "author": "Acrobatic-Door6643"
        },
        {
            "level": 0,
            "comment": "never thought something so simple could look so cool. then again, that's what happens when it's slowed down.",
            "score": 1,
            "author": "dutifulvictory74"
        },
        {
            "level": 0,
            "comment": "Matryoshka Drops",
            "score": 1,
            "author": "Starfox-sf"
        },
        {
            "level": 0,
            "comment": "That last one was so very unexpected",
            "score": 1,
            "author": "squatwaddle"
        },
        {
            "level": 0,
            "comment": "Why doesn’t it just get absorbed when it first drops? It looks like half the initial drop did.",
            "score": 1,
            "author": "Sosa42O"
        },
        {
            "level": 0,
            "comment": "Somehow this reminds me of the game Bubble Trouble",
            "score": 1,
            "author": "TheNewGodss"
        },
        {
            "level": 0,
            "comment": "This is honestly the best thing I've seen in a minute.  The surface tension of the droplet is stronger than I thought.",
            "score": 1,
            "author": "Jenetyk"
        },
        {
            "level": 0,
            "comment": "Do they know by how much volume the ball loses with each bounce?",
            "score": 1,
            "author": "Qaju"
        },
        {
            "level": 0,
            "comment": "how come it doesn’t continue indefinitely since the smaller droplets should have more difficultly breaking surface tension?",
            "score": 1,
            "author": "GallowGreen"
        },
        {
            "level": 0,
            "comment": "I literally chuckled and said \"no fuckin way\" to no one when that last tiny one showed up. Genuinely cool video",
            "score": 1,
            "author": "MDFlash"
        },
        {
            "level": 0,
            "comment": "Any visuals for a \"resonance cascade\"?",
            "score": 1,
            "author": "NottaGrammerNasi",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Zeno, here’s your answer",
            "score": 1,
            "author": "TempoIndigo"
        },
        {
            "level": 0,
            "comment": "Rayleigh.  Worth a google.",
            "score": 1,
            "author": "Waxed_Sasquatch"
        },
        {
            "level": 0,
            "comment": "\"I never thought I'd *see* a coalescence cascade, let alone create one!\"",
            "score": 1,
            "author": "nintrader"
        },
        {
            "level": 0,
            "comment": "Water so fucking weird.",
            "score": 1,
            "author": "MagicMurse1"
        },
        {
            "level": 0,
            "comment": "u/savevideo",
            "score": 1,
            "author": "nfopuhfxir"
        },
        {
            "level": 0,
            "comment": "Dibs on band name",
            "score": 1,
            "author": "bagelstar"
        },
        {
            "level": 0,
            "comment": "&gt;I have walked across the surface of the sun. I have witnessed events so tiny and so fast, they could hardly be said to have occurred at all.",
            "score": 1,
            "author": "undeadalex"
        },
        {
            "level": 0,
            "comment": "Smarter Every Day did an in-depth video on this phenomenon using Phantom Flex cameras, one of his best videos: https://youtu.be/KJDEsAy9RyM",
            "score": 1,
            "author": "Siriacus"
        },
        {
            "level": 0,
            "comment": "12",
            "score": 1,
            "author": "AsliReddington"
        },
        {
            "level": 0,
            "comment": "Why does that last one jump so high.",
            "score": 1,
            "author": "WinBarr86"
        },
        {
            "level": 0,
            "comment": "u/savevideo",
            "score": 1,
            "author": "Infamous_Art1174"
        },
        {
            "level": 0,
            "comment": "Serious question; if the magnification increased, could we continue observing this \"cascade\"? - does it continue longer?",
            "score": 1,
            "author": "cgtdream"
        },
        {
            "level": 0,
            "comment": "Fabulous.",
            "score": 1,
            "author": "_14justice"
        },
        {
            "level": 0,
            "comment": "How much is it slowed?",
            "score": 1,
            "author": "jck8"
        },
        {
            "level": 0,
            "comment": "It's interesting that (excluding the initial drop) each new drop's max height on the first expulsion is higher than the previous drop. Obviously the smaller mass of the new drop is the reason since the collision is inelastic (primarily? entirely?). Neat.",
            "score": 1,
            "author": "Noshoesded"
        },
        {
            "level": 0,
            "comment": "Do you also notice, every time it gets smaller it bounces the same amount of times?",
            "score": 1,
            "author": "Quick_Repeat6473"
        },
        {
            "level": 0,
            "comment": "I enjoyed this very much. \nThis is an excellent video.",
            "score": 1,
            "author": "PhantomPainWalker"
        },
        {
            "level": 0,
            "comment": "How the smallest drop bounces higher than the previous two… magic!",
            "score": 1,
            "author": "Fumquat"
        },
        {
            "level": 0,
            "comment": "This reminds me of that one flash game where you shoot upwards arrows to destroy bigger bubbles into smaller one",
            "score": 1,
            "author": "Mertard",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I took an edible and I think I’m gonna go back and spend the rest of the night watching that on a loop.",
            "score": 1,
            "author": "BeatMeElmo"
        }
    ]
}