{
    "id": "11m35ex",
    "score": 13084,
    "title": "The National Weather Service has mapped almost 30 years worth of Tornado Probabilities",
    "author": "CompleteMCNoob",
    "date": 1678298276.0,
    "url": "https://www.reddit.com/r/educationalgifs/comments/11m35ex",
    "media_urls": [
        "https://i.redd.it/4ii1gu0o0kma1.gif"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Pretty sure I watched this about 10 times on loop before I realized it was a 30 year average shown over 365 days, and not 30 years of daily forecasting. I was like “wow, it’s awfully consistent year-over-year!”",
            "score": 1565,
            "author": "InfernoBrace",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not exactly the sharpest tool in the shed but I still don’t understand the progression its showing lol.",
                    "score": 256,
                    "author": "subutextual",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's the probability of a tornado happening on a particular day of the year. This probability is calculated using thirty years of past data.",
                            "score": 306,
                            "author": "MakeRobLaugh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was so mad they weren't showing the year",
                                    "score": 13,
                                    "author": "fewdea"
                                },
                                {
                                    "level": 3,
                                    "comment": "Makes sense, thank you for clarifying!",
                                    "score": 55,
                                    "author": "subutextual",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, my dumb ass thought they were saying the probability had dropped lately and was like... no.",
                                            "score": 16,
                                            "author": "HCJohnson",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Your ass isn't dumb! It's a poorly titled chart.",
                                                    "score": 7,
                                                    "author": "Solest044"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Thanks, I couldn't figure it out either",
                                    "score": 5,
                                    "author": "geministarz6"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "30 year average (mean? something anyway) of probability for every day of the year.",
                            "score": 4,
                            "author": "XtendedImpact"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was mad they weren't showing the year, was thinking to myself did the author expect me to count how many times it reached January. \n\nCame to comments to complain, then I see this.",
                    "score": 27,
                    "author": "NoCSForYou",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I didnt understand your comment. Then I watched the video on loop for about 5 minutes thinking these patterns are so similar year on year. It’s only when I realised I couldn’t see which year I was on that I clocked it. Snap.",
                    "score": 26,
                    "author": "dumbtalkpanda"
                },
                {
                    "level": 1,
                    "comment": "I didn't pay much attention to the date  and thought this was showing climate change making tornados more common but then it got better and returned to the beginning so I thought we did something to fix it.",
                    "score": 7,
                    "author": "Roskal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 430,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spent most of my life there and never got to see one:(",
                    "score": 74,
                    "author": "zbipy14z",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 60,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My mom and I were chased by one in Kentucky.\n\nIt weakened once we were safe at dads place.\n\nMy anxiety shoots up everytime there's a storm now here in Texas because we've been getting these Frontline stormy bastards.",
                                    "score": 16,
                                    "author": "This_User_Said",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Watched one cross the  Ohio river back in 2017 in WV. Now when I get the seek shelter now alert I go into panic mode cus they aren’t a joke.",
                                            "score": 7,
                                            "author": "FuhrerGirthWorm",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "One broke my leg in Kansas, but I never saw it. I did see another at a different time from a distance, though. I have seen a lot of wall clouds, though, and helped clean up after several.",
                                    "score": 6,
                                    "author": "Officer412-L"
                                },
                                {
                                    "level": 3,
                                    "comment": "I almost saw one in Kansas. That was also enough.",
                                    "score": 16,
                                    "author": "AverageLiberalJoe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’ve heard of Kansas. That too was enough.",
                                            "score": 13,
                                            "author": "reddit-lies"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In Nebraska, but same. Not a large one and in the middle of bumfuck cow country, but still. Damn.",
                                    "score": 3,
                                    "author": "I-Make-Maps91"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I have lived in ok 90% of my life and have yet to see one. Still go outside every time I hear the sirens",
                            "score": 14,
                            "author": "toddwoward",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": ":)*",
                            "score": 3,
                            "author": "PM_ME_UR_OBSIDIAN"
                        },
                        {
                            "level": 2,
                            "comment": "You don't want to. I was in the Joplin tornado. It was one of the worst days of my life.",
                            "score": 3,
                            "author": "LonelyNess1990",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It’s one of those things as a weather watcher you think you want to see. Until there’s one right on top of you, and then you realize it’s not cool at all. \n\nSource: Was in one in 1994.",
                            "score": 3,
                            "author": "ktappe"
                        },
                        {
                            "level": 2,
                            "comment": "Same. Thank you military weather control. /s\n\n👀",
                            "score": 2,
                            "author": "Schwifftee"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In may.",
                    "score": 9,
                    "author": "Denk-doch-mal-meta"
                },
                {
                    "level": 1,
                    "comment": "Stuff being cool unless you live in Oklahoma is kinda standard....",
                    "score": 8,
                    "author": "Historiun"
                },
                {
                    "level": 1,
                    "comment": "The worst one I ever saw in person was in central Iowa and that was nearly 40 years ago and I don't fully remember it. Just my family making a big deal about it. \n\nAfter that I spent four years in Yukon, OK and had quite a few nights sleeping in my parents' bedroom closet, just in case.\n\nAs an adult I saw three at once in New Orleans. I was standing on the balcony of the mall along the river with a group of people watching a storm in a distance.\n\nThere was one that destroyed the church my step-dad attended in Bethany, OK, but that was 10 to 15 years after we moved away. I remember seeing a picture of the church in a newspaper and instantly recognizing it.",
                    "score": 7,
                    "author": "jeremyosborne81"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 35,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm born and raised from Moore, Oklahoma. I moved away after losing a grand total of 5 homes in my life from tornadoes.",
                            "score": 55,
                            "author": "Macoochie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've lived in Moore nearly my whole life (only just recently moved north into the city proper) and I've never been directly impacted by a tornado. Been close a few times though.",
                                    "score": 13,
                                    "author": "Ginkasa"
                                },
                                {
                                    "level": 3,
                                    "comment": "When I first moved to OKC for grad school was right after the most recent EF5, and my ex followed after finishing her Graf program the following summer. One of the first things she did as a therapist was do group therapy for kids from Moore who had to ride out the tornado *at school*, or lost friends, family, or their homes as a result. \n\nI still remember the previous EF5 that went through that town. That was the worst tornado on record until the Joplin EF5. For one town to have been hit *twice* by two of the strongest tornados ever recorded is nuts. Realistically, there's large swaths of land south of OKC with quite low population density and very small towns. So for those two tornados to have leveled miles of the same town within a decade or so (not including smaller ones, just counting these record setting/breaking ones), it just seems like a town to avoid living in. \n\nMy family up in Tulsa installed a steel tornado shelter after the first one leveled and area *a mile wide* and *several miles long*, because stone and 2x4s moving at 2-300mph are absolutely deadly, and will go right through our shitty American toothpick 2x4 framed houses, regardless of outer brick walls.",
                                    "score": 10,
                                    "author": "Mister_Bloodvessel"
                                },
                                {
                                    "level": 3,
                                    "comment": "Not a religious person, but Moore Oklahoma makes me believe there’s a god. And he abso-fucking-lutely does not want a town to be right there.",
                                    "score": 25,
                                    "author": "puzzle-owl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fuck this place in particular",
                                            "score": 7,
                                            "author": "Army_Enlisted_Aide"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Moore and Norman both",
                            "score": 9,
                            "author": "ses1989",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nah, Norman is protected by ancient Native American magic and that's why the tornados always skip it. That's the local legend. \n\nMoore, however, has been fucked up multiple times. I lived in North Norman during the 2013 Moore tornado. It was like a bomb was dropped on parts of that town.",
                                    "score": 7,
                                    "author": "DrMasterBlaster"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "i live in norman.  i actually was outside when a decent tornado was about a mile away from my house, couple weeks ago.  even being so close to moore... i can't imagine how people live there.  but shit people prob say the same thing about me living in norman.  in fact many koreans did tell me that, when i lived there.",
                            "score": 3,
                            "author": "Baxtaxs"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I live in the middle of that circle of death in Oklahoma. It’s… not great.",
                    "score": 6,
                    "author": "acgasp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s not great, it’s OK",
                            "score": 4,
                            "author": "01011010-01001010"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I grew up in East Texas just a few miles south of OK. You get used to tornadoes. It was kinda scary but also fun. The whole family in the bathroom playing board games, couch cushions on the walls, crazy thunder and lightning. My dad would get drunk and watch the whole thing from the front porch, eventually I was old enough to join him. I kinda miss it.",
                    "score": 4,
                    "author": "Cableperson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same. 💕",
                            "score": 2,
                            "author": "HikingMommy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Except it looks like OK isn’t even the most probable state to be hit by a tornado?",
                    "score": -1,
                    "author": "TheKingOfTheMeowton",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure why this is downvoted. Oklahoma ranks 3rd behind Texas and Kansas and it’s declining. Last year, 9 states had more tornadoes than Oklahoma.",
                            "score": 5,
                            "author": "Meerkats_are_ok",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This specific shows that dead center in Oklahoma hits the highest probability on the scale during May. No other location hits that probability.\n\nGranted, the gif ends at 2011 but this is still very recent, living history. Even if Oklahoma does get less tornadoes than other states and even if that is declining, it still gets a lot. Oklahoma has also seen the widest tornado recorded and the strongest winds recorded; that's going to leave a big impact on the collective psyche even if some other state gets more quick spin ups.",
                                    "score": 8,
                                    "author": "Ginkasa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also, Texas is almost 4x the size of Oklahoma, so while the total number of tornadoes is bigger in Texas, the number of tornadoes per square mile is bigger in Oklahoma.",
                                            "score": 2,
                                            "author": "Hoenirson"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oklahoma had 15 tornadoes two weeks ago. Just because it's not probable doesn't mean it's not possible.",
                            "score": 10,
                            "author": "Uttuuku"
                        },
                        {
                            "level": 2,
                            "comment": "Its a GIF...",
                            "score": 5,
                            "author": "TranquiloMeng"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The town in Oklahoma i live in just closed all public storm shelters a few years back too. \n\nWe have perfectly usable shelters bolted up right now. I bought a pair of bolt cutter after the last scare.",
            "score": 753,
            "author": "thugstin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Think we can reasonably assume from this gif that Gulf moisture is transported way further north than just “The South.” Really cool how southern Illinois never leaves one of those highlighted zones, even in winter.",
                    "score": 31,
                    "author": "fgyrd7457",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Looks like in September a big whole opens up in the middle that leaves southern Illinois out",
                            "score": 2,
                            "author": "Legion4444"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why? The “small government” crowd or something? You’d think shelters would be a very, very good idea in tornadoland",
                    "score": 341,
                    "author": "GlandyThunderbundle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That would be a very very good idea.\nWhich is why a lot of conservative town(like mine!) Simply don't have any. Our Tornado shelter protocol is to go to Walmart.",
                            "score": 225,
                            "author": "SerFoxworth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Be aware that tornado shelter protocol is slightly different for big box stores like Walmart- most notably that the center of the building is NOT the safest place to be. [This comment](https://www.reddit.com/r/walmart/comments/f9osqa/comment/fiu481b/?utm_source=share&amp;utm_medium=web2x&amp;context=3) goes into more detail, but ideally a freezer or bathroom (provided it’s on the north-east side of the building)",
                                    "score": 116,
                                    "author": "OkVoyager76151",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why north-east?",
                                            "score": 19,
                                            "author": "periloux",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Tornadoes typically come from the South-West and travel North-East. So the North-East side of the building is the most protected.",
                                                    "score": 21,
                                                    "author": "grunger"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Tornados tend to move from the south-west to the north-east, and in turn tend to push things in that direction. If you’re up against an exterior wall on the south-west side the tornado is more likely to push the wall right on top of you. On the north-east side, you have a better chance of the wall falling away from you. Anything can happen, but might as well give yourself the best chance possible!",
                                                    "score": -1,
                                                    "author": "OkVoyager76151",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This sounded like such horseshit I had to look it up, and would you look at that, it is! Reddit never fails to confidently spread misinformation.",
                                                            "score": 61,
                                                            "author": "Hotchillipeppa",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "When I googled this the only thing I could find was that no corner of a **basement** is safer than another. Big box stores are built differently than houses which can mean different safety rules for sheltering (for example, in a home with no basement you are told to go to the inner most part of the house, but the center of a big box store is a no go). As I mentioned in my first post anything can happen, but you have to pick somewhere to go. Tornados move in every direction but they certainly trend to move in the north-east direction.",
                                                                    "score": 9,
                                                                    "author": "OkVoyager76151",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It depends on your location  this might be good advice if you are in the Midwest United States which has a northwest weather flow system, but could be a deadly mistake for someone living in coastal south Texas where hurricane producing weather patterns influence tornadoes to move the opposite direction.",
                                                                            "score": 10,
                                                                            "author": "Hotchillipeppa"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Good to know as a Mississippian. We get very little tornado training and we have no basements in my part of the state. I also live in a house with no interior rooms or closets. So north east corner? I’ll do that.",
                                                            "score": 1,
                                                            "author": "I_PM_Duck_Pics"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh I know,but thankyou for your concern!",
                                            "score": 18,
                                            "author": "SerFoxworth"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Probably because it's better to shelter in place than to leave your home to go to a different location due to the rapid onset and unpredictable  nature of tornados.",
                            "score": 22,
                            "author": "USMBTRT",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tell that to a poor person living in a trailer park.",
                                    "score": 29,
                                    "author": "sparkster777"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They should shelter in place at their hotel, or whatever establishment they are near to. \n\nI'm not sure how a visitor would even find a community storm shelter in the middle of a storm.",
                                            "score": 1,
                                            "author": "Clovis42",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "yeah just fuck those homeless people i guess. \n\nand god forbid we put community storm shelters  on google or anything.",
                                                    "score": 4,
                                                    "author": "MilesOfMemes",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; yeah just fuck those homeless people i guess.\n\nNo, each area should have some kind of plan for that, but it won't always involve dedicated storm shelters. I know in Boone Count, KY, where I live, there aren't any. But apparently the county has arrangements with businesses, churches, and homeless shelters. \n\nIn most of these areas, the homeless will be connected to some kind of shelter since living without them is almost impossible (you'd freeze to death for a good part of the year). That would be their main storm shelter as well: the homeless shelter that they sleep in. Any open business is probably required by law to provide shelter during an emergency as well. \n\n&gt;and god forbid we put community storm shelters on google or anything.\n\nSorry, I'm old and sometimes forget that google maps exist, lol. My problem was that I was thinking what I would do as a visitor, and I would never google a storm shelter while travelling. I'd shelter in place at the hotel I'm staying at, or shelter in place at whatever place I'm visiting. \n\nAnd I just wouldn't be in the middle of nowhere during a big storm. I'd check the weather ahead of time and if there would be storms I'd stay near areas where I knew there were shopping centers or grocery stores. Even at home, we once got caught out and sheltered in the walk-in fridge at a Kroger's. \n\nI would never think of googling an actual storm shelter. I guess at this point I assumed they basically didn't exist. I mentioned the idea of finding a storm shelter while travelling, and my wife also thought that was bizarre. We're just used to living in an area that has tornados, and sheltering in place makes sense.\n\nEdit: Oh, and I was also talking about actually finding the place. Google maps will get me to the area, but exactly where is the entrance, where do I park, is it even open, etc. This all sounds more complicated and dangerous than simply sheltering in place.",
                                                            "score": 2,
                                                            "author": "Clovis42"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You may not know that there are warning systems in place that watch for conditions.",
                                    "score": 6,
                                    "author": "GlandyThunderbundle"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The \"small government\" crowd is just trying to kill off as many people as they possibly can.",
                            "score": 37,
                            "author": "nomofica",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gotta bring about the End Times for Jesus!!!!",
                                    "score": 14,
                                    "author": "remotectrl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For some its help the weaker or struggling fellow humans for others let's just fast forward to the end.",
                                            "score": 2,
                                            "author": "asackofsnakes"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Can't be a small government if you have too many people.\n\n*Presses temple*",
                                    "score": 7,
                                    "author": "Soliden"
                                },
                                {
                                    "level": 3,
                                    "comment": "Covid made that clear. \"Oh look it's a disease that mostly kills off old people who aren't vaccinated! And those people vote for us! Hey old, unvaccinated people! Get on some cruise ships!\"",
                                    "score": -3,
                                    "author": "VoilaVoilaWashington"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Conservatives hate preventative measures, especially if it might save people's lives.",
                            "score": 4,
                            "author": "SheriffBartholomew"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Our town in Kansas did, too. I agree with the decision, though it was a tough one. The shelters are not staffed 24/7 and we can't keep enough paid staff to open the shelter when a tornado is possible. So our worst case scenarios were thus:\n\n1. People will shelter in their home or a neighbors home even if the don't have a basement. \n\n2. People will drive to a community shelter during an active tornado only to find it locked and have to survive the storm outside or in their car.\n\nSo we closed the shelters, diverted the money to weather alert radios for residents that need them, and put out messaging abouy making a plan before the tornado strikes.\n\nEdit: Our shelter were not dedicated storm shelters. They were churchs, schools, and business who has rated safe spaces built into them. If someone show up while the place is open, they will invite them in. Buy many of our storm happen after those places would close for the day.",
                    "score": 62,
                    "author": "QuandaryOfRed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "just have the fire department or PD open the shelters.  there is no reason to hire people specifically for that purpose.",
                            "score": 41,
                            "author": "5tyhnmik",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's not always possible. We have more shelters than we have on-duty officers. And our firefighters are frequently on calls. We can't take the chance of having residents outside a closed building during a tornado. So we work to help residents find their own plans instead.\n\nAnother complication is that these are not dedicated shelters. They are places of business, worship, and education. We can unlock a school and tell residents to have it it with no one there. We don't have enough people to open a shelter and then stay put.",
                                    "score": 38,
                                    "author": "QuandaryOfRed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I suppose that makes sense in this half life we all live together... too bad you can't just leave them open year round and trust no one to mess them up or whatever while they sit there waiting for the rare times they are needed... people suck...",
                                            "score": 5,
                                            "author": "Odin1806"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That’s just dumb. \n\nI’m from Israel and we have bomb shelters everywhere and they are completely unstaffed and no police of fire department required. \n\nNormally, someone will have a key or bolt cutters. Works great.",
                                            "score": 2,
                                            "author": "symphonix",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is America. Either someone will be squatting in it or whoever shows up with the bolt cutters will charge the others for entry.",
                                                    "score": 5,
                                                    "author": "The-link-is-a-cock"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sound's like a bad plan. We couldn't do one thing, so we will do nothing! Why would the storm shelters need to be manned 24/7?",
                            "score": 19,
                            "author": "Pleasantlyracist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Especially because meteorologists know when a severe weather day is coming up, I lived in Oklahoma for a while and the outbreaks were pretty much always forewarned, neighbors/friends would plan to come over during them bc I had a shelter.",
                                    "score": 21,
                                    "author": "bisou13"
                                },
                                {
                                    "level": 3,
                                    "comment": "Not at all. We actively helped residents make their own plans and bought them the tools to stay informed and get rapid warning of the threat. \n\nAs I said in the post, these are not storm shelters. They are churches, schools, and businesses that have rooms that have been built to also be shelters. The only thing that is 24/7 in this town is one brand of gas station. Even our Walmart closes overnight.",
                                    "score": 8,
                                    "author": "QuandaryOfRed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;\tEven our Walmart closes overnight.\n\nAll Walmarts close overnight now. They changed their 24 hour stores during Covid and never switched back.",
                                            "score": 1,
                                            "author": "a_talking_face"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "But cutting unnecessary costs means your local representative can pocket the money and laugh at you!",
                                    "score": -4,
                                    "author": "_SGP_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This money is definitely not being pocketed in most cases. Town budgets are desperate and there are more needs for that money than there is money to go around. Life is a hell of a lot more complicated than your Disney cartoons with good guys and bad guys depict.",
                                            "score": 14,
                                            "author": "jeegte12",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Maybe use a remotely controlled locking system.",
                            "score": 2,
                            "author": "Alfandega"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because it costs more lives having panicked gridlock with all the people trying to get to a public shelter stuck outside when it hits. \nMuch safer to shelter in place.",
                    "score": 4,
                    "author": "Maklava"
                },
                {
                    "level": 1,
                    "comment": "&gt; We have perfectly usable shelters bolted up right now. \n\nIf someone isn't cleaning them out every season there's a pretty good chance you won't want to sit in one for all the other visitors that have found their way in.\n\nI barely want to use ours and I clean it like once a month during storm season. \n\nSitting amongst the black widows while I wait for a tornado to go buy would be pretty nerve racking.",
                    "score": 7,
                    "author": "crunchypuddle"
                },
                {
                    "level": 1,
                    "comment": "Likely the shelters were no longer up to code.",
                    "score": 8,
                    "author": "Bowens1993",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe, but why close them and not update them? \n\nDuring a tornado i rather be in a shelter thats not up to code than my 2nd floor 1 bedroom apt.",
                            "score": 12,
                            "author": "thugstin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "the city would rather have you die in your own apartment than get injured where they told you to go\n\ni wish that was a joke",
                                    "score": 27,
                                    "author": "5tyhnmik"
                                },
                                {
                                    "level": 3,
                                    "comment": "Legal liability and the costs of repair?  They have no obligation to have shelters, but if they do have shelters they have an obligation for them to be up to code.\n\nIf you get hurt because the shelter isn't up to code, you can sue them.  If you die at home because there are no shelters, they can't be sued.  They don't want to spend the money to update them, so they are closed.",
                                    "score": 3,
                                    "author": "RedditWillSlowlyDie"
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't know. I would need the name of your town to look into it more.",
                                    "score": 4,
                                    "author": "Bowens1993",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No offense broskii but i'd prefer not to. 😂",
                                            "score": 3,
                                            "author": "thugstin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I wasn't asking.",
                                                    "score": 2,
                                                    "author": "Bowens1993",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My town voted against storm shelters. I think there might be one or two open to the public within like 20 minutes? There are none in the actual city limits. We literally voted against paying some insignificant amount and %, while federal govt would’ve paid the bulk.",
                    "score": 2,
                    "author": "theursusregem"
                },
                {
                    "level": 1,
                    "comment": "I can't understand why they don't have assigned free volunteer roles for certified people.  I'm sure people would come from all over the world to help protect and help re-establish those areas hit by a tornado.  I know if I live in an area where tornadoes are always possible. I'd had assigned a volunteer team, and then had more official EMS on the way after the storm hit..  I'm sorry to hear they're so dumb as to want to do this.",
                    "score": 1,
                    "author": "MinimumMonitor7"
                },
                {
                    "level": 1,
                    "comment": "Why? Too much CRT or the threat of drag shows?",
                    "score": -4,
                    "author": "Budded",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah, Youth Pastors",
                            "score": 4,
                            "author": "510Threaded"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love how for most of the year the probability of a nader is low, but it's never zero. I love in North Texas most of my youth and seeing the sky turn that disgusting green color was always so exciting.",
            "score": 183,
            "author": "GI_Bro300",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nader",
                    "score": 42,
                    "author": "kellydactyl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ralph",
                            "score": 19,
                            "author": "Snolidsteak"
                        },
                        {
                            "level": 2,
                            "comment": "I love it when people do this to words. Some farmhands converted me to calling Coyotes “Yodees” and now i can’t go back.",
                            "score": 15,
                            "author": "ThePopesicle"
                        },
                        {
                            "level": 2,
                            "comment": "What's Naders, precious?",
                            "score": 6,
                            "author": "rope_rope",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "TOR-NA-DOES",
                                    "score": 3,
                                    "author": "TheMadHatter524"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They call me tater salad",
                            "score": 2,
                            "author": "dabluebunny"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh my gosh the silence! The loudest quiet I ever heard! So insane.",
                            "score": 5,
                            "author": "GI_Bro300"
                        },
                        {
                            "level": 2,
                            "comment": "That’s what it’s like after a hurricane comes through, except there’s wind",
                            "score": 3,
                            "author": "HungJurror"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's also interesting toe that while the rate increases heavily in spring, it is not at all comparable to fall which is relatively low.\n\nI wonder what causes that, maybe temp increasing is much quicker than cooling which is slower, so not nearly as much cold/warm weather front clashing?",
                    "score": 4,
                    "author": "Corregidor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's because most violent thunderstorms and tornados happen with warm air near the surface and cold air above it.   With the seasons changing from cold -&gt; warm in the spring the temperature changes occur more rapidly at the surface than higher in the atmosphere which means you setup the temperature instability needed for strong storms.   In fall we are going from warm -&gt; cold so it's generally the opposite with the colder air at the surface.",
                            "score": 10,
                            "author": "AJRiddle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It would be neat to see this map as a 30 year aggregate laid up next to each individual year to see how wildly they shift year over year.",
            "score": 52,
            "author": "Bad_Touchin_yo_feels",
            "replies": [
                {
                    "level": 1,
                    "comment": "Might see if NOAA has archives of their images.\n\nI pulled these images from [https://spc.noaa.gov](https://spc.noaa.gov) and made a GIF from them. There's a few other graphics which follow this format on their website like hail and strong winds, as well as Today's probabilities of aforementioned categories. I'll have to look around :)",
                    "score": 30,
                    "author": "CompleteMCNoob",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "really interested to see the delta pct if you include 2011 to now. Having lived down south for a long time, winter tornados seemed like they were becoming more frequent.",
                            "score": 3,
                            "author": "dubya_a"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow that is weird that it's so dynamic",
            "score": 98,
            "author": "Ceramicrabbit",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn't expect it to be a zone that moves, flows and expands through out that area.   I expected it to be more isolated zones popping up here and there.",
                    "score": 30,
                    "author": "Grogosh"
                },
                {
                    "level": 1,
                    "comment": "That would be a fun movie, a cursed town with their yearly tornadoes.",
                    "score": 13,
                    "author": "dragonmp93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Moore, OK](https://kfor.com/news/experts-explain-why-moore-is-targeted-by-tornadoes/amp/) is about as close as you’ll get. They have the worst luck.",
                            "score": 34,
                            "author": "werpicus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Live in Moore. Can confirm. We're due for another big one",
                                    "score": 9,
                                    "author": "ShortyLow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right? At this point it's been 10 years since a big one. It feels overdue.",
                                            "score": 10,
                                            "author": "Macoochie",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I was there during the 2013 Moore tornado. It was a literal disaster zone.",
                                                    "score": 4,
                                                    "author": "DrMasterBlaster"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've always thought that a Lovecraftian Twister has some major potential.",
                            "score": 2,
                            "author": "NebulaNinja"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Spring storms in the south are no joke",
            "score": 28,
            "author": "phoonie98",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same goes for the Midwest, had an F4 just a few miles from my house last March.",
                    "score": 6,
                    "author": "TheH0rnyRobot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "West Virginia got some kind of anti-tornado voodoo",
            "score": 19,
            "author": "Omega-10",
            "replies": [
                {
                    "level": 1,
                    "comment": "big-ass mountains (relative to the surrounding terrain, not... like, globally-speaking)",
                    "score": 31,
                    "author": "thelittleking"
                },
                {
                    "level": 1,
                    "comment": "Only state that lies completely within the Appalachian mountain range babaaaaay",
                    "score": 4,
                    "author": "defnotevilmorty"
                },
                {
                    "level": 1,
                    "comment": "No naders are gonna bother me in the valley....\n\n\nFlooding after the fact? Yes.",
                    "score": 6,
                    "author": "pinkgobi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, yeah. The flooding fucks us up every year, and 2016 especially sucked.",
                            "score": 2,
                            "author": "defnotevilmorty"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Mountains kill tornadoes dead.",
                    "score": 3,
                    "author": "soulcaptain"
                },
                {
                    "level": 1,
                    "comment": "They don’t need tornados. The poverty and lack of resources is already scary enough.",
                    "score": 2,
                    "author": "inkybreadbox"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I understand that this is an average of 1982-2011...\n\nIs it always the same every year - like no single year's is significantly different than the others in aggregate?",
            "score": 55,
            "author": "Thenerdy9",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have heard that the highest probability zones are gradually shifting East.",
                    "score": 8,
                    "author": "SensitiveTurtles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And you are correct:\n\n[https://cms.accuweather.com/wp-content/uploads/2022/03/0networktornadoalleyshift2022.jpg?w=632](https://cms.accuweather.com/wp-content/uploads/2022/03/0networktornadoalleyshift2022.jpg?w=632)\n\nFrom here: [https://www.accuweather.com/en/severe-weather/is-tornado-alley-shifting-east/1162839](https://www.accuweather.com/en/severe-weather/is-tornado-alley-shifting-east/1162839)\n\nAnother read on this matter:\n\n[https://www.usatoday.com/story/weather/2018/10/17/tornado-alley-shifting-east/1660803002/](https://www.usatoday.com/story/weather/2018/10/17/tornado-alley-shifting-east/1660803002/)",
                            "score": 4,
                            "author": "bigbura"
                        },
                        {
                            "level": 2,
                            "comment": "Seems like they're going farther north, too, into Ontario, Canada, where they never used to be",
                            "score": 3,
                            "author": "smozoma"
                        },
                        {
                            "level": 2,
                            "comment": "PA resident here and I can definitely confirm the amount of tornadoes that have been happening around us have almost certainly increased in the last several years.\n\nTornado warnings in my area used to be super rare (only 1 warning over the span of 5-6 years), but now it’s common to have like 1-2 tornado warnings per year now",
                            "score": 2,
                            "author": "TheDancingDoggoo"
                        },
                        {
                            "level": 2,
                            "comment": "It's been pretty rapid in the last decade to the south and east.  Mississippi and Alabama are much worse than they used to be for tornados and severe storms.",
                            "score": 3,
                            "author": "AJRiddle"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is a horrible way to show this data",
                    "score": 56,
                    "author": "throwaway24689753112",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only if there was a significant change over the decades. If there wasn't, then showing the variable that matters (time of year) is the good way to show it",
                            "score": 18,
                            "author": "Babbed"
                        },
                        {
                            "level": 2,
                            "comment": "Thank you. I thought I was crazy. \n\nI'm not sure I've learned much from looking at this.",
                            "score": 2,
                            "author": "klavin1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I still think you're crazy.  \n\nNot really, but what is the confusion? The gif provides the historical probability of a tornado within 25 miles of any point in the US on any given date, and I can't think of a more effective way to show that.",
                                    "score": 19,
                                    "author": "MOZZA_RELL",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not who you asked, but I misunderstood. I thought it was showing likelihood each year, so it was very strange (with climate change) that the end of the gif suggests tornadoes are a thing of the past. Potentially misleading, even though that wasn't the intent other dummies like me are out there and some more malicious.",
                                            "score": 2,
                                            "author": "WontLieToYou",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The labeling is poor, because it's not explicit.  Great visualization though",
                                                    "score": 3,
                                                    "author": "Jokonaught"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "This does not say tornadoes are a thing of the past. It says in January and ends in December. It says tornadoes are much more likely in the summer than in the winter, where they probably only happen on the gulf coast.",
                                                    "score": 2,
                                                    "author": "Viratkhan2"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It might still be one of the best ways even if it’s horrible.",
                            "score": 1,
                            "author": "MSgtGunny",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Speed the video up and make it longer. Show the yearly progression.",
                                    "score": 2,
                                    "author": "throwaway24689753112",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That would be showing a different viewpoint on the underlying data. This is showing that the probability a tornado is in an area changes throughout the year.\n\nYou’re asking to see how the tornado probability has altered over time, but there might not be enough underlying data to make that a good visualization on a per year basis.",
                                            "score": 9,
                                            "author": "MSgtGunny",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[Oh there's enough data all right.](https://storymaps.esri.com/stories/tornadoes/)",
                                                    "score": 3,
                                                    "author": "NebulaNinja"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's just broadly showing each region's average tornado season.",
                    "score": 2,
                    "author": "nomnomnompizza"
                },
                {
                    "level": 1,
                    "comment": "I’m not sure I really understand your question, but no, every single year is not the same. I’m not even sure what that would look like.",
                    "score": 2,
                    "author": "otheraccountisabmw"
                },
                {
                    "level": 1,
                    "comment": "This was my question/hope too for this map. I assume that climate change has both broadened the range and increased the intensity of tornadoes over time, was curious to see if that was true",
                    "score": 1,
                    "author": "CheeseRex"
                }
            ]
        },
        {
            "level": 0,
            "comment": "May in Tulsa it is",
            "score": 3,
            "author": "bloodybeakerfolk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The title of this is frustrating… It’s nationwide map of tornado probabilities over the course of one year based on 30 years worth of data.",
            "score": 4,
            "author": "Rowdyjoe",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My house in NW Ohio got hit November 17th - when the probability is &lt; 0.1% according to this map. Neat.",
            "score": 9,
            "author": "kl040809",
            "replies": [
                {
                    "level": 1,
                    "comment": "I live in NE Ohio and we've had a real deal tornado warning only a few times. A tornado hasn't touched down around here as far as I know but the winds still cause destruction from falling trees and powerlines.",
                    "score": 3,
                    "author": "Kycrio"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Think we can reasonably assume from this gif that Gulf moisture is transported way further north than just “The South.” Really cool how southern Illinois never leaves one of those highlighted zones, even in winter.",
            "score": 7,
            "author": "weII_then"
        },
        {
            "level": 0,
            "comment": "Former Iowa resident here. It was super funny because they’d put out a tornado warning and you’d get the kids in the basement then all the adults would be up on the roof with snacks seeing if they could spot the cloud. Just you and 2-3 other neighbors from your street all up on your roof looking at the storm.",
            "score": 3,
            "author": "Orlando1701"
        },
        {
            "level": 0,
            "comment": "So it averages over each day across all 30 years?",
            "score": 3,
            "author": "GrindvikingIslandi",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Geez! The Midwest is like some sort of alley for tornadoes.",
            "score": 3,
            "author": "pygmeedancer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, almost like some sorta sideroad or narrow path between buildings. Think we're on to something here",
                    "score": 1,
                    "author": "Bobyyyyyyyghyh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Living in Ottawa, Ontario, Canada, where the light shaded area never quite reaches, I suspect that this is no longer accurate, as for the past few years tornados seem increasingly common here, whereas we never used to get them. Perhaps they are just random outliers? Or maybe they are part of a gradual climate change effect, since practically every year now is a new top-5 hottest year...",
            "score": 3,
            "author": "smozoma",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Can somebody explain to me why the US is so much more prone to tornados than Canada?",
            "score": 3,
            "author": "ConsumedConcerner",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because of the two oceans have different pressure systems that start converging. Thats why you see so many north of the gulf",
                    "score": 2,
                    "author": "Lizzards_Gizzards"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Could someone explain to me how you can have a probability of greater than 100%?",
            "score": 11,
            "author": "tag_ur_it894",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's a decimal in there, the range is 0.10% to 1.40%.",
                    "score": 8,
                    "author": "Possibly_a_Firetruck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah you’re right—missed the decimal point!",
                            "score": 5,
                            "author": "tag_ur_it894"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I believe that the max on this chart is 1.4%.",
                    "score": 21,
                    "author": "generalchase",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Phew I like those odds a lot better",
                            "score": 5,
                            "author": "tag_ur_it894",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If it _were_ 140%, that would mean you should expect more than one tornado in range that day.",
                                    "score": 3,
                                    "author": "Grindl"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol, eat shit Oklahoma. (jk, sorry for the yearly inconveniences)",
            "score": 8,
            "author": "cazdan255",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oklahoma is a shit state. Let it blow away\n\nEdit: Currently live here and there are individuals who I work with on occasion who probably would kill me if they knew I am gay. Alaska is homophobic as hell, but I can at the very least expect them to throw scriptures at me and not threaten to run my over with their truck",
                    "score": 5,
                    "author": "Uttuuku"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glad the storms don't dare to enter Canada or Mexico",
            "score": 7,
            "author": "ShanghaiSeeker",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I lived in Missouri; never saw a tornado. Lived in Florida; never impacted by a hurricane. Lived in California; experienced only two minor tremors. Lived in Virginia— two tornados; three earthquakes; and three hurricanes 🤷🏻‍♀️",
            "score": 2,
            "author": "Devtronix",
            "replies": [
                {
                    "level": 1,
                    "comment": "Meanwhile I did basic in Missouri and two tornados hit in that short span haha. Nature is wild",
                    "score": 2,
                    "author": "hereFOURallTHEtea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "cries in oklahoman.\n\nalso when i went to korea, people were shocked i was from oklahoma.  lol.  \n\nseeing there reaction to how crazy our weather is, and in my 36 years never had a shelter.  yeah, shit is wild here.  i guess you can get used to anything.",
            "score": 2,
            "author": "Baxtaxs"
        },
        {
            "level": 0,
            "comment": "That's way more widespread than i thought. Sorta wrecks all of those \"just move out of tornado alley!\" jokes",
            "score": 2,
            "author": "PornCartel"
        },
        {
            "level": 0,
            "comment": "I'm going to OK for three weeks in April. Neat!",
            "score": 2,
            "author": "FilteredAccount123",
            "replies": []
        },
        {
            "level": 0,
            "comment": "is this how people in USA determine where to make cardboard houses? The biggest chance - the more cardboard usage per house?\n\ni mean using cardboard near strong winds does make better videos but i still find it unreasonable to sacrifice your house to any dash of wind only for more entertaining videos",
            "score": 2,
            "author": "Belutak"
        },
        {
            "level": 0,
            "comment": "How on earth do you tell the year? Or am I just stupid?",
            "score": 5,
            "author": "NewAccountNumber101",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's combined",
                    "score": 16,
                    "author": "CompleteMCNoob"
                },
                {
                    "level": 1,
                    "comment": "It's data from every year shown as an average for each month",
                    "score": 2,
                    "author": "nomnomnompizza"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank God I live in the armpit of America and only have to worry about dying of heat exhaustion.",
            "score": 5,
            "author": "ghost_mv"
        },
        {
            "level": 0,
            "comment": "Do people really have to live in Oklahoma?",
            "score": 5,
            "author": "shirk-work",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, but they'll force you to give birth",
                    "score": 2,
                    "author": "imgonnabutteryobread"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does over 100% mean there is a high probability of more than 1 tornado within 25 miles?",
            "score": 2,
            "author": "rollem",
            "replies": [
                {
                    "level": 1,
                    "comment": "The map is a little difficult to read, that's over 1%, not over 100%.",
                    "score": 5,
                    "author": "RedditWillSlowlyDie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Real question:\n\nIs there a tornado season (like hurricanes), or do they just come and go as they please?",
            "score": 2,
            "author": "BigDaddyCool17",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s seasonal, the likelihood follows severe weather events (high temperature and humidity clashing with cooler air are the energy of storms). April to June, though they can happen earlier/later in the year as well of course.",
                    "score": 8,
                    "author": "audrikr"
                },
                {
                    "level": 1,
                    "comment": "Alabama has “seasons” from late February to May and October-December. Basically any time that warm air and cold air meet. But that can happen outside those months.",
                    "score": 2,
                    "author": "alreadytaken76"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mountains are beautiful",
            "score": 1,
            "author": "Unfocused-Attention"
        },
        {
            "level": 0,
            "comment": "Why does God™ hates conservative states?",
            "score": 1,
            "author": "chickenstalker"
        },
        {
            "level": 0,
            "comment": "Sometimes I feel as though the US media like nothing better than to report the worst possible scenarios they can in order to make americans even more paranoid and afraid than they already are.",
            "score": 0,
            "author": "Skrewrussia"
        },
        {
            "level": 0,
            "comment": "This increases my desire to relocate to Arizona, but it does nothing to decrease my desire to never move again.   It might just take a tornado to force my hand.",
            "score": 1,
            "author": "P1nCush10n"
        },
        {
            "level": 0,
            "comment": "That does seem pretty nice for a graphic that shows the main areas of tornado occurences, but I really wish they would've made it so that you could compare the probability of a tornado between the years. There may be an increase due to climate change",
            "score": 1,
            "author": "Not_Leopard_Seal"
        }
    ]
}