{
    "id": "124oflx",
    "score": 7907,
    "title": "A look inside the factory at how Pineapples are prepared &amp; packaged 🍍🍍",
    "author": "SairajBatale",
    "date": 1680009374.0,
    "url": "https://www.reddit.com/r/educationalgifs/comments/124oflx",
    "media_urls": [
        "https://i.redd.it/htifo1px9hqa1.gif"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hmmm, what does happen to the leftovers (peel and core)? Are they just discarded?",
            "score": 150,
            "author": "apeinej",
            "replies": [
                {
                    "level": 1,
                    "comment": "Theyre pressed for pinapple juice",
                    "score": 150,
                    "author": "av3R4GE-CSGO",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pressed, as in interrogated?",
                            "score": 112,
                            "author": "Kangar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "#\"WHERE'D YOU HIDE THE SEEDS?!\"",
                                    "score": 113,
                                    "author": "HowieGaming"
                                },
                                {
                                    "level": 3,
                                    "comment": "#SPILL IT #",
                                    "score": 21,
                                    "author": "DanielGREY_75"
                                },
                                {
                                    "level": 3,
                                    "comment": "#WHERE IS SHE!?",
                                    "score": 14,
                                    "author": "El_Impresionante",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "WHERE’S SCARECROW!?",
                                            "score": 3,
                                            "author": "Nika_113"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If there is ause for the pulp after juicing I will be happy",
                            "score": 8,
                            "author": "Unkuni_"
                        },
                        {
                            "level": 2,
                            "comment": "Trying to get every last useful but out of it.\n\nWhen I buy a pineapple there's a lot more waste than in the factories, but it's a tradeoff for more packaging and transportation.\n\nSolution is if you can't buy pineapples grown within 200km don't buy them at all.",
                            "score": 12,
                            "author": "c1e2477816dee6b5c882",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Idk if you're joking or luddite",
                                    "score": 11,
                                    "author": "10art1"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Some sites use Anaerobic Digestion to produce bio-gas, which can then be used for combined heat and power generation.\n\nWaste utilisation and CO2 savings.",
                    "score": 17,
                    "author": "Spryte_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Smart answer.",
                            "score": 3,
                            "author": "apeinej"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Happy cake day!",
                    "score": 1,
                    "author": "maryv82",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thx",
                            "score": 3,
                            "author": "apeinej"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A store in Germany called Globus has a pineapple machine that does the same thing",
            "score": 41,
            "author": "mangosteenfruit",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love these machines! Same with the OJ pressers. Fascinating stuff",
                    "score": 9,
                    "author": "keedxx"
                },
                {
                    "level": 1,
                    "comment": "That's really cool!\n\nHow do they clean it? I can't imagine it gets used or maintained with the same frequency a factory does...",
                    "score": 4,
                    "author": "sparhawk817",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not sure how they clean it but you have to pick diced or sliced. You put a container in another slot you get fresh juicy pineapples. \n\nWish they had it here in the us",
                            "score": 7,
                            "author": "mangosteenfruit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lots of grocery stores have them in the back. Big ones like Kroger or Stop and Shop don't have it on display but that's how they put out fresh sliced pineapple in plastic containers",
                                    "score": 4,
                                    "author": "10art1"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Nature**: Here is my gift to you, covered in a rind to protect it from pests and the elements.\n\n**Humans**: *plastic*",
            "score": 1098,
            "author": "theredbobcat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Look, I hate to be on the same side as the oil industry on this one, so I will post the Vaporean copypasta in the end to show that I'm not trying to astroturf.\n\nThere's enough evidence that proper packaging can extend shelf life of food, and [with pineapples it's not different.](https://www.sciencedirect.com/science/article/abs/pii/S0925521408001233).\n\nUnfortunately plastic has all the right properties that makes this possible. I really hope we find a different material that does the same job while not lasting 500 years after the fact. Until then we can probably try to decrease our plastic consumption by properly incentivising changes in consumer habits + supply chain.\n\nBut without plastic packaging we would have way less food diversity available and/or just less food in general. So it's not like we do this just to be assholes.\n\nAnyways, the copypasta:\n\n&gt;Hey guys, did you know that in terms of male human and female Pokémon breeding, Vaporeon is the most compatible Pokémon for humans? Not only are they in the field egg group, which is mostly comprised of mammals, Vaporeon are an average of 3”03’ tall and 63.9 pounds, this means they’re large enough to be able handle human dicks, and with their impressive Base Stats for HP and access to Acid Armor, you can be rough with one. Due to their mostly water based biology, there’s no doubt in my mind that an aroused Vaporeon would be incredibly wet, so wet that you could easily have sex with one for hours without getting sore. They can also learn the moves Attract, Baby-Doll Eyes, Captivate, Charm, and Tail Whip, along with not having fur to hide nipples, so it’d be incredibly easy for one to get you in the mood. With their abilities Water Absorb and Hydration, they can easily recover from fatigue with enough water. No other Pokémon comes close to this level of compatibility. Also, fun fact, if you pull out enough, you can make your Vaporeon turn white. Vaporeon is literally built for human dick. Ungodly defense stat+high HP pool+Acid Armor means it can take cock all day, all shapes and sizes and still come for more",
                    "score": 182,
                    "author": "USS_Phlebas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What in the mother of fuck is that copy pasta and why on gods green earth do you have this *saved*?",
                            "score": 19,
                            "author": "LookAtMeImAName"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 84,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Theyre pressed for pinapple juice",
                                    "score": 17,
                                    "author": "OwnContributions"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Umm, cans? They last LONGER in cans and its literally the only way I find them in Australia other than fresh. This plastic looks like its some pointless bullshit they'd do in the US.",
                            "score": 56,
                            "author": "AirmailMRCOOL",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cans weigh more, so it takes more fuel to ship them.  The metal also needs to be refined and shipped to the factory.\n\nReality is a bitch.",
                                    "score": 30,
                                    "author": "mee8Ti6Eit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "opposite to plastic that grows from the soil and is picked fresh every morning at the local plastic garden?",
                                            "score": 25,
                                            "author": "andy_1337",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's right next to the job store where you can get jobbys",
                                                    "score": 9,
                                                    "author": "giant_lebowski"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 41,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Flame retardant. Have you ever seen a can of pineapple catch fire?",
                                            "score": 25,
                                            "author": "Barfblaster",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Twice - it was only my fault once though",
                                                    "score": 8,
                                                    "author": "giant_lebowski"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "But that is a very thin film at least, which is considerably less than a whole-ass package.",
                                            "score": 5,
                                            "author": "aperson"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "WTF kind of cans do you have that are plastic lined? Ours sure as hell aren't. If they were, the pineapple juice wouldn't tarnish the metal and be flavoured by it when exposed to air. But that's only if you keep it in the open can for more than a couple days so it rarely results in wastage. I eat it straight from the can given half a chance.",
                                            "score": -4,
                                            "author": "Carr0t",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My money was on SE Asia",
                                    "score": 1,
                                    "author": "SicnarfRaxifras"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's only astroturfing if he's paid by someone to do this. Astroturfing is a specific term to represent a fake grassroots campaign paid by a special interest. We must be precise or language loses all meaning.",
                                    "score": 12,
                                    "author": "JewishTomCruise"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Unfortunately there is probably loads of packaging to get raw fruit to the store too. Not saying you're wrong, but it really is a problem with every leve of the supply chain.",
                    "score": 7,
                    "author": "SchaeferB"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Many people are disabled or have low mobility in their hands and benefit from prepared foods like these. They're the same people that pre-shucked and plastic-wrapped corn cobs or pre-foiled baked potatoes are for. That able bodied people use and benefit too is just a bonus to ensure product is used before it goes bad.",
                    "score": -93,
                    "author": "shinygoldhelmet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This shit reads like oil co propaganda and probably is oil co propaganda because they would certainly pretend to care about the disabled to try and make a point.",
                            "score": 77,
                            "author": "Tylenol_Jones",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "On r/educationalgifs? On a gif of a pineapple factory?",
                                    "score": 3,
                                    "author": "_stoneslayer_"
                                },
                                {
                                    "level": 3,
                                    "comment": "Plus dozens of comments pointing out the same flawed arguments in this thread. Either pure propaganda or co-opted \"Twitter discourse\", either way the result is the same.",
                                    "score": -6,
                                    "author": "giulianosse",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're so conspiracy starved that you think a bunch of people pointing out the needs of disabled folk is woke propaganda that you have to fight against rather than a bunch of people genuinely trying to point out why some things seen as \"wasteful\" are actually helpful to those of us with disabilities and trouble using our hands?",
                                            "score": 9,
                                            "author": "shinygoldhelmet"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Or maybe we can find ways to give disabled people access to every food without wrapping everything in plastic. There must be other ways!",
                            "score": 10,
                            "author": "risus_nex",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sure, if they live close to the processing plant. Otherwise, without plastic, this kind of food would spoil before grandma could get her hands on it.",
                                    "score": 3,
                                    "author": "SaltyMudpuppy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It makes me sad to see this so heavily downvoted. For anyone who believes that a small number of people with disabilities aren’t worth having more accessible packaging for, [this article](https://thewalrus.ca/garlic-in-a-jar/) helped give me a better understanding of how the pre-prepared ingredients that people love to sneer at can make a big difference to some people’s lives.",
                            "score": 16,
                            "author": "dismantlemars",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*shrug* Some people out there really don't care about people with disabilities and prefer to keep their world view that allows them to look down both on people who are lazy and buy such products as well as the people with disabilities.",
                                    "score": -1,
                                    "author": "shinygoldhelmet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't think anyone is intending on looking down on people with disabilities. It's probably just to look down on people increasing demand on a product they don't need but are too lazy to do the work for. It's unfortunate that there's an overlap but I don't think there's ill thought to the disabled.",
                                            "score": 10,
                                            "author": "TravelBug87"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Could use aluminum cans instead. Those take almost nothing to recycle.",
                                    "score": 0,
                                    "author": "ifandbut",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, aluminium cans are famously easy to open for people who can barely use their hands.",
                                            "score": 3,
                                            "author": "shinygoldhelmet"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for the attempt, but don't worry. Those of us with disabilities are used to having our existences ignored, unless of course we can be used to make the non disabled feel better about their own lives.",
                            "score": 4,
                            "author": "federally",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Those of us\" - thanks for excluding me from my own comment.",
                                    "score": -1,
                                    "author": "shinygoldhelmet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not including isn't the same as excluding.",
                                            "score": 2,
                                            "author": "samurphy"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Reddit moment with these downvotes\n\nIf you even try to point out there are people that need different accomodations suddenly its too 'woke' or propaganda",
                            "score": 3,
                            "author": "Velentina"
                        },
                        {
                            "level": 2,
                            "comment": "If someone isnt able to shuck corn I doubt they can boil it.",
                            "score": -10,
                            "author": "wertyuish"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There was more human work involved in this than I expected.",
            "score": 109,
            "author": "caldric",
            "replies": [
                {
                    "level": 1,
                    "comment": "it's always wild to me to see a production line that's like 90% automated, and then one step is just \"we need a dude to pick up two trays at a time and place them over here\".\n\nlike why was that the line where a robot just wasn't up to the task any more?",
                    "score": 58,
                    "author": "kid-karma",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Additional visual inspection as they're loading the tray?",
                            "score": 23,
                            "author": "RevRagnarok"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ya. As someone in the automation industry I was looking at that gif and thinking \"I could automate that step...and that one...and that one...that one would be easy...\".",
                    "score": 11,
                    "author": "ifandbut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are a jobs killer! How dare you?",
                            "score": 3,
                            "author": "shahnygpt95"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lots of plastic waste just to have a slightly more convenient pineapple slice.",
            "score": 894,
            "author": "Criticalfailure_1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought for sure these were being canned.",
                    "score": 25,
                    "author": "DrAbeSacrabin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, at least on a can it would make sense for shelters and stuff",
                            "score": 1,
                            "author": "Brauen"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Blew my mind, individually plastic-packaged slices. There should be a law against this.",
                    "score": 452,
                    "author": "Margiman90",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don’t ever visit Japan. Everything is individually wrapped. Sometimes multiple times.",
                            "score": 36,
                            "author": "tyscrich",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They also have one of the best recycle and disposable culture though, so it's not going in to the ocean compared to other countries in Asia which is more of an issue",
                                    "score": 13,
                                    "author": "miskle_pics",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't know man, as far as I can tell they have two categories of trash: metal cans and \"burnable\" (i.e. anything else), at least in all the guest houses I've stayed at or the public garbage cans that I have seen.",
                                            "score": 11,
                                            "author": "steen1337",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Things like cardboard in certain neighbourhoods are picked up by trucks on dates so they keep them. \n\nI’m in no way saying they’re masters at it, but just that they don’t dump their plastics in the ocean and on the ground.",
                                                    "score": 4,
                                                    "author": "miskle_pics"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Japan recycles like 98%.\n\nWith the caveat that burning plastics to make energy is considered recycling. You recycle the plastics into energy...\n\nThey basically burn everything but glass and metal.",
                                            "score": 8,
                                            "author": "Firipu",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's a definition of recycling I have never heard before and hope to never hear again.",
                                                    "score": 4,
                                                    "author": "smallfried",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In most western countries that is also a widely accepted form of recycling tbh.",
                                                            "score": 6,
                                                            "author": "Firipu"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A friendly, gentle reminder that a lot of products people think are stupid or made for lazy people are actually targeted at the disabled. A pineapple is not an accessible fruit for anyone who doesn't have the mobility, strength, or dexterity to be able to safely wield a knife. It's also why grocery stores sell silly-seeming things like plastic cups with de-shelled hardboiled eggs inside, packages of pre-peeled orange segments, jars of minced garlic, and pre-cut packs of cleaned and peeled veggies like carrots, celery, squash, peppers, etc. It saves an abled person 5min on cooking prep time, but it makes it possible for disabled folks to independently use those foods *at all*.  I do agree that we produce more plastic waste than is safe, but there are other, better places to cut down.",
                            "score": 35,
                            "author": "ClearBrightLight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hear you, but… no. This is for lazy people. Most grocery stores offer small scale prepared fruit done in house that meets the disabled need.",
                                    "score": 339,
                                    "author": "asterios_polyp",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is it more efficient to do it in house?\n\n  \n\n\nLike, it's more efficient to have most of our eggs layed and shipped out of 8 facilities or whatever in the US, though it's less resilient in terms of supply chain and disease, thats more efficient than having chickens in 1/5 backyards.\n\n  \n\n\nI agree that paying some kid minimum wage to slice open a pineapple might seem easier than having a facility where we package them, but is that 1 kid per grocery store going to be able to do so in a more cost effective manner than this factory?\n\n  \n\n\nAre they going to be able to actually use less plastic than the factory? Or are they going to use a transparent clamshell package that uses the same or more plastic and isn't recyclable in that municipality anyways etc etc.\n\n  \n\n\nThey aren't packing those pineapples at the grocery store in anything different, and if it is different it's MORE wasteful.\n\n  \n\n\nYou can judge and decide it's for lazy people all you want, but that doesn't change the realities of the world we live in. This facility \"meets the disabled need\" more efficiently and cost effectively than the kid slicing up produce at Safeway.",
                                            "score": -44,
                                            "author": "sparhawk817",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; more efficiently\n\nThat's the bit you're conveniently ignoring. This machine is putting out 10x the single-use plastic as the kid at the grocery store. Is the kid less efficient from a work perspective? Yes.\n\nThat means the machine 10x as efficient at putting out waste, too.\n\nThere's literally no good justification for products like this beyond the corporate standpoint.",
                                                    "score": 70,
                                                    "author": "intarwebzWINNAR",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No it's literally using LESS plastic waste. Weigh it out by gram, I guarantee you.\n\n  \n\n\nI actually addressed that in my original comment. Which you conveniently ignored.",
                                                            "score": -34,
                                                            "author": "sparhawk817",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The issue with your argument is the assumption that we need to mass produce this product and it’s plastic waste to serve the disabled market. We don’t. The market for people that need a product like this is very small. I’m not denying it exists, but this level of production is not justified. This level of production is required for mass market adoption - where it is not needed, but used for convenience, at the expense of the environment. A high schooler chopping fruit is a more appropriately sized scale for the limited disabled market - probably get a fresher product as well. Per unit, yes, small scale choppers most likely use more plastic. But for all product, not even close. This is a solution in search of a problem that is highly destructive. And not just in the direct plastic. Think about the logistics of processing and moving that product around - instead of going straight from the airport or dock to a DC and then store, the fruit must go to a processing plant, where workers that drive to that processing do the work. Then it needs to be refrigerated to the DC and then to market. The carbon footprint of food is heavily tipped towards the last mile - the boat is extremely efficient, the trucks not so much. Limiting truck time is critical to a comprehensive carbon reduction plan. \n\nEquity is ideal. I just think we need to really understand the problem we are trying to solve and not rely on late stage capitalism to give us the answer.",
                                                                    "score": 45,
                                                                    "author": "asterios_polyp"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don't understand your argument.\n\nThe clamshell at the grocery store is somehow more plastic than the clamshell from the factory?\n\nAnd somehow, the grocery store clamshell is not recyclable in that area, but the clamshell being shipped in from hundreds of miles away is recyclable in the hundreds of regions the factory ships to?\n\nIt's obvious that a worker at a grocery store is clearly making less waste than this factory. Grocery stores have more control over how many pineapples they prepare like this for shelving, it's often fresher, and they can work with local governments to figure out a recyclable solution for their packaging. \n\nA factory hundreds of miles away shipping clamshells to hundreds of different jurisdictions isn't doing that.",
                                                                    "score": 17,
                                                                    "author": "ShrimpFriedMyRice",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Rotisserie chicken is popular.   Some stores use clam shell plastics and others use paper type bags with a see through thing.  California here.  Both will need proper bagging to take home.  Why do some places choose the plastic way? I don’t know.",
                                                                            "score": 3,
                                                                            "author": "DavidNipondeCarlos",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "A lot of it comes down to cost vs. company image. A company like Whole Foods will use minimally invasive packaging even though it costs more because it works with the company image. Other chains can’t justify the cost of the packaging, or aren’t worried about their image on that front:",
                                                                                    "score": 3,
                                                                                    "author": "intarwebzWINNAR",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "That factory is making way more single use plastic-wrapped pineapple spears in one day than the entire disabled pineapple eating market consumes in a year. You're kidding yourself if you think this factory caters to the disabled. It's probably a fraction of a fraction of 1% of their addressable market.",
                                                    "score": 21,
                                                    "author": "Kev-bot"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I completely disagree.  Take the first product in the video, a small pineapple spear individually wrapped in plastic.  A disabled or abled person would need 10 of these for any sort of dish, and multiple just for a snack.  Its simply not practical for any end customer.  It’s a ridiculous packaging concept and should be illegal.",
                                    "score": 91,
                                    "author": "CityForAnts"
                                },
                                {
                                    "level": 3,
                                    "comment": "Plastic packaged pineapple rings are a waste no matter how you slice it. The original comment is not arguing that pre-sliced food is for lazy people; nor is the one you're replying to. Other comments have said this, and indeed they're wrong on that front. However...\n\nA disabled person able to open a plastic package is also able to open a tin can, where they can pick up a single slice from the tin can if they need it. The tin can is infinitely less wasteful than plastic and often reusable and recyclable.\n\nLet's do away with plastic packaged shit.",
                                    "score": 25,
                                    "author": "CimmerianHydra",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;A disabled person able to open a plastic package is also able to open a tin can,\n\nExcept tinned pineapple doesn't taste the same. (Edit: the pineapple in the video tastes more like fresh than canned.)\n\nDo you also feel the same way about poor people living in a food dessert? \"It's okay (Edit: if they don't have fresh produce) because they have cans?\"",
                                            "score": -2,
                                            "author": "In-burrito",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also, food desserts are a completely different issue.  Conflating them with the needs of disabled people is bad faith.",
                                                    "score": 3,
                                                    "author": "vaxxx_me_daddy",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Except tinned pineapple doesn't taste the same. \n\nWhat on earth are you talking about. There's nothing wrong with canned pineapple, it's delicious. How is pineapple is a plastic bag better in any way.",
                                                    "score": 8,
                                                    "author": "dimmidice",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Do you also feel the same way about poor people living in a food dessert? \"It's okay because they have cans?\" \n\nI don't understand this. Are you shaming him for thinking poor people could eat pineapple out of a can just as easily as a plastic bag? Why could they not? What would be wrong with this?",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "With the money saved by buying fresh, whole pineapple, they can pay the neighbor kid or caregiver a dollar to slice it for them.  You've never spent a day with a disabled person lol.\n\nEdit: Source: I am a disabled person living where rent is cheap.  Fuck all your downvotes.",
                                                    "score": -4,
                                                    "author": "vaxxx_me_daddy"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There are always other places to cut down. And all of those places are pointing the finger at plastic. At the end of the day, they all gotta go.\n\nBack on topic, disabled folks can't push a button on an automatic can opener? I know it's $10 but that's maybe the absolute least of their expenses.",
                                    "score": 26,
                                    "author": "VirinaB"
                                },
                                {
                                    "level": 3,
                                    "comment": "None of those things are done specifically for disabled people.  It is an unexpected benefit.",
                                    "score": 15,
                                    "author": "Ok-Cut4890",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that's how universal design works in general though?",
                                            "score": 5,
                                            "author": "AlexeiMarie"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; A friendly, gentle reminder that a lot of products people think are stupid or made for lazy people are actually targeted at the disabled. \n\nGet the fuck out of here. This is not aimed at disabled people. Disabled people would buy slices in a can. They'd have specialized tools to help them open those cans.",
                                    "score": 12,
                                    "author": "dimmidice"
                                },
                                {
                                    "level": 3,
                                    "comment": "I like the packaging for continental breakfast at hotels, my experience.  Even the tiny bitters and jam seem safer for sanitation reasons.  You can grab items for later use without needing a kitchen.  Does this justify the pineapple plastics? I don’t know.  It used to be one of my favorite fruits until I started to limit daily sugars.  If they can pull this off with coconuts, I’m good.",
                                    "score": 4,
                                    "author": "DavidNipondeCarlos"
                                },
                                {
                                    "level": 3,
                                    "comment": "Lmfao you can’t be serious.",
                                    "score": 4,
                                    "author": "chostax-"
                                },
                                {
                                    "level": 3,
                                    "comment": "What's wrong with putting it in a can?",
                                    "score": 2,
                                    "author": "Kev-bot"
                                },
                                {
                                    "level": 3,
                                    "comment": "They can use metal cans, the local store can prepare in house without all this waste. This is for the lazy.",
                                    "score": 1,
                                    "author": "radicldreamer"
                                },
                                {
                                    "level": 3,
                                    "comment": "I tried some of those packaged hard boiled eggs once and they were horrendous.",
                                    "score": 1,
                                    "author": "AspiringPants"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The problem isn't the individual cost of the plastic or whatever. Straight banning something like this is both difficult and illiberal.\n\nIf you internalize the negative externalities here (plastic waste, co2 production, etc) then the consumer can make an educated choice (educated in that, they know the full cost of the convenience) about whether they want to pay extra for the extra convenience and packaging.",
                            "score": 1,
                            "author": "gburgwardt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don't buy it and they won't sell it.",
                    "score": 18,
                    "author": "Sylens_Dies_in_Space",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At one point the companies should take some responsibility instead of completely killing the planet for money.",
                            "score": 17,
                            "author": "Criticalfailure_1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just tax [Carbon|Plastic waste] appropriately to internalize the negative externalities of this sort of thing.\n\nThrowing blame doesn't make sense when there are unaccounted for externalities out there",
                                    "score": 6,
                                    "author": "gburgwardt"
                                },
                                {
                                    "level": 3,
                                    "comment": "They wouldn't sell it if you didn't buy it. At some point people should take some responsibility instead of completely killing the planet for convenience.",
                                    "score": 4,
                                    "author": "Sylens_Dies_in_Space",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "While true, you're not considering people in food desserts often don't have options for \"fresh\" fruits and vegetables.  In a profit-driven economy with a largely compliant population, it is usually less expensive to manufacture consent via marketing if it keeps the per-unit cost low with a high shelf-life, and therefore higher probability of portionate sale (individually-wrapped pineapple slice) on a single source item (the pineapple).",
                                            "score": 2,
                                            "author": "vaxxx_me_daddy"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "At one point the companies should take some responsibility instead of completely killing the planet for money.",
                                            "score": -1,
                                            "author": "giulianosse",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They wouldn't sell it if you didn't buy it. At some point people should take some responsibility instead of completely killing the planet for convenience.\n\nPersonal responsibility isn't that difficult.",
                                                    "score": 1,
                                                    "author": "Sylens_Dies_in_Space",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not to mention the pineapple waste whenever you have a larger-than-standard-size pineapple.",
                    "score": 2,
                    "author": "Sutarmekeg"
                },
                {
                    "level": 1,
                    "comment": "My roommates buy these. I can't even. I've told them so many times that it's cheaper and only slightly less convenient to buy whole pineapples. I even taught them how to properly cut and clean pineapples. But no, fuckers will just buy plastic garbage.",
                    "score": 3,
                    "author": "FlippedMobiusStrip",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s also got to taste better too. I can’t imagine a pineapple sitting in a plastic bag is going to be that great.",
                            "score": 3,
                            "author": "Criticalfailure_1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No reason for it to taste worse though",
                                    "score": 1,
                                    "author": "gburgwardt",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s a real shame I know.",
                            "score": 2,
                            "author": "Criticalfailure_1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Glad I'm not the only one frustrated by this.",
                    "score": 1,
                    "author": "drunkboarder"
                },
                {
                    "level": 1,
                    "comment": "Not to mention all the parts that were gone with the skin of the fruit. B(",
                    "score": 1,
                    "author": "Two2twoD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That will probably be used somehow. Either crushed for juice or processed otherwise. I’m not upset by the automation of it and that it’s just all that packaging.",
                            "score": 1,
                            "author": "Criticalfailure_1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to work at a pineapple factory but now I'm on the dole.",
            "score": 185,
            "author": "Kangar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Get out",
                    "score": 21,
                    "author": "imjusta_bill"
                },
                {
                    "level": 1,
                    "comment": "That's ananas!",
                    "score": 12,
                    "author": "apathy-sofa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's crazy how much plastic is used for things that initially don't need any covering, only for the sake of convenience.",
            "score": 137,
            "author": "Big-Hairy-Gooch",
            "replies": [
                {
                    "level": 1,
                    "comment": "You should look at some of the stuff Japan does. It’s crazy the amount of plastic they use",
                    "score": 12,
                    "author": "mv777711"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why they circumcised the pineapples?!",
            "score": 9,
            "author": "Void_walk3r",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why plastic instead of cans? I vaguely remember pineapple in cans and for like, most of the video I was like \"oh that's why it is cans, it is  basically a perfect shape and size after being cut- NOPE. PLASTIC. LOADS OF PLASTIC.",
            "score": 8,
            "author": "SirCabbage",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ya. You could use cans with disability friendly opening mechanisms.",
                    "score": 2,
                    "author": "ifandbut"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like the person grabbing the rings:  “5 for you and 1 for me,  4 for you and 1 for me.”",
            "score": 21,
            "author": "jhoover58"
        },
        {
            "level": 0,
            "comment": "P l a s t i c",
            "score": 10,
            "author": "DoublePostedBroski"
        },
        {
            "level": 0,
            "comment": "It’s a weird mix of humans and machines. There are some jobs the people are doing that should for sure be done by the machines and Vice versa",
            "score": 17,
            "author": "EIephants",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always think about this when I see these kind of videos. \nThrough the lens of capitalism, I would assume the areas we use human labor is simply cheaper than the creation and maintenence of machines that could do their job.",
                    "score": 7,
                    "author": "Not_a_doctor_shh12"
                },
                {
                    "level": 1,
                    "comment": "I’m curious which steps should be done by humans instead of machines",
                    "score": 3,
                    "author": "Comfortable_Relief62",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "/u/EIephants \n\nI program assembly lines for a living. Here is my 2c\n\nCutting the bad spots after coreing and skining it: Use vision process to identify products with spots that need trimming. Robot arm pick to cutter.\n\nVertical Slicing: Easy, robot pick using center of product, place on existing cutting tools, press down to cut previous one.\n\nPlacing one at a time in package: Reasonably easy to use a feeder mechanism to load the product into package.\n\nHorizontal slicing: Just a little more complex than vertical slicing.\n\nLoad into plastic packaging, transfer packaging to sealing machine: Easy.",
                            "score": 3,
                            "author": "ifandbut"
                        },
                        {
                            "level": 2,
                            "comment": "When I wrote the comment I couldn’t actually think of one either lol",
                            "score": 1,
                            "author": "EIephants"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ya, that line could have way more automation than it does. The picking and slicing would be easy, especially since the product comes with a handy standard hole to pick.",
                    "score": 1,
                    "author": "ifandbut"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wtf, people are so lazy. It comes in a perfectly awesome biodegradable container. But people won't eat it if the decision is made on \"involves some work\".",
            "score": 54,
            "author": "blokess"
        },
        {
            "level": 0,
            "comment": "r/anticonsumption would like a word",
            "score": 20,
            "author": "EL_Jefe510",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sub is so disappointing.\n\n\"were against consumption!\"\n\n\"should we not consume something?\"\n\n\"no! It's impossible! Capitalism is the real problem\"\n\nLike... great. A potentially enjoyable sub overtaken by the leftist circlejerk",
                    "score": 3,
                    "author": "10art1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "so much plastic :(",
            "score": 14,
            "author": "dumnezero"
        },
        {
            "level": 0,
            "comment": "I need this done to my brain",
            "score": 3,
            "author": "kaden_istoxic"
        },
        {
            "level": 0,
            "comment": "I can smell this video.",
            "score": 3,
            "author": "thickonwheatthins"
        },
        {
            "level": 0,
            "comment": "Thank you for all the unnecessary plastic!",
            "score": 14,
            "author": "gazing_the_sea"
        },
        {
            "level": 0,
            "comment": "Fuck all that packaging. Just buy a pineapple you bastards",
            "score": 10,
            "author": "belizeanheat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or at least canned pineapple.",
                    "score": 6,
                    "author": "guambatwombat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Aluminum isn't exactly the most environmentally friendly material either",
                            "score": 1,
                            "author": "nevlis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can at least be sure it will be recycled if you put it in a recycling bin. That's more than good enough",
                                    "score": 2,
                                    "author": "belizeanheat"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If people did, this product wouldn't exist. Many people will literally not eat food that takes any bit of effort to consume, to the point that this industry exists.",
                    "score": 2,
                    "author": "10art1",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wonder how many people have been fired for that.",
                    "score": 1,
                    "author": "StrawberryMoonPie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Too many or too little, no amount is correct",
                            "score": 2,
                            "author": "Endermanplayer7_1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "thats horrifying.\n\nthey come in a skin that protects and preserves them WHY ARE YOU TAKING IT OFF TO PUT PLASTIC ON.",
            "score": 2,
            "author": "notHooptieJ"
        },
        {
            "level": 0,
            "comment": "With all the modified fruit out there I'm shocked no one has gotten a pineapple variant that could be peeled easily by hand. \n(Before \"GMO bad\" almost every fruit we eat was bred and modified to not have huge seeds, be easier to peel, etc.)",
            "score": 2,
            "author": "rolfraikou"
        },
        {
            "level": 0,
            "comment": "What a waste of plastic and production. \n\nJust load the pineapple directly into my mouth and you could save so much time!\n\nOr onto my pizza, either would be acceptable.",
            "score": 2,
            "author": "Ghostbuster_119"
        },
        {
            "level": 0,
            "comment": "So that's why the pineapple containers are always sticky. They touch the pineapple then the outside of the carton.",
            "score": 2,
            "author": "geauga1"
        },
        {
            "level": 0,
            "comment": "Since they stopped using Hawaiian pineapples, the pineapple is so sour.",
            "score": 2,
            "author": "fabshelly"
        },
        {
            "level": 0,
            "comment": "Please someone remaster this with cartoon eyes and flailing arms screaming in pain. With many funny captions. I have no such skills",
            "score": 2,
            "author": "zorclon"
        },
        {
            "level": 0,
            "comment": "There is room for more automation.",
            "score": 2,
            "author": "Arteyp"
        },
        {
            "level": 0,
            "comment": "Like 5 top comments are complaining about plastic... Dudes, if people bought it while it wasn't in plastic stores would sell it as is. Most people want pre-cut pineapples because they're a huge pain to cut. Only a few would take the time to prepare those things.",
            "score": 8,
            "author": "sheepyowl",
            "replies": [
                {
                    "level": 1,
                    "comment": "The ableism is astounding. If disabled people can’t cut open a pineapple they can just deal with canned (which isn’t fresh pineapple). Nobody’s going to eat just one pineapple spear (because people only eat a ton of pineapple and don’t mix it with different fruit or only want a small snack). Individual packs will stay fresh longer with less waste than if you ate a few pieces from a large portion of fruit that’s now going bad because it’s opened. \n\nLike those bags of sliced apples stay fresh and actually get eaten. \n\nThe packaging definitely should be more biodegradable, but there’s less waste when produce is prepared like this in large facilities. The fruit is taken from the farm to the plant and is packaged then transported to stores. Instead of the fresh whole pineapples being transported all over the world when about 1/4 weight isn’t even edible and will have to be thrown out. The stores have to deal with cutting the pineapple up or watching it rot because people don’t want to deal with a whole pineapple. \n\nEvery store in every town in the US cutting their pineapple up and dealing with the waste is going to have a much bigger environmental impact than a pineapple company having all their pineapple processed at their facilities. The facilities probably have a earth friendly way to deal with the waste, too. Compost or animal feed. Something all grocery stores aren’t going to deal with.",
                    "score": -14,
                    "author": "savvyblackbird"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People defending this im sorry to tell you, but the grocery stores can do the same and put it on a recyclable bag. This kind of food is stupid to put that amount of plastic. Seriously, 3 fucking slices of pineaple in a bag?! But hey, if you are criticizing this and are one of those that buy bottles of water, you are part of the problem.",
            "score": 4,
            "author": "gergi88"
        },
        {
            "level": 0,
            "comment": "I should call her",
            "score": 2,
            "author": "Benis_Gobbler"
        },
        {
            "level": 0,
            "comment": " See AI isn’t taking those people’s jobs. Nubbin cutters are safe.",
            "score": 2,
            "author": "gravitywind1012",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nope. Dont even need AI to replace 90% of the jobs shown. I could replace them in a few months and a couple of robots.",
                    "score": 1,
                    "author": "ifandbut"
                }
            ]
        },
        {
            "level": 0,
            "comment": "/r/oddlysatisfying",
            "score": 1,
            "author": "Flat-Excitement7694"
        },
        {
            "level": 0,
            "comment": "I will put my dick in the pineapples. Every single one of them",
            "score": -2,
            "author": "Aliciathetrap",
            "replies": [
                {
                    "level": 1,
                    "comment": "Careful friend, [pineapples have an enzyme](https://www.thespruceeats.com/flesh-eating-enzymes-of-pineapple-and-papaya-4047013) that eats you back",
                    "score": 5,
                    "author": "JerseyDevl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't you threaten me with a good time.",
                            "score": 6,
                            "author": "Not_a_doctor_shh12"
                        },
                        {
                            "level": 2,
                            "comment": "I see that as an absolute win",
                            "score": 3,
                            "author": "Aliciathetrap"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A guy comes home early from work. He looks ashen faced, and his wife asks what's wrong and why is he home early. He says he stuck his dick in the pineapple slicer at work. His wife is shocked and asks what happened. He says he got fired. His wife says no, I mean what happened when you put your dick in the pineapple slicer. He says Oh, they fired her too.\n\n&amp;#x200B;\n\nEdit: Original joke is a pickle slicer, but this reminded me of the joke.",
                    "score": 9,
                    "author": "Chatty_Monkey_Don"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I find it surprising that not more of the process is automized. If you can automize peeling the pineapple, then why can you not automize slicing it?",
            "score": 1,
            "author": "DrainZ-",
            "replies": [
                {
                    "level": 1,
                    "comment": "I imagine that when the video was made, it was cheaper to use humans instead of robots at those stages of the line. So, it's likely it was not due to technical limitations.",
                    "score": 1,
                    "author": "In-burrito"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shame there's not already a convenient natural packaging already on fruits and vegetables.  Good thing there's all those plastic wraps.",
            "score": -1,
            "author": "Level-Engineering-11"
        },
        {
            "level": 0,
            "comment": "Reminds me of the banana vending machine. Each individually wrapped in plastic",
            "score": 1,
            "author": "guttergrapes"
        },
        {
            "level": 0,
            "comment": "**Always remember:** *as soon as you put a piece of pineapple in your mouth, it starts to attack you*.",
            "score": 1,
            "author": "ryanasimov"
        },
        {
            "level": 0,
            "comment": "Imagine doing that for 8 to 10 hours a day.",
            "score": 1,
            "author": "Bollerkotze"
        },
        {
            "level": 0,
            "comment": "At least in Germany those pineapple slices are canned - cans are a lot easier to recycle than plastic.",
            "score": 1,
            "author": "I_am_Nic"
        },
        {
            "level": 0,
            "comment": "You are suppose to eat the whole thing like an apple just not the green part",
            "score": 1,
            "author": "MacMuffington"
        },
        {
            "level": 0,
            "comment": "https://tegram.me/xxxg4842OTE8Zhxb7",
            "score": 1,
            "author": "Right-Ad838"
        },
        {
            "level": 0,
            "comment": "Tongue's itching just watching that",
            "score": 1,
            "author": "lloydjackson1985"
        },
        {
            "level": 0,
            "comment": "Dude it takes pineapples like a decade to grow if you can't do all that in your kitchen with a knife in 5 seconds you don't deserve pineapple",
            "score": 1,
            "author": "No_Release_1337"
        },
        {
            "level": 0,
            "comment": "I love pineapple",
            "score": 1,
            "author": "Kitchberg"
        },
        {
            "level": 0,
            "comment": "Could you imagine doing this without gloves?",
            "score": 1,
            "author": "DroidLord"
        },
        {
            "level": 0,
            "comment": "Wouldn’t it be great if those pineapple came in protective layer that wasn’t plastic? /s",
            "score": 1,
            "author": "Blitz6969"
        },
        {
            "level": 0,
            "comment": "Anyone who doesn’t own a pineapple corer is a chud",
            "score": 1,
            "author": "IS_JOKE_COMRADE"
        },
        {
            "level": 0,
            "comment": "Is this the Pineapple Express?",
            "score": 1,
            "author": "mrlouiep"
        },
        {
            "level": 0,
            "comment": "That thing cuts 45 in the time it takes me to cut one by hand.",
            "score": 1,
            "author": "nrossj"
        },
        {
            "level": 0,
            "comment": "Brooooo why the fuck remove the middle?",
            "score": 1,
            "author": "TheMoises"
        },
        {
            "level": 0,
            "comment": "So much plastic r/anticonsumption",
            "score": 1,
            "author": "supsup202288"
        },
        {
            "level": 0,
            "comment": "So needlessly cruel. What a horror show. This is why I’m a vegetarian!",
            "score": 1,
            "author": "kribensis"
        },
        {
            "level": 0,
            "comment": "Why is there still human in the loop? At least some of those actions could be automated, so I wonder why they aren’t with all the drive to lower costs.",
            "score": 1,
            "author": "islandRaised"
        },
        {
            "level": 0,
            "comment": "\"How was work today, honey?\"\n\nNine hours sticking the pinussy in the dildo cutter, non stop.",
            "score": 1,
            "author": "Lesson333"
        }
    ]
}