{
    "id": "12euy4n",
    "score": 11075,
    "title": "Wiring connection tips.",
    "author": "Mo_Jack",
    "date": 1680892876.0,
    "url": "https://www.reddit.com/r/educationalgifs/comments/12euy4n",
    "media_urls": [
        "https://i.redd.it/q3jnfq4vbisa1.gif"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The 16 second mark... Wtf even is that??\n\nEdit: fixed the mark from 30 seconds to 16 seconds (stupid gifs counting down not up)",
            "score": 250,
            "author": "vulcansheart",
            "replies": [
                {
                    "level": 1,
                    "comment": "Talking about preloading some Teflon tape on a pencil for hard-to-reach spots? \n\nA good idea, that's what that is.",
                    "score": 132,
                    "author": "RichardStinks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Let me correct my previous comment. It's 30 seconds left on the slide but really it's about 16 seconds into the gif. Two green wires with loops and tails already in them",
                            "score": 52,
                            "author": "vulcansheart",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The two green stranded wires being spliced? That's a crimp connector with heat shrink tubing on top.  Also called a \"butt splice,\" IIRC.",
                                    "score": 37,
                                    "author": "RichardStinks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No, the two green wires immediately following the crimp connector",
                                            "score": 35,
                                            "author": "vulcansheart",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think it’s a Lineman’s Splice https://en.wikipedia.org/wiki/Western_Union_splice",
                                                    "score": 22,
                                                    "author": "DocZoidfarb",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Except the lineman’s splice is shown merging two blue wires in the lower half of the second animation. The one they’re talking between the two green wires has two full interconnected loops initially that aren’t shown in the diagram on the Wikipedia page",
                                                            "score": 20,
                                                            "author": "Evil-Dalek",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Looks like a fisherman's knot to me, but on copper wires. Don't know if it has history or name on the trades. But it's the same concept, symmetrical reciprocating loops, good tug resistance, so it might be useful to splice wire that will be moved about regularly or in general handled frequently.",
                                                                    "score": 8,
                                                                    "author": "stringdom"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Looks to be basically a square knot with the tails wrapped around.",
                                                                    "score": 1,
                                                                    "author": "finlshkd"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Learned that one in Wichita.",
                                                            "score": 8,
                                                            "author": "RichardStinks"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It’s annoying that they put two light green wires right before the two dark green wires that you are asking about. It creates a good deal of confusion.",
                                                    "score": 3,
                                                    "author": "KaleidoscopeKey1355"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Western Union splice.",
                                                    "score": 1,
                                                    "author": "SheriffBartholomew"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Except it's on backwards. You hold the fitting in your left hand and roll it away from you. Otherwise the tape comes off when you thread the fittings together.",
                            "score": 6,
                            "author": "Content_Command_479"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "1. Make bent loop with one wire \n2. Feed other wire through loop\n3. Wrap wire around both ends of loop \n4.Pull wire back through loop\n\nEdit:\nEnd result is same as this, but this video \"cheats\" by using the other end of the string.\nhttps://youtu.be/d67kPqUYRC0",
                    "score": 11,
                    "author": "FrysGrandpa"
                },
                {
                    "level": 1,
                    "comment": "Yeah, I had to slow the video down at that 16- second mark, because it didn't make sense. When slowed down, the wires cross over and render through each other, and so it's not possible to do what is shown in our current known universe.  \nMaybe when they get better at their CGI skills (and electrical design) they can share better tips.",
                    "score": 20,
                    "author": "superdupersecret42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This was my thought exactly. \"That's not physically possible\"",
                            "score": 5,
                            "author": "vulcansheart"
                        },
                        {
                            "level": 2,
                            "comment": "Just stick the wire through and loop it back out? Looks possible to me.",
                            "score": 6,
                            "author": "FuckTheMods5"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It would keep them from being pulled apart I guess.",
                    "score": 1,
                    "author": "TotalWalrus"
                },
                {
                    "level": 1,
                    "comment": "Heat shrink?",
                    "score": 1,
                    "author": "Twad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The two stranded green wires after the heat shrink",
                            "score": 2,
                            "author": "vulcansheart"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most of these wouldn't make it past QA if I tried them",
            "score": 705,
            "author": "BubbaYoshi117",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actually the third one is a legit cable jointing method for Low Voltage electrical cables.",
                    "score": 52,
                    "author": "chavenz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep. Its used frequently for splices in 12V DC harnesses in the automotive industry (though not that style of crimp tool).  The only thing missing is strain relief, but the need for that depends largely on where the harness is going.\n\nAdding to your comment - None of the other “wrapping” style joints should be used for anything permanent, critical, or in a harsh environment (vibe, exposure, etc.) those 90-180 degree bends and tight wraps aren’t ideal for those conditions and will be a weak point in the joint. A good electrical joint is like a good weld - it should fail the material around it, not the weld/joint itself.",
                            "score": 11,
                            "author": "20Factorial"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There's no one I hate more than Quentin Amadeus.",
                    "score": 136,
                    "author": "_stoneslayer_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Typical Quentin Amadeus",
                            "score": 18,
                            "author": "tyrannosnorlax"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One was almost how NASA preps for soldering but then they twisted the other end too lol",
                    "score": 10,
                    "author": "Oldamog"
                },
                {
                    "level": 1,
                    "comment": "What do I do? Really, what do I do here? I should have written it down. Qua-something. Qua... Quar... Qua... Qual... Quar... Quabity. Quabity assuance. No, no, no, no, but I'm getting close.",
                    "score": 2,
                    "author": "IWorkForTheEnemyAMA"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As electronics technician it pains to watch this garbage, but mainly for magical shrink tube which appeared (i assume) using teleportation on the wire AFTER the connection was made.",
            "score": 141,
            "author": "agisten",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a non-electrician, what are the bad ideas besides the magical tube? I'd assume some are just needlessly overdone, but can do the job.",
                    "score": 10,
                    "author": "zrooda",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The magical tube appearing out of nowhere is not even that bad.. You just insert it on one of the cable before making the connection and slide it when you're done.\n\n\nAs an electrician by formation only, I will say that those are not solid enough. The way I learn to make connections is easier and generally just as solid, but we also add a plastic cap that will strengthen the connection and make a proper protection for the other wires and their current: putting tape on those is not enough and not up to code.\n\n\n\nHowever, I know that in electronic, the regulation are often more permissive, and smaller wire also make a difference. I have no idea how that T connection will be secured properly though.",
                            "score": 3,
                            "author": "Gusstave",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "None of these connections would work (long term) without a soldering.",
                                    "score": 2,
                                    "author": "agisten"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just came to see where the pissy electrical engineers are.",
            "score": 22,
            "author": "WhtnBlk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Present",
                    "score": 7,
                    "author": "psaux_grep"
                },
                {
                    "level": 1,
                    "comment": "Heyo",
                    "score": 3,
                    "author": "King-Archdemon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Using a smaller rod to roll and unroll tape in a tight spot is such a great idea instead of me just having the precut tape dangling all over.",
            "score": 46,
            "author": "knsaber",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's too bad they wrapped it the wrong direction though",
                    "score": 13,
                    "author": "Mason9513",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Obviously it's meant to be left hand thread",
                            "score": 3,
                            "author": "OneSoggyBiscuit"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Use a Wago and be done with it.",
            "score": 160,
            "author": "CommentOne8867",
            "replies": [
                {
                    "level": 1,
                    "comment": "It all depends on size and application.\n\nI use method 1 in medical device r&amp;d work where im required to splice a pacemaker lead. It has to have minimal diameter change and 0 chance of shorting between wires.\n\nThe actual clincal use of the design uses method 3 here, the crimping (though much more controlled).\n\nNothin wrong with demonstrating different methods. Wires go in all sorts of things with all kinds of sizes. Wago may be great for wiring a house but completely unsuitable for other things.",
                    "score": 31,
                    "author": "Fancyman-ofcornwood",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can’t imagine wiring a pace maker with Wago",
                            "score": 3,
                            "author": "psaux_grep",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*slaps patient*\n\nHeart surgeon: “That connection there will pass SO MUCH current.”",
                                    "score": 2,
                                    "author": "trastasticgenji"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yeah i was gonna say something to the same effect. practically speaking, virtually none of these would ever be useful to anyone in a trade job who knows what tools and equipment to have on hand. it's no different than those bizzare chinese tiktok \"hacks\" where the guy says \"the design is very human\"",
                    "score": 63,
                    "author": "poodles_and_oodles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pretty sure those ”hacks” are jokes (unlike this gif).",
                            "score": 6,
                            "author": "Unlicenced"
                        },
                        {
                            "level": 2,
                            "comment": "The western union was fairly popular for a while.",
                            "score": 3,
                            "author": "ActualWhiterabbit"
                        },
                        {
                            "level": 2,
                            "comment": "Regular people who just need to be able to securely connect two damn wires without going out and buying trade level equipment don’t exist clearly.",
                            "score": 15,
                            "author": "dnaH_notnA",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This trade level equipment is perhaps $1 at your local hardware store and vastly less fiddly than trying to tie a knot with wires.",
                                    "score": 39,
                                    "author": "light-chaser",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "$1 a piece for the ideal lever-nuts at Home Depot, and I bought a $40, 80 piece assortment of wago lever nuts off Amazon. Well worth it to keep your house from burning down.\n\nThe cheap-ass copper clad aluminum \"wires\" that are on light fixtures from the box stores these days are too difficult to reliably connect to solid 12 or 14 awg.",
                                            "score": 15,
                                            "author": "Liquid_Schwartz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They look way more reliable/safe than regular wire-nuts. I worked at an electrical supply store for a few years and never knew what those things were until seeing your comment and finally taking the time to google it, lol",
                                                    "score": 2,
                                                    "author": "kissmytastygrits",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's awesome! Bless you folks (and ex-folks) at the supply house. \n\nYou get some chain smoking curmudgeon shuffling in there at 6 am going \"Give me a box of apprentice plugs, 100 ft of smurf tube and 5 snake eyes.\" And you guys say...OK",
                                                            "score": 1,
                                                            "author": "Liquid_Schwartz"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Waygo connectors are more expensive than wire nuts, but they're also way less prone to misuse.",
                                    "score": 4,
                                    "author": "Sexual_tomato",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I fucking hate wire nuts. Even when you know what you’re doing they just feel like they could fall off if you look at them wrongly. \n\nGive me a Wago any day. I’ll gladly pay extra for the feeling of safety.",
                                            "score": 2,
                                            "author": "psaux_grep"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "https://www.homedepot.com/p/IDEAL-WingTwist-Assorted-Red-and-Yellow-Wire-Connectors-150-Pack-30-5152J/202956754",
                                    "score": 16,
                                    "author": "poodles_and_oodles"
                                },
                                {
                                    "level": 3,
                                    "comment": "Wire nuts are cheaper and easier than most of these methods",
                                    "score": 2,
                                    "author": "Gutsy_Bottle"
                                },
                                {
                                    "level": 3,
                                    "comment": "Posilock and positap connectors are life.  \n\nOld Honda motorcycle bullet connectors are hot trash.  Posilock and positap saved me from crappy autozone connectors. And you can just unscrew the connecions if needed.",
                                    "score": 2,
                                    "author": "puppyfukker"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Unfamiliar: is this the \"wago\" you are referring to?\n\nhttps://images.app.goo.gl/7UFfYertiDkjbUjs6",
                    "score": 4,
                    "author": "Kenji_03",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's them! I prefer the 221 vs the 222 but they do the same thing.",
                            "score": 5,
                            "author": "TheEdge7896",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "221 is the best.",
                                    "score": 1,
                                    "author": "onda-oegat"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For a house, sure. But Wago or other large connectors are impractical or entirely infeasible for smaller or denser wiring projects.",
                    "score": 11,
                    "author": "BuccellatiExplainsIt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In my experience, Wagos  take up little to no more room in even a single gang box than a twist-on wire nut. I use Wagos daily to terminate between 3-9 conductors in a 3/4\" T. \n\nI do prefer traditional wire nuts on anything smaller than 18 awg stranded though.",
                            "score": 4,
                            "author": "Liquid_Schwartz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wire nuts would be just as impractical in the scenarios I'm talking about. I'm all for Wagos over wire nuts, but they're most applicable for electrician work.",
                                    "score": 11,
                                    "author": "BuccellatiExplainsIt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah, gotcha. I'm used to having to explain wagos vs. wire nuts to the older generation of electricians.\n\nYou know, the \"new and different = scary and bad\" crowd.\n\nOut of curiosity, what application are you talking about? Robotics/aviation/automotive come to mind...",
                                            "score": 3,
                                            "author": "Liquid_Schwartz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not OP, but I use a ton of tiny wires for testing and diagnosing circuit boards. Often when I just need a one off power connection I’ll twist the wire together. Usually I just solder everything. From the looks of it most of the wiring I deal with could fit inside one of the wagos that you deal with. \n\nIf you are curious it is in the phone and tablet industry.",
                                                    "score": 4,
                                                    "author": "ask-about-my-dog",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh yeah, that makes total sense. Thanks!",
                                                            "score": 2,
                                                            "author": "Liquid_Schwartz"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Posilock and positap for automotive size or general low voltage.  Expensive, but amazing.",
                            "score": 1,
                            "author": "puppyfukker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Good if you're writing a house, but won't fit in a really small device.",
                    "score": 16,
                    "author": "privatetudor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why would I do any of those when I can just keep glooping solder on till it works?",
            "score": 42,
            "author": "MiamLitchell",
            "replies": [
                {
                    "level": 1,
                    "comment": "And heat shrink to hide just how bad you are at soldering.",
                    "score": 26,
                    "author": "Alter_Kyouma"
                },
                {
                    "level": 1,
                    "comment": "Soldering wires together doesn't create a good bond because the solder can slowly crawl and the connection loosens",
                    "score": 1,
                    "author": "Chained_Prometheus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "really? \n\ni usually do the 2nd (blue) method to splice wires. and then after twisting them about each other cover the whole thing in solder. \n\nhow would not using solder at all be better? there would be less contact area between the strands.",
                            "score": 3,
                            "author": "OneCat6271"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some of that was standard. the rest was pretty silly",
            "score": 28,
            "author": "salesforceonee"
        },
        {
            "level": 0,
            "comment": "This was so satisfying to watch",
            "score": 172,
            "author": "deezsandwitches",
            "replies": [
                {
                    "level": 1,
                    "comment": "The universe suddenly makes so much sense now.",
                    "score": 13,
                    "author": "YouStopLying"
                },
                {
                    "level": 1,
                    "comment": "Electronics technician here\n\n\nIt wasn't",
                    "score": 5,
                    "author": "Portfel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm actually mad now",
                            "score": 1,
                            "author": "NastyWatermellon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't need any of this information and yet I watched the whole thing twice.\n\n(actually that tape thing is pretty handy but I don't need the rest of it)",
                    "score": 3,
                    "author": "bugbia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "According to a few electricians that have chimed in on other comments, the tape ones are probably the only actual good advice",
                            "score": 5,
                            "author": "Operative427"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That pencil in a tight spot is an amazing idea, especially for taping threads.",
            "score": 14,
            "author": "AcousticOcean26"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 18,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sexy wire knotting!",
            "score": 3,
            "author": "sprocketous"
        },
        {
            "level": 0,
            "comment": "What is the distinction between red and blue in the second one?",
            "score": 3,
            "author": "G0DatWork",
            "replies": [
                {
                    "level": 1,
                    "comment": "The color",
                    "score": 6,
                    "author": "a_ninja_mouse"
                },
                {
                    "level": 1,
                    "comment": "One wraps both peices of wire around each other. The other wraps only one around the other and then folds the unwrapped wire over. The color is irrelevant",
                    "score": 2,
                    "author": "LogicCure",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I assume the red wire that wraps down adds a measurable amount of pull/movement resistance.  Particularly useful in low voltage electronics that have some level of vibrations or movement, especially after soldering, like car electronics, or DIY wearables.",
                    "score": 1,
                    "author": "wildcat-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was surprised to see the zip tie trick on here and it’s honestly the only one of these I use while wiring.",
            "score": 3,
            "author": "Superjerry7"
        },
        {
            "level": 0,
            "comment": "/r/oddlysatisfying",
            "score": 22,
            "author": "fermosquera69"
        },
        {
            "level": 0,
            "comment": "gogo gadget house fire",
            "score": 4,
            "author": "zPoot_"
        },
        {
            "level": 0,
            "comment": "I enjoyed watching this",
            "score": 10,
            "author": "dizziefrizzie"
        },
        {
            "level": 0,
            "comment": "u/redditspeedbot 0.5",
            "score": 3,
            "author": "sevargmas"
        },
        {
            "level": 0,
            "comment": "When does it stops ?",
            "score": 4,
            "author": "PogaSun"
        },
        {
            "level": 0,
            "comment": "I swear I’ve seen this gif reposted 10 times today in different subs.",
            "score": 4,
            "author": "anothermanscookies"
        },
        {
            "level": 0,
            "comment": "This needs a Royksopp soundtrack",
            "score": 2,
            "author": "a_ninja_mouse"
        },
        {
            "level": 0,
            "comment": "r/oddlysatisfying",
            "score": 2,
            "author": "warionooples"
        },
        {
            "level": 0,
            "comment": "In Germany we would say : PFUSCH",
            "score": 2,
            "author": "raybaroune",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes.\n\nr/DINgore\n\nEdit: oh, it's already there.",
                    "score": 1,
                    "author": "continius",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Here's a sneak peek of /r/DINgore using the [top posts](https://np.reddit.com/r/DINgore/top/?sort=top&amp;t=all) of all time!\n\n\\#1: [Notausgang in deutscher Schule](https://i.redd.it/lk3l3d4xa5pa1.jpg) | [101 comments](https://np.reddit.com/r/DINgore/comments/11xisz2/notausgang_in_deutscher_schule/)  \n\\#2: [Berufsgenossenschaft sagt nein](https://v.redd.it/txj1hh42wqna1) | [91 comments](https://np.reddit.com/r/DINgore/comments/11rdlvf/berufsgenossenschaft_sagt_nein/)  \n\\#3: [Berufsschule für Fertigungstechnik in München... so sehen Steckdosen aus](https://i.redd.it/r40sqs0vogqa1.jpg) | [137 comments](https://np.reddit.com/r/DINgore/comments/124f2d2/berufsschule_für_fertigungstechnik_in_münchen_so/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
                            "score": 1,
                            "author": "sneakpeekbot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "r/oddlysatisfying",
            "score": 2,
            "author": "Wirecreate",
            "replies": [
                {
                    "level": 1,
                    "comment": "I watched this twice before realising I wasn't on r/oddlysatisfying",
                    "score": 2,
                    "author": "AllyBrat69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol",
                            "score": 1,
                            "author": "Wirecreate"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Saving this for later knowing damn well that I will not need to wire anything 👍",
            "score": 13,
            "author": "Popcorn57252",
            "replies": [
                {
                    "level": 1,
                    "comment": "all of these are useless. twist and use a wire nut for big stuff or solder and heat shrink for little stuff",
                    "score": 33,
                    "author": "NoNazis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you're working with multistrand you should almost always use some kind of crimp connection with heat shrink.",
                            "score": 1,
                            "author": "OkCarrot89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "not sure what trade you work in but as electricians we use wire nuts on stranded all the time, unless landing to lugs.",
                                    "score": 10,
                                    "author": "NoNazis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Automotive and other low voltage. When you have equipment vibrating and exposure to moisture it's much better to have a crimp and sealed connection rather than solder or wire nuts.",
                                            "score": 9,
                                            "author": "OkCarrot89",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "that definetly makes sense",
                                                    "score": 4,
                                                    "author": "NoNazis"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "What kind of crimp connectors do you use? Everytime I buy some, I feel like they're cheap and hard to get a good crimp.",
                                                    "score": 1,
                                                    "author": "UnfitRadish",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I use different kinds. I like the heat shrink butt connectors off of Amazon, I have a kit of various different size bare butt connectors that I use with heat shrink with glue in it.\n\nI use a pair of ratcheting crimpers that really crimp down, make sure you're using the correct size crimpers for the connector you're using.",
                                                            "score": 1,
                                                            "author": "OkCarrot89",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah I'm pretty sure I'm not using great crimpers and using really cheap crimp connectors. I usually avoid the heat shrink connectors because I always mess up the heat shrink while crimping them. So I'll use crimp connectors with heat shrink tubing. You have any particular recommendations for crimping tools or should I get an off brand from Amazon? Same goes for connecter sets, any recommendation? I'm getting ready to rewire a boat and will need some. Of course I'll be getting marine grade for everything.",
                                                                    "score": 1,
                                                                    "author": "UnfitRadish"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The first one looks pretty nice though",
                            "score": 1,
                            "author": "Popcorn57252"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same here",
                    "score": 1,
                    "author": "dingusfett"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What tiny-ass leprechaun hands are you all using to tie these wires together? My stupid fingers can barely hold the intact wire nevermind twisting the individual copper",
            "score": 3,
            "author": "MartiniD"
        },
        {
            "level": 0,
            "comment": "I know there are better techniques/machines that will do this more efficiently nowadays but it's crazy that most old wiring is hooked up like this, just getting copper to touch. Electricity really is just a form of magic that we've made into a science.",
            "score": 4,
            "author": "Tietonz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just about all wiring is \"just getting metal to touch\". From putting a plug in a socket all the way down to soldering, it's basically the same thing.",
                    "score": 2,
                    "author": "arienh4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never do that, just use wagos.",
            "score": 3,
            "author": "PrestigiousClub4213"
        },
        {
            "level": 0,
            "comment": "I loved it, too bad that when I need it I'll have forgotten.",
            "score": 2,
            "author": "Main_Throat_9052"
        },
        {
            "level": 0,
            "comment": "Cool as hell! I assume electricians know all this by heart?",
            "score": 0,
            "author": "AllKnowingPower",
            "replies": [
                {
                    "level": 1,
                    "comment": "I saw an electrician do a video where he bashed all these fancy connections and told everyone to just use a luster terminal (hope it's correct word for it, had to Google it as English isn't my main language).\n\nI have no clue if he truly was an electrician, or if he was just making a mock video, but it kinda makes sense to me.",
                    "score": 43,
                    "author": "SleepyDadZzz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These are neat, and most are gonna hold really well, but you'll spend way too much time on them to be worth it, and you still need to insulate them. Just get some wirenuts or wagos and be done in 30 seconds instead of 5 minutes.",
                            "score": 26,
                            "author": "feanarl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Use wagos. I have opinions. No you cannot change my mind.",
                                    "score": 5,
                                    "author": "IHeartBadCode"
                                },
                                {
                                    "level": 3,
                                    "comment": "Aren't wire nuts forbidden in new installations?",
                                    "score": -1,
                                    "author": "Flanhare",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No?",
                                            "score": 5,
                                            "author": "AS14K"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm an apprentice electrician and I've not heard anything about that. It might be a regional thing.",
                                            "score": 14,
                                            "author": "feanarl"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Most of these are connections for specific applications. There are wiring techniques for aerospace or other expensive stuff, but nothing most electricians would be using. Most residential, commercial, and industrial connections boils down to twisting the wires together and throwing a wire nut on it. I’ve seen at least a couple of those on NASA manuals for wiring things in I think it was the Apollo program.",
                    "score": 15,
                    "author": "Bareen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ya, the techniques aren’t the issue so much as it doesn’t do anything to describe where they’re appropriate.  The kind of connection you want for thin-stranded wiring that’s subject to heavy vibration is going to be different than the kind of connection you want for residential mains electricity.  \n\nI ado wonder the scope of some of these techniques. There was a time before microprocessors that computers were wires routed around each other in ways that created gates and storage.  They hired seamstresses because the had the dexterity to essentially “sew” the computer circuits.  Wonder if things changed when the wiring only needed to carry power and communications between components, rather than act as processing and storage in itself.",
                            "score": 6,
                            "author": "Kelsenellenelvial",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The \"heavy vibration\" factor makes a lot of sense.  Wire nuts are fine for installing an overhead light in your kitchen, but I would feel a little uneasy about it if I saw those holding together the electronics of an airplane.",
                                    "score": 7,
                                    "author": "YouStopLying"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You see them in marine wiring, especially that western union splice.  There shouldn't be any wire nuts on boats.  They aren't standard, that's heat-shrink butt connectors for the most part, but for certain applications they are the right tools.",
                            "score": 1,
                            "author": "texasrigger"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Am electrician. Have never done any of this. I don’t use wagos because they’re not very used in Canada as far as I know but I do use wire nuts and just twist wires together.",
                    "score": 3,
                    "author": "RastaLino"
                },
                {
                    "level": 1,
                    "comment": "Yeah, we use lineman pliers and twist the ends of wires into a god connection that will never fail. These are just origami with wires.",
                    "score": 5,
                    "author": "thisproductcancause"
                },
                {
                    "level": 1,
                    "comment": "As an electrician, I wouldn't use any of those connections. Some things in the video are useful, like the tape on a pencil. The actual wire connections, though are a waste of time and the only reason I could see for some of them is having a cable under tension, which should never happen. \n\nThese educational videos are annoying because anyone who actually does work on cables should know that this is wrong. And people who don't know see this and think it's good. I'm not sure how old the original video is, but based on the quality of it it seems like it is newer than I'd like to think.",
                    "score": 5,
                    "author": "jaysoprob_2012"
                },
                {
                    "level": 1,
                    "comment": "No, use a wire nut or actual approved connection method. All of these create spots that aren’t actually tight and can create arcing. They’ll slowly melt back insulation or burn the conductive material. Solid electrical connections usually don’t look very aesthetically pleasing lol",
                    "score": 1,
                    "author": "Sokuim"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fun to watch, but most of these are pretty useless as far as practical application. Simple is almost always better. Use some wire nuts or a butt splice (which tbf, they did show).",
            "score": 0,
            "author": "DerekTheMemeBoss"
        },
        {
            "level": 0,
            "comment": "That's cool. Saving for later",
            "score": -2,
            "author": "TurinTuram",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please don’t ever use these.",
                    "score": 14,
                    "author": "Kingofelephantshrews",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I will",
                            "score": -3,
                            "author": "TurinTuram",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your funeral",
                                    "score": 2,
                                    "author": "NukaCooler"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is satisfying as fuckk to watch",
            "score": 1,
            "author": "Deathtodave"
        },
        {
            "level": 0,
            "comment": "What is even the point of the first one?  Just splice them normally?!",
            "score": 1,
            "author": "surfnporn",
            "replies": [
                {
                    "level": 1,
                    "comment": "The purpose is to minimize the chance of shorting wires.  Particularly useful in the health field.",
                    "score": 3,
                    "author": "wildcat-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Rewired a boat recently where the wiring harness went into the outboard. So the cables were flexing left and right as the motor turned. Also really handy for applications like that with high movement. The original wiring was shorting out because they weren't staggered.",
                            "score": 2,
                            "author": "UnfitRadish"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's pretty but nobody is going to do this. Heatshrink connectors and a crimp or twist connectors work perfectly fine and take two seconds",
            "score": 0,
            "author": "Edgar-Allan-Pho"
        },
        {
            "level": 0,
            "comment": "Welp, I’m aroused…",
            "score": 0,
            "author": "Bingo_DiiinoDNA"
        },
        {
            "level": 0,
            "comment": "Anyone that has worked with cables can tell you that cables don't work like that. They are always a mess inside.",
            "score": 0,
            "author": "Dialgak77"
        },
        {
            "level": 0,
            "comment": "Tried this with twisted pairs and the FBI is knocking at my door now. FAQ available?",
            "score": 1,
            "author": "Merkel420"
        },
        {
            "level": 0,
            "comment": "r/oddlysatisfying",
            "score": 1,
            "author": "goaheadmonalisa"
        },
        {
            "level": 0,
            "comment": "Excellent",
            "score": 1,
            "author": "DustyTurtle2"
        },
        {
            "level": 0,
            "comment": "Reddit has created the best electrician's on the planet!",
            "score": 1,
            "author": "JimboBob"
        },
        {
            "level": 0,
            "comment": "Pretty sure none of these would pass IPC",
            "score": 1,
            "author": "reddithelpyou"
        },
        {
            "level": 0,
            "comment": "This feels like learning but I'm pretty sure I didn't learn anything",
            "score": 1,
            "author": "CitizenPremier"
        },
        {
            "level": 0,
            "comment": "I'm no electrician but I'm pretty sure half of these would set your house on fire",
            "score": 1,
            "author": "ShawshankException"
        },
        {
            "level": 0,
            "comment": "i believe those wires are for thin kinds, like for running DC and battery powered circuits.",
            "score": 1,
            "author": "wackocoal"
        },
        {
            "level": 0,
            "comment": "r/oddlysatisfying",
            "score": 1,
            "author": "AthenaRN85"
        },
        {
            "level": 0,
            "comment": "u/savevideo",
            "score": 1,
            "author": "TyphusIsDaddy"
        },
        {
            "level": 0,
            "comment": "This is definitely the funniest thing I've seen today! Nicely done. I really needed a laugh today.",
            "score": 1,
            "author": "LongboardLove"
        },
        {
            "level": 0,
            "comment": "r/oddlysatisfying",
            "score": 1,
            "author": "Dolomight206"
        },
        {
            "level": 0,
            "comment": "Shove it into a wiring nut and then jam it back into the box, got it.",
            "score": 1,
            "author": "JasonCox"
        },
        {
            "level": 0,
            "comment": "I feel like this subreddit is fundamentally flawed. REAL difficult to absorb information without text or audio. Unless you’re Helen Keller.",
            "score": 1,
            "author": "TheVicSageQuestion"
        },
        {
            "level": 0,
            "comment": "Solder: allow me to introduce myself",
            "score": 1,
            "author": "PM_ME_LOSS_MEMES"
        },
        {
            "level": 0,
            "comment": "Some of these aren't good for certain wire lengths and some may even heat up the wires (like the coiled ones) and could cause a fire.\n\nNot sure if a gif like this is very safe.",
            "score": 1,
            "author": "Monckey100"
        },
        {
            "level": 0,
            "comment": "the twisting ones are not allowed in the united states either in a connector or wire nut",
            "score": 1,
            "author": "Pokedechub"
        },
        {
            "level": 0,
            "comment": "These are all BS. Not one of these \"tips\" are used anywhere in any type of splice. Maybe 100 years ago with your solder pot sitting next to your derby and cobble box of hand sharpened pliers. This shit is stupid and worthless. No electricians or lineman or any tradesman that works with conductors  have used these crap twisted wire splices since the telegraph.  Probably not even then.",
            "score": 1,
            "author": "omegamoo67"
        },
        {
            "level": 0,
            "comment": "No. These are all specialized splices with one useful tip for getting bigger lugs on wire that flared out a bit.\n\nAlso like the 15th place this has been reposted in 2 days. Either bots or karma whores got it.",
            "score": 1,
            "author": "Totallyperm"
        },
        {
            "level": 0,
            "comment": "Excellent… in theory.",
            "score": 1,
            "author": "Loureid"
        },
        {
            "level": 0,
            "comment": "It's 2:13am why am I watching this I need sleep.",
            "score": 1,
            "author": "BOXMAN8745"
        },
        {
            "level": 0,
            "comment": "Electric hedger and cord.  First one.",
            "score": 1,
            "author": "DavidNipondeCarlos"
        },
        {
            "level": 0,
            "comment": "That first one *seems* like it'd be great if you solder and shrink wrap it.\n\nWith them all offset like that you wouldn't get a bulge in the middle when you go to shrink wrap the whole bundle.",
            "score": 1,
            "author": "jhguitarfreak"
        },
        {
            "level": 0,
            "comment": "You really thought you could get away with hiding a plumbing tip in there, didn't ya.",
            "score": 1,
            "author": "ObelusPrime"
        },
        {
            "level": 0,
            "comment": "Just use Wagos!",
            "score": 1,
            "author": "onda-oegat"
        },
        {
            "level": 0,
            "comment": "r/gifsifindprettycool",
            "score": 1,
            "author": "Loakattack"
        },
        {
            "level": 0,
            "comment": "Most of these are not up to code. Do not use them or your house might burn down.",
            "score": 1,
            "author": "Laughing_Orange"
        },
        {
            "level": 0,
            "comment": "This is awesome. I’m saving this for sure.",
            "score": 1,
            "author": "Positivelythinking"
        },
        {
            "level": 0,
            "comment": "r/oddlysatisfying",
            "score": 1,
            "author": "One-Run4975"
        },
        {
            "level": 0,
            "comment": "Yeah just saw this video on r/DINgore",
            "score": 1,
            "author": "throwbcuzgermanlaw"
        },
        {
            "level": 0,
            "comment": "Just use wago",
            "score": 1,
            "author": "SrValou"
        },
        {
            "level": 0,
            "comment": "I’ll probably never use any of these myself but it was certainly fascinating to watch",
            "score": 1,
            "author": "dwheelerofficial"
        },
        {
            "level": 0,
            "comment": "I have an urge to wiring things now",
            "score": 1,
            "author": "WaxPuppet"
        },
        {
            "level": 0,
            "comment": "If most of this information is  wrong what’s a good video to watch that y’all recommend.",
            "score": 1,
            "author": "sl143ajl"
        },
        {
            "level": 0,
            "comment": "r/oddlysatisfying",
            "score": 1,
            "author": "Princevaliant377"
        },
        {
            "level": 0,
            "comment": "Most of these are literally terrible.",
            "score": 1,
            "author": "kriza69-LOL"
        },
        {
            "level": 0,
            "comment": "One word: WAGO",
            "score": 1,
            "author": "dixadik"
        },
        {
            "level": 0,
            "comment": "The least you can do is solder those fukin twist joints.",
            "score": 1,
            "author": "grilltheboy"
        },
        {
            "level": 0,
            "comment": "What kind of 19th century shit is this?",
            "score": 1,
            "author": "MANLY_VIKING_MAN"
        },
        {
            "level": 0,
            "comment": "u/savevideo",
            "score": 1,
            "author": "chaliflani"
        },
        {
            "level": 0,
            "comment": "The trick to apply pipe tape to a tight spot is so useful! Thanks for the vid",
            "score": 1,
            "author": "Sealbeater"
        },
        {
            "level": 0,
            "comment": "Dont do this. Looks like something they do in a 3. World country",
            "score": 1,
            "author": "Jhhkkk"
        },
        {
            "level": 0,
            "comment": "*laughs in electrician*",
            "score": 1,
            "author": "landofschaff"
        },
        {
            "level": 0,
            "comment": "I never plan on finding this useful, especially with the automation most manual labour will be replaced with in give or take 20 years",
            "score": 1,
            "author": "Mondaymorningmisery"
        },
        {
            "level": 0,
            "comment": "I know it's probably crass, but it's really satisfying to watch for some reason",
            "score": 1,
            "author": "pdrpersonguy575"
        },
        {
            "level": 0,
            "comment": "Electrician here. \n\nThese are super cute, but I can do 10 twist-and-caps in the time it takes to do most of these.",
            "score": 1,
            "author": "OverLifeguard2896"
        }
    ]
}