{
    "id": "12gs7zb",
    "score": 824,
    "title": "A lockstitch is the most common mechanical stitch made by a sewing machine. The term \"single needle stitching\", often found on dress shirt labels, refers to lockstitch. This is an animated representation by Nikolay showing the inner workings of a sewing machine, using the lockstitch method.",
    "author": "Rifletree",
    "date": 1681066795.0,
    "url": "https://www.reddit.com/r/educationalgifs/comments/12gs7zb",
    "media_urls": [
        "https://i.redd.it/k4vsreruowsa1.gif"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I know that sewing machines work, but I’ve never seen a good diagram. In this one, half of the yellow loop passes in back of the bobbin. I could never understand how it got through the bearing holding the bobbin. I think I now understand that the bobbin is just it’s own little spool that sits freely inside the hook thing. A better 3D view would be nice.\n\nThank to everyone! After many, many years ( include a couple of summers cleaning sewing machines with rags and toothbrushes) I finally understand. The hook can actually be on a bearing, and the thread never has to pass over it, it just says in the hook area. That and the free-floating bobbin!\n\nNow I need to work on how to fold a fitted sheet.",
            "score": 32,
            "author": "Pbx123456",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, the bobbin is a free floating spool. \n\n[Here is a way better example](https://m.youtube.com/watch?v=zqRvljnNLFk)",
                    "score": 22,
                    "author": "Bareen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely better, although I now have to wonder how the thread passes through the drive shaft of the hook. I can imagine that it slips behind the bobbin, but somehow in front of the hook. Even this better diagram doesn’t clarify that. But after many, many years of wondering, I think I’m getting there.\n\nMr Singer was a clever guy.",
                            "score": 4,
                            "author": "Pbx123456",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok, so the shuttle hook is not rigidly attached to the drive shaft of the machine. They kind of float in the bottom part of the sewing machine. There is a gap on either side of the shuttle for the thread to pass through.\n\nI found another video that I think does a better job showing it. https://m.youtube.com/watch?v=rUSecXVt-jU\n\nHere is a video showing how the shuttle hook and bobbin go into the machine. You can see they sort of free float. https://m.youtube.com/watch?v=4rQH4AcpYFw\n\nSkip to about 1:25 in the second video.",
                                    "score": 3,
                                    "author": "Bareen"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you for this video link!",
                            "score": 1,
                            "author": "JackieAutoimmuneINFJ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I posted a couple better videos in another reply. They show. Little better how the parts actually work and interact with each other",
                                    "score": 2,
                                    "author": "Bareen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I watched those, too, thanks! 🙋🏻‍♀️",
                                            "score": 1,
                                            "author": "JackieAutoimmuneINFJ"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it okay if I still don't get it?",
            "score": 14,
            "author": "Kay1636",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is. \nThe hook is attached to a gear mechanism but the bobbin sits in a case that is free floating (essentially). As the hook rotates it pulls the top thread around but guides it towards the bobbin case, not under itself. When it’s about 2/3 around the pull up arm on the top of the machine pulls the thread under the bobbin case making the top thread loop around the bobbin thread making what is loosely a knot. In some cases the hook reverses to start over and in others it makes an entire revolution without thread to reset. \n\nHere’s another look:  https://youtu.be/rUSecXVt-jU",
                    "score": 3,
                    "author": "jfrazer1979",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank You!",
                            "score": 3,
                            "author": "Kay1636",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Thank You!\n\nYou're welcome!",
                                    "score": 2,
                                    "author": "exclaim_bot"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I know this should be making it clear, but I still don't get it.",
                    "score": 5,
                    "author": "anotherusercolin"
                },
                {
                    "level": 1,
                    "comment": "Only the top thread goes through the fabric. The bobbin thread gets taken up by the top thread.",
                    "score": 2,
                    "author": "Peppyperoni"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I ***finally understand***, this has driven me crazy for years! Thank you!!!\n\nHow can I download this gif?",
            "score": 2,
            "author": "S1159P",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right click on it; you should get a menu that includes \"Save video as\"...\n\nIf that doesn't work, use u/savevideo and it will tell Reddit to d/l for you. You'll get a message giving you the link",
                    "score": 1,
                    "author": "there_is_no_spoon1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a terrible gif, the yellow thread jumps from under the rotating grey thing to on top of it.",
            "score": 3,
            "author": "ZeboSecurity",
            "replies": [
                {
                    "level": 1,
                    "comment": "It really is. \n\nTry this video. https://youtu.be/rUSecXVt-jU",
                    "score": 1,
                    "author": "jfrazer1979"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm fairly sure this must be inaccurate, because the rotating part at the bottom has to be mounted on a shaft to rotate: but the yellow thread passes around it on both sides, where a shaft would block it.",
            "score": 2,
            "author": "flexous",
            "replies": [
                {
                    "level": 1,
                    "comment": "The spinning hook is spring loaded. [tThis gif](https://www.reddit.com/r/educationalgifs/comments/nf9hvu/this_is_how_a_sewing_machine_works/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=1&amp;utm_term=1) is clearer.",
                    "score": 5,
                    "author": "storky0613"
                },
                {
                    "level": 1,
                    "comment": "Yeah it doesn't quite add up with the loop going around but only one half connecting and yet the other side rotates freely.",
                    "score": 3,
                    "author": "there_is_no_spoon1"
                },
                {
                    "level": 1,
                    "comment": "The post is only on the bobbin case. It sits loose in the hook and is retained by the crescent thing on the right\n\nhttps://i.imgur.com/Vi2Ke92.jpg\n\n[Here's another picture of it assembled with the bobbin out of it](https://i.imgur.com/2aWctS0.jpg)",
                    "score": 1,
                    "author": "Peppyperoni"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is awesome!",
            "score": 1,
            "author": "Marlemonia"
        },
        {
            "level": 0,
            "comment": "Who is Nikolay?",
            "score": 1,
            "author": "nick1812216"
        },
        {
            "level": 0,
            "comment": "oh god thank you so much!\n\ni've spent way too many sleepless nights thinking on how sewing machines work",
            "score": 1,
            "author": "dysfunctionalduckapp"
        },
        {
            "level": 0,
            "comment": "Ah, so magic.",
            "score": 1,
            "author": "Shaushage_Shandwich"
        }
    ]
}