{
    "id": "141aw4e",
    "score": 4327,
    "title": "Many species of polychaetes (marine annelid worms) undergo epitoky whereby sexually immature worms transform into pelagic morphs capable of sexual reproduction. After fertilization, they release their gametes through rapid disintegration.",
    "author": "KimCureAll",
    "date": 1685963087.0,
    "url": "https://www.reddit.com/r/educationalgifs/comments/141aw4e",
    "media_urls": [
        "https://i.redd.it/tqoas5wtj64b1.gif"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Possibly the most intense orgasm any creature could experience… just dissolve on completion",
            "score": 953,
            "author": "Mbinku",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"I'm coming, I'm coming\", \"Oh, no, I'm going, I'm going\".  *POOF*",
                    "score": 345,
                    "author": "ZeerVreemd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I heard this in Robin Williams tone...",
                            "score": 75,
                            "author": "Odin1806",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "George Carlin: \"all we gotta do is stick a tactical nuclear warhead inside the tip of the man's penis. Then he won't know whether he's coming or going!\" (Terribly paraphrased from a bit on how we should deal with white collar crime)",
                                    "score": 16,
                                    "author": "Rad_Streak"
                                },
                                {
                                    "level": 3,
                                    "comment": "Aaah, so that's what he was doing in this clip where he tears apart his own body... Hmmm...",
                                    "score": 4,
                                    "author": "Nabugu"
                                },
                                {
                                    "level": 3,
                                    "comment": "I heard it in Michael Rosen‘s voice holy sh!t",
                                    "score": 1,
                                    "author": "NotNeographer"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Funnily in hungarian \"coming\" in a sexual context is \"going\" in their native language",
                            "score": 10,
                            "author": "franco_unamerican",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In French it’s having arrived",
                                    "score": 7,
                                    "author": "Mbinku",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The French have arrived, the British came and the Hungarians are going with the Japanese",
                                            "score": 11,
                                            "author": "StandardSudden1283",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Quite the party",
                                                    "score": 4,
                                                    "author": "jambox888"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "While you guys come and go, in Brazil we just enjoy :D",
                                            "score": 2,
                                            "author": "Tomeshing"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Japanese too.",
                                    "score": 2,
                                    "author": "Qelly"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Real life Zoidberg right there",
                            "score": 3,
                            "author": "RedEyeFlightControl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not sure whether this is a compliment or something else... LOL.",
                                    "score": 1,
                                    "author": "ZeerVreemd"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When you nut but she keep suckin",
                    "score": 10,
                    "author": "stamminator"
                },
                {
                    "level": 1,
                    "comment": "That's what I was wondering. Are we witnessing an orgasm?",
                    "score": 17,
                    "author": "meresymptom"
                },
                {
                    "level": 1,
                    "comment": "And I thought honey bees had it bad",
                    "score": 6,
                    "author": "Mks235"
                },
                {
                    "level": 1,
                    "comment": "I don’t feel so good…..",
                    "score": 4,
                    "author": "residentfriendly"
                },
                {
                    "level": 1,
                    "comment": "Honey, I don't feel so good...",
                    "score": 2,
                    "author": "Grizz1371"
                },
                {
                    "level": 1,
                    "comment": "La petite mort… x10000000, I guess",
                    "score": 2,
                    "author": "availjones"
                },
                {
                    "level": 1,
                    "comment": "This happened many years ago in a documentary called torchwood",
                    "score": 3,
                    "author": "SexySmexxy"
                },
                {
                    "level": 1,
                    "comment": "So just like the End of Evangelion, then.",
                    "score": 1,
                    "author": "Zenonlite"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Before reproducing, most species of polychaetes undergo morphological and physiological modifications when they become sexually mature. This sexual transformation is known as epitoky: atokous (juvenile) polychaetes transform and become epitokous (sexually mature). Epitoky prepares the worms for a brief pelagic existence and improves the chances that sexual partners will find each other. During epitoky, some species of polychaetes will \"explode\" or rapidly disintegrate to release their eggs and sperm (gametes). https://fse.studenttheses.ub.rug.nl/9013/1/Bachelorscriptie\\_Pablo\\_de\\_Vries.pdf\r  \n\r  \nVideo footage from Cozumel, Mexico: https://www.youtube.com/watch?v=QNqcWQHEOog",
            "score": 259,
            "author": "KimCureAll",
            "replies": [
                {
                    "level": 1,
                    "comment": "does the entire worm disintegrate (dies)?",
                    "score": 92,
                    "author": "dumnezero",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, but then again, no",
                            "score": 137,
                            "author": "KimCureAll",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How wonderful life is…",
                                    "score": 55,
                                    "author": "nonsequiturnonsense",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "...while you're in the world 🎶",
                                            "score": 72,
                                            "author": "KimCureAll",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You are criminally wholesome :)",
                                                    "score": 13,
                                                    "author": "Yaa40"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I sat on the roof",
                                                    "score": 2,
                                                    "author": "stonedoutofmytree"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "🥲",
                                                    "score": 2,
                                                    "author": "avalanches"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean, yes, I can't see how you consider he isn't dead. As I understand, he explode in his offspring.",
                                    "score": 14,
                                    "author": "1900Grom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So, this stuff can get really weird.\n\nA lot of these practice something called schizogamy. The original entity is asexual, but it will grow little modified clones of itself to swim around looking for prospective clone partners to explode at. Meanwhile, the original organism carries on doing its own thing.\n\nSo, at a certain point it becomes a philosophical question. Do you consider the entity to be its own creature, or just a convoluted gamete delivery mechanism? When that one species of octopus throws its detachable penis arm at females, is the arm dying? It's swimming around with some level of agency, as each arm has its own sort of brain.\n\nAlso, going back to the schizogamy thing, some of them don't involve creating a \"mini me\" that looks similar to the original organism. Maybe just a section of their rear end will pop off, grow an eye, and swim to the mating area. But that sounds a lot like a tapeworm shedding a segment of itself to deliver eggs everywhere, if with more involved steps.",
                                            "score": 35,
                                            "author": "Eusocial_Snowman",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well I guess now I’m off to go look up “octopus throwing detachable penis-arm”",
                                                    "score": 13,
                                                    "author": "Synexis",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That one's the argonaut. Really cool critter all in all, they build a shell and cosplay as a nautilus to carry around their eggs.\n\nAfter you're done with that, look into giant squids and their traumatic insemination.\n\n&gt;''It seems that male giant squids may use their muscular elongate penis to 'inject' sperm packages under pressure directly into the arms of females,'' the scientists said. Researchers have found that the penises of giant squid can measure up to three feet in length.",
                                                            "score": 7,
                                                            "author": "Eusocial_Snowman",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "How many of the researchers died from impalement finding this out?",
                                                                    "score": 5,
                                                                    "author": "jeweliegb",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well, I don't know about all that..but the guy I heard all this from did mention they find a lot of these sperm packets injected into sperm whale flesh.",
                                                                            "score": 4,
                                                                            "author": "Eusocial_Snowman"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So did my dad, but I wish he was dead (yes this is an awful joke)",
                                            "score": 15,
                                            "author": "tetendi96",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Holy *shit* dude haha",
                                                    "score": 7,
                                                    "author": "Lanthemandragoran"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I wonder if this at all inspired Frank Herbert for the 4th book of Dune.",
                                    "score": 1,
                                    "author": "LlamaLitmus"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Scientists do not consider this type of reproduction to be \"death.\" More like \"phase-changing\" from a single descrete organism to many gamete spores that have the potential to become copies.\n\nUnlike most macroscopic life, where the \"self\" is a psychophysiological phenomenon resulting from many individual, specialized cells reading and creating electrochemical stimuli to form individuality, this species has, essentially, one type of cell, no nervous system, no brain, hormones, or even ability to alter it's environment. It is, effectively, a plant. More like a mushroom or sponge. It's lifecycle takes several phases that start and end exactly with what you just saw.",
                            "score": 100,
                            "author": "Aedene",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But don’t annelid worms have a nervous system? Earthworms do, and many polycheates have eyes right? Also plants definitely alter their environment, have hormones…not trying to argue. Just have never heard of or seen this phenomenon and trying to understand.",
                                    "score": 24,
                                    "author": "Crepuscular_otter",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm just a guy with no knowledge about this stuff but I guess there is a point where scientists just can't agree about the reality of certain things? I mean, a point where hard science isn't as hard as everyone thinks.",
                                            "score": 3,
                                            "author": "juanconj_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There's no such a thing as fish.\n\nI guess this is a similar problem. The word \"worm\" is useful to conceptualize \"stringy, wiggly lifeform\" which the above creature conforms to. But the word \"worm\" also denotes a very particular subset of invertebrates in which the above creature wouldn't fit.\n\nSemantics are difficult.",
                                                    "score": 10,
                                                    "author": "Coffee-Robot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ontology is a mindfuck once you start diving into it",
                                                            "score": 5,
                                                            "author": "dethfalcin"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I guess so! I mean I thought it was agreed upon that annelid worms have tissues and different types of cells so that’s why I was asking, because nature is super diverse and I’m certainly no polychaete expert. I’d love to know how those different cells all transform into gametes, that’s so cool.",
                                                    "score": 5,
                                                    "author": "Crepuscular_otter"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This guy woke up and chose to remind us that behind it all we are only a bunch of cells doing what they're programmed to do and nothing more",
                                    "score": 8,
                                    "author": "arealuser100notfake",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Your bundle of programmed meat sac is my favorite configuration &lt;3",
                                            "score": 2,
                                            "author": "Aedene",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "OMG 😍",
                                                    "score": 2,
                                                    "author": "arealuser100notfake"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "To clarify, when you say “it is effectively a plant. More like a mushroom or a sponge”. Mushrooms are fungi, sponges are animals. Neither are plants.",
                                    "score": 50,
                                    "author": "The_Cell_Mole",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's true. To be clear, I was trying to make an analogue comparison. These worms -are-, by definition, animals. They just behave a little bit like other familiar evolutionary trees.",
                                            "score": 32,
                                            "author": "Aedene"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well, that's the whole point of including those under the umbrella of \"not a plant but plant like.\" Such a well thought out and interesting comment, and ppl are just trying to \"ackshually\" them lol. ffs reddit",
                                            "score": 5,
                                            "author": "PMMeUrFineAss"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So it's rebirth through mass cloning? Or is there still two separate RNA from parental worms?",
                                    "score": 8,
                                    "author": "EnvBlitz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Great question! The answer (from my ameture curiosity deep dive on this like 2 years ago) is that worms are weird... Some produce sexually, some asexually, some have the choice of doing both. Some \"spawn\" gametes with only half of their genetic code, while others are hermaphroditic and produce their own not-quite clones if they can't find a fresh genetic donor. Whether this worm is creating fully functioning worm larvae or just a cloud of half-RNA gametes I don't know for sure.",
                                            "score": 5,
                                            "author": "Aedene"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Which species of polychaete is this?",
                                    "score": 6,
                                    "author": "dasrightq",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not a clue. There are literally over 10,000 documented species. Anyone who gives you a diffinitive answer is lying (or incredibly specialized in marine biology).\n\nEdit: most likely in the Flabelligeridae family, but that's still over a third of them.",
                                            "score": 5,
                                            "author": "Aedene",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The reason is I asked is because you say “this species” has only one type of cell and there are tons of polychaete species. So I was wondering how you knew that 😅",
                                                    "score": 4,
                                                    "author": "dasrightq",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You're absolutely right. I should have been more broad. I did not mean any specific genus of tubeworm, just the biological blueprint they use, which is very similar to a non-specialized macro-organism like a fungus or sponge that use the same material for just about every part of the organism.",
                                                            "score": 3,
                                                            "author": "Aedene"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Does that mean it's kind of immortal?",
                                    "score": 3,
                                    "author": "icansmellcolors",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Possibly. Hydra's work similarly and are.",
                                            "score": 2,
                                            "author": "PiersPlays",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't forget the immortal jellyfish!",
                                                    "score": 2,
                                                    "author": "KimCureAll",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I see that apparently there are a few different jellyfish now known to do this!",
                                                            "score": 2,
                                                            "author": "PiersPlays"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So is this more like an ejaculation or more like a childbirth?",
                    "score": 6,
                    "author": "vintergroena",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "...yes?",
                            "score": 2,
                            "author": "ninj4geek"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yea, seems like something the christian god would design",
                    "score": 3,
                    "author": "LoserCowGoMoo"
                },
                {
                    "level": 1,
                    "comment": "Working link I think https://fse.studenttheses.ub.rug.nl/8716/ or https://fse.studenttheses.ub.rug.nl/9013/",
                    "score": 2,
                    "author": "foursticks"
                },
                {
                    "level": 1,
                    "comment": "So this is giving birth not cumming",
                    "score": 1,
                    "author": "evanthebouncy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "... imagine growing and mutate just to have your body become a cloud of cum underwater",
            "score": 166,
            "author": "Pabloracer1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are we really so different....come on now.",
                    "score": 63,
                    "author": "KimCureAll",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Death by cum cloud (spontaneous cumbustion)",
                            "score": 15,
                            "author": "UlyssesSGrant12"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Imagine if one day your ass just falls off, grows an eye, and looks for the collective ass orgy out there while you sit around watching TV and growing a new ass.",
                    "score": 3,
                    "author": "Eusocial_Snowman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This exactly happened to my father, after he came, he vanished to never be found again\n\nIs good to know that is just how nature works.\n\nThanks dad for become just semen in order to me to have an opportunity in life\n\n🥲",
            "score": 50,
            "author": "barzx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hugs",
                    "score": 2,
                    "author": "Queasy-Remove609"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reminds me of the beginning of Prometheus.",
            "score": 14,
            "author": "DavesNotHereMan2358"
        },
        {
            "level": 0,
            "comment": "And that's another possible inspiration for Shai-Hulud (Dune's mega worms) death",
            "score": 43,
            "author": "durboo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Herbert said that he conceived of the sand worms as descended from marine worms that had to evolve to cope with a drying world. So, yeah, he could have potentially been thinking about these critters when he came up with their lifecycle.",
                    "score": 24,
                    "author": "Thiccaca"
                },
                {
                    "level": 1,
                    "comment": "Bless the cuming and going of him.",
                    "score": 3,
                    "author": "veliidae"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is no spoilers in that comment, Shai-Hulud is the word given to the giant worms which die and have their own life cycle just like everything else. If you've not seen the lifecycle desribed in the books yet then no single comment can spoil anything about it because it's just too complex to spoil. By the time you could understand the life cycle you would also be spoiler-free.",
                            "score": 11,
                            "author": "Quicksaturn",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Pick up a book if you care that much lmao",
                            "score": 4,
                            "author": "lasmilesjovenes"
                        },
                        {
                            "level": 2,
                            "comment": "The book is from the 70s and that plot point won't resolve in the next movie lol",
                            "score": 18,
                            "author": "SanguineDemon"
                        },
                        {
                            "level": 2,
                            "comment": "From the 70's? Please.",
                            "score": 6,
                            "author": "Aunty-Saz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Laymen Terms: Worm wiggles it, just a little bit then turns into what looks like hair conditioner in the tub when you rub it off your hands as a kid and try to catch the little wiggle pieces.",
            "score": 93,
            "author": "Alaskan_Lost",
            "replies": [
                {
                    "level": 1,
                    "comment": "[The Kiffness - Wiggle A Bit ft. Nathan Ro](https://www.youtube.com/watch?v=k9rrFq4AqSs&amp;pp=ygUbd2lnZ2xlIGl0IGp1c3QgYSBsaXR0bGUgYml0)",
                    "score": 6,
                    "author": "SeaWeedSkis"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imagine one day you're just chilling as a kid, living your best life. Next moment you're an adult, speed dating. You find a suitable match. You start spasming and every cell in your body turns into sperm. And you just go everywhere.\n\nEw.",
            "score": 13,
            "author": "GreenLurka"
        },
        {
            "level": 0,
            "comment": "You're throwing too many big words at me, and because I don't understand them I'm gonna take them as disrespect",
            "score": 10,
            "author": "Robot_tangerine",
            "replies": [
                {
                    "level": 1,
                    "comment": "How about: squiggly go poof",
                    "score": 8,
                    "author": "KimCureAll"
                }
            ]
        },
        {
            "level": 0,
            "comment": "*butt clenches*",
            "score": 10,
            "author": "DarthKoDa_"
        },
        {
            "level": 0,
            "comment": "r/natureismetal stuff right here.",
            "score": 6,
            "author": "Obvious_Duh"
        },
        {
            "level": 0,
            "comment": "Kidthrowingpeacesignthendisappearing.gif",
            "score": 6,
            "author": "xero_peace"
        },
        {
            "level": 0,
            "comment": "It came so hard, it went…",
            "score": 5,
            "author": "tex91"
        },
        {
            "level": 0,
            "comment": "I finally understand the beginning to Prometheus.",
            "score": 5,
            "author": "geon"
        },
        {
            "level": 0,
            "comment": "Does it decide when to poof or does it kind of happen unexpectedly?",
            "score": 4,
            "author": "StrawberryUnhappy888"
        },
        {
            "level": 0,
            "comment": "Isn't this from an episode of Torchwood? Girl who goes around stealing peoples 'life energy' by screwing them then disintegrating them while they splooged.",
            "score": 4,
            "author": "SaneIsOverrated"
        },
        {
            "level": 0,
            "comment": "The balloon tube guy at that used car lot looks REALLY excited…",
            "score": 5,
            "author": "Mister-Grogg"
        },
        {
            "level": 0,
            "comment": "I'm impressed by how rapid the transition from solid worm to cum cloud is",
            "score": 5,
            "author": "friso1100"
        },
        {
            "level": 0,
            "comment": "so it's like a... cum worm",
            "score": 4,
            "author": "DAS_BEE"
        },
        {
            "level": 0,
            "comment": "\"..Mr Shark? I...I don't feel so good....\"",
            "score": 4,
            "author": "Spider_Ben82"
        },
        {
            "level": 0,
            "comment": "What a terrible day to have eyes",
            "score": 23,
            "author": "GrozGreg",
            "replies": [
                {
                    "level": 1,
                    "comment": "😂👍🏼",
                    "score": 3,
                    "author": "Luke-I-am-ur-mother"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This once happened to me getting a blowjob while on acid",
            "score": 12,
            "author": "JCullberg"
        },
        {
            "level": 0,
            "comment": "*Worm felled*",
            "score": 3,
            "author": "evilMTV"
        },
        {
            "level": 0,
            "comment": "I'm mostly impressed that it happens across the whole organism at approximately the same moment\n\ne: ah, looks like it ruptures at one end really.",
            "score": 5,
            "author": "shea241"
        },
        {
            "level": 0,
            "comment": "Death by snu snu?",
            "score": 5,
            "author": "soulless_ape"
        },
        {
            "level": 0,
            "comment": "Ew",
            "score": 10,
            "author": "discard_3_"
        },
        {
            "level": 0,
            "comment": "I only understood \"sexually\" of all the title",
            "score": 7,
            "author": "pepe_botika",
            "replies": [
                {
                    "level": 1,
                    "comment": "I need an ELI5 without slang",
                    "score": 5,
                    "author": "yikkoe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "An organism with a self-destruct button..    Just made my life THAT much better.",
            "score": 3,
            "author": "Dnozz"
        },
        {
            "level": 0,
            "comment": "Somebody reposted this and got 3000 upvotes, sorry.",
            "score": 3,
            "author": "Sad_Protection269"
        },
        {
            "level": 0,
            "comment": "Holy shit, dude nutted themselves out of existence.",
            "score": 3,
            "author": "dumbasstakestheworld"
        },
        {
            "level": 0,
            "comment": "maybe we, as humans, think this is strange. but nature, being metal as fuck, doesn't actually care about individuals.\n\nin fact, individuality itself is just one more adaptive trait, no better or worse than other traits.\n\njust as civilization is a thin veneer on our beastly natures, individuality also is a fragile illusion on our basic natures.\n\ni.e. your basic nature does not include the concept of the self at all. you don't really exist the way you think you do.",
            "score": 3,
            "author": "platistocrates"
        },
        {
            "level": 0,
            "comment": "Look. I love the knowledge you're trying to lay down, but explain this like I'm from Texas. Because I'm from Texas. Help.",
            "score": 3,
            "author": "stufoor",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am from Texas, so allow me to use our common language to explain.\n\nThe worms knocked boots. Then Yee'd their last Haw.",
                    "score": 14,
                    "author": "it_was_Patricia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bless your heart, thank you!",
                            "score": 1,
                            "author": "stufoor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Worm explodes into worm jizz.",
                    "score": 6,
                    "author": "jaggedcanyon69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me too",
            "score": 2,
            "author": "Igotlaid11"
        },
        {
            "level": 0,
            "comment": "They release their gametes **after** fertilization? I don't get it",
            "score": 2,
            "author": "Yearlaren"
        },
        {
            "level": 0,
            "comment": "I saw this happening at the GBR coral spawning a few years ago. There were THOUSANDS of them. It was insane",
            "score": 2,
            "author": "jillybean712"
        },
        {
            "level": 0,
            "comment": "Can someone ELI5 please?",
            "score": 2,
            "author": "Aunty-Saz",
            "replies": [
                {
                    "level": 1,
                    "comment": "The last nut.",
                    "score": 2,
                    "author": "bannex19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "so... some of it still exists after this? or is it gone?",
            "score": 2,
            "author": "sometechloser"
        },
        {
            "level": 0,
            "comment": "\"I don't feel so good\"\n\n  \n\n\n*(Or do I?)*",
            "score": 2,
            "author": "TheAce0"
        },
        {
            "level": 0,
            "comment": "If this wasn’t someone’s fetish I bet it is now.",
            "score": 2,
            "author": "actionbastard99"
        },
        {
            "level": 0,
            "comment": "r/damnthatsinteresting",
            "score": 2,
            "author": "FriendNo7908"
        },
        {
            "level": 0,
            "comment": "u/savevideobot",
            "score": 2,
            "author": "Delicious_Delilah"
        },
        {
            "level": 0,
            "comment": "I’ve never seen anything so insane",
            "score": 2,
            "author": "craigcraig420"
        },
        {
            "level": 0,
            "comment": "This was on one of those ‘wtf is this’ videos. \n\nTIL tho…",
            "score": 2,
            "author": "Kwa-Marmoris"
        },
        {
            "level": 0,
            "comment": "Sex on a new level. They become the nut.",
            "score": 2,
            "author": "rantottcsirke"
        },
        {
            "level": 0,
            "comment": "Fascinating!",
            "score": 2,
            "author": "moonCake_246"
        },
        {
            "level": 0,
            "comment": "Goals",
            "score": 2,
            "author": "aldmj"
        },
        {
            "level": 0,
            "comment": "Rapid scheduled disassembly",
            "score": 2,
            "author": "chemo92"
        },
        {
            "level": 0,
            "comment": "I’m really interested in how they just… disintegrate?",
            "score": 2,
            "author": "wierdness201"
        },
        {
            "level": 0,
            "comment": "https://gfycat.com/UnitedImpureAlaskajingle",
            "score": 2,
            "author": "kingeryck"
        },
        {
            "level": 0,
            "comment": "You ever nut so hard you explode?",
            "score": 2,
            "author": "ClockworkAstronomer"
        },
        {
            "level": 0,
            "comment": "Bro is muslim",
            "score": 2,
            "author": "NoOutlandishness8974"
        },
        {
            "level": 0,
            "comment": "looking forward to the Ze Frank video about this one.",
            "score": 2,
            "author": "The_Artists_Studio"
        },
        {
            "level": 0,
            "comment": "So many strange creatures at the bottom of the ocean!",
            "score": 2,
            "author": "mattdaviesharmonycom"
        },
        {
            "level": 0,
            "comment": "Gross, I've swum in the sea, I could have got some of that in my eye!",
            "score": 2,
            "author": "undefeatabledave"
        },
        {
            "level": 0,
            "comment": "🤯",
            "score": 2,
            "author": "Lil-Scrapple-Blossom"
        },
        {
            "level": 0,
            "comment": "Sentient underwater gymnastic ribbon segses self to oblivion. Got it.",
            "score": 2,
            "author": "LarpLady"
        },
        {
            "level": 0,
            "comment": "The swarm",
            "score": 2,
            "author": "OrangeDit"
        },
        {
            "level": 0,
            "comment": "Are they sure they didn’t stress it? Why did it happen at this exact moment?",
            "score": 2,
            "author": "Ok_Run6536"
        },
        {
            "level": 0,
            "comment": "Is this what happens to incels when they feel the touch of a woman for the first time?",
            "score": 2,
            "author": "Terrible_Cut_3336"
        },
        {
            "level": 0,
            "comment": "Is that the Keyser Söze worm?",
            "score": 2,
            "author": "reglyt"
        },
        {
            "level": 0,
            "comment": "Can sci Fi writers even compete with the deep ocean?",
            "score": 1,
            "author": "Oligarr"
        },
        {
            "level": 0,
            "comment": "There was the video, maybe on r/whatisthisthing... With something almost exactly like this....\n\n\nEdit: I couldn't find it, but some small worm-like creature is swimming toward the camera, before it dissolves just like this. The comment section decided it was just a sting if dirt or silt caught in a small current if water. This must have been a post several weeks or a month ago. I think it may have been one of these, instead.",
            "score": 1,
            "author": "nevercleverer"
        },
        {
            "level": 0,
            "comment": "I read through the title and understand like 5 words in it.",
            "score": 1,
            "author": "quocphu1905"
        },
        {
            "level": 0,
            "comment": "So they don't come, they just go",
            "score": 1,
            "author": "Excellent-Shock7792"
        },
        {
            "level": 0,
            "comment": "Kum n Go",
            "score": 1,
            "author": "mcflinty_1"
        },
        {
            "level": 0,
            "comment": "Reminds me of the opening of “Prometheus”!",
            "score": 1,
            "author": "trulyuniqueusername2"
        },
        {
            "level": 0,
            "comment": "[https://i.imgur.com/3xAOMqx.gif](https://i.imgur.com/3xAOMqx.gif)",
            "score": 1,
            "author": "technog2"
        },
        {
            "level": 0,
            "comment": "Imagine being the first human to witness this phenomenon",
            "score": 1,
            "author": "1-800-Eat-Rocks"
        },
        {
            "level": 0,
            "comment": "You should have gone for the head.",
            "score": 1,
            "author": "Bascna"
        },
        {
            "level": 0,
            "comment": "What the heck…??  That is wild.",
            "score": 1,
            "author": "AlbinoWino11"
        },
        {
            "level": 0,
            "comment": "Snake io",
            "score": 1,
            "author": "Emotional_Charity716"
        },
        {
            "level": 0,
            "comment": "Somebody get Casual Geographic on this shit",
            "score": 1,
            "author": "Impybutt"
        },
        {
            "level": 0,
            "comment": "Doesn't matter, had sex",
            "score": 1,
            "author": "5alpha-reductase"
        },
        {
            "level": 0,
            "comment": "so..... death by snu snu?",
            "score": 1,
            "author": "alienpsp"
        },
        {
            "level": 0,
            "comment": "Your mom releases gametes through rapid disintegration.",
            "score": 1,
            "author": "tmbgisrealcool"
        },
        {
            "level": 0,
            "comment": "I'd like to find someone I can read this sentence to with no actual context and no showing the video.",
            "score": 1,
            "author": "bottleofgoop"
        },
        {
            "level": 0,
            "comment": "That’s some Prometheus shit right there",
            "score": 1,
            "author": "Ecoaardvark"
        },
        {
            "level": 0,
            "comment": "“Hey men.. I’m not feel so good...”\n— Polycheates, probably.",
            "score": 1,
            "author": "DunkinTacoAlfa"
        }
    ]
}