{
    "id": "k9y005",
    "score": 39259,
    "title": "Extracting a baby",
    "author": "Master1718",
    "date": 1607540092.0,
    "url": "https://www.reddit.com/r/educationalgifs/comments/k9y005",
    "media_urls": [
        "https://i.imgur.com/lNfKtiG.gifv"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "And thats where CPR Dummies come from",
            "score": 9859,
            "author": "JKyneo",
            "replies": [
                {
                    "level": 1,
                    "comment": "You made my day. Thank you.",
                    "score": 837,
                    "author": "onlyhere4laffs",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So like I'd feel like I was breaking the kid's neck when they turn it",
            "score": 4529,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same, I'm no neckologist but it looks bad lol",
                    "score": 3035,
                    "author": "C-_-Fern",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a certified neckologist I can say that this particular baby doesn’t seem to have any bones so it should be fine.",
                            "score": 1389,
                            "author": "cortlong",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*looks and listens in awe*\nThank you ~~Mr~~ **Dr.** Neckologist!",
                                    "score": 254,
                                    "author": "C-_-Fern",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I gotchu homie. Lemme know if you have any more neck related questions. I know it all.",
                                            "score": 18,
                                            "author": "cortlong",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A neckspert, if you will",
                            "score": 54,
                            "author": "bikexpunk",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "The study of neckology!",
                            "score": 309,
                            "author": "Krumpus8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If more people studied neckology, we’d have less babies in the first place.",
                                    "score": 107,
                                    "author": "pineapplepoomba",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Doctor says I need a neckeotomy.",
                                    "score": 57,
                                    "author": "BaconIsBueno",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; I'm no neckologist   \n   \nAre you sure, man? You sound pretty damn professional to me.",
                            "score": 62,
                            "author": "vulfneck",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There's a reason that baby bones are like rubber.",
                    "score": 523,
                    "author": "Korwinga",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For the most part. Found out a few months later that my son's collar bone broke on his way out.",
                            "score": 383,
                            "author": "John_Fisticuffs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yikes! were they able to fix it, or was there any lasting damage?",
                                    "score": 133,
                                    "author": "SgtSilverLining",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not op, but it’s pretty common. I likely had the same injury as a baby but it was never noticed until I pointed out the lump on my bone to a doc when I was in my late teens. No lasting damage that I’ve noticed for myself, but a seamstress did say that I hold my shoulders a little unevenly.",
                                            "score": 268,
                                            "author": "willfullyspooning",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No lasting damage. We noticed around his 8 week or so checkup that he'd get fussy when we raised his arm to put clothes on him. They x-rayed and found the fracture that was already half healed or so and said to just limit how much we make him move his arms and it'll heal on its own. \n\nAnd it did. seemed to not be an issue at all within a few more weeks.",
                                                    "score": 141,
                                                    "author": "John_Fisticuffs",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Fucked that biology designed us to be born like this simply because it would allow our brains to be bigger and 2020 is what we're doing with it all.",
                                                    "score": 133,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's a combination of our bigger brains and our walking on two feet ability. Apparently we're still kind of in the middle to evolving the proper form to walk on two feet. Not like that'll fix itself though, modern society has really slowed or stopped that kind of evolutionary pressure",
                                                            "score": 38,
                                                            "author": "-entertainment720-",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Babies are super flexible. Just going through the birth canal is pretty traumatic but they squeeze and deform their way through somehow. I don’t really like to think about it though.",
                    "score": 364,
                    "author": "EaterOfFood",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The trauma is actually also part of the process. It forces fluid out of the baby’s lungs. Super weird. Hate thinking about birth.",
                            "score": 37,
                            "author": "borchhcrob"
                        },
                        {
                            "level": 2,
                            "comment": "It's also why their little faces are swollen. Lots of trauma, goes away in a couple of days",
                            "score": 11,
                            "author": "SecondaryLawnWreckin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The reason it doesn't is because the whole body inside mum turns. This turn is important so that the shoulders can be born vertically as they tend to get stuck if they try to come out straight.",
                    "score": 171,
                    "author": "Excluded_Apple",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is that why we have LGBTQ people?\n\n/s",
                            "score": 299,
                            "author": "khoabear",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Omg I just had this extraordinary moment of clarity because my shoulder was dislocated during birth and now I'm gay but then I remembered that's stupid. But like. Wow.",
                                    "score": 74,
                                    "author": "Daze_Confuse",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m in my OB/GYN clinical rotation of nursing school this semester, have gotten to see one vagina birth and two emergent cesareans. Every time I’ve seen the physicians pulling on the head I cringe thinking they’re going to snap their neck off.",
                    "score": 123,
                    "author": "F7OSRS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When the doc was performing the c-section on my wife. I shit you not, she was ELBOWS DEEP INSIDE MY WIFE. And they are not gentle when they’re yanking on the uterus to get it and the baby out. \n\nThen she casually like palms the baby and shows her to us and I’m like okay two hands please. \n\nAnd then my daughter slipped off a coffee table when she was 3-4 months old. \n\nShe’s fine but probably not getting into Harvard.",
                            "score": 169,
                            "author": "ImFamousOnImgur",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;She’s fine but probably not getting into Harvard.\n\nOof sorry to hear she's going to Princeton",
                                    "score": 40,
                                    "author": "DrEvil007"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 20,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is why I'd have a hard time being a nurse. I'd be so terrified of screwing up. *\"Congratulations Mrs. Jones, It's all....oh I ripped the baby's head off. Let me try to fix that\"*\n\nAnd here I felt anxious when I put the CPU in my new gaming PC and had to apply pressure to the latch. This is definitely a whole other level....",
                            "score": 77,
                            "author": "steavoh",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Omgsh, my vagina hurts watching this.",
            "score": 6725,
            "author": "Goosehasthreelegs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't have a vagina, and it still hurts.",
                    "score": 3905,
                    "author": "Bored_of_the_Ring",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it scared me how much it expanded, that has to hurt like hell.",
                            "score": 1192,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Contractions hurt so bad that you don't even feel this part.\nI ripped and didn't feel a thing.",
                                    "score": 1530,
                                    "author": "SlippyIsDead",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just tried to explain this to a man. It’s the giant muscle inside your abdomen that’s seizing up (like a muscle cramp) that is shockingly painful. Not stretching the vagina. I do that all the time, for fun.",
                                            "score": 1448,
                                            "author": "mysterysciencekitten",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "https://media.giphy.com/media/l3q2K5jinAlChoCLS/giphy.gif",
                                                    "score": 813,
                                                    "author": "SilkyZ",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This was my risky click of the day...",
                                                            "score": 759,
                                                            "author": "seahawks",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I've seen the AlChoCLS enough that I already knew what the gif was. I should probably take a break from the internet lol",
                                                                    "score": 148,
                                                                    "author": "MightyCaseyStruckOut",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "AND its so damn big at that point. Those mid to end labor is full body insanity pain. I had no pain killers and a home birth. So much pain, but I have zero regrets. Was amazing. Also agree w poster above-contractions and the pushing out hurt so much, the stuff goes number mid and after. Ooof",
                                                    "score": 218,
                                                    "author": "lesliethefatloser",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So much pain.  \n\nZero regrets.  \n\n&amp;#x200B;\n\nI have so much respect for you mums",
                                                            "score": 190,
                                                            "author": "FinnFerrall",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "When youre so big and laboring and get to the end, you just want the baby out. Very primitive. If i had to cut my head off and pull her out my neck, i would have at that point. My kid is the light of my life. Always. Shes 19",
                                                                    "score": 169,
                                                                    "author": "lesliethefatloser",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "lol! Mine is 17. The midwife says, “Do you want to reach down and touch her head?” \n\nFuck no. I want her OUT.",
                                                                            "score": 67,
                                                                            "author": "JustDiscoveredSex",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "it's either this or they cut a fucking hole and take you out that way. either way is like a 9.4-9.7 on the crazy-shit-o-meter",
                                                                    "score": 83,
                                                                    "author": "slowest_hour",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I was a caesarean after 48 hours of labour.\n\nI was also my moms second and final child.",
                                                                            "score": 49,
                                                                            "author": "insane_contin",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": " I was born Caesarean but you can’t really tell. However, whenever I leave my apartment I climb out the window.\n\n Steven Wright",
                                                                                    "score": 62,
                                                                                    "author": "timely_death"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Like your body literally does a bunch of chemical stuff so that they forget tsome of the pain of birth so they don't get ptsd",
                                                                    "score": 97,
                                                                    "author": "BrokenCrusader",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My whole body curled and ran away at your casual use of \"I ripped\"\n\nEdit:a word",
                                            "score": 320,
                                            "author": "meekishone",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "To paraphrase the great show 'scrubs' on the topic of childbirth: You'll fart, pee and poop in front of 10 complete strangers intently staring at your vagina, which by the way has an 80% chance of tearing.",
                                                    "score": 288,
                                                    "author": "shinyshinysnowflakes",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm going to poop?!",
                                                            "score": 70,
                                                            "author": "kirinmay",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I did. I also didn't care. Pain overruled everything. I even remember feeling the paper towel rub my ass when they picked it up like cat shit.",
                                                                    "score": 141,
                                                                    "author": "tknee22",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'd say you're allowed to squeeze out a little celebratory nugget if you're giving birth",
                                                                            "score": 44,
                                                                            "author": "Tanomil",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thanks for wording that for me. It’s been 11 years and I’ve never been able to say anything other than it’s weird, man.",
                                                                            "score": 38,
                                                                            "author": "CesiaFace",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I knew it was possible. My husband, sister and grandmother were there. I did not care what came out of me as long as a baby was at least one thing. It was the only way I would get relief.",
                                                                                    "score": 29,
                                                                                    "author": "tknee22"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "vaginal tearing is apparently pretty common so is pooping whilst giving birth",
                                                    "score": 193,
                                                    "author": "Aalnius",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Can confirm - did both. Hubby got a front row seat and has yet to let me live it down. It's been nearly 8 years!           \n \nEdit: Thanks for the award! I'd say that it was more than my hubby u/jeeby83 gave me but ya know ... Babies",
                                                            "score": 116,
                                                            "author": "GeekyDee",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Live it down? Makes me sound like I blame you! 😂\n\nTo be fair they asked me if I wanted to see. Immediate regret. They asked again for the second. Still looked.\n\nEdit: first ever award and it’s on a comment about my wife pooping herself in childbirth. Never change internet... never change",
                                                                    "score": 136,
                                                                    "author": "jeeby83",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Didn't poop that time tho! 💪",
                                                                            "score": 95,
                                                                            "author": "GeekyDee",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Y’all are so cute omg",
                                                                                    "score": 70,
                                                                                    "author": "langlanglanglanglang",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I always knew I was a piece of shit",
                                                            "score": 128,
                                                            "author": "dtexans18",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Paradoxically, your life may have been shittier if your mom hadn't shat on you during childbirth. \n\nThat gut flora is crucial for the baby's immune system.",
                                                                    "score": 72,
                                                                    "author": "Hope_Burns_Bright",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The rippin' and the tearin'. The rippin' and the tearin'.",
                                                    "score": 41,
                                                    "author": "deevil_knievel",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Just wait until you learn what a Fistula is!",
                                                    "score": 23,
                                                    "author": "namesarehardhalp",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Spoiler alert sometimes it rips down to your asshole, sometimes docs slice it open wider. Enjoy.\n\nEdit: you can also rip upward into your clit !",
                                    "score": 203,
                                    "author": "tawny-she-wolf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yup. I ripped upwards to my critical hood and it just... tore off. Good times. Apparently my kid's head size was the new largest on record for vaginal births on that floor.\n\nEdit: That's an autocorrect, but I'm leaving it because it's funny.\n\nEdit 2 to clarify vague language: the clitoral hood is what tore off. My clit was partially torn and lost function for a while, but is mostly okay again 3 years out. It wasn't a total tear in a straight line upwards from vag to clit, but everything stretched so much that the shortest connecting tissue - the hood and some labial tissue- failed under the strain.",
                                            "score": 196,
                                            "author": "St3phiroth",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Yup. I ripped upwards to my critical hood and it just... tore off.\n\n*Screaming Internally*",
                                                    "score": 187,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "ngl that's some screaming externally too",
                                                            "score": 43,
                                                            "author": "saccharind",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Did it heal OK???\n\n\nI am expecting my first so I am particularly filled with horror.",
                                                    "score": 40,
                                                    "author": "Yeah_dude_its_her",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "First, I'll say it's super rare, and my OB (who has delivered 30 years of babies) hadn't seen that happen to anyone before, and missed it at first inspection before I complained about it and checked the mirror. There was nothing really to be done though. Also, my kid had a record-breaking head, so that's also a statistical anomaly. \n\nI'll give you the TMI - the hood is definitely still gone, so things are way more \"exposed\" and for a while they were super overstimulated and painful, rubbing on undergarments, and I basically lost my ability to orgasm. I was afraid the ability was gone for good and definitely grieved that. At around 8 months postpartum, sensation started returning with lightening shocks at first, then gradually improved. Now, 3 years later, I'm back to \"normal\" sexually, though the hood tissue is still gone and things will occasionally rub it the wrong way.",
                                                            "score": 61,
                                                            "author": "St3phiroth",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Your kid must feel so special",
                                                    "score": 35,
                                                    "author": "Derpazor1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The frustrating(?) part to me is that she then was borderline failure to thrive and her head size percentile went from off the chart to 12%tile. So she really had no reason to grow it that big before the birth. Haha. \n\nMy second kiddo was induced a week early just in case since her head was also measuring gigantic. It was only half an inch smaller.",
                                                            "score": 69,
                                                            "author": "St3phiroth",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If I was on the fence about having kids *before*...",
                                            "score": 110,
                                            "author": "K-ghuleh",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Glad i could help ! ;)",
                                                    "score": 35,
                                                    "author": "tawny-she-wolf"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I am screaming. Thanks, I hate it.",
                                            "score": 40,
                                            "author": "zeeko13"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It does. Hurts a lot. They call it the ring of fire",
                                    "score": 20,
                                    "author": "WhovianBeatle",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 370,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Distinct lack of poop.",
                            "score": 234,
                            "author": "Geekenstein",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My sister was 12 when she heard this and it is the first reason why my mother never had grandkids.  As her only other child I am the second reason",
                                    "score": 91,
                                    "author": "Spacedude50",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The first thing my 2nd child did in her life was get her face pooped on by her mom\n\nI’ve never told anyone that",
                                            "score": 76,
                                            "author": "SupermAndrew1",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When I gave birth in June my husband only looked once and he made the oddest face.  He said, “I shouldn’t have looked.” Now I know why.",
                    "score": 8,
                    "author": "DrMcFoxyMD",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You need to press the bellybutton to extract baby.",
            "score": 1188,
            "author": "JukeBoxHeroJustin",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you press the belly button and perineum at the same time it takes a screenshot",
                    "score": 951,
                    "author": "fontizmo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nature is amazing.",
                            "score": 88,
                            "author": "JukeBoxHeroJustin"
                        },
                        {
                            "level": 2,
                            "comment": "I hope this gets the visibility you deserve",
                            "score": 11,
                            "author": "microwavepoopcorn"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No, that’s how you switch them on.\n\nAnd if it doesn’t work you smack the back between the shoulders where the batteries are.",
                    "score": 264,
                    "author": "OdaNova",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "2 births and I’m glad I’m only seeing this now.",
            "score": 821,
            "author": "accountaholic26",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here, now I see why the dad almost fainted both times.",
                    "score": 274,
                    "author": "stormoak101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought this said “my dad” at first and I was like what in the Alabama fuck",
                            "score": 194,
                            "author": "scarletts_skin",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "u/GifReversingBot",
            "score": 536,
            "author": "DindonProvencal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here is your gif!\nhttps://gfycat.com/OldfashionedFondBarbet\n\n---\n\n^(I am a bot.) [^(Report an issue)](https://www.reddit.com/message/compose/?to=pmdevita&amp;subject=GifReversingBot%20Issue&amp;message=Add a link to the gif or comment in your message%2C I%27m not always sure which request is being reported. Thanks for helping me out!)",
                    "score": 232,
                    "author": "GifReversingBot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 449,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Excellent bot",
                            "score": 34,
                            "author": "CrazyPlatypusLady"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 107,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "hilarious visual for all the parents who have joked about putting their kids back in/returning them when they’re acting up",
                    "score": 48,
                    "author": "txaglt",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Is there a way to upvote you, AND downvote you at the same time?",
                    "score": 110,
                    "author": "KJMRLL",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not really accurate. I watched the birth of my daughter. You're missing the insane amounts of blood and body fluids.",
            "score": 3836,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "And they always forget pushing out the placenta. My boyfriend said that was the worst part lol.",
                    "score": 1425,
                    "author": "nymphymixtwo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I’ll never forget my husband quietly saying in my ear “ omg. You just birthed an organ”",
                            "score": 1834,
                            "author": "Action-Bell",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Several, in fact :D",
                                    "score": 499,
                                    "author": "billyalt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah but the others are all conveniently wrapped.",
                                            "score": 257,
                                            "author": "wonkey_monkey",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The packaging helps with better delivery.",
                                                    "score": 55,
                                                    "author": "misterpobbsey",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 148,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Knew what this was going to be before I even opened it. Best series ever",
                                            "score": 18,
                                            "author": "UserUnavailableAgain",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I still remember the midwife doing some fairly violent (or so it seemed) moves on wife after birth of my son to get placenta out. Like a rough massage on stomach and pulling in naval cord to get it out. And then it snapped. Followed by blood everywhere and midwife saying: oops, hard one. Not to worry, looks worse than it is.\n\nAt that point I realized how messy births can be and how humans in general are being projected a fairytale version in school, movies and what have you not...",
                            "score": 402,
                            "author": "zensonic1974",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When you think about it, it's kind of a miracle that we survive as a species because of how crazy childbirth is.",
                                    "score": 225,
                                    "author": "mdp300",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I recall on another thread related to childbirth that human delivery is difficult, in large part, due to our evolution to stand on two legs.",
                                            "score": 131,
                                            "author": "rapidcalm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And our big brains. 🧠",
                                                    "score": 111,
                                                    "author": "xentropian",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Is that why I was such an easy delivery",
                                                            "score": 102,
                                                            "author": "QuantumField",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yes because human stood on two legs and our skeleton was made for standing on all fours (like a monkey) humans experienced neck and spine pain. Hips got narrower thus constricting the pelvis and the birth canal and because of our increasing large brains, it was difficult for women to birth children. Natural selection favored women that had “earlier births”  and therefore women birthed “smaller brain” babies. I read this in the first few chapters of Yuval Harari’s book: Homo Deus.",
                                                    "score": 23,
                                                    "author": "JakeFar4"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I delivered my 9 lb son with no medication. I unfortunately retained pieces of my placenta after delivering the bulk of it with the guidance of my midwife. They had to manually (read: with their hands)  reach inside to scoop out placental remains, sans epidural. The first midwife’s hands were too large with my swelling so they found another doctor to assist - Dr. Payne. \n\nSo after delivering my massive headed child with a minor para-urethral tear that was further exacerbated after being stitched (also no numbing - I was told there could be two pokes or if I wanted local anesthetic, three pokes)  by three separate manual placenta extractions, I had lost 2 liters of blood, and was so swollen “down there” that I needed a catheter. But the physical trauma had caused a hematoma in my urethra, which they had to push through forcefully in multiple attempts. \n\nBecause of my blood loss, I required transfusions. My husband at this point was sleeping on a couch in the room (approximately 4:30 am) and they required one able bodied adult to be awake to keep your infant in the room with you, so my son was moved to the nursery. My transfusions and final move into the recovery room had me settled around 5:30 am. My son was brought back from the nursery at 6:00 am. \n\nThey don’t warn you that they’ll come by every two to three hours post-delivery to mess with your IVs, check your catheter, and shove on your stomach and uterus to see if they can get any extra blood, fluids, or “debris” to flush out. \n\nConsider yourself warned!",
                                    "score": 75,
                                    "author": "havingagrandoldthyme",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "7 months pregnant and I wish I could un-read this. 🙃",
                                            "score": 17,
                                            "author": "lavanceypants",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Jesus 😵",
                                            "score": 13,
                                            "author": "cherry_",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That “uterine massage” is fucking awful. Massage after birth sounds nice right? Nope. Just did the hardest thing of your life and now you’re gonna get essentially sucker punched by a nurse until she’s satisfied with the shape of things in there. Cool.",
                                    "score": 33,
                                    "author": "Invictus_89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 30,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Doesn't it hurt when she rips it out basically like that?",
                                    "score": 27,
                                    "author": "raeumauf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, you’re not supposed to pull it. The placenta is attached internally to the uterus by a bajillion blood vessels. After birth and the cutting of the cord, the body starts to sever those blood vessels so that the placenta can detach and be expelled. At the same time the uterus is contracting which acts as like a tourniquet to control the bleeding. So the massaging IS helpful but tugging on the cord is NOT. You want to encourage the contractions of the uterus, not prematurely sever those blood vessel connections. Otherwise you risk mom bleeding out. (Source: I am an RN *disclaimer* but not a labour and delivery RN so I remember basically what’s going on but I’m no expert.)",
                                            "score": 140,
                                            "author": "Skitscuddlydoo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As a 36 yo woman with no kids, this whole post thread is not changing my mind at all.\n\nThanks!",
                                                    "score": 60,
                                                    "author": "TacoNomad",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What about cooking of the placenta",
                            "score": 66,
                            "author": "KraljZ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 142,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bit of garlic to spice it up?",
                                            "score": 29,
                                            "author": "KraljZ",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 26,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When I watched a birth it happened a lot faster too. Once the head was out the rest came a LOT faster.",
                    "score": 157,
                    "author": "Yawzheek",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's because of the fluids.",
                            "score": 127,
                            "author": "knotty_pretzel_thief",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Makes sense.\n\nThis dramatization is somewhat accurate, but what is saw was \"Here comes the head, head through ***FLOP*** that's a baby.\" There was far, FAR less time between the head and everything else.",
                                    "score": 78,
                                    "author": "Yawzheek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 50,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Slippery when wet",
                                    "score": 22,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I have birthed 4 babies and 2 of them came out similar to this (slowed for the shoulders because they were big) and 2 of them came out like rockets once the head was born. Haha fun times.",
                            "score": 88,
                            "author": "Excluded_Apple",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Imagine squeezing two open tubes of toothpaste in one hand and trying to make sure nothing comes out of the second one.",
                    "score": 100,
                    "author": "pbzeppelin1977",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "and body solids",
                    "score": 55,
                    "author": "lego_office_worker",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yea the mother not shitting is kinda inaccurate",
                    "score": 187,
                    "author": "ObiWan-Shinoobi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My wife didn’t.",
                            "score": 49,
                            "author": "PGKing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mine didn't either. I did tho",
                                    "score": 164,
                                    "author": "richasalannister",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[\"You'll fart, pee, puke, and poop in front of ten complete strangers who will be staring intently at your vagina, which, by the way, has an 80 percent chance of tearing.\"](https://youtu.be/uMcIUmfTZS4?t=6)",
                            "score": 76,
                            "author": "theghostofme",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Thats why you gotta support the perineum.",
                            "score": 17,
                            "author": "mogsoggindog",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's what makes it so useful for demonstrations.  With a real birth there are some things you're actively trying not to see.",
                    "score": 25,
                    "author": "kirkum2020"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I give birth in a few weeks...pls no.",
            "score": 797,
            "author": "olivegirl94",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’ll do great! ❤️",
                    "score": 338,
                    "author": "iluvluci",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are very sweet, thank you! ❤",
                            "score": 137,
                            "author": "olivegirl94"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 208,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Any other advice? We’re expecting our first in 2 months. \n\nI really don’t want my wife is going to go thru this kind of pain, she’s the most precious thing in my life. Anything I can do to make things easier for her I will do.",
                            "score": 87,
                            "author": "thrownawaypermanentl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 151,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Your wholesome comment and advice actually erased the horror of the GIF for me. I can tell you really love your babies. Thanks for spreading the love! Still not sure if I'll have kids but know your internet comments made people smile :)",
                                            "score": 56,
                                            "author": "aR0sebyany0thername"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As a new dad you just described my life, great advice",
                                            "score": 14,
                                            "author": "commentings",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You are gonna have bad ass nurses taking care of you and if your support system is smart they will lie to you in the moment and encourage you like there is no tomorrow",
                    "score": 55,
                    "author": "2319Mine",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I somehow made it to being a 25 year old woman without seeing anything like this (state with bad sex Ed) and like...was no one gunna tell me this is how it is until I was in one of those already-pregnant info classes??",
            "score": 734,
            "author": "Coolerthanyew",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lel im 30 and ive gone my whole life until now without seeing the real detail of a child being born. I couldnt begin to imagine how it looks for real. Fuck...",
                    "score": 107,
                    "author": "SekhmetTheWise",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m jealous. We had to watch a video of a vaginal birth for 5th grade health class. I threw up and to this day have a birth phobia. My uterus thanks science for IUD’s!",
                            "score": 9,
                            "author": "Nostalgianothing",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is pretty tame though. IRL it's the bloody fluids, shit, incessant bleeding from the episiotomy that makes it horrifying. But the neonatal part pretty cool though.",
                    "score": 369,
                    "author": "thedenigratesystem",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don't always shit and an episiotomy is not standard procedure, its only done under certain conditions.",
                            "score": 173,
                            "author": "DMindisguise",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dude, same. I'm 28F and this is my first time watching anything about the actual birthing process.",
                    "score": 58,
                    "author": "twofourfixhate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 38,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Women I’m sorry.",
            "score": 764,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "We're sorry, too, waffle...",
                    "score": 128,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "So are we.  But thank God I have never and will never do this.  Never ever.  Thanks to a tubal ligation.  🙌",
                    "score": 229,
                    "author": "planet_druidia",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "And men think their dicks can loosen us up! Lol",
            "score": 994,
            "author": "anxiouschub",
            "replies": [
                {
                    "level": 1,
                    "comment": "Whenever I hear people brag about getting laid like \"destroying that pussy\" or \"blowing out her back\" I remind them the only vagina they ever wrecked was their mom's.",
                    "score": 261,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I laughed so hard, thank you",
                            "score": 33,
                            "author": "GroundbreakingMess51"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dicks loosening up a vagina is stupid especially since it’s always based on number of partners not amount of sex (by that logic lots of monogamous sex with one partner would be worse than infrequent sex with multiple partners, but the latter is what women get shamed for).\n\nThat said, isn’t there some sort of chemical/hormonal process going that really dilated the vagina here?",
                    "score": 88,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol, didn't you know? Vaginas are made of memory foam!",
                            "score": 41,
                            "author": "retard_vampire",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Actually men think that being a dick can loosen women up.",
                    "score": 255,
                    "author": "Trollercoaster101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"What's up, baby? Ugh, you're fat.  Wanna fuck?\"\n\n-Dude, on some subway train, probably.",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wonder how long it'll be until some guy will come along and act like he knows more about your body than you do. That'll be going to r/badwomensanatomy\n\nEDIT: I'm specifically referring to the guys who think a woman will \"get loose\" if she has sex too much. Sheesh.",
                    "score": 142,
                    "author": "InvertedSuperHornet",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe a lil NSFW, I’m sat on a train and the dude next to me is probably thinking I’m watching birthing videos for fun lmao",
            "score": 1180,
            "author": "Colvack",
            "replies": [
                {
                    "level": 1,
                    "comment": "NSFT",
                    "score": 169,
                    "author": "RedSoakingWet",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "To be fair the title said ‘extracting a baby’ what did you expect, digging a baby up from a mine haha",
                    "score": 514,
                    "author": "NumeroRyan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lol right, we are ALL watching this birthing video for fun, it's all good, it's not real and it was quite interesting aside from the neck cranking",
                            "score": 74,
                            "author": "informedlate",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We need a RFW (Risky For Work) tag for stuff like this that isn’t porn or awful, but it isn’t something you would just show anyone.\n\nBasically we need PG-13.",
                    "score": 49,
                    "author": "king063",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That is what you’re doing.",
                    "score": 30,
                    "author": "EaterOfFood"
                },
                {
                    "level": 1,
                    "comment": "Why else would you watch them?",
                    "score": 24,
                    "author": "farnsworthfan",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Huh. So that’s what I missed when i refused to watch myself give birth in the mirror.",
            "score": 198,
            "author": "nymphymixtwo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hehe no.  No, it's not what you missed.  I love my kids a lot, and admire my wife for the strength to give birth to them.\n\nBut what you missed is an abomination on man and god.",
                    "score": 263,
                    "author": "teflong",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 39,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I always felt that this was why I had a belly in my way, to block the view. Heck, when I looked days later after the first one, I cried because I saw stitches, but everything went back to what I recognized pretty quickly",
                    "score": 26,
                    "author": "BunBuntPass"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fucking horrific. My tubes just tied themselves.",
            "score": 377,
            "author": "sekhmetx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here. Double knot",
                    "score": 67,
                    "author": "vivagropi",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 126,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congratulations! Hope mom and baby are doing good and that youre not too traumatised!",
                    "score": 20,
                    "author": "cabbage16"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Why do you want to adopt?”",
            "score": 21,
            "author": "SLynch0000"
        },
        {
            "level": 0,
            "comment": "#That’s it, I’m never having kids.",
            "score": 135,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Human population drops to zero after watching this one video",
                    "score": 41,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks, this solidified my decision to NEVER have children.",
            "score": 91,
            "author": "forestcritters",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm currently in the process of being induced and now even more scared lol",
            "score": 26,
            "author": "kikicutthroat90",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Welp, I guess my lunch break is over.",
            "score": 126,
            "author": "theglenlivet12",
            "replies": [
                {
                    "level": 1,
                    "comment": "It didn't even have sauce",
                    "score": 44,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "12 weeks pregnant right now. \n\nFuck.",
            "score": 74,
            "author": "creamily_tee",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When I was in fifth grade, our science teacher made us watch a film of a woman giving birth. I’m 36 and I’m still traumatized to this day. Thanks, Mrs Baylon",
            "score": 55,
            "author": "pop_and_cultured",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I will never put my wife through this. The slim chance that she could die is just not worth it.",
            "score": 10,
            "author": "PillowFightProdigy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Bit on a tangent, but I heard birthing babies in a more up-right position is both natural and more effective for poppin out the baby. Is this true?",
            "score": 35,
            "author": "BigDADDYognar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Other positions, like hands and knees or squatting, do help because instead of pushing the baby UP and out, you’re using gravity to your advantage and pushing the baby down and out. Squatting can put too much power behind the push though and increases the risk for tearing from what I have seen. Most women where I’m from get epidurals making these positions either difficult or impossible. (Former maternal nurse, I’ve seen this about 4,000 times)",
                    "score": 33,
                    "author": "qualitylamps",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "“for education only” \n...\n*zips up pants in disappointment*",
            "score": 10,
            "author": "PM_ME_WHITEBOARDS"
        },
        {
            "level": 0,
            "comment": "The most terrible part is it’s probably even more difficult than that:(",
            "score": 47,
            "author": "atiredthing",
            "replies": [
                {
                    "level": 1,
                    "comment": "SO much worse. Had 3 all totally natural. Wanted to die each time.",
                    "score": 35,
                    "author": "doinmybest4now",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't understand why nature wouldn't chuck some endorphins in there to be honest, seems cruel.",
                            "score": 18,
                            "author": "plumtastic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Evolution likes “good enough.” Lol.",
                                    "score": 27,
                                    "author": "thesoundmindpodcast"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "After reading about five posts on this I want to never see a child be born",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Is this where they teach the nurses to elbow drop women on the stomach when the shoulder gets stuck like they did to my wife.",
            "score": 14,
            "author": "Frack-rebel",
            "replies": []
        },
        {
            "level": 0,
            "comment": "&gt;\\*for education only",
            "score": 41,
            "author": "Cerian_Alderoth",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? That part had me cracking up. It's way more polite than the old warning, which was \"DO NOT FUCK THE PRACTICE VAGINA\".",
                    "score": 7,
                    "author": "Maclimes",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah fuck that imma get my tubes tied",
            "score": 8,
            "author": "tinakiba"
        },
        {
            "level": 0,
            "comment": "Guess who's never gonna have kids 🙋🏻",
            "score": 8,
            "author": "TherealJanaki4eva"
        },
        {
            "level": 0,
            "comment": "Noteworthy: this is probably the worst anatomical position for the mother's pelvis to be in for birthing. Ideally she'd be in a squat to widen her hips, get her tailbone out of the way and straighten the birth canal.\n\nThis position is used so the doctor can sit comfortably on a stool and see everything happening.\n\nEDIT - I guess there are technically worse positions. Being in head stand with the ankles crossed, for example. \n\nThe point is that this is a bad position for mom and baby, but is used for convenience of the doc.",
            "score": 93,
            "author": "Theungry",
            "replies": []
        }
    ]
}