{
    "id": "xsrcv4",
    "score": 6741,
    "title": "Influence of latitude on sunrise location",
    "author": "Wololo--Wololo",
    "date": 1664617979.0,
    "url": "https://www.reddit.com/r/educationalgifs/comments/xsrcv4",
    "media_urls": [
        "https://i.redd.it/v8hzq4r026r91.gif"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Another thing I’d like to grab the popcorn and watch flat earther’s struggle to explain.",
            "score": 51,
            "author": "MEEfO",
            "replies": [
                {
                    "level": 1,
                    "comment": "ThEyRe ArE mUltIPle “SuNs” YoU ShEEpLe, ItS ObViOUs.",
                    "score": 17,
                    "author": "BrainwashedScapegoat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What I don't get is what is the motivation to perpetuate the lie that the Earth is round? What would be the point of NASA and all that if the Earth was flat?",
                            "score": 11,
                            "author": "Frigoris13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly!!!",
                                    "score": 6,
                                    "author": "BrainwashedScapegoat"
                                },
                                {
                                    "level": 3,
                                    "comment": "I actually think they think it is so the government can have a shitload of money that they can do whatever they want with because it's supposedly accounted for through nasa.",
                                    "score": 5,
                                    "author": "thegreatbrah",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You don't even need to make that logical leap if you do, like, 5 minutes of research on the US' military budget. Classic example of our tendency to ascribe things to conspiracies when the actual thing is kinda the same but simpler and not really a secret",
                                            "score": 4,
                                            "author": "StormThestral"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They just like to think they have some secret information and they are smarter or above everyone else. It's just an attempt to hide the fact that they are of limited intelligence....\"I'm so dumb that I've gone full 180 and am actually super intelligent!\", it's the easiest way out for them.",
                                    "score": 3,
                                    "author": "rickwaller"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s obviously mirrors, you plebeian",
                    "score": 1,
                    "author": "blckshirts12345"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The location of the sunrise changes over the year (see this post --&gt; [sunrise location throughout the year](https://www.reddit.com/r/educationalgifs/comments/xqh6ja/sunrise_location_throughout_the_year_new_york/?utm_medium=android_app&amp;utm_source=share)). On the equinoxes it rises due East, and at other times, either in the SE or the NE.\n\nHowever, the variability in sunrise location is dependent on a location's latitude. To demonstrate this, the sunrise location over the year is shown for 5 different locations on Earth:\n\n\\+45 N, -70 W: in Maine, US\n\n\\+22.5, -70 W: in the ocean near Turks and Caicos\n\n0.0, -70 W: the equator in Western Brazil\n\n\\-22.5, -70 W: in Chile,\n\n\\-45 S, -70 W: in Argentina\n\nYou can see that the range of the sunrise annual change is greater the father away from the equator you are. This is a consequence of the Earth's shape, as well as its orbital tilt.\n\nCredits to CCNY Planetarium and openspaceproj.",
            "score": 76,
            "author": "Wololo--Wololo",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is very cool. I live in Hobart, Tasmania, Australia at 42 degrees south but grew up in Darwin, Northern Territory, Australia at I think around 2 degrees south.\n\nThe difference in sunrise and sunset positions over the year is pretty big. Also there isn't much twilight in the tropics, the sun just plunges straight down and then it's dark. Whereas here in Hobart there can be what feels like hours of twilight.\n\nThe other thing I've noticed in my travels is that the sun and moon move counterclockwise through the sky in the souther hemisphere, but clockwise  in the Northern Hemisphere. When I was a kid I used to wonder why clocks go clockwise, until I realised that they were invented in the North and that's the way the sun goes up there.",
                    "score": 33,
                    "author": "GershBinglander",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d like to see a world globe made with the southern hemisphere on top. Just for the perspective. After all, there’s no up or down in space.",
                            "score": 9,
                            "author": "wufoo2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There’s a great [scene from the west wing](https://m.youtube.com/watch?v=vVX-PrBRtTY) about this",
                                    "score": 12,
                                    "author": "iamahonkey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interesting",
                                            "score": 1,
                                            "author": "NationRazer"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same! But on the other side of the earth.  I grew up in Southern Ontario, Canada, but now live in northern Ontario (north of Timmins).  We have a nice sunset view, and its fascinating how the location of the sun down changes.\nAlso have those long twilight times.  I love talking on the phone with friends down south, where its been dark the last half hour and we're still enjoying a lovely glow.",
                            "score": 7,
                            "author": "The_north_forest"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a shitty apartment with one south window and this is the reason I have best indoor growing conditions during winter months, even though the daylight hours are shorter.\n\nI've tried to explain to people, but during the summer the sun path shifts in just such a way so my window gets much less light due to surrounding structures and how the window is situated (I have to use the upper half for plants).\n\nWinter I get nice, direct rays most of the shorter day. So it's all backwards in here with my potted plants. Wasteland summer, lush winter. ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
            "score": 12,
            "author": "xrumrunnrx"
        },
        {
            "level": 0,
            "comment": "Excellent educational clip, thanks heaps. \n\nI recently learned from the comments on another similar post that a lot of people wrongly believe that the direction of sunrise is always South of due East (for Northern hemisphere) throughout the whole year. Conflation with the noon azimuth concept, I guess. \n\nHopefully animations / visualisations like this will help spread awareness of these basic astronomical concepts. And as I always say, if in doubt just go outside &amp; look.",
            "score": 18,
            "author": "DeeJuggle",
            "replies": [
                {
                    "level": 1,
                    "comment": "From this one? [Sunrise](https://www.reddit.com/r/educationalgifs/comments/xqh6ja/sunrise_location_throughout_the_year_new_york/?utm_medium=android_app&amp;utm_source=share)",
                    "score": 4,
                    "author": "Wololo--Wololo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes. Was genuinely surprised to see some commenters just flat out saying the video was wrong because it showed the sun moving North of due East. \n\nUnfortunately, my usual response of \"just go outside &amp; look\" might have to wait half a year if they're in the Northern hemisphere (posting about a week after the September equinox). For those of us South of the equator, get out there &amp; see the sun moving North at sunrise &amp; sunset!",
                            "score": 3,
                            "author": "DeeJuggle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ive heard that the earth axis is slowly straightening. has anyone seen  articles about it?.",
            "score": 7,
            "author": "Boesermuffin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you talking about [precession](https://astronomy.com/magazine/ask-astro/2017/01/what-makes-earth-wobble) by chance? I could be off the mark but maybe that's what you heard?",
                    "score": 4,
                    "author": "Bob_Ross_was_an_OG"
                },
                {
                    "level": 1,
                    "comment": "The earth's axis of rotation does indeed move ever so slightly.  Not at all something we could physically observe on human time scales but cosmic ones, absolutely.\n\nEarth's rotation is also slowing by a fraction of a second every year due to drag from the moon and will eventually become tidally locked with it, unless the sun will go nova before that point.  I don't have the exact figures handy, but in dinosaur days the length of a complete rotation of the earth about its axis (one earth \"day\") was like half an hour shorter than today.  In a few more tens of million years we may need to add another leap day to the calendar, but I'm sure humanity as we know it will be long gone by then.",
                    "score": 4,
                    "author": "angrydeuce"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wait are we on our sides all the time (relative to the plane in which we orbit the sun)?",
            "score": 12,
            "author": "StevenTM",
            "replies": [
                {
                    "level": 1,
                    "comment": "You mean the tilt we see at the top animation halfway through the video?\n\nYes, Earth has an axial tilt of about 23°. Have a read if you're interested --&gt; [Earth's axial tilt -- Wikipedia](https://en.m.wikipedia.org/wiki/Axial_tilt)",
                    "score": 14,
                    "author": "Wololo--Wololo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bottom animation, but yes. I'm having a mild existential crisis.\n\nEdit: okay, the tilt is only 21-24 degrees relative to a line perpendicular to the orbital axis. Phew.",
                            "score": 6,
                            "author": "StevenTM",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hello from Australia. \n\nOne benefit of growing up \"down under\" is I think we're naturally more used to the concept of North = up as just an arbitrary convention. Once you've got that, sideways, back-to-front, changing perspectives, is all pretty ...whatever.",
                                    "score": 7,
                                    "author": "DeeJuggle"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ah no, bottom animation somewhat depicts length of days rather than sunrise location or how the Earth orbits the sun. \n\nThe orientation has been put this way probably to fit the 2 animations together, don't overthink it. It's just the same information in a different orientation, I hope this helps with the crisis.",
                                    "score": 5,
                                    "author": "Wololo--Wololo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Have at it, but don’t send them.",
                            "score": 1,
                            "author": "hocobozos"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi, If I live in London, can you tell me where it rises precisely? . Where can I find the variations during months? Thank you \n\nPs.. Did you create that ? It’s amazing 🙏",
            "score": 5,
            "author": "Birdy1979",
            "replies": [
                {
                    "level": 1,
                    "comment": "This resource can perhaps give you the information you're looking for --&gt; https://www.suncalc.org/#/51.1132,-0.7226,3/2022.10.01/09:25/1/3\n\nYou get all the information about the sun in relation to the Earth and you can use the calendar feature to get the info for any given day.\n\nHopefully that helps for whatever you had in mind.\n\nAnd no, I didn't create this (CCNY planetarium &amp; openspaceproj did)",
                    "score": 8,
                    "author": "Wololo--Wololo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m very grateful, thank you",
                            "score": 3,
                            "author": "Birdy1979",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Glad to hear you found it helpful!",
                                    "score": 2,
                                    "author": "Wololo--Wololo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You could go outside.",
                    "score": 3,
                    "author": "wufoo2"
                },
                {
                    "level": 1,
                    "comment": "https://www.timeanddate.com/sun/uk/london",
                    "score": 2,
                    "author": "buttercup612"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is super cool, where are the places they took these recordings?",
            "score": 2,
            "author": "BrainwashedScapegoat"
        },
        {
            "level": 0,
            "comment": "No idea what’s happening lol",
            "score": 2,
            "author": "PixelsDePx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cool",
                    "score": 2,
                    "author": "GlowsticksII",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Welcome back to reddit",
                            "score": 1,
                            "author": "PixelsDePx"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Right I watched this like 5 times trying to understand",
                    "score": 1,
                    "author": "yikesafm8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Woah does this confirm the world is flat?\n\nSorry had to but this is really cool to see 😊",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "u/savevideobot",
            "score": 1,
            "author": "dizzyderata"
        },
        {
            "level": 0,
            "comment": "u/savevideobot",
            "score": 1,
            "author": "FreedomNinja1776",
            "replies": [
                {
                    "level": 1,
                    "comment": "Link:\n\nhttps://redditsave.com/info?url=/r/educationalgifs/comments/xsrcv4/influence_of_latitude_on_sunrise_location/",
                    "score": 1,
                    "author": "FreedomNinja1776"
                }
            ]
        },
        {
            "level": 0,
            "comment": "FAntastic!",
            "score": 1,
            "author": "MarkivSilent"
        },
        {
            "level": 0,
            "comment": "Can anyone find/create this for sunset as well?",
            "score": 1,
            "author": "CullenaryArtist"
        },
        {
            "level": 0,
            "comment": "so satisfying...",
            "score": 1,
            "author": "Fearless_Girl112"
        },
        {
            "level": 0,
            "comment": "Man, I wish I can have this as a screen saver on my iPhone, I could easily just remain mesmerized by this all day 🤩",
            "score": 1,
            "author": "zye-LOANee"
        },
        {
            "level": 0,
            "comment": "Excellent content!",
            "score": 1,
            "author": "CashewAddict"
        },
        {
            "level": 0,
            "comment": "u/savevideo",
            "score": 1,
            "author": "AkuLives"
        },
        {
            "level": 0,
            "comment": "(To scale)",
            "score": 1,
            "author": "BeardClinton"
        },
        {
            "level": 0,
            "comment": "That first animation doesn't seem accurate:\nIn the Southern hemisphere *below* the tropics the sun never rises further South than East.\nIn the Northern hemisphere *above* the tropics the sun never rises further North than East. So 45'N and 45'S should *not* have the same sunrise headings ; but in this animation that's exactly what is happening.\n\nTo add to this this, at about 80 degrees North, the \"sunrise\" is nearly directly South in Winter as if you go far North enough, it's permanently dark! At that time of the year at 80 degrees South, the sun is most certainly *not* rising from the South when you're near 80 degrees South!!",
            "score": 0,
            "author": "zaTricky"
        }
    ]
}