{
    "id": "zd2w8b",
    "score": 8129,
    "title": "How to tie a trucker's hitch",
    "author": "demizeus",
    "date": 1670234636.0,
    "url": "https://www.reddit.com/r/educationalgifs/comments/zd2w8b",
    "media_urls": [
        "https://gfycat.com/wanpowerlessallensbigearedbat"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "These knot videos I could watch all day and then try to do it and still be completely lost.",
            "score": 601,
            "author": "Weremoose10",
            "replies": [
                {
                    "level": 1,
                    "comment": "Doesn’t help that they’ve edited out several steps.",
                    "score": 254,
                    "author": "TheVicSageQuestion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Indeed, it does knot help at all…",
                            "score": 107,
                            "author": "Exciting-Insect8269",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s bullshit, I did knot hit her. I did knoooot. Oh hi, Mark!",
                                    "score": 31,
                                    "author": "MICKEY-MOUSES-DICK"
                                },
                                {
                                    "level": 3,
                                    "comment": "r/Angryupvote",
                                    "score": 2,
                                    "author": "Pav_22"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A useless gif on EducationalGifs, must be a day that ends in Y",
                            "score": 11,
                            "author": "thanatossassin"
                        },
                        {
                            "level": 2,
                            "comment": "And left out the final, critical half hitch. Goddamn I hate what tiktok has done to the internet.",
                            "score": 3,
                            "author": "pirate_starbridge"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Try [animatedknots.com](http://animatedknots.com)",
                    "score": 67,
                    "author": "CrustedButte",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For OP’s knot. \n\nhttps://www.animatedknots.com/truckers-hitch-knot",
                            "score": 24,
                            "author": "-DementedAvenger-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Looks like a different setup.\n\nBut this one also looks less floppy, more secure.",
                                    "score": 4,
                                    "author": "handlebartender",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Practical application with full tension will generally look tighter than a teaching example.",
                                            "score": 1,
                                            "author": "pirate_starbridge"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thanks! That site is really cool!",
                            "score": 3,
                            "author": "TwiceAsGoodAs"
                        },
                        {
                            "level": 2,
                            "comment": "Saving for later.",
                            "score": 1,
                            "author": "Shavepate"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don’t worry Ylvis have you covered https://youtu.be/TUHgGK-tImY",
                    "score": 27,
                    "author": "reuben_iv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Let’s tie this knot!",
                            "score": 7,
                            "author": "spittingdingo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, once I watched a 30s video to knot a tie. Took 5 min from me to do same.",
                    "score": 6,
                    "author": "gefroy"
                },
                {
                    "level": 1,
                    "comment": "r/knots",
                    "score": 2,
                    "author": "fukitol-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Risky click of the day",
                            "score": 0,
                            "author": "TheWeirdWriter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No no that's knotting",
                                    "score": 0,
                                    "author": "KnewItWouldHappen"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My brain seems entirely incapable of following or remembering what happens in these videos. Like, I’m sure with enough time, and pause button, I could do this. But the knowledge would have nowhere to stick. No room in my brain for this.",
                    "score": 2,
                    "author": "bobfnord",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It would stick if you do activities that benefit from practice and use of knots, like anything with boats, helping someone move, even cable organization under your desk. If you ever start using it for that stuff, then knot tying for fun starts to stick as well. There's no such thing as no room in the brain.\n\nTrucker's hitch isn't all that useful for every day use unless you're.. trucking. The most useful knots are, in order: two-half-hitches, taut line hitch, bowline, and slipknot.",
                            "score": 1,
                            "author": "pirate_starbridge"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "First class armature on YouTube has a better version of this knot and a lot more. Check him out.",
                    "score": 1,
                    "author": "fredandersonsmith"
                },
                {
                    "level": 1,
                    "comment": "Yea. Just like those videos of clever ways of folding clothes.",
                    "score": 1,
                    "author": "samTheSwiss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Except knots are actually useful. Lashing kayaks on cars, not being useless when camping, anything boat related...",
                            "score": 2,
                            "author": "pirate_starbridge"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "noted",
                    "score": 1,
                    "author": "dribrats"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And... of course the video leaves out how to secure the knot, the most important part. Why even post this ffs. More like broken educationalgifs",
            "score": 485,
            "author": "blueskiesandclover",
            "replies": [
                {
                    "level": 1,
                    "comment": "Title should have given this info but this is less a knot and more faux mechanical lever to get the rope super tight. The purpose of the knot is captured in the video but you are correct to point out it needs a knot knot to secure it. \n\nAlso interesting is this seems to use a sheepshank as the base knot with some extra looping added. Sheepshanks are wierd in that they will hold as long as there is a load but come undone if the load drops.",
                    "score": 55,
                    "author": "washyleopard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was like \"That sure is one way to tie it!\"",
                            "score": 4,
                            "author": "noxxit"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Didn't you see? He just twirled it around limply. What else would one need?",
                    "score": 8,
                    "author": "allisonmaybe"
                },
                {
                    "level": 1,
                    "comment": "Typically you would use a half-hitch then secure the tail with an overhand.",
                    "score": 7,
                    "author": "pooppate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "While true, for the novice it might be helpful to show where to place the half-hitch.",
                            "score": 1,
                            "author": "noxxit"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah the tension keeps it there. I just tie it off with a clove hitch and it’s good. People complaining just don’t know what they’re talking about.",
                            "score": 1,
                            "author": "donnydealr"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thousands of upvotes though, because, Reddit.",
                    "score": 15,
                    "author": "Aromatic_Armpits"
                },
                {
                    "level": 1,
                    "comment": "/r/gifsthatendsoon",
                    "score": 15,
                    "author": "TaxExempt"
                },
                {
                    "level": 1,
                    "comment": "Here, try [this video](https://youtu.be/TUHgGK-tImY) if you need more detailed directions",
                    "score": 1,
                    "author": "Beeblebro1"
                },
                {
                    "level": 1,
                    "comment": "/r/brokeneducationalgifs\n\n/r/subredditwasborn anyone?",
                    "score": 1,
                    "author": "RominRonin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What does this do?",
            "score": 66,
            "author": "therealdivs1210",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gives you mechanical advantage to get the rope really tight, without creating a knot that you can't undo at the end.",
                    "score": 169,
                    "author": "PauI360",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh cool. So basically a cargo strap",
                            "score": 45,
                            "author": "DoomsdayTheorist1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like a cargo strap, but knot a cargo strap.",
                                    "score": 59,
                                    "author": "lordcarnivore",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do not knot a cargo strap",
                                            "score": 5,
                                            "author": "Pitboyx"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The mechanical advantage comes from the leverage you're able to apply on the tow hook after looping the rope around it. \n\nThis mechanical advantage would be there regardless of what knot you use. \n\n With other knots you would have to introduce some slack in the line so you can then put a knot in. With the truckers hitch it doesn't let any slack out as you pull the rope tight... and sets tight once you stop pulling.",
                            "score": 13,
                            "author": "DockDoor__Doom",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There is a self locking version of the truckerss hitch, but this version is not self locking and is more complicated than needed.",
                                    "score": 16,
                                    "author": "Docuss",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep this version only sets tight.. the additional tie up is needed if you want it locked in \n\nThe trucker hitches used to secure guylines are the best form of this knot imo",
                                            "score": 1,
                                            "author": "DockDoor__Doom",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I like to tie an alpine butterfly in the line, run it to the anchor point, then back threw the butterfly, pull tight &amp; then tie it off with 2 half hitches on a bight.",
                                                    "score": 5,
                                                    "author": "bladow5990",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's my preference too, less hassle with retaining tension if whatever we're securing is slippery or flexible.",
                                                            "score": 3,
                                                            "author": "Dan_706"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "r/confidentlyincorrect , but close. \n\nWrapping the rope around the tow hook only introduces friction into the system. The mechanical advantage comes in when you take the tag end from the tow hook, and pass it through the initial bite that is tied up high. Bummer the video doesn’t show the knot finished. You can then pull down on that tag end, creating what is effectively a 2:1 mechanical advantage. Set tension and finish with a Munter/Mule, half-hitches, or whatever you prefer down low. In this case the bite at the top not only redirects our force like a pulley, it also acts as a force multiplier.",
                                    "score": 7,
                                    "author": "Weary_Dragonfruit559",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, its the same principle used in a block and tackle (how overhead cranes work), you get mechanical advantage at the cost of having to run additional length of rope through the pulleys, the two loops move together relative to each other, long story short, you have to exert less force in and get more force out",
                                            "score": 3,
                                            "author": "CoolHeadedLogician"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Cool idea. I will try to think of another way to do it now that I have seen this video. One that uses less rope.",
                            "score": 5,
                            "author": "StnMtn_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, there's a bunch of different ways to do a trucker's hitch. Any combination of knots that makes a loop in the rope, then goes around the tie down, and back through the loop to tighten the rope before tying off the end can be called a trucker's hitch.",
                                    "score": 16,
                                    "author": "EpeeGnome",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just listening to you say that feels like i already used a lot of rope",
                                            "score": 10,
                                            "author": "MightySamMcClain"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This one is one of the more complicated ones ive seen",
                                            "score": 3,
                                            "author": "schwaebebaby",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I agree, this particular style seems unnecessarily complicated to me. It does look like it would hold well and come out easily after use, but there are easier ways to accomplish that.",
                                                    "score": 2,
                                                    "author": "EpeeGnome"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There is a specific single knot that works great and pulls out when you are done.  The knot in the video is unnecessarily complex.",
                                            "score": 2,
                                            "author": "TaxExempt"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Look up on YouTube “automatic trucker’s hitch” by FirstClassAmature",
                                    "score": 5,
                                    "author": "TobyHensen"
                                },
                                {
                                    "level": 3,
                                    "comment": "Check out the ones campers use to cinch down their tent guylines. They're simpler to do and still hold very tight.",
                                    "score": 2,
                                    "author": "DockDoor__Doom"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She burns",
                    "score": 1,
                    "author": "babyProgrammer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most importantly, you have to say \"There -- that's not going anywhere.\"",
            "score": 300,
            "author": "TargetOfPerpetuity",
            "replies": [
                {
                    "level": 1,
                    "comment": "*slaps side of truck*",
                    "score": 70,
                    "author": "NorthernSparrow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Equally important. Good call.",
                            "score": 22,
                            "author": "TargetOfPerpetuity",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You guys forgot the person who helped secure the load signaling to the driver through the side mirror with a thumbs up and yelling “you’re good!”",
                                    "score": 5,
                                    "author": "zer0w0rries",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can't believe we overlooked them.\n\n*Note -- in lieu of \"you're good!\" drivers may substitute \"rock and roll!\"",
                                            "score": 3,
                                            "author": "TargetOfPerpetuity"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No, no. You have to pluck the rope while saying it or it'll come Undone.",
                            "score": 6,
                            "author": "cheese_sweats"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Then proceed to take it anywhere",
                    "score": 30,
                    "author": "earthfase"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://youtu.be/TUHgGK-tImY",
            "score": 180,
            "author": "michal_w96",
            "replies": [
                {
                    "level": 1,
                    "comment": "I read the title and the song started playing in my head",
                    "score": 25,
                    "author": "CreatoSnail"
                },
                {
                    "level": 1,
                    "comment": "Thank you, I was hoping somebody else knew of this lol",
                    "score": 36,
                    "author": "PeejWal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I haven't looked that band up since we found out what the fox said.  What else have they done lately that is good?",
                            "score": 16,
                            "author": "bretttwarwick",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Idk about lately, but Stonehenge has always been a favorite for me. Mr Toot and Yogurt are great too. Almost had Yogurt played at my wedding, it objectively bumps lol",
                                    "score": 22,
                                    "author": "PeejWal",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nothing will replace the absurdity that is Massachusetts (Makkakoko?) in my heart.",
                                            "score": 18,
                                            "author": "Jamaninja",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "OMG how could I forget that one lol. I used to work in Massachusetts for a few years and would sing that on the reg",
                                                    "score": 4,
                                                    "author": "PeejWal"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "“That’s wayyy too many k’s”",
                                                    "score": 2,
                                                    "author": "doFloridaRight"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Stonehenge is amazing, I also really like Jan Egeland https://youtu.be/Yn-oemgzlEU",
                                            "score": 9,
                                            "author": "reuben_iv"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "All of their classics were amazing. Jogurt, Mr. Toot, I’ll never be a star.  More recently I loved their “you’re fucked” song about a guy caught drunk driving. Acapella is awesome too.",
                                    "score": 4,
                                    "author": "GeneralZaroff1"
                                },
                                {
                                    "level": 3,
                                    "comment": "This one’s been doing the rounds on TikTok https://youtu.be/2c6lf4P0Vtw",
                                    "score": 3,
                                    "author": "reuben_iv"
                                },
                                {
                                    "level": 3,
                                    "comment": "[Jan Egeland\n](https://www.youtube.com/watch?v=Yn-oemgzlEU)",
                                    "score": 2,
                                    "author": "80proofconfession"
                                },
                                {
                                    "level": 3,
                                    "comment": "Lol, they are more of a comedy duo(Brothers). All their music is comedy music.",
                                    "score": 0,
                                    "author": "Pentosin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;\tAll their music is AMAZING comedy music.\n\nFTFY",
                                            "score": 2,
                                            "author": "ChuckinTheCarma"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Here's something they dropped that's actually recent, just two months ago. It's in Norwegian not English so the reach probably won't be as big but it's 100% a banger and funny if you speak the language \n\nhttps://youtu.be/aPGfwAB1Gbw",
                                    "score": 1,
                                    "author": "DirtMaster3000"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Watching that 8 year old video right after OPs post and being like \"that looks kinda like a sheepshank actually\" was just a surreal moment that I'll never be able to replicate so thanks.",
                    "score": 9,
                    "author": "awfullotofocelots"
                },
                {
                    "level": 1,
                    "comment": "Of course they used the gangnam style melody",
                    "score": 1,
                    "author": "Insert_Bad_Joke"
                },
                {
                    "level": 1,
                    "comment": "I came hoping to find this song. Not disappointed. Thank you &lt;3",
                    "score": 1,
                    "author": "Angelphile"
                }
            ]
        },
        {
            "level": 0,
            "comment": "begins too late, ends too early",
            "score": 19,
            "author": "1-Ohm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Story of my life.",
                    "score": 1,
                    "author": "Hoitaa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People who come up with knots are literal wizards to me. I can knot even figure shit out by watching a video",
            "score": 39,
            "author": "GoobeIce",
            "replies": [
                {
                    "level": 1,
                    "comment": "More amazing is that there are actual maths and numeric modeling of knots",
                    "score": 11,
                    "author": "az987654",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "IIRC mathematical knots and real life knots aren't very similar. Irl ones are technically \"entanglements\".",
                            "score": 8,
                            "author": "CaptainMcSmoky",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Knots are only knots when they are from Knottsville, otherwise they are '*Sparkling Entanglements*.'",
                                    "score": 10,
                                    "author": "Strikew3st"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's all beyond me!",
                                    "score": 1,
                                    "author": "az987654"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "But...none of this actually secures the rope.  It's a bunch if loops on the middle (which might serve some function, although that isn't explained) but the bottom not tied to anything.",
            "score": 11,
            "author": "amdaly10",
            "replies": [
                {
                    "level": 1,
                    "comment": "The loops in the middle are a sheep shank (with an extra turn around the upper bight(rope speak for loop)) a knot used to shorten a rope or isolate a bad section of rope. They then run the rope to the hitch and back up to the lower bight on the sheep shank then the video cuts before they acualy tie off the rope. Tying 2 half hitches or better yet 2 half hitches on a bight (with a loop) is how I always secure the end",
                    "score": 6,
                    "author": "bladow5990"
                },
                {
                    "level": 1,
                    "comment": "If you loop around the truck hook and back through each hole once each, you get more leverage for tightening and friction for sticking as you tie it.",
                    "score": 2,
                    "author": "TaxExempt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[A better explanation](https://youtu.be/raTYwsfnsXg)",
            "score": 10,
            "author": "drums_addict",
            "replies": [
                {
                    "level": 1,
                    "comment": "Been scrolling for ages for this. Thaaaanks",
                    "score": 2,
                    "author": "dumbtalkpanda"
                },
                {
                    "level": 1,
                    "comment": "Not quite the same knot",
                    "score": 1,
                    "author": "Cyclotrom"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bring it up  \nCheck the rope  \nSpin around  \nOn the neck  \nWhip it, whip it  \nTake it home  \nBring it up, split it now  \n\nShoulder, now, make a loop  \nPull it, feed it, push it through  \nUp, stretch, down again  \nIn the face and prepare  \nLift, pull, bring it round  \nThigh, tie, tighten tie  \nKick the heel  \nSwivel time  \nRound, round, back to knot  \nC'mon!  \n\nPull the loop  \nDown and through  \nPull again  \nLift the hand  \nThrough the loop  \nMake a stitch  \nNow you got your Trucker's Hitch!",
            "score": 68,
            "author": "Vievin",
            "replies": [
                {
                    "level": 1,
                    "comment": "So easy to remember!",
                    "score": 16,
                    "author": "crooks4hire"
                },
                {
                    "level": 1,
                    "comment": "For some reason I can picture The Animaniacs doing a song and dance routine to this.",
                    "score": 4,
                    "author": "b1t_viper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This song is by Ylvis and is super fun and catchy!",
                            "score": 8,
                            "author": "IjsKind"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bitch, ima a trucker’s hitch!",
            "score": 7,
            "author": "Fairmount_Throwaway"
        },
        {
            "level": 0,
            "comment": "I didn't learn shit, this was not educational",
            "score": 5,
            "author": "aNeonSpecter"
        },
        {
            "level": 0,
            "comment": "Isn't there a simpler version of this?",
            "score": 4,
            "author": "roland_pryzbylewski"
        },
        {
            "level": 0,
            "comment": "That is such a shit way of doing it. It’s twice as complicated as it needs to be. Make a loop, twist it a few times and then pull the end through to make your locking loop. It’s simpler and easier to undo.",
            "score": 12,
            "author": "brickmadness"
        },
        {
            "level": 0,
            "comment": "No pls, im a knot expert. This is not how you knot.",
            "score": 4,
            "author": "BillyBadBoy"
        },
        {
            "level": 0,
            "comment": "You don't need the sheepshanky thing at the start, that's just one more potential failure point for novices",
            "score": 8,
            "author": "l94xxx"
        },
        {
            "level": 0,
            "comment": "There are simpler ways to do this. \n\nWhat is the purpose of the first step? Is it to make a fancy looking loop for no purpose?\n\nThe only thing I can think of is this distributes the load over more \"turns\" in the rope, thereby decreasing the likelihood of failure at a \"turn.\"",
            "score": 31,
            "author": "Plinian",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can think of this as tying a sheepshank knot, and then using the second loop as a pulley. A sheepshank both allows you to easily control the length of rope by adjusting the distance between the two loops, which is important if you are carrying variable sized loads and thus are using a rope that will occasionally be too long for your load, and it only stays tied under load. This means that when you release the tail after cinching it down, the knot falls apart. Cinching down other knots might make them hard to untie.",
                    "score": 26,
                    "author": "Fmeson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That checks out. Thank you for clarifying the purpose of the first step.",
                            "score": 4,
                            "author": "Plinian"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It also helps keep the second loop \"straight\" so that it doesn't \"untwist\" and release the whole knot. \n\nThis... works, but definitely easier and more flexible ways to do this that I can't describe in words.",
                    "score": 1,
                    "author": "fukawi2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just tie a simple loop on top rather than the elaborate knot.  They've always held for me, mostly use them on tarps, never to secure a load.",
            "score": 4,
            "author": "-BEEF-SUPREME-"
        },
        {
            "level": 0,
            "comment": "This is unnecessary too complicated, there’s always an easier way. Not to mention that half the time there’ll be a close loop to thread the rope thru, not an open hook.",
            "score": 6,
            "author": "DisasterTimes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well yeah an easier way is to have straps or pulleys sitting around haha.\n\nBut this method uses loops in the rope to get you the same mechanical advantage that a pulley would, and without tying a knot for the loop that would end up binding. \n\nI think this would still work with a closed loop instead of a hook, you could just tie the rope off using a taut line hitch or something. \n\nBut anyway, I just see this gif as a cool demonstration of a way to get purchase without binding the rope. A fun little esoteric solution that will probably never be necessary.",
                    "score": 0,
                    "author": "wagon_ear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I use one loop on the rope, it’s more than enough to tie stuff down. Keeping it simple is a better way to go about life.",
                            "score": 3,
                            "author": "DisasterTimes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a beautiful knot",
            "score": 2,
            "author": "LeeroyDagnasty"
        },
        {
            "level": 0,
            "comment": "IT IS THE GREATEST KNOT OF ALL!!!",
            "score": 2,
            "author": "Dave_BraveHeart",
            "replies": [
                {
                    "level": 1,
                    "comment": "SO FLEXIBLE AND STRONG!",
                    "score": 2,
                    "author": "TheInevitablePigeon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ever seen Ylvis' video on the same subject? \nIt's quite catchy! 😉\nhttps://youtu.be/TUHgGK-tImY",
            "score": 2,
            "author": "pinnsvin84"
        },
        {
            "level": 0,
            "comment": "Impossible to not say “that’s not going anywhere!”after tying one of these.",
            "score": 2,
            "author": "Optimal_Worth_6988"
        },
        {
            "level": 0,
            "comment": "Please don’t do this lol",
            "score": -6,
            "author": "chumblemuffin",
            "replies": [
                {
                    "level": 1,
                    "comment": "why?",
                    "score": 2,
                    "author": "Deppfan16"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just use ratchet straps.",
            "score": 0,
            "author": "Mr-47"
        },
        {
            "level": 0,
            "comment": "Best way to keep the hookers in one place",
            "score": 1,
            "author": "East-Character-2216"
        },
        {
            "level": 0,
            "comment": "That’s a cool jacket, reminds me of a comic book strip",
            "score": 1,
            "author": "lucidesposition"
        },
        {
            "level": 0,
            "comment": "I read *How to be a truckers bitch* when I first looked it and assumed the truckers **really** appreciated it. The video still works from both angles.",
            "score": 1,
            "author": "ihaveadarkedge"
        },
        {
            "level": 0,
            "comment": "The one I learnt 30 years ago was simpler than that ... Nice to see this one",
            "score": 1,
            "author": "mrmattyuk"
        },
        {
            "level": 0,
            "comment": "Wow. I've been doing it wrong. This method won't leave you with an untyable know after a heavy load.",
            "score": 1,
            "author": "BoomhauerYaNow"
        },
        {
            "level": 0,
            "comment": "If you cant tie a knot, tie a lot... and then curse a ton later",
            "score": 1,
            "author": "ilovequesadillas"
        },
        {
            "level": 0,
            "comment": "I always wanted to learn how to do that knot",
            "score": 1,
            "author": "Arlamanbradodor"
        },
        {
            "level": 0,
            "comment": "Nunca acerto estes nós",
            "score": 1,
            "author": "Sea_Foundation_9825"
        },
        {
            "level": 0,
            "comment": "Now you have a Truckers Hitch.",
            "score": 1,
            "author": "Virtual-Biscotti-451"
        },
        {
            "level": 0,
            "comment": "It's essentially a sheep shank with an extra loop",
            "score": 1,
            "author": "TheUnbiasedRant"
        },
        {
            "level": 0,
            "comment": "Bring it up! Check the rope. Spin around, on the neck! Whip it whip it, take it home, bring it up, split it now!..",
            "score": 1,
            "author": "TheInevitablePigeon"
        },
        {
            "level": 0,
            "comment": "This isn’t what we would call a trucker’s hitch in the US, but still a cool way to do it.",
            "score": 1,
            "author": "Tremodian"
        },
        {
            "level": 0,
            "comment": "I’d try to do it myself, but I do not have a CDL.",
            "score": 1,
            "author": "TrueCuriosity"
        },
        {
            "level": 0,
            "comment": "I believe you can accomplish the same end with a much simpler knot.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Safe enough",
            "score": 1,
            "author": "Pennyfreund"
        },
        {
            "level": 0,
            "comment": "I read hitch wrong for a second",
            "score": 1,
            "author": "opensourcer"
        },
        {
            "level": 0,
            "comment": "Wom can't be truk",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "are most of thesse knots just found out over centuries of experience or is there like a mathematical basis for a perfekt knot ?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "*one way",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You know what we need now though: How to untie a trucker's hitch",
            "score": 1,
            "author": "RunOrDieTrying"
        },
        {
            "level": 0,
            "comment": "/r/restofthefuckingowl",
            "score": 1,
            "author": "zbowman"
        },
        {
            "level": 0,
            "comment": "https://www.animatedknots.com/truckers-hitch-knot",
            "score": 1,
            "author": "TipsyTiger501"
        },
        {
            "level": 0,
            "comment": "Wow",
            "score": 1,
            "author": "partybenson"
        },
        {
            "level": 0,
            "comment": "Dude’s got nice hands",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[There's a lovely song about how to do this.](https://youtu.be/TUHgGK-tImY)",
            "score": 1,
            "author": "Rootkit9208"
        },
        {
            "level": 0,
            "comment": "Reminder to all that the \"Trucker's Hitch\" is not a specific knot. The name refers to a specific combination of elements; it just means you have a loop, you wrap around an object and through the loop like a pulley, and you tie it off with a hitch. There are many choices for what knot you use for the loop and what knot you use for the hitch. Instead of trying to memorize the steps in a video like this, I recommend first learning a good loop knot and a good hitch knot, and then learning to combine them to form a Trucker's Hitch.",
            "score": 1,
            "author": "myristicae"
        },
        {
            "level": 0,
            "comment": "I keep saving these kind of videos for years and never have used one of them.",
            "score": 1,
            "author": "Mictlan39"
        },
        {
            "level": 0,
            "comment": "There are a handful of easier ways of doing this.",
            "score": 1,
            "author": "stephzerker",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be honest, that knot is simple.",
                    "score": 1,
                    "author": "3ndt1mes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "u/savevideo",
            "score": 1,
            "author": "radek2105"
        },
        {
            "level": 0,
            "comment": "Looks more like a sheep shank thats incorporated into a truckers hitch.",
            "score": 1,
            "author": "RichardSnoodgrass"
        },
        {
            "level": 0,
            "comment": "Time to save post... and never look at it again.",
            "score": 1,
            "author": "safeforworkaccount69"
        },
        {
            "level": 0,
            "comment": "I love this knot. Especially, for hammock camping.",
            "score": 1,
            "author": "3ndt1mes"
        },
        {
            "level": 0,
            "comment": "\"Now you know the truckers hitch\" - Ylvis",
            "score": 1,
            "author": "Observator_I"
        },
        {
            "level": 0,
            "comment": "Ylvis would be proud",
            "score": 1,
            "author": "Jshappy21"
        },
        {
            "level": 0,
            "comment": "I’ve always wondered if people set out to tie a certain knot or if they just start looping and swooping until something happens? Do you just wrote down what you did in reverse order or draw pictures?",
            "score": 1,
            "author": "Kadorja"
        },
        {
            "level": 0,
            "comment": "....I'm more interested in that coat.",
            "score": 1,
            "author": "Armouren"
        },
        {
            "level": 0,
            "comment": "I thought this knot was dangerous only because it can be easily looped wrong and end up with a false knot, no?",
            "score": 1,
            "author": "MegaDonkeyDonkey"
        },
        {
            "level": 0,
            "comment": "Yes I know, Ylvis taught me",
            "score": 1,
            "author": "wty261g"
        },
        {
            "level": 0,
            "comment": "I, I know how to tie\nEvery kind of knot\nExcept one\n\nIt's so hard\nThe greatest knot of all\nSo flexible and strong\nBut I do something wrong\n(…)",
            "score": 1,
            "author": "uzuneto"
        },
        {
            "level": 0,
            "comment": "I'd rather see time lapse than jump cuts. Thatthow people end up watching the damn video a dozen times and still get it wrong.",
            "score": 1,
            "author": "desrevermi"
        },
        {
            "level": 0,
            "comment": "There used to be a website called \"knot-wars\" (or something similar) that showed how to tie almost every knot imaginable with animated gifs. I was going to post a link but I can't find it anymore. It also put knots head to head against one another (thus the name). It would show you how to tie them, show how much pressure they could take &amp; where the pressure was, if you could slide it, and what was the knot's best uses. It had a ton of valuable information for fisherman, campers and just general use. If anyone finds the site please post it.",
            "score": 1,
            "author": "Mo_Jack"
        },
        {
            "level": 0,
            "comment": "Interesting use of a sheepshank.",
            "score": 1,
            "author": "Adept_Information94"
        },
        {
            "level": 0,
            "comment": "Wow",
            "score": 1,
            "author": "YogurtCommercialGirl"
        },
        {
            "level": 0,
            "comment": "u/savevideobot",
            "score": -1,
            "author": "dizzyderata"
        },
        {
            "level": 0,
            "comment": "This is a very helpful knot",
            "score": 0,
            "author": "Mmaibl1"
        }
    ]
}