{
    "id": "10o1dbz",
    "score": 11,
    "title": "FAQ - Answered by a current Berklee student",
    "author": "ThatMusicianist",
    "date": 1674975210.0,
    "url": "https://www.reddit.com/r/Berklee/comments/10o1dbz",
    "media_urls": [],
    "other_urls": [],
    "postText": "Here are some of the most commonly asked questions by entering students/those interested in applying to Berklee.\n\n**Q: Are there gen eds?**  \nA: Yes, Berklee has required liberal arts courses such as English like Intro to College Writing, Math, Science, History, Psychology, and Visual Studies to name a few.\n\n**Q: What is the course load like?**  \nA: Most students take 8 courses per semester although you can take more or less. The minimum amount of credits required is 12 and the maximum amount of credits is 16. Throughout your time at Berklee, you can meet with an Academic Advisor who will help you plan your schedule each semester to make sure you graduate on time.\n\n**Q: I heard Berklee chooses your schedule for the first semester?**  \nA: Yes, Berklee does choose your first-semester schedule because everyone is required to take Core Music classes which consist of Harmony, Arranging, and Ear Training classes. Over the summer entering students will take ESPA exams, which depending on your scores, will let you test out of these Core Music classes. You can declare your major as early as October/November and start taking major classes your second semester depending on the prerequisites.\n\n**Q: I took (insert AP class) in high school can I get credits for it?**  \nA: Depends, Berklee has a list of approved AP and CLEP transfer credits\n\n**Q: What is a typical first semester of classes like at Berklee?**  \nA: 8 classes: Harmony, Arranging, Eartraining, MTEC (music technology which if you test out you take Intro to Music Business), Intro to College Writing, Private Instruction which is 50 minutes once a week, LENS (a seminar class which can be about varying topics like a Musicians Artistic Space, Mass Incarceration, History of Boston), Ensemble\n\n**Q: What are ensemble classes like during the first semester?**  \nA: During orientation week, you will have a ratings audition. You will bring in a prepared piece (5 min max or they will cut you off), sightreading, and you will be asked to do some improv. They may ask about your preferred styles/backgrounds.  After, you will be given a rating from 1-8. Not all ensembles require ratings, some require the approval of the professor and an audition.\n\n**Q: What are ratings and do they matter?**  \nA: Ratings are given after doing a rating audition and are based between 1-8. However, that number is averaged from 4 categories Improvisation, Instrumental Skills, Reading, and Stylistic Interpretation. You are scored 1-8 for all 4 categories and that number is averaged together. Scores are rounded down ex: If you score a total of 3.5 the number is rounded DOWN to 3. Ratings don't define you as a musician or what you're truly capable of, it's only used to determine what ensemble fits \"best\" for you, but not all ensembles even require a rating.\n\n**Q: What are the dorms like?**  \nA: Depending on which building, some buildings have private bathrooms like in 150, while others like 160 have a communal bathroom. The dorms are not super spacious so factor that in when bringing things, especially keyboards. There are quiet hours which are around 11 pm to 8 am each night. Some buildings like 150 have practice rooms available on each floor.\n\nI covered some of the main questions, but if you have any other Berklee questions post them below and I can try to help answer them as best I can!",
    "comments": [
        {
            "level": 0,
            "comment": "I think this is a really good post. I thought I should add some things. Most people take a full load of 16 credits starting after their first or second semester. Berklee will give you AP credit for most classes. However, you cannot get credit for music classes that you’ve done in AP or at another university. You have to test out of those courses on the ESPA. Still take AP, because it will help you get out of a lot of liberal arts courses. For ensembles, a lot of singers get low ratings like ones or twos. This is because most singers hit their peak later. It’s hard to be a child singing prodigy. Pretty much all singers unless you have a ridiculously high rating will get placed into an ensemble, called rhythm and grooves for vocalists. This course basically teaches you how to make lead sheets and communicate with a band in the jazz style. You don’t have to sing exclusively jazz, but it comes very much from that tradition. As for dorms, you really want to get 160 or 150. They are the closest to your classes, and they are clean and have air conditioning. 270 and 98 Hemenway are very far away and are known for not having air conditioning and having mice. Good luck! Feel free to DM me if you have any questions.",
            "score": 2,
            "author": "LiteratureLeading999"
        },
        {
            "level": 0,
            "comment": "where can i see all the gen ed courses? and how many are required?",
            "score": 1,
            "author": "hotairballoon89",
            "replies": [
                {
                    "level": 1,
                    "comment": "In order to see what courses you need for your major, there are charts called “Major Grids” Berklee students can log in and view. Typically there are about a total of about 14 gen Ed courses but that depends on your major. Some may require more or less.",
                    "score": 1,
                    "author": "ThatMusicianist"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can an ABRSM grade 8 certificate in vocals help me get into Berklee, if yes then how?",
            "score": 1,
            "author": "sadsquirrely",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not super familiar with the ABRSM nor am I a vocalist, but if you're talking about the Berklee audition It's more about then I would say your ability to sightread, understanding of rhythm, and ability to solo is most important so focus on those aspects.",
                    "score": 1,
                    "author": "ThatMusicianist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the answer",
                            "score": 1,
                            "author": "sadsquirrely"
                        }
                    ]
                }
            ]
        }
    ]
}