{
    "id": "11nzwrp",
    "score": 4,
    "title": "MA Online Film Composition Quality?",
    "author": "AccomplishedBag5124",
    "date": 1678480132.0,
    "url": "https://www.reddit.com/r/Berklee/comments/11nzwrp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey y'all, I'm looking at the Online Masters program for Film Scoring and was wondering if anyone has any insights into the quality of the Online MA programs? The curriculum looks solid, and the program would start much sooner than any of the other MA programs I was looking at (which is a huge bonus for me). There's an in-person MA program at the Valencia campus but I'd like to keep myself in NYC to facilitate being able to continue freelancing on the side. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I'm in the online Songwriting MA program and have really enjoyed it! The platform itself is easy to use and the workload has been manageable at 3 courses per semester. As a pregnant person with a wonky work schedule and ADHD, the online program has been way better for my life and brain than in-person college was (Berklee at the Boston campus 09-13). I think this definitely varies from person to person, though. I can't speak to the Film Scoring program, but I've enjoyed most of my classes. My biggest gripe is that the course schedule is rigid - there are no electives, so I have had to take a couple of classes that don't interest me. Even the ones I haven't been excited about have still helped, though, and a few of my classes have been genuine game changers.\n\nI've found with Berklee in general that the less famous the professor, the better the teaching (this isn't always true, though, and I've had a couple of awesome famous professors). It's really easy to reach out to professors through the messaging system, so I've been able to get quick answers for any and all questions. I've also found that making friends has been easier than expected since you tend to have a lot of classes with the same \"cohort\". Happy to answer specific questions if you have them!",
            "score": 5,
            "author": "aprilkeez",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!! This helps a lot. Just at the beginning of exploring my options, but will definitely reach out if something else comes up. thanks again!!",
                    "score": 3,
                    "author": "AccomplishedBag5124"
                }
            ]
        }
    ]
}