{
    "id": "1392g0k",
    "score": 3,
    "title": "waitlist - Berklee freshman year in Spain",
    "author": "No-Stop-2018",
    "date": 1683323125.0,
    "url": "https://www.reddit.com/r/Berklee/comments/1392g0k",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi - My son has been on the waitlist for Berklee Boston and Berklee Valencia as a freshman for September. He found out just now he didn't get in but the admissions email specified Berklee Boston. Does anyone know if the Spain program would be issuing its own email or was this one for both? At one point there was an email promoting the Spain option and it said if you join that WL they will email you \"on May 9.\"  I don't want him holding out hope for a different decision on May 9 if that door is closed.\n\n(Separately - He decided rather late to apply and didn't put in as much effort as optimal in preparing for the audition. (He auditioned on keyboard but wants to major in music production.) He has accepted a spot at Drexel University's RAMP program but was talking about possibly applying again and transfering to Berklee at a later point. Any advice on whether that's worthwhile and whether he would be more likely to get in?\n\nThanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "I would email the admissions office asking about the spain program, they will have the info on that. Also as far as I know, berklee doesn’t consider what your major is if your audition wasn’t up to standards.",
            "score": 2,
            "author": "globglobbyman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks - my son called when he got the email but they were already closed today. He will check next week. I mentioned the audition because they don’t have an audition format for music producers. They required him to audition on an instrument even though that isn’t what he has studied. That seems to handicap kids who aren’t performance focused so I wondered if spending time studying piano would make a difference. It would seem hard for someone who isn’t a piano star to be up to the standard of people who have dedicated themselves to the instrument.",
                    "score": -1,
                    "author": "Perfect_Mousse_205",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah unfortunately since everyone starts off undeclared I think that studying piano would definitely help, also the music production major isn’t guaranteed you have to apply for it after 2 semesters, I wish him luck though :)",
                            "score": 1,
                            "author": "globglobbyman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you ask?",
            "score": 2,
            "author": "Frosty_Evening3937",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks - they were already closed. He will try next week.",
                    "score": 1,
                    "author": "Perfect_Mousse_205"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hi sorry did you get a chance to call them?",
            "score": 1,
            "author": "Frosty_Evening3937"
        }
    ]
}