{
    "id": "dluupk",
    "score": 5,
    "title": "This subreddit is giving me anxiety lmfao. But I’ve got some questions.",
    "author": "loganandreoni",
    "date": 1571809605.0,
    "url": "https://www.reddit.com/r/Berklee/comments/dluupk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Senior in high school from the middle of a corn field here, reading all of this is really making me nervous but man do I really want to go to this college. Any tips? I just finished filling out my application, just need my fee waver from my counselor. What would be the next step if they accept my application? I see an audition is all over the place. I play guitar. Do I need to play a song? In person or over camera? Why is this so stressful? .-.",
    "comments": [
        {
            "level": 0,
            "comment": "At my audition I played my piece and was pretty happy with it, then when I was given the sight reading piece I pretty much told the guy I'd never done any sight reading. I sat there, looked at it for a second, tried to play it but messed up on the second note, and kept struggling until he told me it's okay, I don't have to do it.\n\nI'm writing this from class at Berklee right now.\n\nYou're gonna be fine. The audition is incredibly laid back, don't overthink the piece or try to play something complicated to \"impress\" the judges. Play what makes you happy, what you think makes you shine through the most.\n\nI'm a first semester guitarist here so I know what you're going through, I was exactly where you were last year. I would absolutely recommend coming here, it's amazing so far. DM me if you'd like, I'd be happy to help with anything else man.\n\nDon't stress too much!",
            "score": 5,
            "author": "hackjolland",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome! Will do :)",
                    "score": 2,
                    "author": "loganandreoni"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Auditions are in person, you prepare a piece to play for the judges. You also get asked to sight read and a couple other things to determine the level you’re at. You also sit down for an interview. This is all in one day, and goes pretty fast.\n\nDon’t be stressed, it’s surprisingly a very easygoing interview and audition process.",
            "score": 3,
            "author": "009reloaded",
            "replies": [
                {
                    "level": 1,
                    "comment": "I cannot sight read to save my life oh no lol. Especially while playing guitar bc I only understand sheet music when singing and not playing unless I sit there and write out each note you know?",
                    "score": 1,
                    "author": "loganandreoni"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You dont need to worry too much about the audition..go in and just simply do what you are best at. Good luck!!!",
            "score": 1,
            "author": "NorthStruggle123"
        },
        {
            "level": 0,
            "comment": "Are you rich, or are you being offered a full scholarship? If not, skip Berklee (too much debt) and get a degree in something that will actually give you job opportunities.",
            "score": 0,
            "author": "tibbon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m most definitely not rich lmaoooo. One can dream. However, money won’t be what stops me. I haven’t filled out all of my fafsa and scholarships or anything like that yet. Still working on it.",
                    "score": 1,
                    "author": "loganandreoni",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cool, and good luck. I was in your shoes once, and thought money wouldn’t stop me. It didn’t stop me, but then having 150k in debt slowed me down hard and prevented me from actually being in music jobs, because I needed to live in a big city and also pay over 1k a month in loans, which didn’t add up at music industry salaries. \n\nGo through the process but be willing to turn away. I wish I had gone to school for computer engineering/science, as I work now as a software developer and I’m happy and well paid. Had I done that in the first place I’d probably be doing yet more music now because I wouldn’t have this debt.",
                            "score": 2,
                            "author": "tibbon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah reality is a bitch but I’m sure I’ll figure it out. Thank you for your input because in the end I’ll have to take price into consideration big time. I want to go into music tech engineering and production. I mess around with logicx, guitar, and piano quite often in my little room and I just want to take that higher places.",
                                    "score": 1,
                                    "author": "loganandreoni",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Yeah reality is a bitch but I’m sure I’ll figure it out.\n\nPlease think really hard about this. What u/tibbon said is really fucking important, and could fuck you up for the rest of your life. I graduated in 2013, and the cost has almost DOUBLED since then. I know very, very few people who are close to finishing off their loans and it's fucking them up, hard. Working crazy, endless hours during the day to pay your bills, living with 4 roommates in a tiny apartment, begging to get gigs that pay $250 to get home at 3am, if you're lucky. Then getting up again at 5am for an opening shift at their non-music-industry job.\n\nAnd these are the talented musicians, everybody wants them in the band, they came into Berklee sight-reading, ratings 5+, but the pay isn't ever enough to keep up with your loan payments. Even the dude I knew who got the presidential scholarship (full ride) is struggling because of the high cost of living in Boston while he was attending.\n\nRead this, top to bottom: \n\nhttps://www.collegecalc.org/colleges/massachusetts/berklee-college-of-music/\n\nBut this line in particular:\n&gt;The total of all payments including interest would sum **$192,637.09**. This could be your effective total out of pocket cost of an education at Berklee College of Music. Note that this calculation **assumes you don't pay full list price tuition**, are part of the reported 51% of students at this school who receive financial aid\n\n\nWhatever you need to pay for rent, food, etc, etc... you will also need to pay an addition **$1,600 PER MONTH** for the next **10 YEARS** to pay off your loans, assuming you've qualified for financial aid. That means if you manage to find a steady, salaried job that will pay you $50k per year, more than 50% of that is going to paying off your Berklee loans.\n\nYes, reality is a bitch, but don't fuck your future self by saying \"I'm sure I'll figure it out\" -- figure it the fuck out NOW.",
                                            "score": 5,
                                            "author": "laggingtom",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also; good luck finding a job out of Berklee that will pay $50k a year... or even after several years. \n\nInstead what you'll find are a ton of \"internships\" that want you to work there for 2-3 years, for no pay or $10/hr, 40-50 hours a week, with your own car (to do deliveries for them), in NYC or LA. And paying NYC or LA rent ($1000+ month for even a shitty place). Oh, and none of them will give you health insurance, etc... all of these things seem unimportant when you're 17/18, but really do matter. Another real downside is that no one wants to date a 25-year-old broke-ass musician who can't even afford a cup of coffee (these aren't my words, but the words I heard from people when I was 25 and broke trying to date). Good luck ever saving money for a car, house, vacation, etc when you're paying for student loans nonstop. \n\nOn the flipside, go to a cheaper school for *any* engineering field, and get a job paying $70-100k right out of school, pay minimal (or no) student loans, and then have the time/money to buy a house, travel, buy music gear, buy a van to gig with your band, go to the nice recording studios in town, etc.",
                                                    "score": 4,
                                                    "author": "tibbon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So what is GOOD ab Berklee? Everything you guys says seems terrible.",
                                                            "score": 1,
                                                            "author": "loganandreoni",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The instructors are great. Class sizes are small, and you'll get far more 1:1 instruction than you will pretty much anywhere else, in any subject. Even my largest classes like Acoustics were only 75 people or so, which is about the average class size for things at many universities. \n\nIt isn't a research institution, so professors aren't constantly chasing grants. On the downside, there's no research mentality, so there isn't opportunity to get your names on papers and such. \n\nThere's pretty great (although sometimes crowded) access to neat gear; but really don't let that overly excite you. Access to the MP&amp;E studios is tight, late nights, and never for as long as you want. It will get you some great experience, but also is there to impress for tours and such. Realistically, I got *far* more studio time and gear access at a medium-sized public university in NC than I ever did at Berklee.\n\nEveryone's in it for similar reasons; so there's a lot to connect with other students about. There are no non-music people (obviously), which is unique. But also a downside, in that people aren't particularly well rounded, and it can be a bit of an echo chamber.\n\nIt's a \"different\" college experience than most in that there's practically no campus. I used to joke that Berklee didn't own a single blade of grass. That might not be true now, but it is a distinctly urban feel, and doesn't have the sprawling idyllic campus for late night walks, growth and contemplation. For some people that's great, for others less so. \n\nIf you're already good, and want to get great, then this can be an amazing opportunity to connect with people, including professors and really accelerate your career. But if you just go to class and get grades, then it really isn't worth it. You need to be making it a super active experience, and digging in deep. \n\nIt's weird, now over a decade out of Berklee, I'm friends with some professors and see them as peers. They are all great; but they also don't seem magical to me. Talented, absolutely, but I have my own special talents as well and just think of them as normal people. \n\nIf I went to Berklee again in some magic time machine, I'd focus super hard, not date anyone (seriously that ate a lot of my life living with a girlfriend then), and basically eat/sleep/breathe music for four years. Play on every gig possible, and not care if it's \"my perfect idea of music\" or not. Get to know professors. Get to know people running music businesses in town. I'm not sure where it would net me in the end, but it would be something. I'd probably have focused on one instrument a little harder. I'm a multi-instrumentalist, but that's harder to get gigs than just being a badass at one.",
                                                                    "score": 3,
                                                                    "author": "tibbon",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Damn. Thank you. I have a lot to think over.",
                                                                            "score": 2,
                                                                            "author": "loganandreoni"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "MP&amp;E is kinda a trap. It's good, but also can fuck you. You can't apply for it (or this was the case over a decade ago) until you've been there a year already. If your Ear Training and other skills aren't up to their level, you've wasted a year  (and $50k) and can't get in.\n\nBerklee also isn't for people who \"mess around\" with various instruments or dabble a bit. I'm sorry if I'm nitpicking, but this place will chew up and spit out people who aren't living and breathing it every minute. It's harsh, but it's also only 10% of how the music industry will treat you, so buckle up. Shit is rough out there.\n\nThe people I knew who were successful from Berklee were so good coming in the door they basically didn't need it, and then dropped out after a year. Esperanza Spalding was the only person I knew who made it big who graduated. Everyone else noped out pretty quick.",
                                            "score": 2,
                                            "author": "tibbon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So what colleges would you recommend instead?",
                                                    "score": 1,
                                                    "author": "loganandreoni",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The places I'm going to list are *hard* to get into, and I'm aware not everyone (including myself likely) can get in. \n\n- MIT\n- Oberlin\n- Harvard\n\nHarvard is actually a pretty far 3rd there, but does offer some really unique experiences and my friends who went there have done well for themselves and are happy. \n\nMIT is really the star there. Here's the fucked up secret: there's more innovation happening musically at MIT than Berklee. More interesting synthesizers. More technology for music things. More students who are truly making original music and art. More on-campus opportunities. Better bands playing at their parties (fucking Nirvana played Steer Roast, basically a big dorm party, in 1990- and didn't go anywhere near Berklee). I know 10x more good musicians at MIT than I know at Berklee. Plus, then you have a degree that actually matters, ability to raise money for interesting projects, easy paths to jobs, etc. \n\nAt all of these, there's the feeling around you that your fellow students (and you) will change the world. At Berklee, there's a feeling that someone might go on tour some day.\n\nAlso at these, financial aid is real. It's a fucking joke at Berklee. None of my friends who went to MIT or Harvard are sinking in debt.",
                                                            "score": 2,
                                                            "author": "tibbon",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wow that’s really interesting. I have quite a knowledgeable background in technology and electronics. That honestly sounds like a great fit for what I’m interested in. Thank you so much!",
                                                                    "score": 1,
                                                                    "author": "loganandreoni"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}