{
    "id": "e1bktk",
    "score": 6,
    "title": "Are there any chances for a classical performer to get the scholarship at Berklee?",
    "author": "grintroy",
    "date": 1574660782.0,
    "url": "https://www.reddit.com/r/Berklee/comments/e1bktk",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a high school student, studying in Russia in a prestigious music school where the classical musicianship of students is developed through all the eleven years of studying and mixed with a regular school curriculum. I have been playing piano for 14 years now, and, during the last couple of years, even though that my current major has been Choir Conducting, my piano abilities were marked with a distinction by the piano department. Although I haven't had attended any piano contests and competitions for the past few years, I believe that I've got a great basement knowledge and skills set in the field of not only performance, but in a music theory as well — in my curriculum I have such subjects as Harmony, Solfege, Music Form and others. Also, it is good to mention that my GPA for the previous year was somewhat around 3.9 (converted from school system to a maximum of 4.0 points).  \n\n\nSo, I'm going to apply to Berklee College of Music. But there is an issue — I can afford myself to attend this university only when I am granted the scholarship.  \n\n\nThus, there is my question — is it possible for a classical musician to be given a good scholarship at Berklee?  \n\n\nP.S.: The major I'm looking for is not Performance — on the opposite, I'm going to choose Contemporary Music Writing and Production, Music Production and Engineering, or both.",
    "comments": [
        {
            "level": 0,
            "comment": "Yes! I auditioned with a Mozart violin concerto and an original piece in a classical style, and I got a scholarship. It's not fantastic, but it helps significantly.",
            "score": 3,
            "author": "link5669"
        },
        {
            "level": 0,
            "comment": "Alongside the other comment: Berklee officials said they are going to be leaning more towards need-based scholarship. Not sure when this is going to be implemented, but I imagine that you will get something to help if you need it to attend",
            "score": 2,
            "author": "PM_ME_DRUMSETS"
        }
    ]
}