{
    "id": "etrpsr",
    "score": 3,
    "title": "Auditioning in a month, stressing myself out WAYYY too hard",
    "author": "therealwavygravy",
    "date": 1579964254.0,
    "url": "https://www.reddit.com/r/Berklee/comments/etrpsr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm from Scranton, PA and have my audition in Philly and I'm freaking out a little bit. I'm a pretty decent multi instrumentalist with Guitar, Bass Guitar, Drums, Ukulele and know some basics about playing Banjo, Saxophone, Shakuhachi, and Piano, but Guitar is my main instrument. I'm almost done learning \"Bold as Love\" by Jimi Hendrix, but I don't feel like I play well enough to really impress them. I see how confidently a lot of the players are on YouTube that got in there and I can't help but feel very intimidated by their chops. I can improvise a bit (Mainly blues scales, learning major and minor scales as we speak), do some basics sight reading, and I have a little ear training. \n\nI put my major as Composition and quickly threw three pieces together on MuseScore between Dec.22nd-31st (was a last minute decision, my own fault) and submitted those on my application as well. Two pieces are Jazz band pieces that are pretty *bizarre* and a 5-piece orchestra that is simpler, but very enjoyable IMO.\n\nBasically, my questions are:\n\nDid I pick a strong enough song? How much do things like improv and sight reading better your chances? Should I bring one of my different instruments along for another piece? As a composition major, are their specific audition/interview requirements? \n\nAny answers and tips would be greatly appreciated. Thank You!",
    "comments": [
        {
            "level": 0,
            "comment": "I was relatively calm before the audition, but then I started freaking out an hour before the audition. \n\nI would say the prepared piece and the improvisation are the most important aspects of the audition, with sight reading maybe being the least important aspect since a lot of people don’t understand how to.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Good luck! I'm from Pittsburgh, but know hella people from the 570. Just applied a few weeks back for masters at the Valencia Campus. I'm getting pretty nervous about my decision as well. You've made it this far, so you know they're considering you. Just keep shedding away. You can only give it your best shot. You got it!!!",
            "score": 1,
            "author": "manuonthekeys"
        }
    ]
}