{
    "id": "jzjhhl",
    "score": 9,
    "title": "Interview",
    "author": "Fermatamon",
    "date": 1606144766.0,
    "url": "https://www.reddit.com/r/Berklee/comments/jzjhhl",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I got confirmation with admissions with a zoom link a week ago. Then I received a reminder saying to have Skype ready instead. I spent 20 minutes waiting for my interview only for admissions to email me saying it is on zoom.\n\nI only had a 10-minute interview. It was a pleasant one, but I don't know. I might have ruined my chances with this one.\n\nUpdate: They allowed me to have another interview only if I think that the 10 minute interview didn't finish. They haven't admitted fault or apologized at all while I'm here apologizing profusely. I mean I get it that they sent a zoom link first. This wasn't the first mishap I've had applying.\n\n1. First I found a discrepancy between the instructions of application on the app and the admissions page. This was after I applied.\n\nThe admissions page gave a 2 minute max limit for videos. The actual application had no limit for the app videos but everything else had limits similar to the admissions page.\n\n2. They never updated my app to say they had my transcripts, which gave me a heart attack a week after deadline. (They had it)\n\n3. Now this.\n\nAll these things and I still feel like I was the problem child and I feel like that is how they are going to view me.\n\n&amp;#x200B;",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is it really this bad? I see other interview/Audition posts and people are having a blast.",
                    "score": 4,
                    "author": "Fermatamon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i would email admissions. I’m sure they’ll be understanding about the situation, maybe provide screen shots? Good luck!",
            "score": 3,
            "author": "meleebird",
            "replies": [
                {
                    "level": 1,
                    "comment": "I emailed admissions asking if anything was wrong and they sent me the zoom link lol 20 minutes in. Here's hoping they'll let me have another one.",
                    "score": 3,
                    "author": "Fermatamon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yikes! They should definitely do a “make-good” on this. I hope they will.",
            "score": 2,
            "author": "onebiscuit"
        },
        {
            "level": 0,
            "comment": "That's messed up, sorry you had to go through that. I'd try emailing someone higher up to clear anything up. You shouldn't have to have your chances hurt because of their mistake.",
            "score": 1,
            "author": "hackjolland"
        },
        {
            "level": 0,
            "comment": "I'm sure they'll consider how stressful a time it is to be auditioning online. It's a new experience for them and for you and there are so many examiners that it would be hard to maintain a standard or protocol in this interview process. Which is why I'm sure they'll consider the situation! In fact being apologetic and nervous are very common and normal behaviour and I doubt they'll use it as leverage to judge you. But you know I would be just as irritated as you are if I was in a similar situation and hope they correct other issues you've faced as well as apologise to you. \n\n&amp;#x200B;\n\nHope this makes you feel a little more secure!",
            "score": 1,
            "author": "HappyPicnic"
        }
    ]
}