{
    "id": "s8qhgx",
    "score": 16,
    "title": "Berklee vs Berklee Online",
    "author": "awakenhappy",
    "date": 1642705832.0,
    "url": "https://www.reddit.com/r/Berklee/comments/s8qhgx",
    "media_urls": [],
    "other_urls": [],
    "postText": "My son is a junior in high school and has been involved with his school bands since 7th grade. He wants to pursue a career in music, namely music scores for soundtracks for film, and video games. He plays the oboe, clairnet, and now percussion. He also taught himself to play the keyboard. \n\nBesides the obvious, do you think Berklee online differs greatly from Berklee? In what ways?",
    "comments": [
        {
            "level": 0,
            "comment": "Berklee grad here ('09)!\n\nIn short, it differs the most in terms of the opportunities he'd be able to have by going in-person vs. taking classes online, and consider that an umbrella for a myriad of things like jam sessions, campus life, interfacing with instructors, living in Boston and such.\n\nEven though I don't always recommend Berklee (the cost alone makes it hard to recommend, as well as what you get out of it in the end since that very much varies on how much effort you put in), the major thing that you really get out of going to Berklee is the experience of actually being *there*.\n\nBerklee Online has its merits (I've taken a couple courses when I was thinking I'd get my MBA, but that was nearly a decade ago now).  I think it gives you a lot of the elements of Berklee's core curriculum (theory is theory is theory), but not the intangible stuff you get with experiencing something in-person.  I would also say, considering what your son is interested in (scoring, creating music for film/video games), Berklee Online is not the way to go and he'd vastly benefit from going to Berklee vs. the online route.\n\nFeel free to follow up with any questions and take it with a caveat that I have no recent experience with Berklee Online, so not sure how it is today (it could be better - and I hope it is! - than it was in its infancy).",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "'07 grad. Agreed. \n\nThe difference between any online school and the in-person experience is HUGE. Especially with how hands-on Berklee is. You're not going to play in a 10 piece ensemble over Zoom.\n\nHarvard Extension School online is not the same as going to Harvard. MIT courses via EdX aren't the same as going to MIT. And Berklee Online is a useful tool, but definitely not 10% of going to Berklee.",
                    "score": 5,
                    "author": "tibbon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I graduated so long ago I never had or used a computer while at Berklee. But I have taught music ever since, and I have had students go on to Berklee. I can assure you that the above posts are correct. I also have no experiences with Berklee online. But, even more than with a traditional school or program, Berklee is about the experience, interaction, networking, etc. What you will learn online will be fantastic and valuable, (I'd love to take some online course myself!) but it won't be \"Berklee\".",
                            "score": 1,
                            "author": "ReasonablyOK"
                        },
                        {
                            "level": 2,
                            "comment": "Looking back at how the school is, just even getting in is some unicorn shit.  We’re in a special club worldwide.  It’s cool. It was hard as hell for a former classical player, but I’ve had many a door open for me because of them practice rooms.  I hope the food in the cafeteria has improved.  Those turkey melts were amazing though.\n\nThe first semester ensemble and improvising was a nightmare 🤣 \n\nLet’s just say I went right to taking Labs after that.",
                            "score": 1,
                            "author": "ContWord2346"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Me too, 06 \nWhat’s up bro/ broette",
                    "score": 1,
                    "author": "ContWord2346"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depending on what he wants his career to be, Berklee online can be a waste of time. What does he want to do?",
            "score": 1,
            "author": "anom0824",
            "replies": [
                {
                    "level": 1,
                    "comment": "He wants to play the instruments he is familiar with I guess within an orchestra and studio setting and be involved with film and gaming soundtracks. I think there is so much more to explore within the industry that he may change his mind at some point and try something else.",
                    "score": 1,
                    "author": "awakenhappy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then honestly Berklee online would be a waste of time. How is he going to get experience playing in a group setting via zoom?\n\nI don’t think Berklee is even offering an online curriculum anyway, aside from rare occasions where a specific class is on Zoom.",
                            "score": 1,
                            "author": "anom0824"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m in my last year currently, I decided to switch to berklee online with pre-approved courses to transfer into my degree. Why? Covid.",
            "score": 1,
            "author": "Taylorthe117"
        }
    ]
}