{
    "id": "tjznw7",
    "score": 6,
    "title": "Ear Training Portion of Audition",
    "author": "FinancialTreat3541",
    "date": 1647943906.0,
    "url": "https://www.reddit.com/r/Berklee/comments/tjznw7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys I just had a quick question regarding the war training portion of the admissions audition at Berklee. Do we have to sing the melodies back or do we play our instrument to play the melody back? So if I’m auditioning with a piano, will they expect me to like play their melody back on the piano or can I sing the melody back to them? Thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "sing",
            "score": 3,
            "author": "HitYouWTheThrowaway"
        },
        {
            "level": 0,
            "comment": "When I took the audition back in 2017, they asked me to play back the melodies on my instrument. I am not 100% sure that they always ask you to do it on your instrument if you are an instrumentalist. I am a guitarist and the auditioner(not sure if it’s even a word lol) happened to be a guitar faculty. So that is probably why. Anyway it’s good for you to be ready for both cases because you are gonna have to do “sing back” and “sight singing” in ear training classes after you get accepted. Hope this helps:)",
            "score": 2,
            "author": "LeeBerk"
        },
        {
            "level": 0,
            "comment": "My audition was the piano.  From what I remember, they played a single note on the piano and I had to sing that note back (not in solfege, just a \"ta\" or whatever you prefer) and then they would play a short melody on the piano and I would have to play it back on the piano.  I don't think you have to sing the melody back unless your auditioning with voice.  That being side, all audition for everyone can be different even if they audition with the same instrument.  You might have to sing a pitch but not play a melody back, a classmate of mine had this happen.",
            "score": 2,
            "author": "LolzAndrew",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did they let you work the melody out or did you have to get it right first try with no experimenting?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For me, I remember them giving me like about 2 tries.  After that they move onto to the next melody whether I got it right or not on the second try.",
                            "score": 1,
                            "author": "LolzAndrew"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For my audition on saxophone last December, they had me do both.",
            "score": 1,
            "author": "AndWeKilledHim"
        },
        {
            "level": 0,
            "comment": "I just did the audition this past January. I auditioned on guitar and they had me do both: sing and play back melodies. They’ll also do a rhythm based section where you clap back or ‘tah’ back rhythmic phrases that were between 2, 4 and 8 bars. I hope this helps.\n\nI got accepted with a half off tuition scholarship only to realize I still can’t afford to go to Berklee based on my student loans situation. I wish you the best of luck.",
            "score": 1,
            "author": "Consistent-Bell6363"
        }
    ]
}