{
    "id": "u0ljll",
    "score": 2,
    "title": "what was it like for you guys, spending time in berklee?",
    "author": "[deleted]",
    "date": 1649609243.0,
    "url": "https://www.reddit.com/r/Berklee/comments/u0ljll",
    "media_urls": [],
    "other_urls": [],
    "postText": "Please reply and share your opinion.\n\nLike gigs, how much and how frequently you did? Are there plenty of opportunities for going to a gig?\n\nHave any teacher or student not taught you a particular genre coz it's gay??(I read this somewhere)\n\nGirls being put on pedestal as there are less girls. (BTW are there cute girls in berklee??)\n\nHave to do 2 or more jobs for money??\n\nYou guys can share all your positive and negative opinions bout everything in and around the college(not only the above questions) . Coz it's better for all the freshers as they get a good perspective bout the college.",
    "comments": [
        {
            "level": 0,
            "comment": "Hey! I am on a full scholarship at Berklee, and I would honestly never pay the tuition amount to go to Berklee. People don’t even realize that they are schools in Canada with the same opportunities of learning but that cost max 5k per semester. THE PRICE TAG IS INSANE FOR EVERYTHING AT BERKLEE. They raise tuition every year, they find a way to charge you for everything and even the teachers think it’s too pricey. Don’t go to Berklee unless you have money or a significant scholarship. I don’t say this because I don’t like it, I love Berklee, it’s just not worth that price tag. So many people go to Berklee and have access to no opportunities. Sadly, you have to already be good to be in the bpc shows, to get the gigs, the big studio sessions, etc. I honestly don’t have that many gigs, my teachers are not that good compared to some I had in my country. Yes the girls are cute! You should get at job ASAP before they raise the tuition and your financial plans are ruined. That said, berklee has also amazing aspects; you meet people from all around the world, you the curriculum is very good, the possibilities of studying many music subjects are endless (with pro music and another major as a double major, you can take classes from 4 different majors it’s crazy).",
            "score": 7,
            "author": "Conscious-Secret2845",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like that you shared both positive and negative aspect of it??\nWhy didn't you had many gigs??\nHow many teacher weren't good for you??\nThe thing is Ive searched songwriting program everywhere.\nI first searched in trinity because I do trinity exam didn't get any result about songwriting program. Searched everywhrre and only berklee had it.\nAbout the opportunities, you know it's not like a mainstream course or program like engineering or commerce, so I've heard it somewhere that schools like berklee are amplifier not a generator, so we have to barge in where ever we can to get opportunities.\nIt's so nice to get girls who are musicians too😆😆, I really hope there cute and thanks for clarifying it😉😉",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Berklee is not what it used to be! Yes, it’s still a top notch school and a lovely place located in a magical city where you can make great friends BUT… The person with the full scholarship that wrote before told a big truth! Having a full scholarship with no opportunities for gigs… At Berklee I met one of the best female vocalists ever from China where she was already famous in her country with amazing voice and everything and had literally NO SHOWS at Berklee! You know why? Because most people there are either a clique where they are giving the shows to people who belong to their clique or people who already have record label contracts from their home country and they are using Berklee as a promo for their career! BE SMART LADIES AND GENTLEMEN AND DON’T LET ANYONE FOOL YOU!",
            "score": 4,
            "author": "7777777King7777777",
            "replies": [
                {
                    "level": 1,
                    "comment": "So ur tryna say that people where they go to perform, that place only allows people from their clique??\n\nAnd isn't there other way of getting exposed? Like social media and stuff? \n\nBut isnt there a way to avoid all these and perform gig? \n\nI am going to take songwriting program, the last few lines literally shattered my dream. Where u said berklee as a promo.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mostly yes! That’s what I am trying to say! That doesn’t mean though that it happens all the time but it’s a pretty repetitive and common pattern there!\n\nSongwriting major has an angel as a Professor who is the person who created the program! He is a lovely person! The other Professors though are meh with some exceptions!\nWhat you have to understand is that Berklee is a business and it has one of the best marketing teams in the industry!\n\nI know many examples of people that used Berklee as a promo for their career! That doesn’t happen only at Berklee though! This is called “legacy students” and of course in a music school this happens to be bold and unpleasant.",
                            "score": 2,
                            "author": "7777777King7777777",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But is it worth it to send a ton of money and go study, only if one professor is good at teaching??\n\nBut I've seen it in my college As well as in my school, not all school has the best of teachers. Some are good and some are bad.\n\nNot only berklee, all the school, uni and college are business, they don't care bout us. What is a service for us it's business for them. As far as they have good teachers the college will be in a good rank. \n\nI'm sorry for all these nonsense, I'm tryna cope and console myself that berklee is not bad.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You know what happens though with Berklee? There are no official rankings for it. \n\nFor example Harvard, Imperial College of London etc have specific rankings and placements. Berklee doesn’t. Of course it is considered together with Julliard to be the best schools for music but there isn’t an official list if you know what I mean!\n\nAlso, one thing that is very annoying is that Berklee as far as performances are concerned is a Jazz oriented school. That means that if you are not a Jazz musician you are not taken seriously at all!\n\nBack in the 90s and in 00s that wasn’t the case! Metal, Rock, Pop, Jazz were equally accepted! Nowadays Berklee is a Jazz/RnB school with whatever that means.\n\nNevertheless, I believe that if you have a combination of money and scholarships Berklee is a great experience located in a lovely city!",
                                            "score": 3,
                                            "author": "7777777King7777777"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "not worth it lol",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "😢Have you attended the classes?. Or gone to berklee?",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "that i have, unfortunately. it’s common knowledge that what they advertise as their student experience is actually only achieved through favoritism, and very few people are given the opportunity to enjoy such opportunities.",
                                                            "score": 2,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "😢",
                                                                    "score": 1,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I went in 2006 so might be a different time, but I had a blast. \n\nOpportunities are unlimited, it's crazy how much is going on in tht network. Everywhere, all the time. Even house parties on the weekends, there's always a live band playing. The party scene is a great hang, made tons of friends. \n\nGirls put on pedestal, yeah that's a thing. Not sure why, there are just way more dudes in this industry than girls.",
            "score": 3,
            "author": "aasteveo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh I wanted to add, in terms of networking, even after graduation, the online outreach of gigs is still great, internship coordinators and such. There's online groups that help each other get gigs all the time. It's a great community.",
                    "score": 3,
                    "author": "aasteveo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You never had any negative experiences??",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope, all amazing. Except the loan repayments yeesh",
                                    "score": 2,
                                    "author": "aasteveo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Money is the pain problem for some people who want to go to berklee.",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I actually went to state college for a year to save some cash and transferred in a bunch of generic credits.",
                                                    "score": 2,
                                                    "author": "aasteveo"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}