{
    "id": "uo2gst",
    "score": 3,
    "title": "Is berklee worth it if you actually get in and can afford it?",
    "author": "autismsqueaks",
    "date": 1652365981.0,
    "url": "https://www.reddit.com/r/Berklee/comments/uo2gst",
    "media_urls": [],
    "other_urls": [],
    "postText": "I got accepted to Berklee online for songwriting for fall 2022. I deferred my admission to fall 2023 so that I can finish my associates this fall. I’m just curious to know if Berklee is actually worth it? I know it’s a private school but it’s a non profit so they’re not really “scammers” are they? Considering how ridiculously expensive their in person programs are I feel like the college is, in general, money hungry maybe? Is the degree worth anything or does it mean anything to others? The online program only cost as much as a California state university (where I live) so maybe that’s more so worth it right? I want to be a lyricist or a producer or even use any newfound knowledge in the educational field to teach writing and production to kids.\nWhat did you do with your degree and how helpful was it to have it from Berklee rather than another school?\n\nTLDR: is Berklee online worth it for aspiring lyricists/producers/educators or are there better ways to go about this path",
    "comments": [
        {
            "level": 0,
            "comment": "If you can afford it, yes.",
            "score": 4,
            "author": "pokeshulk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "autismsqueaks"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It depends on what you actually major in and what you mean by “can afford it.” If you mean that you’ll leave Berklee with $0 debt, yes it’s worth it, mostly because Berklee will teach you to be really good at what you want to do. I wouldn’t depend on having Berklee on your resume opening any doors for you. It’s possible, but not guaranteed. Most people in the music industry do not care where you went to school, and depending on the field don’t care if you went to school at all. You may make connections while at Berklee that may help you though. The only major that you’ve listed that I would even consider going into debt for would be one of the two major production majors, because your DTI ratio will be more manageable that way if you lean into a career in production. I would not go to Berklee for education if you need student loans. The program is great but the DTI is not worth it and there are much cheaper comparable programs. For lyrics, I honestly just recommend reading Pat Pattison’s (Berklee professor) books and taking some of his Berklee online courses.",
            "score": 5,
            "author": "Limp_Contribution_57",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I got in for songwriting so that would be the degree I do. I’m thinking the same as you though, that I could literally go to school anywhere for anything and just write music on my own time",
                    "score": 1,
                    "author": "autismsqueaks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did the songwriting degree and the program is great, but I don’t recommend going into debt over it. You need to be able to live La Vie Boheme for a while as a beginning songwriter, and it is really difficult to do that when you have student loans to pay. Speaking from experience, lol",
                            "score": 2,
                            "author": "Limp_Contribution_57",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right haha. I was already thinking of just going into education anyways",
                                    "score": 2,
                                    "author": "autismsqueaks"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you can go to berklee without going into debt it is 100% worth it and the connections and knowledge you gain there can launch you into the industry. The school admin above the teachers and dept chair are extremely money hungry but the professors and the dept chairs ect really do care and for the most part are excellent",
            "score": 3,
            "author": "yadyadayada",
            "replies": [
                {
                    "level": 1,
                    "comment": "\nHello! You have made the mistake of writing \"ect\" instead of \"etc.\"\n\n\"Ect\" is a common misspelling of \"etc,\" an abbreviated form of the Latin phrase \"et cetera.\" Other abbreviated forms are **etc.**, **&amp;c.**, **&amp;c**, and **et cet.** The Latin translates as \"et\" to \"and\" + \"cetera\" to \"the rest;\" a literal translation to \"and the rest\" is the easiest way to remember how to use the phrase. \n\n[Check out the wikipedia entry if you want to learn more.](https://en.wikipedia.org/wiki/Et_cetera)\n\n^(I am a bot, and this action was performed automatically. Comments with a score less than zero will be automatically removed. If I commented on your post and you don't like it, reply with \"!delete\" and I will remove the post, regardless of score. Message me for bug reports.)",
                    "score": 1,
                    "author": "ectbot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Berklee Online degrees and courses are 1000% worth it if you are actively engaging yourself with the professors and students. They are so much cheaper and you can pick the brains of the professors and network around almost as much as in person. However, you do miss out on the in person experience, but a lot of the same resources are available if you know what you’re after! I’m graduating next year and it’s been the best for work, my mental health, and overall well-being especially during the height of the pandemic",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I really am drawn to the fact that it’s online. If I go another route I won’t get that opportunity. I also get financial aid I’m just not sure how much. I don’t play instruments but I will be learning so that I have basic keyboard and guitar ability. I have a year to learn so that’s not what I’m worried about at all. I’m worried about getting a job and possibly being able to switch careers in California if it doesn’t work out",
                    "score": 2,
                    "author": "autismsqueaks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I pay between $5k-$6000 at most for a semester. You are able to take up to 4 semesters a year. I’ve accumulated 10+ semesters so far and attendance hasn’t been a requirement which let me tell you is a HUGE RELIEF when working even part time. Unless you’re going directly for a Songwriting the most they might require is a piano. I know it’s been heavily Mac/Apple computer based for the most part although they have windows alternatives for their lessons. I’m in the Interdisciplinary Music Studies program and currently deciding on graduate programs Musicology/History. I never needed to play an instrument, but I chose electives with piano and guitar to strengthen and get some easy credits. It’s pretty easy repertoire, but you do learn a new piece every week so practicing a little every day is a given. Like I said I work and was still able to do piano and guitar at the same time with a little bit of background. They top you off at 4 classes (12 hours). They accepted a few transfer credits from a previous school and even without which I’d be able to graduate in 3 years doing a couple summer classes.",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is that amount you pay after financial aid or without financial aid??",
                                    "score": 2,
                                    "author": "autismsqueaks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Without aid. With financial aid it’s about half for me",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So you don’t currently use your financial aid?",
                                                    "score": 1,
                                                    "author": "autismsqueaks",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh no, I use my financial aid I’m not nuts lmao. I was trying to provide a general amount if you didn’t have aid",
                                                            "score": 2,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh I see. 3,000 is still pretty expensive out of pocket",
                                                                    "score": 1,
                                                                    "author": "autismsqueaks"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I get that now haha and that’s totally true. The amount they charge shows it.",
                    "score": 1,
                    "author": "autismsqueaks"
                }
            ]
        }
    ]
}