{
    "id": "ur2w2b",
    "score": 3,
    "title": "Should I make my principle guitar or voice?",
    "author": "ImVenerable",
    "date": 1652726559.0,
    "url": "https://www.reddit.com/r/Berklee/comments/ur2w2b",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have an audition for a Berklee high school program soon and I’m questioning which principle I should apply with, guitar or voice? I’d like to say i’m a fairly strong vocalist and guitarist, which has led me to really struggle on this choice of which principle I should audition with and study for the next year. I sent an email out to one of their support advisers, which she got back to me with, “Hello, \n\nThe application we received had guitar as the primary instrument. The audition is for a guitar spot in the program. For the audition piece, you can sing and play guitar, but the adjudication will be for a guitar principal. \n\nPlease let me know if this is incorrect and if you would like me to change the principal instrument to voice and schedule a voice audition. This would change the audition time. \n\nIf you are a strong guitarist and a strong vocalist and like both equally, I would recommend staying as a guitar principal as it is a less competitive instrument this year. \n\nBest, \nKasey”\n\nContext for this is that I accidentally selected guitar which I thought was guitar and voice. Which principle should I choose knowing this? I want to make music with singing so I don’t know which principle to study would benefit me more in the long run.",
    "comments": [
        {
            "level": 0,
            "comment": "Everyone sings at berklee. half the school is vocal principals to the point where it is a bit of a joke. Guitar being the second most popular. If you are interested in doing singer songwriter stuff I would say go for guitar your knowledge for theory will be deeper and it gives you a visual representation of what you learn. \nGood luck",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say this. They accept about any vocalist that walks through the doors that can hold a note. Some of them here aren't the best. That being said, Do what you feel like you want to do more of and/or are better at. Don't let the stigma of vocalist at Berklee make your mind for you. If you want to do singer songwriter stuff, I'd say guitar. But Berklee won't make you a great musician. It's up to you to make yourself a great musician by using what Berklee offers.",
                    "score": 2,
                    "author": "Stuff_nThings_"
                }
            ]
        }
    ]
}