{
    "id": "xfgsn5",
    "score": 3,
    "title": "Mash Up Songs for Audition",
    "author": "timalaye",
    "date": 1663300448.0,
    "url": "https://www.reddit.com/r/Berklee/comments/xfgsn5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I play electric guitar and I would like to audition with kind of a mash up of pieces of various songs I’ve learned that all together would be about 3 minutes. Do you think it would be acceptable for me to audition with this type of structure instead of just a whole 4 minute song?",
    "comments": [
        {
            "level": 0,
            "comment": "If it’s good sure. If it’s just you randomly changing between riffs for no discernible reason I probably wouldn’t do it.",
            "score": 4,
            "author": "jazzcigarettes",
            "replies": [
                {
                    "level": 1,
                    "comment": "each song is about 50 seconds and I added some transitions for them to change more smoothly. do you think that’s fine?",
                    "score": 1,
                    "author": "timalaye",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If it sounds good yeah",
                            "score": 2,
                            "author": "jazzcigarettes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That transition needs to be 🔥 and tight, otherwise it’s going to be jarring, confusing and seem more like a mistake. Is this a mashup you’ve done a lot before?",
            "score": 2,
            "author": "tibbon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve done the transitions a few times, but i’ll probably need to add things to make it tighter. thank you!!",
                    "score": 1,
                    "author": "timalaye"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Question - why is this the desired approach?  Have you been given any structure for the audition?\n\nWhat kind of music?  What kind of performance?\n\nAre you just playing and they judge your skill?  Will you play a few songs with the band?\n\nIn my experience as a rock guitarist, every audition has been playing with the band.\n\nI’ve also found that while your proficiency matters, attention to details of the band matter more.  Did you get guidance on gear?  Did they ask you to learn any songs?  How do you plan to approach your tone and volume in the mix?  How do you plan to approach your interactions and introductions to the other members?\n\ndid you bring an extension cord for all your power?\n\nDo you have a backup guitar in case you break a string.  If not, do you know how to quickly change a string and stretch it so it will stay in tune?\n\ndo you have a tuner and a backup tuner?\n\n\nLots more i’d want to know before attempting to judge whether your idea is a good one… you could simply kill your performance and guys look at each other with wtf looks.  Or it could be perfect.  Inquiring mind wants to know!",
            "score": 1,
            "author": "mikeyj198",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the reply!! The audition is more simpler since I’m not near the audition site. I’ll just be auditioning online in my room and I’ll be doing it by myself with no band. I play RnB and Jazz. I’m just going to play my audition piece and then they move on to the improv and technical section and etc.",
                    "score": 1,
                    "author": "timalaye",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Makes sense to me.  Good luck!",
                            "score": 2,
                            "author": "mikeyj198",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!",
                                    "score": 1,
                                    "author": "timalaye"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}