{
    "id": "ze9trc",
    "score": 3,
    "title": "What should I audition with",
    "author": "Certified__Cryptid",
    "date": 1670341157.0,
    "url": "https://www.reddit.com/r/Berklee/comments/ze9trc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Something classical. I’ve been playing for 2 years, I think I’m okay. I want to major in music theory so preferably a little chromatic. I have a month to learn it and I have 0 ideas. \nThanks for any suggestions",
    "comments": [
        {
            "level": 0,
            "comment": "They don’t really care what your intended major is when you audition. That’s an interview question. Play something you play well or that means a lot to you. Play something comfortable. Not to say it shouldn’t be impressive, but you should play something you know so inside and out that you couldn’t screw up if you tried. Don’t try and guess what the admissions panel will want to hear. Play what you want and what you care about and your passion will shine through.  \n  \nI auditioned with a self-arranged piece from a video game and my major only had a little to do with arranging skills. My intended major had nothing to do with arranging skills. Neither have anything to do with video game scoring.\n\n I’ve known people who’ve auditioned on every genre under the sun. Diversity and authenticity is a plus over all else.",
            "score": 3,
            "author": "pokeshulk",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s what I want to play I just don’t know what fits that cause I don’t know alot of classical prices",
                    "score": 1,
                    "author": "Certified__Cryptid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’ve got a month to learn it. That’s not enough time for an entrance audition piece imo. You probably won’t be comfortable enough with the material. Pick something you already know.  \n  \nEdit: also chromaticism is kinda counter to most classical styles and techniques. If anything, most classical music is built specifically to avoid chromaticism. If you want to show of your comfortability with approach notes and/or complex theory and/or dissonance, your best bet is to pick a jazz tune. Maybe more modern composers will have what you’re looking for sonically, but I struggle to think of any pieces of the top of my head that would meet all the criteria.",
                            "score": 1,
                            "author": "pokeshulk"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I auditioned with a classical piece too: I played Debussy's \"La cathedrale engloutie.\" If you want to read about my experience click [here](https://www.clarachanmusic.com/s/stories/six-tips-for-getting-into-berklee-college-of-music-and-get-a-scholarship-my-experience-part-1). I agree with the others on this thread - you'd want something you're super comfortable with. Since you only have a month, I would recommend you dig up repertoire you've already learned, and continue to refine it. I think it's too late to learn a new piece (unless you're a super fast learner). \n\nAlso, make sure you know your scales - they will be asking for any major scale in two octaves. Brush up on your sight reading, improv and ear training. Feel free to contact me [here](https://www.mastermusic.online) if you have any questions!\n\nBest of luck!",
            "score": 2,
            "author": "clarachanhk"
        },
        {
            "level": 0,
            "comment": "First of all, I don’t think Berklee has a music theory degree. I also think it might be difficult to find an undergraduate degree in that subject anywhere. That being said, what is your instrument?",
            "score": 1,
            "author": "LiteratureLeading999",
            "replies": [
                {
                    "level": 1,
                    "comment": "Piano and they have a ba in music theory and comp",
                    "score": 2,
                    "author": "Certified__Cryptid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s no music theory major, but there is comp. The undergrad degrees are Bachelor of Music, not Bachelor of Arts. Either way, commit to a piece that you feel good about that shows your skills off well. They’re looking for potential, not perfection, so definitely bring something that makes you feel confident :)",
                            "score": 2,
                            "author": "kccsell30"
                        },
                        {
                            "level": 2,
                            "comment": "I see. Are you looking for a graduate program?",
                            "score": 1,
                            "author": "LiteratureLeading999",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think just 4 years, so undergrad",
                                    "score": 1,
                                    "author": "Certified__Cryptid"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Getting in is easy, getting a scholarship is not. Good luck.",
            "score": 1,
            "author": "tommykmusic"
        },
        {
            "level": 0,
            "comment": "They’re looking to be impressed by your performance so try to prepare something interesting, but know it very well. If you’re musical, you will get in easily. The hardest part is getting a scholarship. \n\nThe goal is to show off your skills as best as you can and let them know you’re comfortable with what you’re doing and that you know your way around things. Performance is key. Do you have any experience performing live, perhaps in a gig or for a crowd? If not, it’s ok. My point is, has there been anything you’ve ever played for a crowd that got a really good reaction from people? Perhaps that could be a step in the right direction. If you have any tricks on the piano, make sure to include that.\n\nknowing how to sight read and being able to identify chords, scales, etc can also get you far, but it seems like you’ll be fine here. You don’t really need to know music theory to enter. They decide what level theory classes you need once you get in.",
            "score": 1,
            "author": "konforming"
        }
    ]
}