{
    "id": "zhxwlv",
    "score": 3,
    "title": "What’s something you wish you knew when you first started Berklee?",
    "author": "konforming",
    "date": 1670692761.0,
    "url": "https://www.reddit.com/r/Berklee/comments/zhxwlv",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Get your reading together before you get there. Try to find housing within walking distance to campus. Learn how to cook cheap meals. Learn how to make ramen dishes, chicken soup, etc. make sure you can get to a full grocery store. Bring warm clothes-Boston is very expensive and cold. Spring for the T pass.",
            "score": 4,
            "author": "JazzRider",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for the advice! I start in May so if I have a chance, I’ll try to stay on campus for at least the first semester to make some friends. I’ll stick around Mass Ave or Comm Ave after probably. And I know there’s a bunch of places to grocery around there. I’ll def check out the T Pass, thank youuu! 🙏",
                    "score": 3,
                    "author": "konforming"
                },
                {
                    "level": 1,
                    "comment": "The rental price might be tempting from area around Boston university but good luck with the T breaking down in winter and you will be asked to get off and walk with your instrument. Go on Facebook group Berklee Free and for sale, Berklee off campus housing and Berklee off campus apartment, there are plenty of housing info. My suggestion is live in the dorm for the first semester, making connection is what Berklee can offer best, then find someone to share an apartment.",
                    "score": 2,
                    "author": "That_Part-time_Dude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, I’ll def try to find housing on campus. I start in May so I’ll have to get on it.\n\nAlso thanks so much for letting me know about the possibility of the T breaking down. If I ever get a place off campus, it would be in or around Comm Ave, Mass Ave, or Newbury. I was staying in 270 this summer for the Aspire program and it was still tough carrying my instruments to classes and practice. Can’t imagine what it would be like in winter.",
                            "score": 2,
                            "author": "konforming",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What’s your instrument? There’s instrument storage rental available if you don’t need to bring it home everyday. Pretty sure drum lockers were available.",
                                    "score": 2,
                                    "author": "That_Part-time_Dude",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Technically I’m a percussionist, but I auditioned with EDI. I had to carry midi keyboards, a eurorack system, laptop, and a push. \n\nDo you know if it’s possible to change your primary instrument if you don’t want to do private lessons for EDI? I feel like I’ll benefit more learning percussion instead of something I’ve been doing for the past 15 years.",
                                            "score": 1,
                                            "author": "konforming",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, you can change your instrument or adding secondary instrument, you have to talk to the faculty head about that decision.",
                                                    "score": 2,
                                                    "author": "That_Part-time_Dude",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh that’s even better. I’m going to probably add if the work load isn’t too crazy.",
                                                            "score": 2,
                                                            "author": "konforming"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That you can test out of nearly one semester's worth of credits/classes just in your first semester alone. I did that, and in the end, tested out of 32 credits in total. I graduated a year early and saved more than $50,000. But a lot of people don't know that they can do that and miss out on the opportunity to study to take the CBXs. Anyway, if anyone has any questions, please let me know.",
            "score": 2,
            "author": "clarachanhk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, thanks for sharing! Would it be ok if i messaged you about this? Just want to know If I could do this before entering? I got accepted in October to start in May 2023 and I have a bit of time to prepare. Also is it one exam for all subjects or are there several (one for each subject)? Like how could we study/prep for it?",
                    "score": 1,
                    "author": "konforming",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep! You have time to prepare! Please message me - happy to answer any and all your questions. You can also check out my website www.mastermusic.online. thanks!",
                            "score": 2,
                            "author": "clarachanhk"
                        },
                        {
                            "level": 2,
                            "comment": "It’s like your entrance exam for placement into harmony and ear training and arranging and the core music classes. Study up on your theory and start singing some solfège",
                            "score": 2,
                            "author": "jazzcigarettes"
                        },
                        {
                            "level": 2,
                            "comment": "Now that I'm home I can answer your question in more detail. There is one exam for all freshmen: the ESPA. It comprises of four parts: ear training, harmony 1, writing skills, music tech. Within the exam, there are three other optional components: harmony 2, harmony 3 and arranging 1. This is taken online, before you start school. So if you're starting May 2023, I would guess \n\nAnd then when you're at berklee, you can also take CBXs during your time there. The most common ones to test out of would be traditional harmony, counterpoint and keyboard skills. I've also heard of people testing out of conducting and private instruction. Once you've declared your major, look at the classes required and see which one(s) you'd like to test out of. Look at the department website for CBX information and instructions. If you don't see any for a class you're interested in, see the chair - sometimes they would just give you the final exam for the class, and if you pass, congrats you have your credits! Just ask - the worst they can say is no. \n\nBut since you're starting in May, I would advise that you start studying asap. happy to map out a game plan for you if you'd like. Also, this [article](https://www.clarachanmusic.com/s/stories/i-got-accepted-into-berklee-college-of-music-whats-next) might help you :)",
                            "score": 1,
                            "author": "clarachanhk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so so much for all this great info. I’m so glad you commented! \nI’ll definitely do as you advised and I might take up on your offer on mapping out a game plan. That would be so helpful. I messaged you privately!",
                                    "score": 1,
                                    "author": "konforming",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The credits that are easier to transfer in from other school are the liberal arts credits, so you can do some those through a cheaper school like a community college. I covered requirements for several subjects I didn't care as much about (i.e. natural science/math) with online courses through my local community college that were super easy and cheap. Between credits from AP/IB in high school (make sure you send results if you did any of those; some will get you credit as well), the cc courses, and taking 1 credit more than a full load a couple times, I was able to graduate a semester early and be part-time my last semester.",
                                            "score": 1,
                                            "author": "velaurciraptorr",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, im actually planning on doing this with Berklee online. I’ve already taken a few like intro to college writing and developing artistry with Berklee to name a few. I’ll look into the community college if they have online courses. That could help a lot. And maybe it could be cheaper than berklee online? Idk\n\nHow long did it take you to finish the courses with your community college? I’m going in May, so I wonder if I have time. \n\nAlso how many courses and what did you take?\n\nYou advise it’s best to not take the math and science course? I was about to take applied maths for musicians so I could do the acoustics course later for my major.",
                                                    "score": 1,
                                                    "author": "konforming"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You can also take liberal classes from other institution, community college or Harvard whichever is cheaper per credit than Berklee",
                    "score": 1,
                    "author": "That_Part-time_Dude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Does Harvard offer these classes online?",
                            "score": 1,
                            "author": "konforming",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They didn’t but not sure about now, Covid changed the game and they could be offering them online now.",
                                    "score": 1,
                                    "author": "That_Part-time_Dude",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’ll find out tomorrow. I was about to sign up with Berklee online and finish my 3rd certificate with them. But I do like the idea of studying with Harvard. Thank you so much for the tip!",
                                            "score": 2,
                                            "author": "konforming"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t just hang out with the people in your major or musicians who play the same instrument as you, hang out with diffident kind of people, for example, hang out with the MP&amp;E students, they are the ones who can get you recording studio time. Treat the techs right who work at EPD or MP&amp;E studio, those are your life savers if you are in production.",
            "score": 2,
            "author": "That_Part-time_Dude",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha awesome, this is great advice! I’m actually doing MP&amp;E myself.",
                    "score": 1,
                    "author": "konforming",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hi MP&amp;E student,I have the biggest advice for you, learn python and you will be happy with getting your 6pm recording slot and create your own automation for pro tools. Good luck!",
                            "score": 2,
                            "author": "That_Part-time_Dude"
                        },
                        {
                            "level": 2,
                            "comment": "And btw, the record co is a cheap alternative to studios outside of Berklee, bear in mind that you are not allowed to publish anything you recorded from Berklee studios.",
                            "score": 1,
                            "author": "That_Part-time_Dude",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What?! That sucks!\n\nBut thank you again for all these great tips. You’re amazing! Wish we could meet if you are at Berklee.",
                                    "score": 2,
                                    "author": "konforming",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I wish I could visit Boston one day, feel free to DM me. Good luck and enjoy Berklee.",
                                            "score": 2,
                                            "author": "That_Part-time_Dude",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hopefully that can happen for you soon. I’m beyond grateful for all your help. Wishing you happy holidays and a successful new year!!",
                                                    "score": 2,
                                                    "author": "konforming",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thank you, you too!",
                                                            "score": 2,
                                                            "author": "That_Part-time_Dude"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No you can publish ur shit, I googled it and it’s fine lol. Plus everybody does it so there’s that lmao",
                                            "score": 2,
                                            "author": "deetzeefly"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}