{
    "id": "2kbuuo",
    "score": 57,
    "title": "When I see another post by /u/GVSU_Nate",
    "author": "AlmostStainless",
    "date": 1414281892.0,
    "url": "https://www.reddit.com/r/GVSU/comments/2kbuuo",
    "media_urls": [
        "http://i.imgur.com/2v2CFyS.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I know him in real life and I'm still not sure what his job is. ",
            "score": 13,
            "author": "eomertmor",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work in the venture capital field and occasionally go to class. ",
                    "score": -8,
                    "author": "GVSU__Nate"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hilarious, I always think the same thing on both /r/gvsu and /r/grandrapids.",
            "score": 5,
            "author": "Masticator93"
        },
        {
            "level": 0,
            "comment": "I carefully curate the information that comes my way. Keywords on Google News are your friend.\n\nI like to stay informed about what's going on around me, so I set up Google News filters for terms that are relevant to my life like \"GVSU\", \"Grand Rapids\", \"Michigan\", etc... you get the idea. That way, the information presented to me is all relevant and I don't have to waste time sorting through tons of other junk. ",
            "score": 4,
            "author": "GVSU__Nate",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know why you're getting downvoted so much, your contributions are always relevant and keep this sub alive. It is the sheer volume of posts that I find funny.\n\nPlease stop downvoting the most active member of the community.",
                    "score": 15,
                    "author": "AlmostStainless",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I really try to provide quality content and information that this sub would find interesting. \n\nAs someone who has been at this university for quite a while (~200 credit hours) and been involved in various research initiatives, student government, and acted as a consultant for the university administration, I can offer a unique \"behind the scenes\" perspective on some things that are discussed in this sub, but apparently people aren't ready for it. ",
                            "score": 5,
                            "author": "GVSU__Nate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wondered the same thing about the downvotes. I'm starting to wonder if it's a downvote bot/mini brigade or something, since none of your comments should be that low even if you do piss a few people off.",
                                    "score": 2,
                                    "author": "RobThePirate"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here is what the linked meme says in case it is blocked at your school/work or is unavailable for any reason:\n\n#***Confused Black Man***  \n\n&gt;***Post Title:***  *When I see another post by /u/GVSU_Nate* \n\n&gt;***Top:***  *IS THIS SHIT* \n\n&gt;***Bottom:***  *YOUR JOB?* \n\n\n\n[Original Link^1](http://imgur.com/2v2CFyS) | [Meme Template^2](http://imgur.com/memegen/create/2v2CFyS)",
            "score": 1,
            "author": "imgurtranscriber"
        }
    ]
}