{
    "id": "g87g19",
    "score": 7,
    "title": "Has anyone ever had Amanda Cavillo",
    "author": "SilentMomento",
    "date": 1587872522.0,
    "url": "https://www.reddit.com/r/GVSU/comments/g87g19",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm wondering wheter or not I should take MTH 124 (precalc) over this summer and I saw that she was teaching it. I couldn't find any reviews for her, and normally I wouldn't mind but since this is an online class there could be a learning curve. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Math department chair here. She's awesome. She has experience not only teaching online but teaching MTH 124 online specifically. I teach MTH 124 fairly often myself and end up studying (and stealing) a lot of what she does in the classroom. Sign up for the class with confidence.",
            "score": 11,
            "author": "Rtalbert235"
        },
        {
            "level": 0,
            "comment": "Provided you listen to her advice and know when to ask for help, she’s pretty good. I ended up dropping the class for different reasons, but her teaching was not one of them.\nIf it matters to you, consider that the summer classes are possibly going to start out online and that can potentially hurt students if they’re not used to that kind of class setting. \nGood luck!",
            "score": 3,
            "author": "HyperKnight619",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just to clarify, the 12-week classes (that span all of Spring and Summer term) are all going to be 100% online. So are the classes that are just Spring term (first 6 weeks). The Summer term (second 6 weeks) are still undecided as of now.",
                    "score": 6,
                    "author": "Rtalbert235"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely take Cavillo for MTH 124! I had her in the Fall, and I feel that she really prepared me for Calculus! In the beginning, it was difficult for me because I was taking other heavy classes (I was failing with a 58 the first couple of months) but I dropped a class and my grades got better. I ended pulling through and passed with an 86! The only con I would say are the writing assignments which are a bit annoying to complete (there were seven) as other classes had maybe 3 or 4. But, otherwise, utilize her office hours when you know you are going to struggle with a topic and know that this class takes a lot of time. You will be fine!",
            "score": 1,
            "author": "Konnyyy13"
        }
    ]
}