{
    "id": "gci3uu",
    "score": 4,
    "title": "Laker Store open?",
    "author": "buddyboyx69",
    "date": 1588469463.0,
    "url": "https://www.reddit.com/r/GVSU/comments/gci3uu",
    "media_urls": [],
    "other_urls": [],
    "postText": "I ordered a MacBook from the Laker store and live only 15 mins away from campus. I have tried to contact the school multiple times via phone and email and have not received any word back. I was contacting them to see if I could safely pick it up at the campus. Does anyone know if people are working on campus still? I understand essential staff may be but no-one has answered my messages. \n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I don’t think you can at the moment. When I was on the laker store website it said the Allendale location is closed.",
            "score": 3,
            "author": "DietKibble",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like I’m there should be some people working though right? Otherwise how would orders be processed?",
                    "score": 1,
                    "author": "buddyboyx69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s true, I’m really not sure how that would work. I assumed the primary location wasn’t the one on campus but maybe it is. Sorry I can’t be much help, have you tried calling them?",
                            "score": 2,
                            "author": "DietKibble",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I appreciate it. I’ve called the Laker store and GVSU’s main number and not gotten any response.",
                                    "score": 2,
                                    "author": "buddyboyx69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Try contacting them via Facebook or Instagram DM. I was a student worker in their marketing department before graduation and we tried to maintain a high response rate on all our social media platforms. This'll probably be your best bet since the store hours that staff are there are irregular right now so we might not have people around to take a call. \n\nIf that doesn't work, shoot me a DM and I'll get in contact with my old manager to see how we can help you.",
                                            "score": 4,
                                            "author": "Zakkuya",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I will try! Thank you so much!!",
                                                    "score": 2,
                                                    "author": "buddyboyx69"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That sounds frustrating! :( Emailing various offices is probably your best bet since email could be monitored more easily than phones by someone working from home. Also most of the offices are probably closed during the break but hopefully someone can get back to you when the spring semester starts!",
            "score": 2,
            "author": "momotheseaturtle"
        }
    ]
}