{
    "id": "hbpa5h",
    "score": 63,
    "title": "Anyone else disappointed by GV's town halls?",
    "author": "SrKitteh",
    "date": 1592522137.0,
    "url": "https://www.reddit.com/r/GVSU/comments/hbpa5h",
    "media_urls": [],
    "other_urls": [],
    "postText": "I feel that these meetings are far more focused on marketing and generating positive PR than providing students with relevant information about plans for the fall. What has been announced like floor markings and increased cleaning are to be expected and frankly the bare minimum. Students at other schools already know if their classes are online/hybrid while we're still left in the dark.\n\nIt feels like GV is waiting until the last minute to makes these announcements so we don't have as much time to weigh our options.\n\nI hoped that GV would have provided us with more information by now.",
    "comments": [
        {
            "level": 0,
            "comment": "It is really hard to believe their sincerity when within 5 minutes of the super scripted town hall, where none of your questions get answered, The GVSU marketing body sends out another article about how wonderful and productive the town hall was.",
            "score": 9,
            "author": "booksOnTheShelf"
        },
        {
            "level": 0,
            "comment": "Agreed. I picked up on the same thing so I stopped watching them lol. I figure if information comes up that is important enough then they will just email it anyway.",
            "score": 17,
            "author": "DaCoOpBots"
        },
        {
            "level": 0,
            "comment": "I’m so glad to see this post! I’m disappointed and frustrated, too. I feel like they just keep repeating the same thing over and OVER again without providing any concrete decisions or advice. \n\nI also am slightly offended by the apparent ease with which the administration glosses over such important issues - like dorm rooms - an outbreak will happen in the dorms. Period. Philomena mentioned that the floor could go on lock down. Okay, well what happens with the students who are sick? Who aren’t sick? With their classes? How do they get food? College life, but dorm life in particular, necessitates you are in close contact with other people - will there be a contact tracing system? \nOn top of all of that, how the f*ck is campus dining going to work? \n\nAs a closing note, I found it comical that one of the people on tonight’s panel said they were going to “wrap chairs in plastic wrap”. Seriously? That’s the length we’re going to? Just make everything online for gods sake.",
            "score": 15,
            "author": "maternity_overalls",
            "replies": [
                {
                    "level": 1,
                    "comment": "And I get it, GVSU (and every other college) sees massive revenue from housing. But the decision to make housing fully available at one student per room with seemingly no apparent plan in place is irresponsible.",
                    "score": 6,
                    "author": "maternity_overalls"
                },
                {
                    "level": 1,
                    "comment": "Thank you for the rant I couldn't bring myself to write. I have the same concerns. Wrapping the furniture in plastic was an interesting comment. yikes",
                    "score": 5,
                    "author": "SrKitteh"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is such a good point. I didn’t even consider what students will be doing outside of class, but you’re absolutely right. Everyone has been cooped up for months, and not to mention school abruptly ended in March. Everyone is missing their friends. As soon as we’re all back at school, the parties are going to be crazy. \n\nWhat can the admin even do about that? Police the off campus apartments like a militarized zone? None of this seems realistic to me.",
                            "score": 1,
                            "author": "maternity_overalls"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Departments got in our revised schedules this week. The idea is they'll be available to students, listing the format of the class (in person, hybrid, hyflex, online synchronous, online asynchronous by mid-July). Slow process, but ultimately will be more specific information than most colleges are giving out.",
            "score": 9,
            "author": "goldenj",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the information! I appreciate all the work faculty have put in the past few months.",
                    "score": 2,
                    "author": "SrKitteh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I turned on the one the other day, sat for about five minutes, and then realized what this was going to be about so I proceeded to play games on my phone the whole time they blabbed about how awful the coronavirus is and how important it is to stick together and etc, etc. They said they received thousands of questions but only answered like...two? Like what happened to \"We're going to answer as many as possible\"?",
            "score": 6,
            "author": "Faeri"
        },
        {
            "level": 0,
            "comment": "I completely agree, if anything they have made me more anxious to return for classes!",
            "score": 3,
            "author": "realistic-dreamer-10"
        },
        {
            "level": 0,
            "comment": "I agree, I was especially disappointed that they disabled the chat feature when the emails they sent us previously said we would have a chance to ask questions. I did fill out the form with my questions, but none of them were even touched on.",
            "score": 2,
            "author": "megvz"
        },
        {
            "level": 0,
            "comment": "Expect an announcement June 22nd or shortly after!",
            "score": 1,
            "author": "thoughtsofap"
        }
    ]
}