{
    "id": "hrzx9i",
    "score": 65,
    "title": "Petition Grand Valley to lower online class prices and tuition",
    "author": "nolanater5711",
    "date": 1594860395.0,
    "url": "https://www.reddit.com/r/GVSU/comments/hrzx9i",
    "media_urls": [
        "http://chng.it/V2r22NW7xB"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "100% of the student body could sign this and there will still be no deduction. The administration won't just lower the tuition cause people dislike it. Right now they're probably cheering cause they get the same revenue but their expenses are lower than ever. \n\nI hope I'm wrong but don't get your hopes up.",
            "score": 13,
            "author": "ElCamo267"
        },
        {
            "level": 0,
            "comment": "Signed. I hope they do something. They must think this pandemic didn’t affect us at all financially...",
            "score": 8,
            "author": "jkicks22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Many of the administration are totally out of touch with the plights of students. Will be funny when they loose their jobs.",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm guessing you got downvoted because of that last sentence. I know I wouldn't wish what I've gone through in life on anyone. Other than that though, you're absolutely right. GV's tuition even without the hike is no joke, and they def aren't as cheap as they think.",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Probably people white knighting for people who make 6 figure salaries and do nothing.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now now, let's give credit where it's due. They did raise tuition when it was already cost prohibitive during a crisis. That is something. /s  \n\n\nTotally agree, it's ridiculous. This whole situation is ridiculous.",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Got to make your non-profit university profitable like a private university.",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Agree, but keep a low profile. I know in the past I've had faculty talk to me about changing majors, and missing school due to work. Somehow working in a factory is a vacation. Not all faculty are bad obviously, but there are some who've tried to defend GV's tuition in the past.",
                                                            "score": 2,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "GVSU is suffering financial setbacks just like us. I don't like the raise in tuition but they are losing money during all this as well. Events, programs, etc. will most likely be cancelled that would've brought money in to make the university better. I don't like the increase but I understand why.",
            "score": 9,
            "author": "buddyboyx69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn't this exactly what an endowment is for though? Saving for a rainy day so they don't have to take it out on student tuition?",
                    "score": 3,
                    "author": "DaCoOpBots",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, I forgot about endowment but I’m sure no one expected a pandemic and I’m also sure that they are still using some endowment to put this plan in place. They explain in this thread. \n\n\nhttps://twitter.com/gvsu/status/1284951995313528832?s=21",
                            "score": 1,
                            "author": "buddyboyx69"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Signed !",
            "score": 7,
            "author": "OldOctet",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same!",
                    "score": 1,
                    "author": "sliceofhumblepie"
                }
            ]
        },
        {
            "level": 0,
            "comment": " The only way to make them lower tuition is to speak with your wallet",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}