{
    "id": "iwicjr",
    "score": 14,
    "title": "Possibly stupid question",
    "author": "Opposite_Short",
    "date": 1600623648.0,
    "url": "https://www.reddit.com/r/GVSU/comments/iwicjr",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'm currently in my second year at GV. I've been planning quite a bit because I was considering a transfer. Anyways, it looks like I'll have 113 credits at the end of next year if everything goes how I'm hoping (with spring/summer 2021 classes). I'll have all of my major, minor, and gen ed requirements, but I will not have the 120 credits needed to graduate. Is there any way to appeal this? I don't really want to go another semester just to take 7 random credits. I know it's still a while ahead in the future, by my transfer decision kind of hinges on the possibility to graduate early.",
    "comments": [
        {
            "level": 0,
            "comment": "Unfortunately you need 120 credits to graduate and I’ve never heard of anyone appealing this. The only options I could think of is to take a lighter course load fall 2021, more credits winter 2021 and spring/summer 2021 to make up those 7, or take a full schedule fall 2021 and don’t take spring/summer courses",
            "score": 19,
            "author": "chEARful8"
        },
        {
            "level": 0,
            "comment": "You can earn up to 32 credits by exam. For many students, this means coming in with AP or IB credits, however you can also take CLEP exams to earn credit while you are a college student. For example, if a math major who came in taking calc as a freshman is just a couple credits shy, they could go back and take the CLEP exam for college algebra and pick up a few credits that way. The key is to find an exam that you can pass without a lot of extra studying, although if you wanted to study independently for the exams, then that might open up more possibilities for earning credit.",
            "score": 13,
            "author": "ProfLouisa",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did this my between junior and senior year.  Spanish 101, Marketing 350, and History 110 (i think) were all passable with minimal studying and the tests cost like $80 each (had 2 years of high school spanish and got that with no prep)\n\nThey did have a rule that your last XX number of hours had to be \"traditional\" credits, so you may need to make sure you take any CLEPs before starting your senior year.",
                    "score": 8,
                    "author": "wormamputee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you do plan a transfer, I believe you need to have your last 30 credits at that institution before they will let you graduate ( that’s the amount at GVSU). So please plan accordingly if you are going to transfer.",
            "score": 7,
            "author": "TheWorldEndsTonight",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this is probably true for most schools, requiring students to complete their last year (2-15 credit semesters) at the school.",
                    "score": 4,
                    "author": "DeadSockPuppet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The best person to ask with clear answers is your advisor.",
            "score": 6,
            "author": "Smithsellsthemitt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seconding this.",
                    "score": 3,
                    "author": "jakerbox"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a version of this issue when I was finishing undergrad - basically had to take any class as long as it wasn’t in my major department (long story as to why...). Pissed me off at the time (I was preparing for grad school) but my advisor basically said he’d sign off on any pre-reqs that I would need.  Ended up taking some amazing upper level classes in poli-sci, art history, and anthropology that I never would have done otherwise.  Also - you can take these type of classes credit/no credit if you don’t want to have to worry about your GPA.",
            "score": 2,
            "author": "hildawangel"
        },
        {
            "level": 0,
            "comment": "The 120 credit requirement is part of the higher ed accreditation, so unfortunately there is no way around it. You could potentially take credits at a local community college and appeal the last 30 credit hours in \"residency\" at GVSU (this is a fairly common request and easily approved). \n\nIf you think you'll do those 7 credits at GVSU, look into microcredentials like a badge or certificate, then at least the credits aren't random and you get something to put on your resume. Here are some badges that are around 7 credits: [https://www.gvsu.edu/acad-index.htm?page=1&amp;search=&amp;type=8EFB935E-90D9-4283-9621A6F7F918BB5E&amp;interestId=&amp;location=&amp;format=](https://www.gvsu.edu/acad-index.htm?page=1&amp;search=&amp;type=8EFB935E-90D9-4283-9621A6F7F918BB5E&amp;interestId=&amp;location=&amp;format=)\n\nCertificates will usually be more credit hours: \n\n[https://www.gvsu.edu/acad-index.htm?page=1&amp;search=&amp;type=CCE13793-B23D-0005-C0F75DB99B170972&amp;interestId=&amp;location=&amp;format=](https://www.gvsu.edu/acad-index.htm?page=1&amp;search=&amp;type=CCE13793-B23D-0005-C0F75DB99B170972&amp;interestId=&amp;location=&amp;format=)",
            "score": 2,
            "author": "j-dusty-rose"
        },
        {
            "level": 0,
            "comment": "Take summer classes, do a for-credit internship to get work experience,  etc. There is no way around 120 credits. It is required for all BA and BS degrees.",
            "score": 1,
            "author": "Linyazj"
        }
    ]
}