{
    "id": "j2pird",
    "score": 18,
    "title": "Disability Resources",
    "author": "GoGoSqueezers",
    "date": 1601483580.0,
    "url": "https://www.reddit.com/r/GVSU/comments/j2pird",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just a question, I have a generalized anxiety disorder that is pretty well managed. However, every once in a while I’ll have a really bad day that can often make it very hard to remain in class, especially with my mask on, all day. Is this something the disability center can help with? I’ve been told by a couple professors that even if I don’t really need it all that much, it’s not a bad idea to reach out to them and see what kind of services may be available. I suppose I’m just curious if reaching out would be beneficial for me or my scenario?",
    "comments": [
        {
            "level": 0,
            "comment": "It's always valuable to at least reach out and get your questions answered.\n\nHere is a paragraph from their website that relates to your situation: \"Persons who are unable to wear a face-covering due to a medical condition are asked to complete a Disability Support Resources (DSR) [profile application](http://www.gvsu.edu/dsr/accommodations-login.htm) and submit supporting medical documentation to DSR.  A thorough review of the request will be considered, and applicants will be contacted by DSR staff for a virtual interactive appointment to discuss alternatives.\"\n\nYou can also contact [dsrgvsu@gvsu.edu](mailto:dsrgvsu@gvsu.edu) or (616) 331-2490 if you'd just like to talk to someone there for now.",
            "score": 6,
            "author": "Mysterious-Platypus5",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much for this! And in the end, it’s not even so much about the mask as it is me wanting my professors to understand why I may need to step out a few times within a class every now and then. I’m certainly not against wearing my mask, I just hate it as much as the next guy. Plus my claustrophobia and anxiety tend to make it a bit more of a challenge.",
                    "score": 6,
                    "author": "GoGoSqueezers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Happy to help. If you're looking for some additional support for your anxiety, the University Counseling Center has recently rolled out some self-guided [virtual workshops](https://www.gvsu.edu/counsel/healthy-lakers-virtual-workshops-320.htm), one of which focuses on anxiety management. The counseling center also provides [a number of other services](https://www.gvsu.edu/counsel/our-services-91.htm) that you can explore if you're interested.",
                            "score": 5,
                            "author": "Mysterious-Platypus5"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have “attendance may be an issue” or something on my DSR memo, and it has helped with professors in the past. Attendance enforcement is up to the prof but having some documentation can help convince them to excuse absences due to disabilities",
            "score": 3,
            "author": "marsfruits"
        }
    ]
}