{
    "id": "jj4bnh",
    "score": 41,
    "title": "The Math Department wants your input on online/hybrid course experiences",
    "author": "Rtalbert235",
    "date": 1603815819.0,
    "url": "https://www.reddit.com/r/GVSU/comments/jj4bnh",
    "media_urls": [
        "https://www.reddit.com/r/GVSU/comments/jj4bnh/the_math_department_wants_your_input_on/"
    ],
    "other_urls": [
        "http://gvsu.edu/s/1wq"
    ],
    "postText": "Hi there, I'm a professor in the Math Department and serve as the department's Online/Hybrid Course Coordinator. I'm also active here on the subreddit. Based on a lot of the interactions I've had with students here since the \"Big Pivot\" back in March, it's  very clear that students have a lot to say about their experiences with online and hybrid courses, and we faculty/admins have a lot to learn from you. \n\nSo, working with our department chair and assistant chairs, **we've created a survey asking for your input on our online and hybrid instruction**. Please note that to keep things focused, **the survey is only for students who are currently (Fall 2020) enrolled in a mathematics course (one that starts with \"MTH\") that is online or hybrid (not fully face-to-face).** \n\nYou can find it here: http://gvsu.edu/s/1wq\n\nThis survey should take less than 10 minutes to complete, although you may spend as much time with it as you wish --- in fact this is a great venue for you to go into depth if you wanted, and I know a lot of you have many things to communicate. Your responses will be anonymous, and I personally guarantee all responses will be read (because I'll doing the reading!). We'll be using the information we get to identify broad trends and issues --- things we're doing well; places where we need to improve; and maybe most importantly, what your needs are, and how we can do better at meeting them. \n\nTo sweeten the deal, once you complete the survey you'll be given a link to another form where you can enter your name and email for a random drawing for one of several $20 Amazon gift cards. You can also then indicate if you'd like to participate in followup surveys and focus groups we might conduct later.\n\nWe are serious about listening to you and improving our offerings based on your feedback. I hope that if you're in an online or hybrid MTH course right now that you'll budget some time to complete this survey. And if you've got any questions, just leave them in the comments and I'll respond. \n\nEven if you don't do the survey, please know that your work this semester is hugely inspiring to us faculty. You're being asked to get a college education under conditions that many of us with PhD.'s now would have found impossible back in our college years. So please know that we see you and appreciate you.",
    "comments": []
}