{
    "id": "jtihq7",
    "score": 9,
    "title": "Laptop Suggestions",
    "author": "hannah-nah-nah",
    "date": 1605283900.0,
    "url": "https://www.reddit.com/r/GVSU/comments/jtihq7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone-- my five-year-old laptop is about to go off the deep end so I was wondering-- does anyone have any suggestions for a really good high powered laptop? I work in graphic design for my internship and edit videos on the side, so I'd need a really solid performance. Also all of my classes and work are remote so... I can't get this wrong lol. I've been looking at the newest surface book from Microsoft, but kind of cringing at the price. Any suggestion is helpful-- even if it's laptops to avoid!",
    "comments": [
        {
            "level": 0,
            "comment": " I'm an engineering student and I have a Lenovo ideapad 330S which has worked well for the simulation software I run on it.\n\nAnother suggestion would be to look for something that's a bit above your price range and try to get a good black friday deal on it.",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "(*cracks knuckles*) I graduated from the design program in ‘18, and went through two laptops in the process. I felt outnumbered using Windows in a sea of Macbooks, but there’s no harm in conforming haha. The last half of my senior year, my Surface Pro died and I had to finish it all out using the Macs in the lab. They work GREAT in the meantime, so make an investment on storage backup and recovery first. All of it. Use that Adobe Cloud.\n\nAs for replacements, the first generation of Surface Book has a “plus” version with a larger battery/keyboard. Cheaper now that there’s a few years of models out.\n\nI personally bit the bullet and got a Dell XPS 15. There’s an XPS 13, and touch screen versions of both if you illustrate. Healthy amounts of RAM and high-end Radeon graphics instead of NVidia. I also got the 1080p HD display instead of the 4K option because it eats battery power.\n\nGet yourself a D-Brand skin, and you’ll be the envy of class!!\n\nAlso, say hi to design Profs Koz and Vinicius for me! :)",
            "score": 4,
            "author": "Jrodsqod",
            "replies": [
                {
                    "level": 1,
                    "comment": "I check this subreddit out as my daughter attends. I'm an IT professional; 25 years experience.\n\nThis reply is on the mark! I provisioned Surface Book 2's for the graphic designers where I work. They do primarily InDesign, no video work. I give them grief for working with 10GB files where they have an entire product line within one file. But the laptops keep up! I tested Mac vs Surface for capabilities in it environment. The surface is better for far less money when comparing apples-to-apples specs. Microsoft has their 13.5\", i7, 32GB RAM for $2500. It's worth the investment. Microsoft offers 10% discounts for students, also.\n\nWhatever you do, do not do less than an i7 processor.\n\nAnother laptop that I've provisioned for other power users is the Dell XPS15. These have kept up great for intense excel work by our analysts.\n\nBoth are nearly bulletproof for high demand. Laptops with less specs won't serve you well.\n\nBest of luck!\n\nEdit 1:\nI found this and think that it might be great for you:\nhttps://www.amazon.com/dp/B079M4H3SJ/ref=cm_sw_r_cp_apa_fabc_cUDSFbBF8AYQH\n\nOr\n\nhttps://www.amazon.com/dp/B076HZCQY9/ref=cm_sw_r_cp_apa_fabc_iWDSFbJH138W7",
                    "score": 5,
                    "author": "RuminateMan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I  have a Lenovo Flex 4 with an AMD Ryzen 5 and it runs great for a cheap/mid-range laptop. I use it for programming, photoshop, video editing, and light gaming with no problems. I'm not doing any heavy VFX or anything, just pretty basic video editing, but it works fine for that. It comes with a pen which is  nice for some design stuff. It's a few years old. I think there's a flex 5 now. If you don't know a lot about computers I would recommend doing a little research so you can see what specs you are looking for and what's important to you. IMO Microsoft laptops are a bit overpriced, but they're good machines. I have been happy with lenovo for my last couple laptops. Hope that helps. I'm happy to answer any more questions if you want",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "They're just now being introduced, but you might want to consider the latest MacBook Air with the new Apple M1 chip. With Apple's student discount it would start at $900. [The early performance tests are crazy good](https://9to5mac.com/2020/11/11/macbook-air-with-m1-chip-beats-16-inch-macbook-pro-performance-in-benchmark-test/)",
            "score": 3,
            "author": "el_caballero"
        },
        {
            "level": 0,
            "comment": "Recommend buying a business grade laptop.  Consumer grade laptops (ones you can buy at best buy etc.) are known for having not as good components...especially if you get one on black friday (they make electronics intentionally cheaper for black friday often time).  I recommend Dell or Lenovo business class laptops.  You can buy them online at either website.  I believe Dell has a pretty good refurbished program which you could look into as well.",
            "score": 2,
            "author": "[deleted]"
        }
    ]
}