{
    "id": "m8p6fg",
    "score": 9,
    "title": "Working on a story about students and stimulus checks",
    "author": "teo_sherbert",
    "date": 1616182647.0,
    "url": "https://www.reddit.com/r/GVSU/comments/m8p6fg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys, I’m working on a story for the Lanthorn this week about the new stimulus checks that have gone out and how it will impact students. Is this the first check you’ve gotten with the eligibility rules? Did you miss out because you’re a dependent? How will getting not getting the check impact you? Leave a comment or send me a pm (I understand this might be a sensitive topic for some, so you can remain anonymous of course).",
    "comments": [
        {
            "level": 0,
            "comment": "Hello, 24 (23 for 20-21 year) year old who is “independent”, ie I pay for most of my own stuff and files my taxes but considered dependent by the school. I received all stimulus checks, most of which I saved or went towards my car payment. What I planned on doing was saving the money and investing, but due to some unfortunate circumstances I will need to use some of the money to purchase a new car. In conclusion, the stimulus checks will help in the near future and down the road.\nEdit: The OP has my permission to use this story, and may reply/PM me if they would like to know more.",
            "score": 5,
            "author": "defar1"
        },
        {
            "level": 0,
            "comment": "Mines paying for a class lmao",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "A story on how parking is butt fudging us is beyyer",
            "score": 8,
            "author": "bigpenman"
        },
        {
            "level": 0,
            "comment": "20 year old dependent on my parents tax forms, but I file for my own taxes and pay for most of my own stuff. I was fortunate enough to have my parents give me a little bit of the first stimulus check (even though they didn’t get anything for me and I didn’t qualify) to help pay my tuition. Because I’m 20 and a dependent, neither me nor my parents got money for me from the second one either. This most recent one, my parents gave me a bit more to cover the security deposit on a house I’m leasing next year. Been pretty touch and go this year, working two jobs and unsure how I’m going to afford rent every month but somehow it always works out. Would’ve been nice if dependents older than 17 had been included to get their own checks out of all the stimulus checks.\n\nOP has permission to use this for a story and can DM/reply if more information is wanted",
            "score": 3,
            "author": "devefs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Idk I got a stimulus check on my own this year and I am an 18 year old, although my dad couldn’t claim me this year I thought it was based on 2019",
                    "score": 1,
                    "author": "lesbianclarinetnerd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I (18) filed my 2020 taxes and my father couldn’t claim me as a dependent, so I got my own. I actually got the last checks through the recovery rebate as extra money on my tax return (both checks so $1800)\n\nI haven’t been able to afford a car until these stimulus checks. Living in a rural town during the summer, this opens me up to better opportunities, more independence. Plus I can get an off campus job and not have to worry about depending on the bus. Not only that, my doctor office that is 13 miles away usually took a two hour bus ride due to how the bus system is spaces out. I can get to my doctor for my chronic health issues without worrying now.",
            "score": 2,
            "author": "lesbianclarinetnerd",
            "replies": [
                {
                    "level": 1,
                    "comment": "13 miles is 20.92 km",
                    "score": 1,
                    "author": "converter-bot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Still a dependant, so haven't got one :^)",
            "score": 1,
            "author": "Saitamago",
            "replies": [
                {
                    "level": 1,
                    "comment": "Go to the “get my payment” IRS site and possibly do some research to see if you are eligible! I don’t know your complete situation of course, but I do know that adult dependents are able to get the 1400 from the bill.",
                    "score": 1,
                    "author": "teo_sherbert",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It appears that only adult dependents of parents who don't make over the threshold are eligible.",
                            "score": 1,
                            "author": "daradv",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What is the threshold?",
                                    "score": 1,
                                    "author": "Saitamago",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "https://www.cnet.com/google-amp/news/10-quick-stimulus-check-facts-income-limits-for-the-third-payment-tracking-checks-and-more/",
                                            "score": 1,
                                            "author": "daradv"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had to get the check 1 &amp; check 2 through my 2020 tax return. My 2019 return had me as a dependent. I have been waiting for a week, the 3rd check finally showed a pending status today. My parents got theirs last Sunday. So I was stressing, because I didn't want to wait till 2022.\n\nThe money is going towards my student loans. I will lump sum them down, so that when they become due in October my monthly payment will be lower. I also want to avoid interest capitalization.",
            "score": 1,
            "author": "cdlechen_1122"
        },
        {
            "level": 0,
            "comment": "I’m 21 and I’m a dependent on my parents’ taxes. Even though my parents help me out and I have a part time job, getting a stimulus check would help so much and with it I could really start building some savings. Sure I’d buy myself like one nice thing that my parents won’t get me, but that money used be to start my saving funds for grad school. I wish that the government would allow dependents or students to get a stimulus check even though my don’t receive one.\n\nEdit: OP can use my post",
            "score": 1,
            "author": "stsoleil"
        },
        {
            "level": 0,
            "comment": "I’m 23 and this is my first year. I’ve gotten all 3 checks and for this one I put it towards rent",
            "score": 1,
            "author": "Cheap_Asparagus5518"
        }
    ]
}