{
    "id": "nb0r0h",
    "score": 5,
    "title": "Macbook Recs",
    "author": "Puzzleheaded-Light75",
    "date": 1620857083.0,
    "url": "https://www.reddit.com/r/GVSU/comments/nb0r0h",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all! I’m an incoming freshman this year and I’m looking at different laptops for school. I was wondering if anyone had a Mac and what they would recommend that I get.",
    "comments": [
        {
            "level": 0,
            "comment": "Just get a computer that can run Google Suites and Microsoft Office that you will won't feel encumbered hauling around.  Most laptops fit this bill.  You don't need to spend the $2000+ on a MacBook unless you want to (which is fine too).\n\nUnless you are in a major that requires a computer to have certain qualities like graphic design or something all you need is a paper-typing Netflix machine.  That's it.\n\nNo one will look down on you and you absolutely won't feel weird if you don't have a crazy top of the line MacBook if, after some introspection, that is a concern.  One thing you'll find is different about college than high school is that no one gives a fuck about the things you have or the stuff you enjoy in college.  Honestly your probably going to accidentally spill coffee on it or bash it into a building door anyway.",
            "score": 16,
            "author": "Redcard911",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate the honesty!",
                    "score": 3,
                    "author": "Puzzleheaded-Light75",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This. So much this. Stigmas of tutoring - none. Bullying - extremely rare to none (not like high school). Nobody really will judge you on your clothes, laptop, accessories, car, etc. I was so afraid that these would be the case. Heh, on my bike coming from class the zipper of my backpack went. I heard a crash and a scraping sound. That was my Macbook Pro skidding down along S. Campus Dr near Connection. Went the rest of the semester with it all scuffed. Aside from the bill, makes a great story.\n\nRambling aside. Yeh, unless you're in a major where you need specific hardware or software beyond the basics, and they'll let ya know' you'll be fine.\n\nAlso, GV has free downloads of Microsoft Office and Windows 10 available to you as a student.",
                            "score": 4,
                            "author": "nolanater5711",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks so much! I‘m a first generation college student so this entire process is really foreign to me. I appreciate the insight!",
                                    "score": 2,
                                    "author": "Puzzleheaded-Light75",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Props to you for being a first-gen student and asking questions like this. Just want to encourage you to keep asking them! There's so much professors assume their students know by default (like reading a syllabus or what office hours are for) that can be tricky to navigate as a first-gen. Number 1 tip: get to know your professors, remember that 90% of them would love the chance to get to know you a little better and help you out with things you're struggling with (the other 10% are jerks and/or clueless). Also: make sure you meet with a professional (not faculty) advisor (in the advising center for your college) at least once a year to make sure you're staying on track for graduation and being as efficient in course selection as possible, and take full advantage of things like the Knowledge Market. If you have a hard time adjusting to the workload, the Student Academic Success Center can be an awesome resource with success coaching and workshops. You're paying for all this stuff in your tuition so use it to your advantage!",
                                            "score": 3,
                                            "author": "EmilySpin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That is really great advice, I seriously appreciate it! I have already made an appointment with my advisor to discuss my path towards graduation, and I am so excited to meet my new professors.",
                                                    "score": 2,
                                                    "author": "Puzzleheaded-Light75",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I know this thread was long ago and you’ve likely gotten one already—but go with what they’re saying!! I bought a 2015 MacBook pro (which still works fantastically years later and I would recommend if you like apple products) but I found that I totally didn’t need to spend that much money. I’m an English/Education major and none of my classes have needed a super powerful processor to complete work. \n\nIn addition, I was the freshman who dropped my laptop off of my lofted bed more than once…so don’t go crazy if you anticipate falling asleep with your computer 😅",
                                                            "score": 2,
                                                            "author": "educationispowerGR"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even better recommendation, dont buy a new mac, go on ebay, look carefully, and buy a used one. Honestly, the cheapest and best route IMO",
            "score": 5,
            "author": "Rude-Blackberry-2294",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will totally do that! Thanks!",
                    "score": 3,
                    "author": "Puzzleheaded-Light75"
                },
                {
                    "level": 1,
                    "comment": "I didn't have to get a mac but getting my undergrad degree in film meant I wanted one, so I bought a refurbed Macbook Pro on NewEgg for $650 - that was my sophomore year (so nearly four years ago) and I am writing this on that same mac. \n\nNow that I'm in grad school (for something totally unrelated to film) I've decided to make my next computer a Windows machine because of a number of reasons, but I don't regret having used a mac at all in undergrad. The only issue I ever had was that external hard drives need to be formatted either to windows or mac, and one can't read a device formatted for the other. However, with cloud storage that may not be an issue for you at all. \n\nI saw you asking further down the thread about using Office 365 and wanted to let you know you don't have to worry about that at all; I've never had a problem.",
                    "score": 2,
                    "author": "BelleRevelution"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you want a Mac to use for general schoolwork and nothing heavy, get the MacBook Air instead of the Pro. The performance difference the Pro has is not worth the extra dollars :) I also recommend shopping through the Laker Store (I worked there for a year) or straight from Apple, and make sure to use their [student store](https://www.apple.com/us-hed/shop) to save $100!\n\nWindows alternatives that I like are Microsoft Surface Laptops, Dell XPS', or Lenovo Yoga 2in1s. As always, depends on your budget!",
            "score": 3,
            "author": "jakerbox",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, unless you’re doing graphic design/film editing an Air is more than capable to get you through college. As far as the office suite goes, most of your work can be converted to a word doc straight from your MacBook Air using Pages, or you can use Google Docs then use one of the computers at the labs to submit your work in Office formats. You can also just submit PDFs for course work most professors will be fine with it.\n\nThe student pricing ranges from $50-250 based on the laptop you purchase. Every year around July/August Apple does a Back To School special where you still get the student discount but on top of that you might get a gift card/headset/printer/iPod etc., that special differs each year, but in recent years it’s been beats. \n\nWelcome to the Laker family! Good luck!\n\nEdit: a word\nEdit 2: another word 😂",
                    "score": 3,
                    "author": "mmpb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Instead of Beats, the bonus is AirPods now!",
                            "score": 2,
                            "author": "jakerbox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s not bad. I do like AirPods more than Beats! When I went to GV back in the stone ages they were giving out printers and iPods, not together but like one year apart from one another.",
                                    "score": 2,
                                    "author": "mmpb"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you! Do people tend to have difficulty using Office 365 on a Mac? I’ve never purchased one before so I honestly have no clue haha.",
                            "score": 1,
                            "author": "Puzzleheaded-Light75",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I personally never liked the office suites because I’ve used the Apple stuff (used to be called iWork) for a long time, and the Mac versioned Office suite differed from the regular PC office suites so it didn’t help. Granted, pages and numbers also changed a lot throughout the years and I miss the old templates 😂",
                                    "score": 1,
                                    "author": "mmpb",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good to know! Thank you!",
                                            "score": 1,
                                            "author": "Puzzleheaded-Light75"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "i’ve had no problem with my 2019 mac book air! you get office for free for being a gvsu student as well!!",
                                    "score": 1,
                                    "author": "honeydew_syd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s good to know! Thank you :)",
                                            "score": 1,
                                            "author": "Puzzleheaded-Light75"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you so much for the advice!",
                    "score": 1,
                    "author": "Puzzleheaded-Light75"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a computer science major at GVSU currently and I’ll be a senior this upcoming year. Buying a Mac is the on thing I wish I would’ve done! Being able to have Linux on your system and Mac OS would have been so helpful for my projects and classes in which having those would have been necessary. I would definitely go for a Mac, a Mac can do everything a laptop with Windows can but better imo.",
            "score": 2,
            "author": "scub_101",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you think I would be better off getting the 13 inch pro or the 15? I trust your opinion because that’s what you’re studying haha.",
                    "score": 2,
                    "author": "Puzzleheaded-Light75",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For me personally in the computer science world having a bigger screen(s) is better because you can have different programs up and different pieces of code to look at to help for what you are doing. So personally, I would get a 15 inch or 16 inch if they have one. But, I have no idea if that’s your major specifically. If it’s not then I would suggest getting a 13 inch because you won’t need all that screen real estate like a computer science major would.",
                            "score": 1,
                            "author": "scub_101",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m going to be a nursing major in school. I’m not going to be doing any programming or coding. Do you think an Air would be best?",
                                    "score": 1,
                                    "author": "Puzzleheaded-Light75",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes definitely! The new MacBook Airs are so powerful for what you would be doing in college. I would highly recommend getting one. You can’t go wrong with a Mac.",
                                            "score": 2,
                                            "author": "scub_101",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you so much!",
                                                    "score": 2,
                                                    "author": "Puzzleheaded-Light75"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree with people saying not to buy a Mac unless you're getting an art degree or something like that, but also buy through the laker store. They have discounted computers",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the advice!",
                    "score": 1,
                    "author": "Puzzleheaded-Light75"
                }
            ]
        }
    ]
}