{
    "id": "ozzsiv",
    "score": 16,
    "title": "How good is the CS program at GVSU?",
    "author": "shashaspamzz",
    "date": 1628364910.0,
    "url": "https://www.reddit.com/r/GVSU/comments/ozzsiv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi there! I am a student planning to transfer to Grand Valley State University and I wanted to know what is the Computer Science program like, whether it's good or not and what are the professors like? Looking forward to reading your replies :)",
    "comments": [
        {
            "level": 0,
            "comment": "CS Alumni here. Overall I thought the program was great. I came in with little to no programming experience and did alright. The professors are all exceptional and knowledgeable except for maybe 1 or 2 IMO. Compared to other universities, I think that the professors at GV actually \"care\" about you learning as opposed to somewhere like U of M where I hear that some profs there let you drown. The smaller class sizes help in this aspect. I believe a lot of the stuff you learn can be applied to the real world, although it is really dependent on which professors you have and what you decide to focus on. My advice is take electives that you think you want to apply in your career later on and research your future profs on ratemyprofessor.com. Hope this helps.",
            "score": 17,
            "author": "wrokband",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have done some projects outside of school yes. For example a Discord bot for my friends server. I have not applied anywhere out of state but I don't think the school you went to matters in terms of employment options. Most employers just care that you have the degree they're looking for. Of course some will be looking for the Stanford or U of M grads but there is really no way for me to know that.",
                            "score": 5,
                            "author": "wrokband"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It does! Thank you so much :)",
                    "score": 1,
                    "author": "shashaspamzz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Upvoted for the shout-out to Discrete Structures. :) \n\nSpeaking of which, it's actually super easy to get a math minor if you're a CS major -- most CS majors can just take 2 more courses (MTH 204 and MTH 465 are good ones). Details here: https://www.gvsu.edu/mthpolicies/special-substitutions-for-students-studying-mathematics-and-computer-4.htm",
                    "score": 9,
                    "author": "Rtalbert235",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey professor Talbert!! Loved taking discrete structures with you. Thanks for the extra info - I might bake in a math minor now!!",
                            "score": 2,
                            "author": "radioarchitect"
                        },
                        {
                            "level": 2,
                            "comment": "I'll definitely keep that in mind. Thanks for sharing that with me :)",
                            "score": 1,
                            "author": "shashaspamzz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for replying! It was really helpful :)",
                    "score": 1,
                    "author": "shashaspamzz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a math prof, I've been impressed with it. As mentioned by u/wrokband, the attention and chance to interact with profs is much greater than at graduate mills. Loads of opportunities for research and internships with local businesses. And the interaction with our new applied program is very cool.",
            "score": 6,
            "author": "goldenj",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for sharing that with me, I really appreciate it and it was really helpful :)",
                    "score": 3,
                    "author": "shashaspamzz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alumni/Current masters student. Great program that works hard to bring in excellent faculty. You’ll be very challenged in a few classes, but it’s a very doable program. The university is working on creating more research/corporate sponsored opportunities lately, which is great for current/future students to fill out their resumes and network in more meaningful ways.",
            "score": 5,
            "author": "ThaBirdLion",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, that sounds great! Thank you for sharing that with me :)",
                    "score": 1,
                    "author": "shashaspamzz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really good IMO. I mean I just interned at a company in Lansing Michigan and there were college students from MSU and I can tell you right off the bat, none of them have ever taken a speaking class in college or a resume/job preparedness class. GVSU focuses on making the students in CIS be more well rounded when they get into the industry. Most bigger schools try to just give as much information on the major or subject you are trying to become a professional in but they usually miss out on the social aspects and the job preparedness part of becoming a professional. Not trying to bash on MSU but like the fact that the CIS students there have never taken speech (required at GVSU) or have never been taught how to write a good resume is shocking. Tbh I’m kind of glad I picked GVSU, made really good friends and there are hella parties as well (if your into that).",
            "score": 4,
            "author": "scub_101",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's great to hear! Do you feel that GVSU helped prepared you well for the working world?",
                    "score": 2,
                    "author": "shashaspamzz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of Course! I mean just from what I saw and heard from others at different university's I believe so. Just the fact that having an internship is required in the CS course work just makes me believe GV wants you to go the extra mile which is great. MSU, and Purdue (some of the colleges kids attended at my workplace) don't require you to have an internship which is devastating. I just got offered a part time position this Fall from my internship and I'm still in college! This all wouldn't have happened if I did not attend GVSU. You would love it here at GV!",
                            "score": 1,
                            "author": "scub_101"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know two people that graduated from the program, one had an internship and full-time job lined up after they graduated 7 years ago, the other person graduated in the past 3 years and is making good money now around GR.\n\nFrom what I can tell the classes can be challenging, but GV does supply the tools to succeed if you use them. Best of luck!",
            "score": 3,
            "author": "electrick-rose",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for replying :)",
                    "score": 2,
                    "author": "shashaspamzz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for sharing that with me. I really appreciate it :)",
                    "score": 1,
                    "author": "shashaspamzz"
                },
                {
                    "level": 1,
                    "comment": "University of michigan only requires up to calc 2 unless you do computer science through their engineering school. MSU and ferris and other schools require calc 3",
                    "score": 1,
                    "author": "alec_202"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Current eternal senior :) I’m enjoying the CS program a lot! I transferred in with a decent knowledge of programming and I feel like what I’ve learned has been valuable so far. Most of my professors have been phenomenal and the other classes you have to take like Discrete Structures are really interesting. There’s not a lot of choice in your courses besides electives but the courses you have to take are interesting. \n\nIf you’re at all interested in a graduate degree they have a hybrid program to earn your bachelors and masters with some overlap. It saves time and money. I’m happy with my decision to apply. \n\nThe area is also great! COVID aside, there’s a lot to do here and I’m looking forward to participating more on campus. GR features a lot of cool restaurants, the art museum and public museum, and the Frederik Meijer gardens.   \n\nMost places don’t care where you get your undergrad, so pick a school you like in an area you could see yourself being for a while. A CS degree from GVSU is just as valuable as one from UofM. Hope this helps!!",
            "score": 1,
            "author": "radioarchitect",
            "replies": [
                {
                    "level": 1,
                    "comment": "It really does. Thank you!",
                    "score": 1,
                    "author": "shashaspamzz"
                }
            ]
        }
    ]
}