{
    "id": "pk3fyk",
    "score": 16,
    "title": "Campus dining",
    "author": "Nochis-",
    "date": 1631075110.0,
    "url": "https://www.reddit.com/r/GVSU/comments/pk3fyk",
    "media_urls": [],
    "other_urls": [],
    "postText": "I totally get that there are staffing issues, and it’s of no fault of the students. But GV seriously needs to fix the lack of staffing on campus for dining. The few places that do have staffing, seem to still be pretty minimal on workers, and the lines get long and stay long. I can only imagine how stressed that must make the student workers. \n\nI’ve heard it to be horrible managers, low pay, etc. but whatever the case, GV needs to address this, and soon.",
    "comments": [
        {
            "level": 0,
            "comment": "When I worked for Campus Dining, the work was abysmal at best. Fellow student workers made it more tolerable, but at $9.25 an hour before taxes during COVID - no thanks.",
            "score": 23,
            "author": "nolanater5711",
            "replies": [
                {
                    "level": 1,
                    "comment": "They called me off an online resume, offered 17/hr to be a manager. Culver's 5 minutes from my house pays 20/he starting as a cook, no thanks",
                    "score": 1,
                    "author": "Wheredidiparkmyyugo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This has been an issue since they started having more students each year but failed to update the dining structures on campus. I can only imagine with more students and covid measurements making it worse. \n\nNot gonna lie I brought a tiny rice cooker with a steamer, a microwave, and a panini maker just so I can “cook” some stuff in the dorm to avoid the traffic at campus dinning. If you need to go this route Target/Amazon has small personal cooking appliances that’s pretty cheap, besides the microwave, you can score a personal rice cooker for &amp;10-15, and a panini press or other heating press or toast for less than $20. If you have more money to spear, a 3qt instant pot around $50 would be even better.",
            "score": 12,
            "author": "mmpb",
            "replies": [
                {
                    "level": 1,
                    "comment": "A small crockpot would make a nice addition to your collection of appliances!",
                    "score": 6,
                    "author": "Goodlollipop"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I worked at campus dining for over a year my first year on campus and tbh there is no amount of money they could pay me to go back. Management was shit, we were overworked and underpaid, there was little to no training. It was just terrible",
            "score": 14,
            "author": "twentytinyhearts"
        },
        {
            "level": 0,
            "comment": "As someone who’s worked for campus dining I understand why nobody wants to work for campus dining",
            "score": 12,
            "author": "Jake_The_Snake42"
        },
        {
            "level": 0,
            "comment": "Low pay, one of the reasons I didn’t work on campus when I attended. Heard of crap management as well.",
            "score": 8,
            "author": "defar1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve heard that it’s pretty common for the student managers to be really nice but the managers above them can be a real pain. (Source: multiple of my friends work for campus dining)",
                    "score": 10,
                    "author": "Nochis-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Check your email. Maybe someone in administration read your post lol",
            "score": 8,
            "author": "Oddrenaline",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was just thinking that! The timing was awfully coincidental, that’s for sure",
                    "score": 8,
                    "author": "Nochis-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They pay like shit and only let you work 20-25 hours a week therefore nobody works there because they literally can’t make enough to live here",
            "score": 6,
            "author": "Koobz16"
        },
        {
            "level": 0,
            "comment": "I'm sure it'll die down a bit over the next few weeks as people stop showing up due to classes being too easy/too hard, staying out late partying, etc. But yeah bringing a sandwich is definitely the play right now. That or going to one of the restaurants off campus. Even at lunchtime, the Culvers on Lake Michigan dr. seems to be pretty dead inside.",
            "score": 3,
            "author": "NoMansSkyWasAlright"
        },
        {
            "level": 0,
            "comment": "I worked at fresh before the pandemic and loved my managers. Guess it depends on the place.",
            "score": 2,
            "author": "DegreeEmergency",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s definitely neat hearing a different take on the perspective of working food service at GVSU. Would you ever go back to working dining at GV? And why/why not?:)",
                    "score": 1,
                    "author": "Nochis-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d go back to work with that manager but I transferred to GRCC, the manager or director who runs fresh is super laid back and very understanding.",
                            "score": 2,
                            "author": "DegreeEmergency"
                        }
                    ]
                }
            ]
        }
    ]
}