{
    "id": "tsbj22",
    "score": 6,
    "title": "Which has a better 2 bedroom, Murray or Laker village?",
    "author": "NotEnoughCreamcheese",
    "date": 1648660972.0,
    "url": "https://www.reddit.com/r/GVSU/comments/tsbj22",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ll be attending this fall and I was planning on living at laker village but housing recommended Murray. They seem pretty similar, but those do you who have been to both what do you think?",
    "comments": [
        {
            "level": 0,
            "comment": "good luck finding housing in laker village",
            "score": 8,
            "author": "Lukethekid10"
        },
        {
            "level": 0,
            "comment": "I've only lived in Laker Village so I can't speak as to Murray but I liked it there. It essentially felt like living off campus but not having to drive or ride the bus to campus every day since you can just walk. Also it's traditional apartment style so you have your own room as well as a shared common area downstairs. My main complaints would be that it's still further away than anywhere else on campus, as well as the fact the units don't have dishwashers. It's also kind of confusing if you have to give people directions to your apartment since they all look the same. I have however seen that the south LVA units are slightly bigger than the north LVA units so if you're going to live there try and get into the south apartments.",
            "score": 7,
            "author": "H1shf1sh"
        },
        {
            "level": 0,
            "comment": "Laker Village hands down. I haven't lived in Murrary but I lived in Vansteeland my freshman year, which is basically the same.  Lake Village yields you much more space and privacy. You can have some family and friends over and have a lot of room for some guets. You get almost zero counter space in the Vansteeland/Murray kitchen. You won't have a dishwasher in either, but the extra kitchen space is worth it in Laker Village.\nThe laundry situation at Laker Village sucks through. People are incredibly rude and will fuck with your clothes in front of you. I had one asshat do it right behind me (moments after I put my clothes into the dryer) and I had to set him straight. You also have to be mindful of the weather situation outside since you'll need to do your laundry at the clubhouse. Other than that, Laker Village is great but yeah, have fun trying to get a place over there. It's incredibly popular.",
            "score": 3,
            "author": "Lyndis-of-Pherae"
        }
    ]
}