{
    "id": "10gauvo",
    "score": 4,
    "title": "Looking for old syllabus- The Nature of Earth (2018-2019)",
    "author": "Extreme_Row6484",
    "date": 1674156781.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/10gauvo",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm in desperate need of help finding an old syllabus. I was a student at AU for one year (2018-2019) before transferring to UT Austin. It's now my last semester and I still need one more gen-ed science course because UT accepted the Nature of Earth (ENVS) as elective credit, not fulfilling my science requirement. \n\nI need the syllabus to petition for science credit but I CANNOT find it. Every semester I try again to contact the department/registrar or find the instructor or syllabus online, and fail. I've sent so many emails and sat on hold for hours. I have no documentation of the class on my computer; the laptop I used my freshman year broke down and I lost all my data that wasn't stored online. I can't remember who the professor was (a woman I think?) or even which semester I took the class...\n\nDoes anyone have a copy of the syllabus from that year (or later), remember who taught the course at the time, or know where I might be able to find more information?",
    "comments": [
        {
            "level": 0,
            "comment": "AU has since switched to from using Blackboard when you were attending to now using Canvas for online coursework and material. Faculty were instructed to download everything they needed from their Blackboard courses before the switch but many of them did not. \n\nIt's likely that the only person who might have a copy of that would be the instructor who taught your class. Even then, there's a fair chance they haven't kept track of it.\n\nMy advice would be to first reach out to the teacher of the course to see if they have a copy still and if that doesn't work, reach out to the registrar's office and ask if they have a similar course that's currently being offered. Every year course numbers, names and descriptions are altered so it may just be going by a different name. You might be able to submit that course's syllabus as a similar example of the coursework and rigor.",
            "score": 6,
            "author": "Hoosier_816"
        },
        {
            "level": 0,
            "comment": "I have it from that year when I took the class give me your email I can send it.",
            "score": 4,
            "author": "bsheiffer",
            "replies": [
                {
                    "level": 1,
                    "comment": "awesome!!",
                    "score": 3,
                    "author": "Extreme_Row6484"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ENVS-150 Nature of Earth the professor is Dhananjaya Katju her email is katju@american.edu",
            "score": 2,
            "author": "shhsjsjshssjshs"
        },
        {
            "level": 0,
            "comment": "I got the syllabus but it’s for this year but she said the course hasnt changed. Got an email i can send it to you?",
            "score": 2,
            "author": "shhsjsjshssjshs"
        },
        {
            "level": 0,
            "comment": "Cant help other than maybe checking your AU transcript or contacting your old advisor?? But I am also looking at transferring to UT from AU- maybe you could help gain some insight?",
            "score": 1,
            "author": "imadepressedegg"
        }
    ]
}