{
    "id": "10q2wxi",
    "score": 4,
    "title": "Where to live/find roommates?",
    "author": "perry_princess",
    "date": 1675181353.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/10q2wxi",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was recently admitted to grad school at AU and was wondering if anyone had any tips on finding a decently priced but also safe place to live near campus. I originally wanted to live in a studio or 1 bedroom but with how expensive everything is, I would like to find a roommate. I've never lived in a big city and would appreciate any help lmao. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "The Berkshire is very close to campus and a lot of students live there. I lived there in 2021, I'm not sure about prices now but at the time it was affordable compared to other apartments. There are a few other places on Mass Ave but the Berks is like a 5 minute walk to campus.",
            "score": 4,
            "author": "sg345"
        },
        {
            "level": 0,
            "comment": "There’s a resource from the school you can use: https://offcampus.american.edu/. Would also find Facebook groups for housing/rentals in the area",
            "score": 2,
            "author": "writingwithwings"
        },
        {
            "level": 0,
            "comment": "Same here! I will be starting my studies in Fall 2023 and I don't know where to find roommates.",
            "score": 2,
            "author": "AfricanQueen2000",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you haven’t found a roommate yet I’d be more than willing to further discuss potential roommate ideas? I’m also an incoming fall 2023 first year grad.",
                    "score": 1,
                    "author": "Think_Zucchini_2444"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Define near. Are you looking for a place where you want to walk/take public transit to AU? Or are you bringing a car and intend to drive to school? \nIf you’re looking for walking/metro distance look for the neighborhoods of Tenleytown and Friendship Heights, and if you’re driving look more towards Bethesda and Chevy Chase in MD or Arlington and McLean in VA.\nThere’s not really any place near school (inside the 495 beltway) that I would consider “affordable and safe”\n(Edit): as far as finding roommates there’s some online forums, and some discords that I’d recommend checking out.\nThis is the school discord hub and a decent place to start.\nhttps://discord.gg/qeVGTh48E3",
            "score": 1,
            "author": "Miku_Nakano"
        }
    ]
}