{
    "id": "11txzkb",
    "score": 3,
    "title": "i just need some input and advice",
    "author": "AbleLog7723",
    "date": 1679074662.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/11txzkb",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I was just accepted to American University and the Kogod school of business in D.C.\n\nI also was accepted to Fairfield University and the Dolan school of business in Connecticut.\n\nThese are my two choices and luckily for me I come from a family where the price of college tuition doesn't make a difference.\n\nIm super conflicted about where to go and I'd just like some input from college students and other 2027 students.",
    "comments": [
        {
            "level": 0,
            "comment": "To me the actual campus experience would be way different at AU because of their like-minded community and what DC provides as an additional resource.",
            "score": 5,
            "author": "SoCalJR",
            "replies": [
                {
                    "level": 1,
                    "comment": "i just can't decide. I feel like I wont like AU students as much because i'm more conservative and not very political but i know its a better school than Fairfield",
                    "score": 1,
                    "author": "AbleLog7723",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s valid. AU students do tend to be more aware and opinionated on all things political or happening in the world. That is also DC too (lived there for a decade). It’s the capital of the US so there are lots of AU type of folks around that area. If you are a busy HS student…my opinion is you’ll be around other busy students at AU. Your conservative nature is more than fine at AU/DC. You just need to be aware there are a lot more students at AU that would push back or have strong opinions if you choose to engage in those discussions. That isn’t a bad thing IMO. Just something to be aware of.",
                            "score": 10,
                            "author": "SoCalJR"
                        },
                        {
                            "level": 2,
                            "comment": "If you’re conservative do not come here. While Kogod is known to be the most conservative out of all the schools, you will literally be ostracized because of your political beliefs. I’m a democrat and even I feel like I don’t belong a lot of the time. Everyone here is just annoying tbh.",
                            "score": 3,
                            "author": "caseybacot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think I’m going to go to Fairfield, I’m not even that conservative but I’ve yet to see another student who doesn’t have there pronouns listed on insta gram",
                                    "score": 2,
                                    "author": "AbleLog7723",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that shouldn’t be a make or break..",
                                            "score": 1,
                                            "author": "elcabori"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Our kogod kids seem to lean more conservative so you’ll be fine",
            "score": 7,
            "author": "shhsjsjshssjshs"
        },
        {
            "level": 0,
            "comment": "Not a current AU student but an alum.  Don’t let conservative/liberal sway you too much.  It’s important  to be in a place that challenges you.  Best things I’ve done in life are learn to work with people I completely disagree with.  \n\nI can’t answer your question as I’m a bit too removed, but I wanted to chime in with the above.  You may be challenged in your beliefs and ideologies…what’s what is college and life for if you’re not?",
            "score": 3,
            "author": "chezewizrd"
        },
        {
            "level": 0,
            "comment": "Not a student, just work in IT support for Canvas at AU. \n\nAnd it may not make much difference but AU uses Canvas and Fairfield uses Blackboard. \n\nI only mention this because this year I heard something I’ve never heard before, which is that there are students making their final college decisions based on what platform a school uses. \n\nIt definitely makes sense though; if you’re choosing between two schools and one uses an established LMS and the other uses some random free software that doesn’t do everything it needs to do causing workarounds and complications, I can see that swaying your decision.\n\nBut yeah, I’m not holding my breath that it’s the deciding factor for most students lol",
            "score": 7,
            "author": "Hoosier_816"
        },
        {
            "level": 0,
            "comment": "I’m a current student at AU, started in Kogod switched to SIS. Although I switched I do think Kogod is a great business school and def recommend it. The reason I switched was more of a career preference move than anything. Campus experience at AU isn’t always the best, especially if you’re looking for a more traditional college experience. However, there are still frats if that’s your thing and there are the clubs downtown. I like it at AU overall and I’m very happy I went here. If you have any other questions, especially if they’re specific to Kogod feel free to DM me.",
            "score": 1,
            "author": "flybe72"
        },
        {
            "level": 0,
            "comment": "I’m a current student at AU, started in Kogod switched to SIS. Although I switched I do think Kogod is a great business school and def recommend it. The reason I switched was more of a career preference move than anything. Campus experience at AU isn’t always the best, especially if you’re looking for a more traditional college experience. However, there are still frats if that’s your thing and there are the clubs downtown. I like it at AU overall and I’m very happy I went here. If you have any other questions, especially if they’re specific to Kogod feel free to DM me.",
            "score": 1,
            "author": "flybe72"
        },
        {
            "level": 0,
            "comment": "I’m a current student at AU for 2 years. Honestly yes the school is extremely liberal and if you are conservative I don’t think you should go there. People are very liberally expressive and there is definitely a lot of diversity on campus. If you are conservative at all I would not touch the school.",
            "score": 1,
            "author": "TheRapt0rPack",
            "replies": [
                {
                    "level": 1,
                    "comment": "ill change the school SMH",
                    "score": 1,
                    "author": "AbleLog7723"
                }
            ]
        }
    ]
}