{
    "id": "8133y7",
    "score": 6,
    "title": "best time to visit the gym?",
    "author": "OriginalPractice",
    "date": 1519883990.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/8133y7",
    "media_urls": [],
    "other_urls": [],
    "postText": "I hate seeing people I know but also want to get in shape. Which gym at what hours are there typically the lowest amount of AU students? I just want to get in shape without worrying that Chad is visually deconstructing my form of lifting. ",
    "comments": [
        {
            "level": 0,
            "comment": "If you go late at night it’s normally pretty empty. Jacobs at 10 or so. Like 6 or 7 max other people in the weight area and they are all there doing their thing. Don’t worry about it. No one else is paying attention.",
            "score": 9,
            "author": "Direwolf224"
        },
        {
            "level": 0,
            "comment": "Just go anyway. But Pro Tip: Back in my day Cassell was less crowded than Jacobs",
            "score": 5,
            "author": "Totally__Not__NSA"
        },
        {
            "level": 0,
            "comment": "Not sure if still needed, but I've been a gym rat since first semester. \n\nMorning hours (and they open pretty goddamn early) are clear for both gyms. But if you're doing this you pretty much have no soul and shouldn't worry about people judging you.\n\nAbout the last hour and a half for both gyms (Cassell closes an hour earlier at 11) have few people. This is usually when I go. I'm the guy with black hair in a bun, probably grey and yellow shorts, feel free to say hi. \n\nDon't have much experience with this time, but when I've gone during peak class hours (11am-2pm ish) there's few people around. \n\nAnd honestly dude, most no one cares about your workout. Most of the regulars are pretty chill. Everyone else is looking at themselves in the mirror just as much as you are. Just do what you go there to do. ",
            "score": 2,
            "author": "Marear"
        }
    ]
}