{
    "id": "9clyc6",
    "score": 5,
    "title": "How hard is it to get in RD?",
    "author": "officemonkey33",
    "date": 1535985377.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/9clyc6",
    "media_urls": [],
    "other_urls": [],
    "postText": "I know that AU accepts a ton of students ED, more than most schools, so I'm guessing that skews that accepted students profile a lot. I can't find any stats just for RD. Does anyone know how hard it is to get in RD? ",
    "comments": [
        {
            "level": 0,
            "comment": "Hey, so I'm a Freshman who applied RD and was accepted off the wait-list for this academic year.  I've read on the Eagle that the admissions office received 18,950 applications for this year (2018-2019), and about 29% of applicants were accepted, though the official university site for information about the Class of 2022 states that 31% of applicants were accepted. I don't think my essay was great (I talked about my major basically), my GPA anything extraordinary (3.79, weighted), or extracurriculars exciting (only really had 3 or 4). I chose not to submit my SAT scores as they weren't spectacular either (FYI it was 1190). I did however visit the school after being wait-listed and attended information sessions in my hometown, and I think my continued interest helped get me off of it. American does take how much interest you show in actually wanting to go here (e.g. coming for a campus visit, attending info sessions in your area, etc.) into account for admissions. I would argue that my race and major MIGHT'VE played a role into how I was accepted, but I can't be for sure. All I can say is that do your best in school, make your essay unique and not cliche (don't write about a mission trip you went on to Central America and how it changed you or how a grandparent drove you to pursue this, etc), and visit to really get a feel for what the campus is like and if you can see yourself living in D.C.  \n\nHere are links to the websites that I got these stats from:\n\n[https://www.american.edu/ucm/news/20180828-Facts-2022.cfm](https://www.american.edu/ucm/news/20180828-Facts-2022.cfm)\n\n[http://www.theeagleonline.com/article/2018/04/american-university-accepts-29-percent-of-applicants-for-class-of-2022](http://www.theeagleonline.com/article/2018/04/american-university-accepts-29-percent-of-applicants-for-class-of-2022)",
            "score": 2,
            "author": "Ry1459",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for this. My GPA is a little bit lower than yours but I have a 1400 SAT score and have a few more ECs than you. So I guess it's a toss-up. ",
                    "score": 2,
                    "author": "officemonkey33",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be honest, I think you’ll be fine. You already have a great SAT score and more ECs than I did. I don’t know how I got in with my stats lol. Just remember that the quantity of what you bring to the table isn’t the only thing playing a factor into if you’ll be accepted or not. It’s also, if not more-so, about the quality of your character and how you feel you can contribute to AU as a whole. Work on those essays, and don’t decide to do them the night before the app is due (like me). ",
                            "score": 3,
                            "author": "Ry1459"
                        }
                    ]
                }
            ]
        }
    ]
}