{
    "id": "a4gnbh",
    "score": 7,
    "title": "Prospective student with questions !!",
    "author": "brbafterthebreak",
    "date": 1544318035.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/a4gnbh",
    "media_urls": [],
    "other_urls": [],
    "postText": "1) How diverse is the campus and immediate area? In terms of socioeconomic status and race. Do you feel like you see the same type of students everywhere? I live in NYC and in the NYU area it feels very homogeneous; I don’t want that. \n\n2) Party scene? I mean I’m talking laidback, rangers, average house parties, dorm parties even. While I’m not going there to get drunk and don’t party everyday, I do like parties and would like a decent scene. Do you feel you get that there? Not necessarily every day but that there are are often options on the weekends. \n\n3) Internships and opportunities. Do a lot of companies come and recruit and if so what kind? How in your face or prevalent is it? What sort of opportunities have you searched for/been presented with?\n\n4) Teaching quality. How are the professors? Do they seem like they care? What kind of classes do you usually have (lectures, small discussion based,...)?\n\n5) Workload. Is it hard? I plan on doing work-study freshman year possibly, do you think that’s something feasible at AU?\n\n6) How expensive is DC? I mean I live in NYC and I’m used to prices but I definitely don’t like it haha. \n\n7) How is DC in general? Do you think the area AU is in is good? Lotta things to do? Public transportation? Safety?\n\n8) School spirit. Do people attend games and events on campus much?\n\n9) How are the dorms? Is there AC? What sort of amenities are there in the dorms or amenities on campus you didn’t expect/like?\n\n10) What’s something you read about AU before coming there that you don’t see/experience/feel? \n\n11) How the fuck is it actually so far? What’s your major?\n\n12) How’s the food on campus? What about off-campus?\n\n13) Financial aid? Did you get much? What about people you know?\n\n14) Name recognition? You think having the name AU on your resume helps you?\n\n15) What do you think of the enrollment size? Too small? Just right? What are the pros and cons of this you’ve noticed? Do you see the same faces every day?\n\n16) Is it easy to take classes just because it’s interesting?\n\nThank you!!!",
    "comments": [
        {
            "level": 0,
            "comment": "Lotta questions, but I'll take a crack at them. Keep in mind, I'm a freshmen currently.\n\n1. Not that diverse, I'm from Cali and it took some time to get used to the lack of diversity here. Many kids are wealthy, and the dominant race on campus is white. The school is located in the northwest part of D.C., which is the richest area of the city.\n2. I don't party, but there are some going on pretty much every week (frats, dorm parties).\n3. D.C. has plenty of opportunities, it's up to you to seek them. There are some job fairs and special events throughout the year, and you can sign up for job listing emails from the Career Center. On-campus recruiting is little to none, so you have to network.\n4. Overall teaching quality has been pretty good so far. It's really dependent on the classes you take and how many students are in them. Some of the required classes however, have been pretty hit or miss. The professors do care about your success, and are willing to help if you take advantage of their office hours. There are some bigger lecture classes, but for the most part, the average class is about 19 students.\n5. Workload isn't too bad as long as you are smart with managing your time (also depends on your major). I'm a work-study kid with a part-time job on-campus and I've been able to keep up pretty easily.\n6. D.C. is expensive, but there are plenty of things to do that are free.\n7. D.C. is a great city, I personally love the museums (they're free). The surrounding area has little to do, and pretty much everyone takes the shuttle (10-15 min ride) to Tenleytown which has the closest metro stop. From there, you can go around the city. Speaking of, the tuition covers transportation, so you get an unlimited metro pass which is also good for the metrobuses. The city is pretty safe. but you should always be aware of your surroundings.\n8. School spirit? What's that?\n9. Oh, the dorms. If you look past the mold, rats, and broken appliances, they aren't too bad. You get a decent amount of storage space, and the room comes with a desk and a shelf for each occupant. I'm lucky to live in Anderson, which was recently renovated, so our lounges are a lot nicer than Letts or Centennial. You have to pay for laundry and of course, there's communal bathrooms for both men and women. AC and Heat are available in each room, but the school kinda controls it. You can hack your unit though. My AC didn't work in the summer months so I got to melt in my 86 degree room.\n10. I read a lot about the inclusiveness of the school (they try to pride themselves on it), and while it's getting better, there is still a ways to go. People tend to stick with those who are similar to themselves.\n11. It's been pretty good so far, at least for me. I've definitely had some rough times here and there, as do most people, so it's not uncommon if you experience it as well. Make sure to take care of yourself. Feeling the homesickness right now with finals going on. I just want to go home lol.\n12. Food on campus sucks. Subway and Starbucks are about the only good places, plus they stay open late. They closed Megabytes after a rat incident, which was like the only other good place to eat on campus. Freshii, Elevation Burger, and maybe Pi &amp; Fry is alright, everything else is pretty bad (especially TDR). All the school-run places close early (like 6pm during the week and they aren't open on the weekends, with the exception of TDR).\n13. Oof, tough topic. While I was lucky enough to get a decent amount, which without it I wouldn't be able to go here, some aren't so lucky. There are certainly kids who can outright afford the cost of tuition, but be prepared to take out loans, even with financial aid as the school is pretty stingy with who they give it out to.\n14. I think it can help, but not nearly as much as some of the other schools in the area like Georgetown or GWU.\n15. I personally like the enrollment size. It's not super small, but it also isn't too big. It's a good middle, where you can make a small knit group of friends while also being able to have plenty of acquaintances.\n16. It can be if you are actually able to take the classes you want. Registration can be a pain in the ass.\n\nHope this helps. Feel free to ask anymore questions.",
            "score": 6,
            "author": "Ry1459"
        },
        {
            "level": 0,
            "comment": "I've been at AU for a long time now as both an undergrad and master's student. Here's my two cents:\n\n1. I would say it's a diverse campus when you factor in that it's a high-tuition school and for the area. It kind of depends on the groups of people that you associate with, because to be honest you can find all sorts of folks at AU if you seek them out. There are a lot of student groups in the school.\n2. I think there's a good mix. You have the fraternities, which are typical college parties. Once I got a friend group going, smaller parties and get togethers are pretty common.\n3. This kind of depends on what you're looking to do. DC has a robust job market that is only improving, so there's all the opportunity in the world here if you're interested. If you are thinking of career center opportunities it depends on where you're looking to get into. There's a large all-school fair they hold each semester, we have a school job board with thousands of jobs on them, and I've found that even professors have great connections you can leverage. Again, it all comes down to your initiative and drive to find things that don't immediately jump at you. What are you interested in?\n4. I've found that overall the professors are great to work with. They're really knowledgeable and while you will find some that seem weak, they haven't been the norm for me.\n5. I did work study all four years in my undergrad and both years of my master's. All the offices I worked in realized I'm a student first and were willing to work with my schedule.\n6. DC is pricey, but if you find a group of people to split rent with, it's manageable. I had a two bedroom that was split 4 ways and worked out to about 600 per month. Being conscious of your spending and cooking for length helps a lot. Having a FWS job also made a difference for me.\n7. NW DC is by far the nicest part of the city. Affluent, good surroundings, though it can be a bit of a bubble. There's a shuttle to the metro and a few bus lines near the campus that go to Dupont Circle, Friendship, and some others. I think the city is a great alternative to NYC. It's got similar opportunities without skyscrapers and a sleepier feel. People tend to turn in sooner than other cities.\n8. Not really much school spirit, but are sports teams are pretty decent. It's D1 and all that. Our women's teams are off the charts, but people tend to forget about them regrettably.\n9. I enjoyed my time in the dorms, though Anderson/Letts can be rough depending on the room you get. I went off campus second semester sophomore year. North side is better than South outside of Centennial Hall, which I'm pretty sure is upper classmen still.\n10. I didn't know much about AU before visiting. I was just so taken with the campus upon visiting that I felt more at home here than at other places I visited.\n11. My undergrad was poli sci, which I thought was a great program but didn't know how to translate into a career. Wish I had gone more to the career center to figure that out. I ended up getting interested in business and am studying accounting for my master's. Wish I had done it for my undergrad--not a terribly difficult subject, interesting, and has tons of opportunities out there, many from the career center.\n12. Awful food on campus. TDR is fine when you have meal swipes, but going off campus for eating out is recommended. There are really decent options in Tenleytown and nearby before that off Van Ness street.\n13. No financial aid for me outside of FWS, but I think my parents just made enough that FAFSA couldn't help. I know of plenty of others that had success, though, from AU and other sources.\n14. It definitely helps if you want to work in the DC area. It's a well known school here, but only carries name recognition outside DC if you are going poli sci/international relations/communications route in my opinion. SOC is a decently ranked school, SPA is better, and SIS is really up there as well.\n15. I think just right. You start to see the same faces as it relates to your program of study, but for other schools there are plenty of faces to meet.\n16. Depends on the class. Listen to what people say and your advisors, and that will help make a decision. If you have any specific classes in mind, let me know and I can offer an opinion.\n\nHope that helps!\n\n&amp;#x200B;",
            "score": 3,
            "author": "guanacosine"
        },
        {
            "level": 0,
            "comment": "1. I wouldn't call it extraordinarily diverse, but I would say it's probably a little more diverse than average although I would say international students account for some of that. It's not bad for a school that runs over $60k a year before financial aid, but it could definitely be better and in the past couple of years there have been several hate crimes on campus that they didn't do a great job of handling. I'm white so I can't speak too authoritatively about this though.\n2. I'm not a big party person but I've gone to my fair share. From what I know there's a decent party scene that I just never got involved in but Greek life seems to be pretty active. Not like in a big state school but they throw parties. Personally, I just have some close friends who throw parties pretty regularly so I just go to their house on the rare occasion that I want to go somewhere.\n3. There definitely are a lot of opportunities but you have to be proactive in seeking them out. \n4. I've never had a professor I didn't like. All of my professors have at the very least taken time to give me good advice and a couple have really been mentors to me. I've only had two classes at AU that were big lectures. All the rest have been capped at about 30 people tops. I've watched multiple professors, upon learning that students weren't going home for Thanksgiving, invite students to Thanksgiving dinner at their houses. I've never had a professor that didn't seem to at least be a well-meaning person who wanted to help students that wanted to learn.\n5. Workload kind of depends on the major but I would say school full time + a job and/or internship is doable if you manage your time well. This semester I was a full-time student + interning 3 days a week + a part time job + VP of a club + 2 other volunteer commitments which was definitely pushing it, but I think the first three things alone would have been fine.\n6. DC is definitely expensive in terms of rent (which is often still cheaper than living on campus) but I would say things like food and stuff are probably still cheaper than New York (I'm from Massachusetts though so maybe I don't know how expensive New York is). There's also tons of free stuff to do so unless you're 21 and going to bars, entertainment can often be had for free.\n7. I really like DC, mainly because of my last point but also it's generally a nice and safe city. Public transit is less than ideal but it can usually get you where you need to go as long as you plan ahead. AU is in the rich white suburban part so there's not a lot in the immediate area but there's usually always some kind of festival or free event going on elsewhere in the city.\n8. Lol, no.\n9. Dorms are fine, if kind of expensive for the money. I understand some of the freshman dorms have been newly renovated. I lived in the \"shithole\" dorm my freshman year but it honestly wasn't any worse than a dorm in general. The biggest issue I noticed was that the plumbing sucked and water pressure was nonexistent and second semester my floor had a bit of a rodent problem. Sophomore dorms are basically brand new and much better. I moved off campus after that so I can't speak for Cassell or Nebraska.\n10. I would say AU and colleges in general just kind of oversell everything, but I can't think of a specific thing that I felt was advertised to me and I just didn't get.\n11. I majored in IR and graduate next week. I really did enjoy it even if it was difficult at times. My only regret is that I decided pretty late in the game that I want to get a Ph.D. and my indecisiveness is probably going to cause me to bumble around for a year or two before I can start trying to do that.\n12. Food on campus sucks, food in DC is fantastic.\n13. I got a decent amount. I have some loans but the overwhelming majority of my tuition was covered by financial aid. My parents literally make minimum wage though so I don't know what it's like to be solidly middle class and try to get it. I know some people who I would call at least upper middle class, maybe upper class, who don't get any.\n14. Depends on the major. For IR I think it's mildly helpful. But I know pre-med people who transferred because the name recognition/opportunities for that are pretty poor.\n15. Personally I don't notice a difference one way or the other. You definitely do start to recognize a lot of people after a while. Most are still strangers, but there are lots of familiar faces. It's hard to avoid bumping into people repeatedly so think before you ghost someone, let's just say that.\n16. I find that it is. ",
            "score": 2,
            "author": "muppet_reject"
        },
        {
            "level": 0,
            "comment": "&gt;How diverse is the campus and immediate area? In terms of socioeconomic status and race. Do you feel like you see the same type of students everywhere? I live in NYC and in the NYU area it feels very homogeneous; I don’t want that.\n\nSocioeconomic status? lol. NW DC is full of rich people. So is AU, but not as bad as GW or Gtown. We have about 7% of students from the top 1%, GW and Gtown are at 14% and 21%, respectfully.\n\nRace wise you can look at the stats. There seems to be quite a bit of social segregation on campus, the foreign students keep to themselves. A lot of greek life seems to be only white or only black. \n\n&gt;2) Party scene? I mean I’m talking laidback, rangers, average house parties, dorm parties even. While I’m not going there to get drunk and don’t party everyday, I do like parties and would like a decent scene. Do you feel you get that there? Not necessarily every day but that there are are often options on the weekends.\n\nPlenty of options. One frat made the news for having the ambient air read a 0.01. \n\n&gt;3) Internships and opportunities. Do a lot of companies come and recruit and if so what kind? How in your face or prevalent is it? What sort of opportunities have you searched for/been presented with?\n\nPlenty of internships in the area. You can look up who comes to the AU job fair, warning it's not a great list. Recruitment on campus is very little. AUs name won't get you anything. \n\n&gt;4) Teaching quality. How are the professors? Do they seem like they care? What kind of classes do you usually have (lectures, small discussion based,...)?\n\nProfessors are great, small classes. Warning: usually stuff goes slow because a majority of the student body doesn't study and just gets black out drunk every weekend. \n\n&gt;5) Workload. Is it hard? I plan on doing work-study freshman year possibly, do you think that’s something feasible at AU?\n\nnot hard. work study is easily doabe. \n\n&gt;6) How expensive is DC? I mean I live in NYC and I’m used to prices but I definitely don’t like it haha.\n\nExpensive. \n\n&gt;7) How is DC in general? Do you think the area AU is in is good? Lotta things to do? Public transportation? Safety?\n\nCampus is safe, plenty of things to do. DC kinda shuts down after 5pm, so watch for that. \n\n&gt;8) School spirit. Do people attend games and events on campus much?\n\nnon-existant. \n\n&gt;9) How are the dorms? Is there AC? What sort of amenities are there in the dorms or amenities on campus you didn’t expect/like?\n\nFacilities are crap. My room hit 95 last spring and the response was \"suck it up.\" There was a used condom sitting on the floor of the elevator in my dorm today. As an idea of how the housing people are, the response was \"grab a paper towel and pick it up we will not do anything.\" Plenty of mold, mice, and rats in the dorm. \n\n&gt;10) What’s something you read about AU before coming there that you don’t see/experience/feel?\n\nThe location doesn't matter. Everyone likes to feel important because they are in DC, but for the vast majority of events they are just watching them on TV like any other school. \n\nNo school spirit. Not a whole lot of \"academics\" going on at this \"university\"\n\n&gt;11) How the fuck is it actually so far? What’s your major?\n\nI fucking hate it! A lot of people do to! I would use freshman retention rate as a good measure. Ours is shit. \n\n&gt;12) How’s the food on campus? What about off-campus?\n\non campus? shit. Subway is only place open after 8pm on weekends. It gets old, quick. Off-campus food, with the exception of 2 expensive restaurants with poor service is non-existent within a mile radius. Really only option is tenleytown, where places are closing left and right. \n\n&gt;13) Financial aid? Did you get much? What about people you know?\n\nfinancial aid is terrible. I asked them for anything else to stop me from transferring, they didn't give a shit. If there's no merit aid for a 3.97 GPA student whose finished 3 years in a year and a half through overloading..you ain't getting shit unless you are super poor or get one of the scholarships coming in. \n\n&gt;14) Name recognition? You think having the name AU on your resume helps you?\n\nif anything the name hurts you. 0 name recognition. \n\n&gt;15) What do you think of the enrollment size? Too small? Just right? What are the pros and cons of this you’ve noticed? Do you see the same faces every day?\n\nactually quite a good size. Not super sized like most state schools, but not tiny like most LACs. ",
            "score": -6,
            "author": "Zeus1325",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn. What are the most frustrating things about the school",
                    "score": 1,
                    "author": "brbafterthebreak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Administration. Non-responsive, they don't really give a fuck about students. Hate em'. \n\nStudents- Majority don't study or give two shits about anything. Lot of coastal elites that think they are better than everyone. ",
                            "score": -4,
                            "author": "Zeus1325"
                        }
                    ]
                }
            ]
        }
    ]
}