{
    "id": "ad3hpb",
    "score": 1,
    "title": "Questions about AU",
    "author": "am_ERICANDRE_am",
    "date": 1546759204.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/ad3hpb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone, I’m a student doing the Washington semester program this spring at AU (I’m coming from Illinois if it helps at all). I just have a few questions about campus:\n\n1. I got placed in McDowell Hall. Is that a good dorm or should I be worried?\n\n2. How’s the political science department at AU?\n\n3. How’s the food there?\n\n4. Student life? Any club or group recommendations?\n\n\n\n",
    "comments": [
        {
            "level": 0,
            "comment": "1. All the halls suck tbh, it’ll be fine\n\n2. The Poli-Science department is amazing, and well worth going to AU for\n\n3. The food is shit, just no.\n",
            "score": 7,
            "author": "Closet_weeb13"
        },
        {
            "level": 0,
            "comment": "1) McDowell is in a central location so it’ll be easy to get around. it’s not great but nothing at AU really is. \n\n2) great department! \n\n3) the food is truly terrible but there are some days when it’s markedly less terrible. \n\n4) there will be a club fair at the start of the semester but if you’re interested in poli sci &amp; the like, i would recommend checking out AU Dems/the Republican equivalent (I forget what it’s called), Kennedy Political Union, etc. we also have fantastic student media that’s worth getting involved in/attending events with. there’s lots of smaller clubs that do cool things - a sailing club and beekeeping society for example",
            "score": 5,
            "author": "noah_jay"
        },
        {
            "level": 0,
            "comment": "McDowell is better than Leonard, so you got that going for you.\n\nPoli Sci department is great.\n\nFood is terrible.\n\nStudent life is a little lacking. Plenty of events to keep you busy for a semester though\n\n\nWhere in IL if I may ask? I'm from QC. ",
            "score": 3,
            "author": "Zeus1325",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m from will county, like 45 mins south of Chicago ",
                    "score": 2,
                    "author": "am_ERICANDRE_am"
                }
            ]
        }
    ]
}