{
    "id": "ax0ieu",
    "score": 5,
    "title": "ATTN: American University Alums!",
    "author": "ogbreeze",
    "date": 1551658400.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/ax0ieu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I would love to go to American University and enroll in the Counterterrorism and Homeland Security Policy masters program. Has anyone gone through this problem? If so, what can you tell me about this? Any info about off campus apartments close to AU? Thanks in advance! ",
    "comments": [
        {
            "level": 0,
            "comment": "Not an alum of the program, but I can talk about housing options. If you want to live near campus, be sure to avoid the really close ones since they're beyond overpriced. That includes the Avalon, Berkshire, and Greenbriar. I've seen better process for places in Glover Park (30 minutes walking from campus) or Cleveland Park (about the same time walking or so). The management company I've had experience with is Bernstein Management, and their properties are decently priced. Idaho Terrace near campus isn't bad. ",
            "score": 5,
            "author": "guanacosine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome thanks. I am the type of person who wakes up at the last minute (working on it), and wanted something closer than 30 min walk. But then I check the prices and yeesh! 😬",
                    "score": 1,
                    "author": "ogbreeze",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seconding Idaho terrace and everything on cathedral avenue. The bus runs everywhere and is 4 minutes from campus at most. Walking (mostly uphil) it’s like 15 minutes. Used to be part of my wake up routine before school.",
                            "score": 1,
                            "author": "calrissian_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live in Bethesda and it takes me 20-40 mins to get to AU by metro and shuttle. I absolutely love living in Bethesda because it’s close to metro and you get access to entire DC by metro, also price is way cheaper than Berks and Avalon. ",
            "score": 2,
            "author": "naughtyboy35"
        },
        {
            "level": 0,
            "comment": "I have friends who live in friendship and van ness and the responses so far have been mostly positive. ",
            "score": 1,
            "author": "naughtyboy35"
        }
    ]
}