{
    "id": "e28kxa",
    "score": 5,
    "title": "Chance me for AU please",
    "author": "chinako2013",
    "date": 1574819153.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/e28kxa",
    "media_urls": [],
    "other_urls": [],
    "postText": " \n\nI'm an international student from Argentina and I already applied to the regular decision plan for AmericanU. I really want to get accepted. I intend to study biology there.\n\nGPA: our school doesn't use that system but I have a national \"GPA\" based on 1-10 with an average of 9.18 which is nearly a 4 in the GPA system.\n\nSAT: 1360\n\nWe don't have honors over there but I studied under the Cambridge International curriculum and sat for 12 IGCSE and 7 AS and A Level exams.\n\nI was Head Boy in my school (like the school president), was president and founder of the debate club, participated in the ESSARP model United Nations and two time winner of the public speaking competition in my school. Also participated in the English Speaking Union public speaking competition in the British embassy.\n\nMy Essay: it's about my love for Egyptology and how I investigate it .\n\nI also play the violin, was concertmaster in my high school orchestra and now participate in the municipal juvenile orchestra of Hurlingham.\n\n&amp;#x200B;\n\nThanks in advance!!!",
    "comments": [
        {
            "level": 0,
            "comment": "You're gonna get in",
            "score": 7,
            "author": "Wiggles-McSwiggles"
        },
        {
            "level": 0,
            "comment": "I would be very surprised if you got rejected",
            "score": 2,
            "author": "ZanderDogz"
        },
        {
            "level": 0,
            "comment": "Confirmed- 81% of ED accepted: https://www.theeagleonline.com/article/2019/12/new-report-raises-questions-about-aus-early-decision-policy",
            "score": 1,
            "author": "seeloewe23"
        },
        {
            "level": 0,
            "comment": "I would say you have a pretty good chance of being accepted. Not just based on your grades but also considering your enthinicty. Au loves to accept students based on that. And your your grades are pretty good. Also if your a male you might have more chances since more than half the school population is female.",
            "score": 1,
            "author": "Reivaj22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I'm asian though? Will that work against me? I mean my parents are chinses but I was born and grew up in Argentina",
                    "score": 2,
                    "author": "chinako2013",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would say that's better. Double the minority. Hope you get in.",
                            "score": 1,
                            "author": "Reivaj22"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "AU acepta todas estudiantes internacionales que pagarían la colegiatura. Casi no hay reglas estrictas para de estar aceptado aquí. Si no estás aceptado regularmente, hay otros programas que van asegurar tu aceptación. Programas que te enseñan un año de idioma y después conviértete a un estudiante regular. Que estudias y porque decides a venir a AU? A mi no me gusta AU es una de peores decisiones he hecho. Me arrepiento mucho de estar aquí. Si quieres venir a Dc, hay escuelas muchos mejores cómo GW y Georgetown. AU casi no tiene apoyos por sus graduadores y sufre muchos de las cifras de empleados. No puedo recomendar AU a cualquiera según mi experiencia. \n\nLo siento el español no es mi primera idioma sino mi tercera. Hablo inglés y Chino al principio.",
            "score": 1,
            "author": "naughtyboy35",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hola! Hablas muy bien español, yo tambien soy chino pero naci aca y vivi toda mi vida en Argentina. Ya he aplicado a GW y he leido varias cosas buenas de AU. Planeo estudiar biologia.",
                    "score": 1,
                    "author": "chinako2013",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jaja gracias. Que padre! Antes yo viva en Mexico en mi adolescencia. También hablas Chino? 你也会说中文吗？\n\nPues la biología es la mejor programa de STEM que haya AU ahora. Si vas a AU, ustedes van a tener un nuevo edificio que esta en construcción ahorita. AU también tiene una buena reputación de biología. NIH es una organización que contrata muchos graduados de AU. \n\nPues si tienes la oportunidad de venir a GW, vaya!! AU no es una escuela súper mala pero trata sus estudiantes con mucha indiferencia. También tiene un centro de carrera pesimo, de verdad. Así no ayudó a sus estudiantes para prepararse con el trabajo. Estoy en mi último semestre y estoy buscando el trabajo por mi mismo la institución casi no me ayuda con nada. \n\nPues si decides a venir a AU, mucha suerte. Hay muchísimos latinos(ricos) en AU vas a tener mucha compañía, aunque no hay muchos asiáticos latinos. Hay muchos estudiantes de china si hablas Chino vas a tener mucha oportunidad de hablarlo. \n\nSabes que el protagonista de wolf of Wall Street, Jordan Belfort, el que retrato Leonardo DiCaprio, también graduó de AU de biología??",
                            "score": 1,
                            "author": "naughtyboy35",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Increible! me alegra que AU tenga un buen programa de Biologia pero una pena que tenga un centro de carreras tan pesimo. No tenia idea sobre Jordan Belfort y AU. \n\nQue bien eso sobre la comunidad de chinos y latinos.",
                                    "score": 2,
                                    "author": "chinako2013"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You will get in because international students usually pay full freight- that is roughly 41k tuition + 21k room and board, and are less likely to transfer due to visa issues. Actually 1/3 of this year’s freshman Kogod class is from China. AU has to accept more students than usual as the freshman retention rate is the lowest it’s been in 10 years.",
            "score": 1,
            "author": "seeloewe23",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, if not through regular process they’ll admit international students through some bullshit programs like IAP lol.",
                    "score": 2,
                    "author": "naughtyboy35"
                }
            ]
        }
    ]
}