{
    "id": "fehe44",
    "score": 4,
    "title": "RD",
    "author": "heeraimran",
    "date": 1583517820.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/fehe44",
    "media_urls": [],
    "other_urls": [],
    "postText": "Can someone chance me? I applied rd I’ll tell you my stats and I’m lowkey worried",
    "comments": [
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay it comes out next week or week of March 16 so I’m stressed I wish I did Ed:( \nSo I did ED To GWU but got rejected idk how but yeah so \nI applied To the College of Arts and Sciences for Public Health \nMy weighted GPA is 3.91 because they only got my freshman through junior year grades and I haven’t sent out senior year oops \nBut freshman year 1st sem a 2.8, second sem 3.3\nSophomore year a 3.9 \nJunior year a 4.1 \nI’ve taken APUSH\nAP LIT\nAP GOV\nAll during junior year and right now I’m in\nAP STATS AP BIO AP PSYCH AND AP LIT \n\nHooks: first gen citizen and college student \nI wrote my common app about being a woman who is a part of a small group in Pakistan that is known for business and how women are expected to be house wives yet I want to challenge that barrier and do the complete complete opposite and go to school in medicine \nMy why American essay is just about a student club That I’m in hs and how I’m on the board to help students to take aps and then I approach AU and how i wanna take part in their community for change and mentioned a professor etc \n\nI’m Asian but South Asian \n\nECS:\nTEAM ASAP BOARD aka helping AP students club \nSOAR BOARD students organized against racism \nDECA a business club but I won first place at state and went to nationals last year \nPEER CONFERENCE FACILITATOR I speak with students who have gotten into fights in our school and like help them w solutions etc \nPEER TUTOR I tutor kids w subjects in our school such as English or Math \nNHS member \nBOOKS R US DISCUSSION FACILITATOR I lead discussions in a book club \nSAME DISCUSSION LEADER I lead discussions in south Asian middle eastern club ab politics and etc \nKELLOGG CONNECTIONS I work w MBA northwestern uni students in a club w majority men and just speak ab business techniques\nCOMM service:\nI teach kids every Sunday at a religious school \nAnd I worked all of my junior year part time\n\nDidn’t submit any standardized scores so I’m worried Bc I have a lower chance of getting in and idk:/",
                    "score": 3,
                    "author": "heeraimran",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m pretty sure everyone with half decent grades that EDs gets in. Take it from someone that had half decent grades and ED’d.",
                            "score": 2,
                            "author": "mwthecool",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But I didn’t Ed:/",
                                    "score": 1,
                                    "author": "heeraimran",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I totally misread. \n\nSame, to be honest. AUs problem is aid, not admittance.",
                                            "score": 1,
                                            "author": "mwthecool",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh wtf do they not give good aid? Even if u talk to them?",
                                                    "score": 1,
                                                    "author": "heeraimran",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That’s just my experience from who I’ve spoken too. Yours may be different. There’s no reason to stress because there’s nothing you can do. I know it’s rough waiting, but it’s out of your hands. I’m sure things will work out no matter what happens.",
                                                            "score": 2,
                                                            "author": "mwthecool",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thank you! THERES just like so many applicants like 16k and I think 5k get in",
                                                                    "score": 1,
                                                                    "author": "heeraimran",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "16K is a lot of people, chances are that most of those people aren't qualified to get in, according to what the school is looking for. Another large portion only applied to the school because they could. The fact that you care so much already means a lot for your prospects.",
                                                                            "score": 2,
                                                                            "author": "mwthecool",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Ur so kind thank you! Well let’s see what happens!!",
                                                                                    "score": 1,
                                                                                    "author": "heeraimran"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How much demonstrated interest did you do?",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "None besides my supplement and I don’t live near DC :/",
                                    "score": 2,
                                    "author": "heeraimran"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Denied:/ idk what I did wrong everyone’s rejecting me lol",
            "score": 1,
            "author": "heeraimran"
        }
    ]
}