{
    "id": "fh5gnv",
    "score": 8,
    "title": "NYU vs AU Grad Comms",
    "author": "brooklynborn93",
    "date": 1583964805.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/fh5gnv",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was accepted into American University’s Strategic Communication MA program and NYU’s MA in Media, Culture, and Communication. I am having trouble deciding between the two programs so if anyone has some insight, please feel free to share! \n\nNYU seems to be a more widely recognized school and I’ve wanted to live and work in NYC for a while now so it seems like a great opportunity for making connections in the NY area. AU also has a lot of connections to NYC but it’s not located in NYC and therefore it’s connections to NYC are probably not as good. AU also offered me an assistantship which seems like a great opportunity and the NYU program unfortunately doesn’t offer anything like that. That said, the kinds of skills I would build through an assistantship at AU (writing, research, connections, etc) I could gain through an internship in NYC as an NYU student. Thoughts?? \n\nIf anyone knows of a better subreddit to post this, please let me know!",
    "comments": [
        {
            "level": 0,
            "comment": "So I’m from NY and I’m very biased, but NYU is a very expensive university for a very average college, particularly ones from out of NY who are coming just for NY. I don’t know about AUs program, but I’d put a lot of thought into both and really research the differences between the programs because I’d bet they’re the same.",
            "score": 5,
            "author": "Endercacti"
        },
        {
            "level": 0,
            "comment": "i went to nyu for undergrad and i’m at au for grad and the biggest difference is really the location. new york is so expensive but the city is so alive and has better clubs, bars, restaurants, etc. AU is much more of a campus, traditional experience",
            "score": 4,
            "author": "Apathyash"
        },
        {
            "level": 0,
            "comment": "What are your long term goals? Do you want to work in government/politics? NGO?",
            "score": 3,
            "author": "pauliewalnut01"
        },
        {
            "level": 0,
            "comment": "It really depends on what you want to do as a career. Being in DC will limit your internship opportunities to this area. And same with NYC. Research and figure out what you want to do after and that'll help guide your decision.",
            "score": 3,
            "author": "Smashed_Adams"
        },
        {
            "level": 0,
            "comment": "AU does have a decent amount of connections in the media world. One of CNN’s leading hosts, Alisyn Camwerota was an AU grad and she gave internship spots of CNN to bunch of AU students last year. Currently president of CBS, Fox News are also AU grad. I’d say for media/communications, your connections and real world experience better more than your school name. Both DC and NYC are great for media connections. It’s always better to graduate from AU with tons of internship experience than from NYU with none. \n\nFormer NBA 2kTV host Rachel Demita also came to AU, and used connections to intern at NBC which is right around  to the campus.",
            "score": 1,
            "author": "naughtyboy35"
        },
        {
            "level": 0,
            "comment": "What did you decide? I have a similar decision here",
            "score": 1,
            "author": "FlimsyItem9275"
        }
    ]
}