{
    "id": "gzb6p0",
    "score": 6,
    "title": "Interested in AU",
    "author": "George_Ren",
    "date": 1591659613.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/gzb6p0",
    "media_urls": [],
    "other_urls": [],
    "postText": "AU is on my list of schools that I may want to go to.  I think I want to go into either political science or philosophy, specifically continental philosophy or international policy. I would love to know what these programs are like if you have experience, and if not I also would like to know what your general thoughts are on the university.",
    "comments": [
        {
            "level": 0,
            "comment": "AU is THE school for international studies (they have an entire building dedicated to it on campus)\n\nplus what you can't get at AU you'd be able to find in the surrounding DMV area (District, Maryland, Virgina)\n\nThere's a ton of orgs, nonprofits, companies etc that you can work for/with for additional experience and you can almost ALWAYS find a way to turn this into academic credit if you're not getting paid for it\n\nAU is an awesome school, and I loved my time there - I didn't even have a ton of friends or was popular, nor did I participate in popular social activities and whathaveyou (there are plenty) - so it's a great school for serious students and the social butterfly type scholars \n\nDo the thing!",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What kind of things did you participate in?",
                    "score": 1,
                    "author": "mellowyellowguava",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had paper writing parties where groups of 2-4 would post up at the library all night, alternating who would go out to chain smoke and who would watch the stuff.\n\nWe also did this at people's houses, the only difference being we ordered calzones from Angelicos and everyone could go outside at the same time.\n\nI also did a lot of LSD, which is 12-24 hours of a weekend.\n\nThen I studied more.\n\nI helped write a book with a professor. I presented in 2 research conferences and wrote a senior thesis.\n\nI participated in rogue lesbianism, long distance relationship (freshman year-big mistake), and converted people to Acid, while maintaining a 3.8 GPA.\n\nAlso commuting takes a long time, so when I moved to Columbia Heights there was like 40min-3hrs of time spend getting to and from campus lol\n\nSo yeah. I did my own thing with basically the crowd for 4 years, and it was great.\n\nOther people did college differently, but I liked my way. \nUnlike my friends, I dont have very many \"wish I had's....\" \nI took school seriously while not taking life too seriously and it worked out.\nMy only regrets are relationship based \n(could have had more fun if I hadn't been worried about maintaining toxic intimate relationships because \"love\")\n\nSchool is priority, everything else is a distraction. Dont isolate yourself, but if socialization gets in the way of you making good grades, you're not ready for AU or any other college.",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "were there any like stereotypical “party” parties at AU lol",
                                    "score": 1,
                                    "author": "mellowyellowguava",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not on campus, but yeah.\nFrats and other groups of friends/clubs threw parties.\nSome had themes.\nAll year round\n\nThere's also the DC nightlife, which is alive and well",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi there! \n\nI was C/O '13 and a double major, with my secondary major in philosophy. Highly recommend Lauren Weis (I took 4 courses with her!), as well as Jin Park, Andrea Tschemplik, Mark Schaefer (he's the Methodist leader at AU and teaches RELG courses but there's a lot of cross pollination with the PHIL major), and Gershon Greenberg. \n\nMy husband (also C/O '13) was a PHIL major. We both really enjoyed our time both at AU (it's where we met!) and in the department. Lauren Weis is one of the best teachers either of us has ever had! \n\nI loved my courses:\n\nWestern philosophy (the one that got me hooked)\n\nMoral philosophy \n\nIntro to logic \n\nAsian philosophy \n\nTheories of democracy \n\nCritical bioethics \n\nChinese philosophy \n\nGender, body, and society  \n\nForms of the sacred \n\nThe biological body \n\nReligious heritage of the west \n\nNon-western religious traditions",
            "score": 4,
            "author": "SchleppyJ4",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for the response. just curious what do you and your husband do now",
                    "score": 1,
                    "author": "George_Ren",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also if you want to do anything related to political science and/or international policy: you can't beat AU and DC. Perfect location, and very strong program.",
                            "score": 3,
                            "author": "SchleppyJ4"
                        },
                        {
                            "level": 2,
                            "comment": "Of course. Let me know if you have any other questions. \n\nHusband is a web developer, and I work in higher education. \n\nOther folks from our cohort work in the federal government, work on policy, work at nonprofits, are working on their MAs or PhDs, are doing research or teaching, etc. \n\nYou can do almost anything with a philosophy degree!",
                            "score": 2,
                            "author": "SchleppyJ4"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "SIS is a pretty great place to be for International Relations in general.  What type of policy are you interested in?",
            "score": 2,
            "author": "Wiggles-McSwiggles"
        },
        {
            "level": 0,
            "comment": "Don't go. Not worth the money. Go be a plumber.",
            "score": 3,
            "author": "Totally__Not__NSA",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you the NSA?",
                    "score": 1,
                    "author": "----NSA----",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No",
                            "score": 2,
                            "author": "Totally__Not__NSA"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey there, Poli Sci+History '20. Honestly not sure if the school is worth it for just philosophy but anything Gov or IR related is pretty dang good. There are also some really good political philosophy classes within the Gov programs if you wanna merge your interests or do a minor. Make sure you intern while you're there.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}