{
    "id": "k5txy0",
    "score": 4,
    "title": "Is it worth it?",
    "author": "Salty_Tomorrow_3968",
    "date": 1606986736.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/k5txy0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm considering transferring there from another university because our curriculum doesn't cover much as far media (I'm majoring in Communications) and I'd minor in cinema lit (I LOVE movies and I feel like it would be helpful since I want to go into entertainment). But this university costs A LOT and I wanted to know if it's worth it. Also if you're majoring in COM or you've transferred before please message me so we can talk. I'd really appreciate it.",
    "comments": [
        {
            "level": 0,
            "comment": "Hey! Journalism major at AU here. For the next semester, I'd strongly suggest finding an in-person college in your hometown. My first semester has been entirely online and fairly difficult-- if you're alright with another online semester then go for it! But imo the cost has not been worth the online instruction at all, and I'm not very stoked to burn out at the end of the academic year.",
            "score": 4,
            "author": "mayoraei",
            "replies": [
                {
                    "level": 1,
                    "comment": "feel free to pm me",
                    "score": 2,
                    "author": "mayoraei"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! I'm a journalism major at AU. AU professors are known for being experts in their fields, which I think is a major plus (they've worked in a lot of the areas that they now teach) and the class sizes are small, if that helps with your learning style. My COMM 100 professor was able to bring in a great guest speaker once a week, and I felt like I already learned so much in 1 (online) semester. that being said, it is very expensive and maybe another school might provide what you're looking for",
            "score": 1,
            "author": "MasterofeatingOreos"
        }
    ]
}