{
    "id": "khtcnj",
    "score": 8,
    "title": "What are some good places to eat near American University?",
    "author": "Burnout_Latina",
    "date": 1608594506.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/khtcnj",
    "media_urls": [],
    "other_urls": [],
    "postText": "AU is my top school and I want to know more about the food options  :) I prefer somewhat cheap places that are relatively good. How’s their dining?",
    "comments": [
        {
            "level": 0,
            "comment": "TOns of stuff in Tenley",
            "score": 12,
            "author": "jfrenaye"
        },
        {
            "level": 0,
            "comment": "In Tenleytown you’ll find a lot of great places (as well as places that might not be considered “great” but students still love them). Nando’s, Angelico’s Pizza, and Z-Burger are some places I went to a lot. Wagshals and Cava are also fairly popular, I believe. And going to Steak &amp; Egg at least once is I think essential for the AU experience.",
            "score": 9,
            "author": "jelvinjs7"
        },
        {
            "level": 0,
            "comment": "Here's a list of on-campus dining options: [https://dineoncampus.com/au/meal-exchange-guide](https://dineoncampus.com/au/meal-exchange-guide)",
            "score": 5,
            "author": "MasterofeatingOreos"
        },
        {
            "level": 0,
            "comment": "the shuttle from the campus goes to Tenley Town which has some good choices for restaurants. \nDC food prices are generally pretty high depending on where you are coming from. Cheaper than NYC, for example, but higher than most southern states, etc",
            "score": 4,
            "author": "Apathyash"
        },
        {
            "level": 0,
            "comment": "I’m a fan of guapos, Silver, and open city, all a good walk from the school.",
            "score": 5,
            "author": "TheUnitedStates1776"
        },
        {
            "level": 0,
            "comment": "Dan's cafe",
            "score": 3,
            "author": "MaybeAlzheimers"
        },
        {
            "level": 0,
            "comment": "I love Seoul Spice in tenley town",
            "score": 3,
            "author": "----NSA----"
        },
        {
            "level": 0,
            "comment": "my ass",
            "score": 2,
            "author": "bois_who_cry"
        },
        {
            "level": 0,
            "comment": "Go to Tenleytown and you’ll find TONS of good restaurants. I personally really like the pizza place they have there.",
            "score": 2,
            "author": "naughtyboy35"
        }
    ]
}