{
    "id": "ki08gt",
    "score": 8,
    "title": "Student Housing?",
    "author": "Cinnabbon",
    "date": 1608620304.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/ki08gt",
    "media_urls": [],
    "other_urls": [],
    "postText": "ED1 here :) As an incoming freshman I was wondering, is it possible to try and get into a student housing apartment with roommates? I just genuinely don't like the idea of sharing a room for a whole year. Is it cheaper, and is it worth it to try it out? I don't want to get into huge debt or something. Kind of excited/scared for this year. Thank you guys in advance!\n\nP.S. Is there a way to try and match with students for dorms or housing? Or to like, try and make friends so you can match with someone you might like. lol.",
    "comments": [
        {
            "level": 0,
            "comment": "Freshmen can live in one of three residence halls: Anderson, Letts, or Centennial. All are shared 2-person rooms. You won’t have the ability to get your own room through on-campus housing until Junior year when they open up Nebraska hall. If you’re concerned about living situations, get your own apartment, but there’s something about the dorm experience that everybody enjoys.",
            "score": 7,
            "author": "Leggo414",
            "replies": [
                {
                    "level": 1,
                    "comment": "it looks like we're doing the same housing plan as the original fall 2020 plan (single rooms) in fall 2021",
                    "score": 2,
                    "author": "MasterofeatingOreos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know some incoming freshmen are making Google Forms to match up with similar students. Or join the group chat, find a few others you connect with, then dm them on Instagram/snap. That's a great way to get to know someone better. A few of us made Google Docs with a list of 20 roommate questions and shared that w potential roomies too",
            "score": 5,
            "author": "MasterofeatingOreos"
        },
        {
            "level": 0,
            "comment": "In all honesty, I wouldn’t be too concerned with housing bc opening campus is still up in the air for next semester. They technically never sent out official spring 2021 plans like they did for fall 2020. They said some classes would be in person but I’m yet to hear of any class having in-person sessions. Essentially, don’t get your hopes up with AU’s ability to send out a plan in a timely manner. But if they open campus in the fall, I think they’ll be doing single housing so you won’t even have a roommate.",
            "score": 9,
            "author": "lilwonk"
        }
    ]
}