{
    "id": "mmciky",
    "score": 9,
    "title": "Secret Societies at AU?",
    "author": "Mr_G1ab",
    "date": 1617831130.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/mmciky",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, \n\nSuper stupid haha but are there any confirmed (or rumored) secret societies at American Uni?",
    "comments": [
        {
            "level": 0,
            "comment": "There was an under ground frat a couple years ago but they all got expelled.  Some of the Greek orgs that fell apart this summer were thinking about operating under the table but I don’t think any ended up going through with it.  Otherwise nothing like that",
            "score": 5,
            "author": "Wiggles-McSwiggles",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are frats not allowed on campus?",
                    "score": 1,
                    "author": "Mr_G1ab",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Social Greek life is active here, but the fraternities all have off campus houses for parties and other events.  Over the summer there was a National reckoning with sexual assault in greeklife that got pretty big at AU.  A couple sororities and a few frats folded and a lot of people disaffiliated, including myself",
                            "score": 6,
                            "author": "Wiggles-McSwiggles"
                        },
                        {
                            "level": 2,
                            "comment": "When I was at AU, there were 2 frats that operated under their chapter names. I frequented their events, but it wasn’t some hush-hush secret...it just wasn’t a sanctioned and nationally recognized frat.",
                            "score": 2,
                            "author": "tinypant",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that's news to me.  Was the other one TKE?  They ended up folding and a lot of them went into Beta but i think everyone involved is long graduated",
                                    "score": 1,
                                    "author": "Wiggles-McSwiggles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh, I was at AU about 10 years ago, though it does feel like yesterday! It seems a lot has evolved in Greek life! \n\nIt was EI (which was originally ATO, though not called that when I was there). And “Sammy” - SAM",
                                            "score": 1,
                                            "author": "tinypant"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 0,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "lol back in the day when they were ATO they were the gay frat.  \"Can't spel f\\*\\*\\*\\*\\*t without ATO\" was the joke.  One of the guys that was part of the EI big fight arrest scandal is now a big time sports radio host in Dallas.",
                                    "score": 3,
                                    "author": "sm4269a"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Who got disbanded?",
                    "score": 1,
                    "author": "Redhotlipstik"
                }
            ]
        }
    ]
}