{
    "id": "mvrk1k",
    "score": 11,
    "title": "Chances of getting in?",
    "author": "notebook329",
    "date": 1619045411.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/mvrk1k",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys! I'm a current HS junior who just toured AU, and it further solidified my want to go to AU. However, I'm nervous about my stats and if they're good enough to get in.\n\n\nI'm from MA and would apply early.\n\n\nGPA (weighted): 4.32\nClass rank: 52/355 (needs to be updated)\nSAT: Took PSAT with no\nprep and got 1280; waiting to take June SAT but will def study and hopefully get higher\n\n\nECs:\n\nDebate club all 4 years; leadership positions in 3/4\n\nDrama program 3 years; hopefully will have a leadership position sr year\n\nBand all 4 years, leadership in junior and senior year\n\nbasketball freshman year only\n\nwork at a coffeeshop junior and senior year, am a manager\n\ngot into NHS my junior year\n\nI would be applying to SPA as a history/polsci double major.\n\nThanks in advance (and sorry for the wall of text)",
    "comments": [
        {
            "level": 0,
            "comment": "ED you’ll get in not even a question.  RD can be very competitive, I think the new median test scores are a little higher than your current ones.  Otherwise you seem like the type of person who does well here to me already tbh",
            "score": 6,
            "author": "Wiggles-McSwiggles",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would agree with this but you'll probably want to get that SAT a bit higher. I think 1300+ is recommended (with studying it doesn't sound like you'll have a problem with that though).",
                    "score": 3,
                    "author": "Borael529",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I got in with a sat of 1100. Your fine",
                            "score": 0,
                            "author": "moose2521"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agree with all of this",
                    "score": 1,
                    "author": "ThatOneGuyAI"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whether or not you are able to pay tuition is typically a bigger indication of whether or not you’ll get in. \n\nThe grades, resume &amp; extracurriculars generally matter more for financial aid.",
            "score": 2,
            "author": "X-Biggityy"
        },
        {
            "level": 0,
            "comment": "**You need to take the ACT and get a 28 or higher.** No one except Ivy's really cares about SAT scores.  For the record, a 28 or higher will get you accepted into basically any school, assuming the rest of your application and your essay are halfway decent. A 28 is the threshhold on the standardized tests front. It's also way more commonly accepted on a national scale than the SAT.\n\nYou sound like you're an excellent candidate for \"college\" in general....you sound far more put together than I was (I'm just a decent writer with a weird childhood! And good grades.)\n\n&amp;#x200B;\n\nAU a 32% acceptance rate in 2012, no clue what it is these days. You need some sort of edge - I was present of my highschools GSA and wrote my admissions essay on why you shouldnt go to college immediately after high school (no joke, I was an EDU major, too!)\n\nHere's the thing, you need to figure out why you want AU over other schools. There are so many colleges in the DC Metro Area alone, let alone the rest of the US. So you need to make it clear to them that you see DC as the hub of everything a student could possibly hope for (and it is) - nonprofits, public/private sector employment, immigration, federal government out the wazoo, the Embassys, the historically black city that it is as it faces gentrification (education is another battleground people always forget to associate with the district, but michelle rhee put DC on the map in 2008 with the charter movement and now it's 50% public/50% charter schools, with that one private school in tenley that obamas girls went to....). \n\nIn other words, **you need to have a cause, even if it's a pretend cause, before you get there and you need to make your essay about that.** Why AU is the answer to your dreams...don't pretend too hard, be realistic. I made the point of \"*I choose AU because even if they couldn't offer me exactly what I wanted within the university, I was confident I could supplement my education with the multitude of options the city has to offer.*\" which is exactly what i did!\n\nI was an American Studies, Secondary Education double major and I loved going to AU. I moved off campus and to Columbia Heights as soon as I could (1111 Lamont St Apts, in case you ever need a place to look). I miss living there so much. \n\nAnyway,\n\nHMU and **I'll hook you up with a resume template we can work on**. **I'll even proofread your essay if you'd like** \n\n(I'm a professional resume writer, and my other career was teaching high school - you are my ideal client lol but I'm doing this as an Alumni to a prospect, not as a sale for my business, btw)",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "why are you getting downvoted....",
                    "score": 2,
                    "author": "GreenHornetzz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know. People who took the SAT are probably super bitter that they wasted all that money lol\n\nMost states (public schools, at least) make you take the ACT once at no cost. \n\nI did take both, but I sat for the SAT once because one school wanted me too, the ACT I took 3 times and once I got a 28 (I had undiagnosed adhd, my test taking still sucked pretty hard) I stopped taking it and was offered merit money at every school I applied for (9 in total). \n\n**A 28 is \"good enough\" and, in most state schools, will get you some money. Even private universities are cool with a 28. It's a solid score.** (My oldest brother stayed out all night, barely slept, never studied, and got a 35 on his ACT and didn't give a fuck about college. and almost didn't graduate high school. It makes me so mad that I can't do that. I also had a boyfriend only missed two questions on the math section of the SAT and got perfect scores in writing and verbal or whatever the other section is...but once I got a 28 I was like \"Point Made!\" and stopped freaking out about it and spent a lot of time on the essay, which is  what I think got me in.)\n\n&amp;#x200B;\n\nAlso AP Courses by the College Board save you a shit ton of money if you pass, but AU doesn't accept anything under a 4 or 5 on those tests to give credit. Due to an error in the system, the counted my AP Euro score 2 times, so I got 6 credits and not 3. I never corrected them, and graduated with those additional credits on record. I hope that happens to each and every one of you lol State schools will accept 3s for credit, but the more elitist your school (which AU definitely is), the less impressed they are by shit. Everyone took AP classes in high school at AU\n\n&amp;#x200B;\n\nObviously, what sets applicants apart is whatever makes you unique as a person; your specific goals are and why you think AU is the place to do it should be clear in your application.\n\n You can't just say \"I wanna study stuff about foreign places\" because of course you do, so does every other SIS kid....but if you want to study a specific cause or are interested in immigration, or int'l edu development, or conflict in the middle east, or human rights issues, or something equally specific but not SIS related - that's what you need to make clear in your admissions essay. Why you stand out and are a better candidate than the international student whose parents are ambassadors and she interned at the embassy and likes to ski and just thinks politics are neat. Everyone at AU has a cool purpose, or else they drop out.  If AU doesn't have exactly what you want, mention that there's some organizations in the area that you're really interest in, or that the district has access to opportunities you wouldn't have otherwise, and you think AU can help get you there through their service-learning program or something.\n\n&amp;#x200B;\n\nMine was education and american studies, specifically movements of resistance/advocacy/revolutions in the US.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got in this year to SIS with stats that are generally lower than yours. Make sure you write a good essay and it sounds like you’ll get in pretty easily!",
            "score": 1,
            "author": "Impossible-Battle-91"
        },
        {
            "level": 0,
            "comment": "You want to shoot for 1300 SAT. I think we have a 35% acceptance rate.",
            "score": 1,
            "author": "freshfef"
        }
    ]
}