{
    "id": "zzfjga",
    "score": 6,
    "title": "Chance at Early Decision with major in Poli Sci?",
    "author": "sonicthesonic",
    "date": 1672444462.0,
    "url": "https://www.reddit.com/r/AmericanU/comments/zzfjga",
    "media_urls": [],
    "other_urls": [],
    "postText": "GPA W: 3.75\n\nUW: 3.51\n\nSAT: 1360\n\nExplamations:  I have a learning diability which has severely affected me for my  entire life, and I have needed therapy for most of it. Most of my poor  grades are concentrated in Freshman year as a result of me not being  able to adjust well to learning after COVID, excluding freshman my  Weighted GPA is 4.12\n\nAP's: 1 in Junior, APUSH 4 in senior, AP Lit, AP Gov, AP Comp Gov, AP Macro\n\nEC’s:  on the schools varsity swim team,  captain of the schools Lincoln  Douglas Debate team with a pretty big commitment to speech and debate  throughout my high school, 52 hours volunteering at a local hospital,  member of the young politicians club, member of the world quest club and  seeking leadership positions in both clubs.",
    "comments": [
        {
            "level": 0,
            "comment": "You’d easily get in with that kind of resume applying early decision",
            "score": 6,
            "author": "Frostbite326"
        },
        {
            "level": 0,
            "comment": "Easy acceptance for you.\n\nI got into early pol sci decision.\n\nGPA 3.3\nSAT 1170\n\nTook four AP classes, didn't get credit from any of the AP exams.\n\nCew team for a year, not varsity. \nChoir for four years, never competed or did all state.\nDebate club for four years, president for three of them. Wasn't competitive.\nDnD Club VP and Co-founder for two years.\nWorked at a restaurant for a year.\nBoys State.\nHalo LASO CE, 2, 3, ODST, and Reach\n\nIt should be near impossible for you to not be accepted.",
            "score": 3,
            "author": "WAFFAR1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay but what about Halo 4?",
                    "score": 1,
                    "author": "Frostbite326",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Eventually. Got busy with finals so I had to stop but I'm not a fan of 4, so I'm in no rush to getting to it. (Forgot to mention those were earned over the past year so I didn't actually have them when I applied to AU, but they are on my resume now.)",
                            "score": 1,
                            "author": "WAFFAR1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Easy admit",
            "score": 2,
            "author": "SoCalJR"
        },
        {
            "level": 0,
            "comment": "You’d get in easy ED 1 or 2",
            "score": 1,
            "author": "shhsjsjshssjshs"
        },
        {
            "level": 0,
            "comment": "I had basically exactly your scenario, with a similar GPA and low freshman year grades that I blamed on a recent medical diagnosis. Also very similar SAT and I had maybe worse extracurriculars. I got in regular decision poly sci and I got an okay amount of aid.\n\nI would say your chances are pretty good… I might even say wait and apply for RD instead but I know that ship has sailed lol. Might’ve helped you in negotiating aid because this school is expensive af",
            "score": 1,
            "author": "Colin286"
        },
        {
            "level": 0,
            "comment": "Bro don't waste an ED application here. You'll get in easily through regular decision with those stats. AU is everybody's second/third choice school, use your ED opportunity to try somewhere better.",
            "score": 1,
            "author": "Leggo414"
        }
    ]
}