{
    "id": "3cxdea",
    "score": 5,
    "title": "So I am thinking about going here...",
    "author": "KrazySteve",
    "date": 1436633691.0,
    "url": "https://www.reddit.com/r/calupa/comments/3cxdea",
    "media_urls": [],
    "other_urls": [],
    "postText": "Like most high school seniors I am starting to look at colleges. So far I visited CalU and IUP and I liked this one a lot better. It seems that people are pretty negative about this school on here. Would you guys recommend it?",
    "comments": [
        {
            "level": 0,
            "comment": "Cal's campus is very nice, as are the dorms. I graduated in '14, so feel free to pm me if you have any questions. The place can be boring if you don't really know how to venture out of your comfort zone. A lot of people head home or to other schools for the weekend. As long as you are able to seek out your interests and act on them, you'll do just fine there.",
            "score": 2,
            "author": "jasonbourne77q",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok, that makes me feel much better about applying there. I know the area pretty well having a lot of family out there. Even if I am not outgoing enough to make friends there I know many people in Pittsburgh who could show me around so I think I will be fine. Thanks for the reply!",
                    "score": 1,
                    "author": "KrazySteve"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This subreddit is pretty dead, I'm amazed you have this many replies. \n\nThe campus is nice, but the town is very lackluster. I think the main complaint everyone seems to have is that there's nothing to *do* here. \n\nBut, as far as classes, almost every professor I've had (I only disliked one in the four semesters I've taken) has been excellent. Easy to understand, makes the subject as interesting as they can, etc. Every prof I've had is really, really into the subject they teach, which is important.\n\nThe student center is hopefully going to be done with its renovations this semester, though, so we'll see if that adds anything exciting to life outside of class. Hope to see you in the fall!",
            "score": 2,
            "author": "Dessum",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks",
                    "score": 1,
                    "author": "KrazySteve"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a fine school that is not close to downtown Pgh or Morgantown.  So, to be honest, if you actually want to study, its a good place to escape the bad influences that may or may not have impacted your ability to study.  Personally, I lived in Charlerois, made the trek to Vulcan-ville and think that it is like most colleges, its worth what you put into it.  Yeah, I get that the directly surrounding area is not Hollywood.  But, will that have been important to you when you are 40?",
            "score": 2,
            "author": "maineblackbear"
        },
        {
            "level": 0,
            "comment": "Just chiming in waaayyyy late, but it might help someone looking in the future.\n\nDid 2 years at CCAC South, then 2 more at Cal for the undergrad, another year for the grad program.\n\nCal is what you make it - if you want it to be a party school, get shitfaced, and fail out, you can sure do that. Plenty of parties here and there. However, if you want to actually do something while you're there and set yourself up for a good job, you can completely do that too.\n\nI opted for a 80/20 split, edging more towards the academic side. The library is GOLD. Use it, not for the books, but because if you head up on the 3rd or 4th floor, you can escape everyone and get some studying and work done alone.\n\nProfessors leave a bit to be desired, but thus is true with all colleges. In business, we had the same bland teachers over and over. Become friends and all will be ok. Undergrad isn't hard at all.\n\nOff campus housing sucks and is borderline unsafe now. 5 years ago when I was graduating undergrad (yikes, it's been that long?) it was just getting bad. Before that, I felt completely safe there, even in town, past midnight. Vulcan Village, where I lived for 2 years, had almost zero issues when I was there and everyone was very friendly. Met a lot of good friends back then, which I don't necessarily keep in touch with anymore.\n\nLocation wise, there isn't much. Town is dead. Walmart in Belle Veron is your only saving grace. Brownsville and the surrounding areas aren't much better.\n\nHonestly, I looked at Pitt and couldn't stand the housing. Penn State didn't appeal to me, nor did IUP. Cal just fit and was close. Costs are reasonable for college, although I think all colleges are overpriced.",
            "score": 2,
            "author": "cmiovino",
            "replies": [
                {
                    "level": 1,
                    "comment": "I felt the same way when I took a tour there. I had visited other campuses but Cal just kinda felt good. I know a lot of people in Pittsburgh and I have a lot of family over in summerset so it's not too big of a deal that the area is not really built up. I applied to cal a few months ago and got accepted right away. I'm really excited to be going there. Thanks for the reply.",
                    "score": 1,
                    "author": "KrazySteve"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Its okay.\n\nWhat is your major going to be?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not quite sure yet but I was thinking Maby something in the natural sciences. I know IUP is kind of better for that but Cal U is just way more convenient for me. And I liked the campus more.",
                    "score": 1,
                    "author": "KrazySteve"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely a good school to study at. I still go here",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}