{
    "id": "10chn0k",
    "score": 4,
    "title": "Any international students want to join a group chat?",
    "author": "chvdn3",
    "date": 1673782338.0,
    "url": "https://www.reddit.com/r/GriffithUni/comments/10chn0k",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ll be moving from the UK to Gold Coast to study at Griffith, really in need to meet some like minded people so if anyone wanted to join a Griffith group chat, drop a comment 😊 (you don’t have the be international)",
    "comments": [
        {
            "level": 0,
            "comment": "I'm an international student too but I'm in nathan campus tho",
            "score": 3,
            "author": "oats_and_cakes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey there, I'd like to pursue my Masters in Business Analytics from Nathan Campus. Kindly share some factual information about this particular Uni in Brisbane. If you don't mind asking, what's your course and do you actually enjoy the campus atmosphere? Are the lectures good enough and is it worth studying in Nathan especially for this particular course, if you have any clue about it? Also, are you able to meet the living expenses and what are the part time job opportunities out there?",
                    "score": 2,
                    "author": "LegatoxT20",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tons of hospitality jobs in Brisbane. Nathan campus is by itself in the woods in a residential area. Might be good to live on campus so you can easily meet people and attend class",
                            "score": 1,
                            "author": "Cheezypoofs1111111"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hey! I do. Brazilian student here",
            "score": 2,
            "author": "marioandrezzo"
        },
        {
            "level": 0,
            "comment": "I do!\nI’m from South Korea btw",
            "score": 2,
            "author": "Jenelf_"
        },
        {
            "level": 0,
            "comment": "I do, from South Africa!",
            "score": 1,
            "author": "NoBasket5079"
        },
        {
            "level": 0,
            "comment": "I do",
            "score": 1,
            "author": "TurnCapital3981"
        },
        {
            "level": 0,
            "comment": "Hey, I'm not technically an international student, but from Italy (got my PR this year) and studying at Mt Gravatt.",
            "score": 1,
            "author": "Felagun"
        }
    ]
}