{
    "id": "38q4lr",
    "score": 2,
    "title": "Graduation Question",
    "author": "cookiesncakes",
    "date": 1433541291.0,
    "url": "https://www.reddit.com/r/GriffithUni/comments/38q4lr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I know this is way early for me but seeing everyone graduate back home has got me thinking about graduation. I'm an international student and my last semester starts in February. My visa expires at the end of August. When would graduation happen? Before or after I'm gone?",
    "comments": [
        {
            "level": 0,
            "comment": "If I'm reading this right (http://www.griffith.edu.au/graduations/important-dates) it should be the 24th of July if you're at the Gold Coast campus, either way it should happen before the end of august",
            "score": 1,
            "author": "InfantDressingTable",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks :)\n\n",
                    "score": 1,
                    "author": "cookiesncakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd love to stay because 3 years isn't nearly long enough and goes by too fast :(\nbut my visa will be expired and I only have Canadian citizenship so no real way around it. I'm not married to an Australia citizen, I'll be a few months too old to apply for a working holiday visa, I'm not sponsored by anyone and my field isn't on the Australian Immigration Skilled Occupation List so can't transfer my student visa to a work visa. I can only stay longer if I get a tourist/visitor visa (which I won't be allowed to work during as per the conditions of the visa) and that's only good for 12 months then I'd have to go back to Canada. I can't afford to go 12 months without working so leaving after I graduate is my only option.",
                    "score": 1,
                    "author": "cookiesncakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just quickly looked into that now, I actually might have another option, thanks. Can't believe that when I looked into staying longer they didn't mention that but they did mention the tourist visa. Must do some more investigating :)\n\n",
                                    "score": 1,
                                    "author": "cookiesncakes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}