{
    "id": "9565dy",
    "score": 2,
    "title": "Bachelor of Aviation",
    "author": "HourglassEngraving",
    "date": 1533596415.0,
    "url": "https://www.reddit.com/r/GriffithUni/comments/9565dy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone done the bachelor of aviation course at Griffith? What are your thoughts on the course?\n\nIf anyone has done it, are there textbooks? What helped you the most doing this course?",
    "comments": [
        {
            "level": 0,
            "comment": "haven't done aviation but I've done units with people that have. Most courses will have a list of prescribed texts for each unit that you'll have to undertake to acheive your degree.",
            "score": 1,
            "author": "Discombobulated_Fact"
        },
        {
            "level": 0,
            "comment": "Hey there! I'm currently finishing my second year in the bachelor of Aviation. I know you asked this question 2 months ago and may not be interested anymore and so I won't waste time writing out a big response. However, if you still are, feel free to ask me any questions about the degree.",
            "score": 1,
            "author": "MalevolentCarrot",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m interested to find out your thoughts on the course. Am hoping you can share a bit on your experience? I am asking around for my partner, who has done flying through the private route, getting his cpl, getting his atpl unfrozen, the whole rot etc. He’s looking to get formal qualification (i.e. a Diploma or degree) so he can fall back on that for other aviation-related careers rather than be the guy who can only fly planes but can’t do anything else.\n\nWould be great if you could share your experience on things such as whether you had any prior knowledge before starting the course, how steep the learning curve is, are lecturers helpful, is coursework collaborative or practical/exam heavy etc. I’ve been on the website and have seen the list of units, but it’s not the same as talking to someone who has gone through it. \n\nThanks in advance. ",
                    "score": 1,
                    "author": "UnbitterFeelings"
                }
            ]
        }
    ]
}