{
    "id": "bip4gg",
    "score": 3,
    "title": "On campus living?",
    "author": "Pmh1201",
    "date": 1556542302.0,
    "url": "https://www.reddit.com/r/GriffithUni/comments/bip4gg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys!\n\nSo I’m looking at coming to Griffith Gold Coast next year and after seeing my friend down in Newcastle and his on campus living I’m interested in what Griffith on campus living is like. I never considered in until now but I’m strongly wanting his experience. He’s always meeting new people and has a wide group of friends from his level and college campus. There is constantly parties and events organised for his campus, what’s Griffith kind of like?\nCheers for anyone taking the time to answer, really appeciate it!",
    "comments": [
        {
            "level": 0,
            "comment": "I live at the village at the Gold Coast campus. It’s okay, quite expensive but they do lots of nice events that bring everyone together. That being said, it can get very, very loud so if you’re a person that enjoys quiet study space I would maybe consider going elsewhere, especially on the weekends but if you’re a party person then this is the place to be!",
            "score": 1,
            "author": "Sdormer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah ok! Thanks for that insight and replying! I’ve also heard it’s mainly made up of international students, is this accurate?",
                    "score": 1,
                    "author": "Pmh1201",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes because it’s really the only option for international students, but since it’s so expensive  Aussies don’t really live here",
                            "score": 1,
                            "author": "Sdormer"
                        }
                    ]
                }
            ]
        }
    ]
}