{
    "id": "buqje2",
    "score": 3,
    "title": "Creative Writing in Griffith for International students? And what are the dorms like?",
    "author": "[deleted]",
    "date": 1559203707.0,
    "url": "https://www.reddit.com/r/GriffithUni/comments/buqje2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! So I’m thinking of applying here and I was wondering what the creative writing course/major is like, and do you think someone with english as their third language can keep up? :( Whats the situation like? Good profs? Bad profs? Hard courses? \n\nAnd what’s orientation like? How much free time will I have between classes and days?? Gosh I’m so excited but also really scared. \n\nWhat are the dorms like? I love my peace and quiet, so is it super noisy there? And I have a friend who lives nearby and we talk a lot about having him visit me, so would it be okay to have male guests in the female dorms? Is there like a curfew? God I’d hate that so much. \n\nThanks!! Can’t wait to be there",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "He can stay over even in female only dorms? I have very strict parents and if the dorms somehow tell them that I have male guests 😬 I’m fucked. \n\nThat’s what I’m afraid of :( I don’t like it when it’s too noisy and I like my space. But I guess, if I get to meet people I’ll endure it haha. \n\nSo your attendance or absence isn’t recorded? Does it affect your grade?\n\nAnd aww thank you, I was a bit worried but people have been telling me that I’ll do fine which is great!",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Attendance is only marked for some courses, and mainly the tutorials. Furthermore they usually only make up for 5 - 10% of total marks for that subject. Lecturers who do will normally tell people in the introductory lecture during week 1.",
                            "score": 1,
                            "author": "separation_of_powers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah riiight okay that’s super good because I have the tendency to skip 😬 because I get sick a lot",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What dorms are you talking about? What campus?",
            "score": 1,
            "author": "Sdormer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nathan! And honestly any dorms, I’m pretty sure my parents would put me into those female only dorms :( I can’t bring people over?? I have male friends too lol it would suck if they can’t come over",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry can’t help ya! I’m down at the Gold Coast. Good luck, there’s gotta be info online right?",
                            "score": 1,
                            "author": "Sdormer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm unsure about literature courses. I do have a few friends that are doing it. If your english is already this good then I think you'll be fine. For study... I'd say depending on how well you understand the course content, you could do a decent amount (&lt; 10 hours per week per subject) and still pass, but your experience may vary. For whether the lecturers, tutorial instructors are hard, most of the time not really. I guess just asking for help at the end of each tutorial or lecture is completely fine, there's also dedicated times where you can discuss course related stuff with them. There's a few non-course specific support teams who can help with things like writing, referencing etc, they're usually in the library (N53 on Nathan Campus, M13 on Mt. Gravatt campus). \n\nOrientation for international students I've heard is good; guided tours of Brisbane and stuff.\n\nI can tell you that the on-campus dorms (specifically Nathan campus) can be pretty good if you like diversity. For peace and quiet, depends where you're going. Bellenden Ker is like dorms, where each level is pretty much rooms. Barakula, Kinaba, Girraween and Carnarvon are more like shared flats, where you have up to 6-7 people in a flat / apartment. From asking a friend who lives on campus &amp; has a boyfriend, there really isn't much of a curfew. Male guests are completely fine. \n\nFood options not so much. Many friends of mine who live on campus will go to Sunnybank (for the Asian supermarkets - mainly Yuen's, and the late night open hours for restaurants) and Garden City for food / groceries. Getting there from either Nathan or Mt Gravatt campuses doesn't take long on public transport, about 15-20 minutes (Nathan campus taking the 120 bus route to Garden City, 135 to Sunnybank).",
            "score": 1,
            "author": "separation_of_powers",
            "replies": [
                {
                    "level": 1,
                    "comment": "In my current University, everytime a foreign student applies they’re promised one tour guide type of person for when they arrive to help them, like, settle into their dorms, buy a sim card, etc, (I used to be one of them lol) does Griffith provide these? \n\nSo male guests staying over in female only dorms are okay too? I have friends from my city who I’d love to hang out with haha if he can’t stay over I’ll be terribly sad",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes! They're known as [Griffith Mates](https://www.griffith.edu.au/life-at-griffith/griffith-mates) - the university will usually pair you with someone, if possible someone who speaks your native / mother language. \n\nHave you checked the offerings listed on the [on campus accomodation](https://www.griffith.edu.au/accommodation/on-campus/room-options) page? I don't think there's gender restrictions.\n\nP.S.: During O-week (Orientation), your Griffith Mate will help you set up all of the things like go cards and stuff.",
                            "score": 1,
                            "author": "separation_of_powers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Great!! Because I’m terrible at getting around without a friend haha.\n\nI did, but I wasn’t sure because I thought they might have unwritten rules about gender restrictions",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah okay. As far as I know there isn't any restrictions.",
                                            "score": 1,
                                            "author": "separation_of_powers",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Grrrreat! Thank you so muchhh",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}