{
    "id": "fjwk48",
    "score": 19,
    "title": "University-wide changes to learning this Trimester (all students will receive this by end of today)",
    "author": "separation_of_powers",
    "date": 1584408385.0,
    "url": "https://www.reddit.com/r/GriffithUni/comments/fjwk48",
    "media_urls": [],
    "other_urls": [],
    "postText": "From the email sent out regarding changes to learning over pandemic concern: \n\n&gt; Griffith University is taking the COVID-19 pandemic seriously and our primary focus is the health and wellbeing of our students and staff. We also continue to focus on ensuring you progress in your program, and for those of you in your final trimester, you successfully graduate.\n\n&gt; We are undertaking activities to ensure our ability deliver learning and teaching will provide you with the best opportunity to successfully complete your studies this trimester.  \n\n&gt; In line with the advice of the National Cabinet, Griffith University is moving to practice social distancing. This is about the where, when and how we deliver learning and teaching and manage assessment and examinations. This is happening in a staged approach over the next few weeks.\n\n&gt; This week we have:\n\n&gt; * ceased all face-to-face lectures for classes with greater than 300 students enrolled. If you are in a large class, you will receive notification that your face-to-face lectures have been replaced with online lectures\n\n&gt; * commenced work to move smaller lectures to remote delivery for the start of next week.  No lectures will be delivered face to face after this Friday.\n\n&gt; Over the following two-three weeks we will: \n\n&gt; * work to move tutorials and workshops to remote/online delivery modes before the end of the mid-trimester break, to be ready for the resumption of teaching on 14 April\n\n&gt; * continue to deliver laboratories, clinics, work-integrated-learning etc that cannot be delivered online, but review how we could move these forward or delay them in the event of campus closures\nadjust the timing of or modify assessment for online delivery in case end of trimester exams can’t be run on campus\n\n&gt; * take a flexible approach to assessment practices such as extending time for non-submitted assessment, special consideration, submission of medical certificates and awarding supplementary assessment for students due to graduate in trimester 1 2020\n\n&gt; * postponing the academic standing round until the conclusion of trimester 2 2020.\n\n&gt; If you are immune suppressed or have a respiratory problem that puts you at particularly risk and you need to move immediately to on-line teaching, please contact studentconnect@griffith.edu.au\n\n&gt; These considerations are designed to help you manage extenuating circumstances and support you to succeed. We want to minimise disruption and ensure you continue to have an excellent learning experience.  Thank you for your understanding and patience as we all face this unprecedented situation.\n\n&gt; We realise this may be a distressing time. The Griffith Online Health and Wellness Centre can provide you with access to counselling services on campus, as well as other support resources. For counselling after hours and on weekends, call Crisis Support Service on 1300 785 442 or text 0488 884 146.  \n\n&gt; If you are feeling unwell, please do not come to campus. You should contact 13HEALTH (13 432 584) or see your GP.\n\n&gt; We will keep you up to date as we respond to the evolving COVID-19 pandemic. Please continue to take care of yourself and one another. If you are concerned about another student's wellbeing, you can refer the student to our services listed above.\n\n&gt; For information and advice please visit www.griffith.edu.au/coronavirus",
    "comments": []
}