{
    "id": "iit3iw",
    "score": 2,
    "title": "Is there anyone who studies in biomedical science or Bsc?",
    "author": "Accomplished-Goal470",
    "date": 1598710632.0,
    "url": "https://www.reddit.com/r/GriffithUni/comments/iit3iw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys!\n\nI'm planning to get into biomedical science or Bsc(clinical science)next year.\n\nI'm just wondering how hard you get 7.0 gpa at biomed or Bsc.\n\nI know it depends on the subjects I take or how well I'm participating in.\n\nbut, I just want to boost my gpa for getting into medicine after graduation.\n\nor if you know any uq students, compared with UQ, what do you think it is good to study in biomed or science at Griffith.\n\nif you would give me any information or advice, I really appreciate it.",
    "comments": [
        {
            "level": 0,
            "comment": "There is only one way to guarantee a 7 GPA, and it involves getting a PhD haha\n\nRealistically, you don’t need biomed, go with a science a degree and pick the subjects that are the easiest to get a 7 in and will help you with gamsat",
            "score": 1,
            "author": "Pyrrolic_Victory",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for reply \nIf I take the  courses which get easily 7 gpa,not difficult? \nAnd really thank you 😊",
                    "score": 1,
                    "author": "linege123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh it’s difficult, even if you’re smart. You will have to work very hard",
                            "score": 1,
                            "author": "Pyrrolic_Victory"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "From my experience a biomed degree there is less electives to choose from, more structured. But a better base of knowledge going into med. \nA lot of people ive met in biomed want to go into med. \n\nIn bsc you get more elective and flexibility but not as focused. People in bsc often want to go to research. \n\nThere is still plenty of cross over for both degrees. A lot of classes are together except for in first year. \nSo maybe go based on which classes you like better",
            "score": 1,
            "author": "CharkyAsh"
        }
    ]
}