{
    "id": "nsqz9r",
    "score": 3,
    "title": "Assessments for online courses",
    "author": "Professional-Link278",
    "date": 1622881183.0,
    "url": "https://www.reddit.com/r/GriffithUni/comments/nsqz9r",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi there! I am planning to pursue a completely online (fully-flexible) bachelor's program with Griffith. \n\nWhat are the various types of assessments for online modules? Are there graded group projects? And, if I am not able to attend the live online lectures and workshops, will marks for the module be penalised (e.g. class participation marks)?",
    "comments": [
        {
            "level": 0,
            "comment": "Fully online courses are a new thing to griffith and generally they are just the same as regular courses but the lectures and workshops are online like a Zoom call. in my experience the assessments have been mostly the same as in-person but it depends what degree you're doing.\n\n&gt;What are the various types of assessments for online modules?\n\nyou can look at the course profile for any course to see what the assessments are (under *Assessment Plan*\n\n[you can search for course profiles here](https://app.griffith.edu.au/course-profile-search/)\n\n&gt;Are there graded group projects?\n\nsometimes. it should say on the course profile\n\n&gt;if I am not able to attend the live online lectures and workshops, will marks for the module be penalised\n\nno. however, a lot of courses have *weekly workshops* as an assessment item and sometimes it is a requirement for you to attend the workshop for marking - it should also say this on the course profile.",
            "score": 2,
            "author": "billwharton",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the elaborate response and the link to the course profiles. Didn't know that existed!",
                    "score": 1,
                    "author": "Professional-Link278"
                }
            ]
        }
    ]
}