{
    "id": "roevnq",
    "score": 3,
    "title": "Canadian student questions",
    "author": "Jtheory13",
    "date": 1640457411.0,
    "url": "https://www.reddit.com/r/GriffithUni/comments/roevnq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys I’m looking into attending Griffith for design and I have a few questions about how it works. In Canada it’s a little different so I’m a little confused. Message me if you’re willing to help me, thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "What questions do you have?",
            "score": 1,
            "author": "UltraWideGamer-YT",
            "replies": [
                {
                    "level": 1,
                    "comment": "For the trimesters do most students take one off for example the summer, like they do in Canada? Or is it recommended to take all 3? And if a course says design major course credit 40 is that 4 different classes or one class worth 40 credits?",
                    "score": 1,
                    "author": "Jtheory13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are correct there are 3 trimesters and mostly you will do T1 and T2. You don’t have to do T3 and some degrees don’t even have courses in T3. \nIf you have courses available in T3 I think it can help lighten the course work since normally you would do 2 trimesters of 4 courses. Instead you could do 3 trimesters and do a 3/3/2 course split instead of 4/4. But it does really depend on the degree and there is not many options for T3. \n\nEach course is 10CP with the final major being 20CP. Full time study is 30CP+\n\nWhich design degree you plan to do? Bachelor of design? I’m currently doing industrial design which shares many courses. Happy to help with more questions.",
                            "score": 1,
                            "author": "UltraWideGamer-YT",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes I’m looking into the bachelor of design specifically product design! Thank you so much I really appreciate all the help!",
                                    "score": 1,
                                    "author": "Jtheory13"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}