{
    "id": "10lhfd3",
    "score": 8,
    "title": "Missing out on life experiences for Uni",
    "author": "Unfair-Eye-9832",
    "date": 1674701189.0,
    "url": "https://www.reddit.com/r/curtin/comments/10lhfd3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone ever gone on a holiday mid/early semester? My partner wants to take a trip in march but uni will be on so I'm unsure if it's feasible to do both (I'm doing a double degree and only 1/2 is available online). Do I just accept this is something I will have to miss out on or can I do both?",
    "comments": [
        {
            "level": 0,
            "comment": "You can always go on the trip once you've finished uni.\n\nStaying for uni kinda makes more sense.. \n\nIf your partner loves and respects your wishes they'll agree with what you feel is best for yourself.\n\nGood luck deciding mate 👍",
            "score": 11,
            "author": "1justsomeAussie"
        },
        {
            "level": 0,
            "comment": "March is still very early for classes, assignments tend to start being due around week 3-5 so if before then you should be fine to go. Since it's early is easy to catch up on anything you missed",
            "score": 6,
            "author": "Penguiner1888"
        },
        {
            "level": 0,
            "comment": "a weekend in week 1 or 2 might be ok, but after that you’re creating a snowball of work and cutting in to your assessment prep/study time and that’s what really matters. \n\ndef not worth ruining your semester/CWA for and being stressed while you’re on holiday. If your partner is considerate they could plan another holiday with you when you are on break (uni is only 30 weeks /year?)  Prioritise you and be careful of FOMO temptation at uni. You can holiday whenever you like in break/after grad.",
            "score": 5,
            "author": "takethepressuedown"
        },
        {
            "level": 0,
            "comment": "Or graduate and have more money and then travel, the travel will also be more fun",
            "score": 3,
            "author": "bigthickdaddy3000"
        },
        {
            "level": 0,
            "comment": "Depends on what year you are in and what the duration of the holiday is.\n\n1-2 weeks? Probably fine.\n3-4 your stretching it\n4+ consider taking the semester off or dropping to part time units.\n\nYou can probably catch up with the course notes when you get back no problem.\n\nThe other thing to think about is if you can enjoy the holiday and not ruin for yourself thinking about uni.\n\nAs someone who is older, finished uni and has a heap of responsibilities at work, my advice would be to enjoy the days you have with lack of responsibilities while you have them. \n\nI need to take over a week off to make it worthwhile - a few days just leaves me with too much of a backlog of work to complete that isn't worth handing over.\n\nDon't take that as a negative sentiment, as life isn't worse, it's just different.",
            "score": 2,
            "author": "ChillCadence"
        },
        {
            "level": 0,
            "comment": "You can take a 6- month break just by not enrolling in units, and a whole year after a quick email to admin",
            "score": 1,
            "author": "Shortcuttrash"
        },
        {
            "level": 0,
            "comment": "It’s an absolute nightmare for the student and the teacher in terms of catching up if there’s a holiday mid-sem. \nOne student I know became a vile stressball due to a “working holiday” they took to Bali last year, involving getting work done ahead of time but overwhelmingly filling the tutor’s inbox with emails and a final assessment that was shithouse. Avoid it!",
            "score": 1,
            "author": "StraightBudget8799"
        },
        {
            "level": 0,
            "comment": "Hi Ive done it, but I did it very carefully, I was away for 4 weeks near the beginning of semester 2, I did only enrol in 2 units and I made sure that they did not have any tests during that time period and I also made sure that I was up to date on all the work I would have missed out before I left (it was stressful and handwork) but there is no way you can or will want to do uni work when you are on holiday. \n\nIt works near the beginning of your degree but not the end and be really nice to your tutors, you are giving them more work. \n\nUnless you want to go through all of that effort and work don't do it. You will only disadvantage yourself and holidays arent that important during uni",
            "score": 1,
            "author": "Mountain_File_8101"
        },
        {
            "level": 0,
            "comment": "With the quality of the education at curtin university I’d say your fine to do whatever. I’m doing my masters there and I’m not present. They target the learning to the lowest common denominator, so if that’s not you you’re fine.",
            "score": 1,
            "author": "Sorrymateay"
        },
        {
            "level": 0,
            "comment": "1. Why are you doing a double degree? (Employers will only hire you for 1)\n2. Don't skip out on Uni for a holiday ever. You have breaks for that and holidays for that when you work. Making up uni time is a waste of money, energy worth and stress.",
            "score": 1,
            "author": "ActionToDeliver"
        },
        {
            "level": 0,
            "comment": "There's a few variables here.\n\n1) What exact classes you have and their attendance requirements. If you're doing a course that has practical classes like lab sessions then you really can't be missing out on those. Even tutorials if attendance isn't compulsory it's better to attend them cause you usually go into the material in more depth which helps for assignments and exams\n\n2) Speaking of assignments, what is the assessment schedule for your unit? Will there be assignments due around that time? Are there regular assessments like quizzes or lab/tutorial exercises that get graded? Or are there skills in things like lab sessions that might get assessed at the end of semester in a lab exam? If you're gonna miss out on easy marks from turning up and doing classwork or compromise your ability to complete assignments I wouldn't go\n\n3) Just how much of a self-motivated learner are you? Some people can miss a week of classes and absolutely blitz it to catch up. A lot of us say we're gonna do it and never really do. If you're someone who struggles to motivate themselves to go back and catch up on stuff you missed, I'd turn up as it gives you the best chance of learning what you need to know.\n\nAs others have pointed out, you might get away with a very short weekend trip early on but other than that I would be asking my partner to wait and go at a time when uni isn't on. Besides, a trip won't be very fun for you if you're stressing about what you might be missing at uni the whole time",
            "score": 1,
            "author": "SquiffyRae"
        },
        {
            "level": 0,
            "comment": "Depends how long you are going for. I take a 10-14 day trip in August every year to places with 0 reception and have always made it work (handed in a few assignments weeks early etc.) But it depends on what courses you are doing, when you have assignments due, your own ability to keep up and how long you go for. \nIt is 100% doable in a lot of cases you just need to get really on top of everything and be prepared to not do anything but uni stuff for a week after you get back so you don't end up behind. And also talk to your teachers the first week of semester so you can work out what you would be missing out on",
            "score": 1,
            "author": "Professional-Pie-888"
        },
        {
            "level": 0,
            "comment": "No, you don't get to take holiday mid-semester, and if any of your classes are marked on attendance you will be penalised for it. Furthermore, if you have trouble in any of these classes the lecturer will be far less lenient when it comes to giving exam resits etc.",
            "score": 0,
            "author": "speedfox_uk"
        }
    ]
}