{
    "id": "113i8bl",
    "score": 9,
    "title": "UWA vs Curtin Mechanical Engineering",
    "author": "Winter_Struggle_9876",
    "date": 1676522736.0,
    "url": "https://www.reddit.com/r/curtin/comments/113i8bl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I’ve been looking at mechanical engineering at UWA and Curtin and was wondering what opinions people out there had regarding the quality of teaching they have experienced at either universities. Does the prestigious status of the uni heavily influence whether you will get your first job in this industry. Does either uni provide work experience and do they have good connections with the industry? \n\nAny advice or experiences to share would be appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "I went down this path, curtin is better hands down. UWA has great industry sponsorship with the mining industry but as far as getting a better degree, its curtin every day of the week. Their STEM sector is widely regarded as being better",
            "score": 12,
            "author": "Derpfish_lvl10k",
            "replies": [
                {
                    "level": 1,
                    "comment": "Appreciate the comment thanks",
                    "score": 1,
                    "author": "Winter_Struggle_9876",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mech engineer with 15 years experience. I went to UWA and it quickly became apparent how out of touch the coursework was with what Mech engineers in Perth were actually doing. When the majority of the work in Perth is either materials handling or piping/hvac I think I had 1 lecture on pump calcs and none on materials handling.   In truth it probably won't matter once your graduate and get real world experience. Best of luck with your decision.",
                            "score": 1,
                            "author": "Brelvis85"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m heavily involved in the engineering industry in WA, and I engage with curtin for several scholarship programs. I’d recommend curtin, their Motorsport program is pretty sick too!",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Did mine at UWA and I'd generally recommend Curtin. Lots of if ands or buts but yeah.",
            "score": 2,
            "author": "StorMPunK"
        },
        {
            "level": 0,
            "comment": "I was wondering the same thing. Im a few years off uni but I need to start planning. :p",
            "score": 2,
            "author": "Pattieojoe-"
        },
        {
            "level": 0,
            "comment": "I went to UWA and have worked at one of the big mining companies since I left uni. If you want to work directly for a big mining company i can confidently say that where you do your vacation work has the most impact on whether I would hire you as a graduate rather than where you went to uni.\n\nIf you wanted to get into a specific areas such as design etc then you should choose where you want to go based on the courses and resources that the uni has. \n\nWe are lucky in WA that we have great universities… so it doesn’t really factor into the equation (my opinion).",
            "score": 2,
            "author": "mjr-",
            "replies": [
                {
                    "level": 1,
                    "comment": "100% agree. \nOP listen to this",
                    "score": 1,
                    "author": "ActionToDeliver"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For mechanical, ECU is better than both in terms of teaching staff and modern equipment\n\nI went to Curtin for reference",
            "score": 1,
            "author": "antiscab",
            "replies": [
                {
                    "level": 1,
                    "comment": "To expand on it a little, ECU has a 3d printer that prints in stainless steel, among other major expensive pieces of equipment that are available to students doing final year project",
                    "score": 2,
                    "author": "antiscab"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Curtin hands down. I went to UWA btw hahah",
            "score": 1,
            "author": "BenDover609"
        },
        {
            "level": 0,
            "comment": "Curtin is a better degree and more hands on. \n\nI had a Grad Engineer from UWA work for me for a year and academically he was brilliant however he had to bridge the gap in the practical world. \n\nHe was picked up by Rio a year later as a grad on 120 (about 4 years ago).\n\nUltimately you need to get practical experience during your studies irrespective of uni. Get a job working as a junior engineer doing cad, tech writing, something. That will be your edge. As an employer I would pick up a grad with actual work place experience over a grad without it or a Kmart job. Oh and the race cars that they build at uni is cool but it's not really enough",
            "score": 1,
            "author": "ActionToDeliver"
        }
    ]
}