{
    "id": "119njs2",
    "score": 28,
    "title": "Please read your Curtin email.",
    "author": "Academic_Coyote_9741",
    "date": 1677124025.0,
    "url": "https://www.reddit.com/r/curtin/comments/119njs2",
    "media_urls": [],
    "other_urls": [],
    "postText": "If you’re an incoming student, this is a friendly request to ask you to read your Curtin email. Your course coordinators and tutors are likely to be sending essential information prior to the start of teaching.",
    "comments": [
        {
            "level": 0,
            "comment": "Thanks for the reminder, I normally check it but I'd checked out the last few days with life admin... logged in and I have 6 emails :(",
            "score": 4,
            "author": "pureleeawesome",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea they can get overwhelming due to the volume but just try and persevere with it and do as much as you can because if you can't keep on top of them they'll pile up and it'll be worse.\n\nTafe used to do this to me it was so triggering but set aside dedicated time to just do emails at some point every day or every other day, sort what they want and then you can relax knowing they are done.",
                    "score": 1,
                    "author": "wanderingsol0"
                },
                {
                    "level": 1,
                    "comment": "Lol 6. World revolves around email. Wait till you are a little bit older. 6 will be 60 will be 600",
                    "score": 0,
                    "author": "45peons",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is more in reference to the fact I suddenly had 6 uni emails after months of checking and having none.\n\nBut thanks for the laugh about \"when I'm older\", I've already been in the work force for 16 years 😆",
                            "score": 1,
                            "author": "pureleeawesome"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who just graduated, best way to keep update is download Outlook for your phone and turn notifications on.\nYou can also create filters for some mail that isn't too relevant to you so you won't be notified about those.",
            "score": 2,
            "author": "18815030"
        }
    ]
}