{
    "id": "qi8lui",
    "score": 9,
    "title": "Panicking",
    "author": "fzprof",
    "date": 1635498304.0,
    "url": "https://www.reddit.com/r/curtin/comments/qi8lui",
    "media_urls": [],
    "other_urls": [],
    "postText": "So last sem I was a bit all over the place. A lot of bad things happened and one thing that is making me crazy right now is that I was so stupid to not withdraw from a unit that I got a horrible mark for.\n\nI was stupid enough to think it wasn't a big deal but now I am on unconditional status because I got a 7/100 and failed two units then and have a horrible average.\n\nI might go to terminated status because this semester I am not doing well. Do you guys think if I am honest and say I made an honest mistake they would accept it? I was obviously going to fail because my mark was extremely bad then. It is a fail incomplete. \n\nIn terms of extenuating circumstances, I only made another really silly mistake around that time (lost 6k with centrelink simply because I didn't claim the money 😔). I really don't know what is wrong with my head, ADHD maybe? Does anybody think if I give a good appeal where I can show them I can be very dedicated in getting much better marks next semester they would give me a chance? I just don't know what else to do rn. How can I let a really silly mistake ruin my marks that horribly?\n\nI'm doing secondary teaching for human bio btw.",
    "comments": [
        {
            "level": 0,
            "comment": "First piece of advice is don't panic. My first suggestion would be to go and seek advice from your unit co-ordinator or head of teaching and learning, arrange a meeting with them and explain the situation. Those people hold the power at academic board etc, also remember they are people just like you and they are passionate about teaching and getting the best out of people. \n\n[Ed. School contact list.](https://about.curtin.edu.au/learning-teaching/humanities/education/people/)\n\nBe calm, honest and accept their advice. Don't make excuses and ask good questions ie. What support is available for me? How can I stop this from happening again? What would you recommend I do?. University's are scary places, but help does exist, you just need to ask for it.\n\nMy second piece of advice is to ask yourself wether uni is the right choice for you at this point in time. I, like you, really struggled at uni. I changed courses and universities several times. The pressure was great because I thought the expectation was that I go to uni and that if I didn't do well and pass I'd be a failure and my life would amount to little. I eventually dropped out to work and travel and went back a few years later to get my degree. TBH uni taught me a lot but working and travelling were just as important and I've been lucky enough to have a succesful career and work all over the world.\n\nStay Calm. Ask for help. And remember you can do anything you want in life, uni is not the be all and end all. You can live a good and fulfiling life without a degree.",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is great advice- I would also contact Student Wellbeing through Curtin Connect. They can provide you with confidential advice and strategies to help manage your studies. They can also advocate for you during termination appeals.",
                    "score": 2,
                    "author": "Empire_Apples"
                }
            ]
        },
        {
            "level": 0,
            "comment": "same position here, but at UWA. Idk what's going to happen to me lol it's my first sem masters.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently many people do get into conditional at curtin. My fault was that I was so careless to not withdraw earlier when that was obviously the best solution.",
                    "score": 1,
                    "author": "fzprof",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too my friends told me to withdraw but I thought I could do it… I’m looking at realistically failing like 3/4 of my papers lmao it sucks man I don’t know if they kick u out for that but most people I know (engineering electrical) have failed at least 2 papers in their masters",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "How would u get refunded? If you have proof of adhd or depression is it?",
                    "score": 1,
                    "author": "fzprof",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Probs not. I was doing teaching but now taking a sem break",
                                            "score": 2,
                                            "author": "fzprof",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Human bio major and bio. We might've shared the education classes before aha",
                                                            "score": 1,
                                                            "author": "fzprof"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}