{
    "id": "10a1ces",
    "score": 5,
    "title": "where are the best places to nap on campus?",
    "author": "Bubbabigbutch",
    "date": 1673534772.0,
    "url": "https://www.reddit.com/r/emu/comments/10a1ces",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have like a two hour break between classes and I don't want to lose my parking spot by going home. Are there any secluded areas on campus to nap privately?",
    "comments": [
        {
            "level": 0,
            "comment": "Back in my undergrad we would reserve a study room in the library and put a sign on the door that said something like “room reserved until X, taking exam, please do not disturb” and just nap out of view. Probably not what you’re looking for, but it’s something!",
            "score": 10,
            "author": "Frank28d6h42m12s",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol i will def try this out",
                    "score": 1,
                    "author": "Bubbabigbutch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ll see people nap sometimes in the second and third floors of the library, especially near the children’s section. I’m not sure I’d be comfortable with that personally, but it’s an option. You could also try the bottom floor, hardly anyone goes down there it seems",
            "score": 5,
            "author": "knagy17"
        },
        {
            "level": 0,
            "comment": "I’ve napped at the library and asked for a near person to keep an eye on my things",
            "score": 1,
            "author": "Itwastheotherguy88"
        },
        {
            "level": 0,
            "comment": "I used to go sleep in my car. People do it. Otherwise, yes, library study room.",
            "score": 1,
            "author": "funkmon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have been for the past few days lol it just feels weird having people being able to look into my car",
                    "score": 1,
                    "author": "Bubbabigbutch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Park farther away and nobody will! :)",
                            "score": 1,
                            "author": "funkmon"
                        }
                    ]
                }
            ]
        }
    ]
}