{
    "id": "y97lan",
    "score": 21,
    "title": "Admin celebrating while parkEMU makes students suffer",
    "author": "snugglestruggle5",
    "date": 1666294396.0,
    "url": "https://www.reddit.com/r/emu/comments/y97lan",
    "media_urls": [],
    "other_urls": [],
    "postText": "Remember when you see the administrators celebrate the construction of new buildings they are still letting a private company hold the student body hostage. Each semester parkEMU has raised the prices of commuter passes $10 since 2019. This semester it’s almost $200 and then they closed down a third of our parking commuter parking while not opening the pay lots. We are being squeezed by an immoral company and the EMU administration is letting it happen.",
    "comments": [
        {
            "level": 0,
            "comment": "There have been days I can't park in the Ford lot because it's full, forcing me to find parking elsewhere, its become a game of who can get to campus earlier. Parkemu Is the greediest company I've ever encountered",
            "score": 9,
            "author": "LocoMarlin089"
        },
        {
            "level": 0,
            "comment": "Honestly - I try to get to the parking lot by 8:45 everyday and twice a week my class isn’t until 12:30. It’s abhorrent what they’ve done. Forcing people to pay $200 and then on top of that another 10 bucks to park in a PAY LOT? literally the least and I mean LEAST they could do is leave the science center pay lot gates up for the remainder of the year until the parking structure is done but they probably won’t even start maintenance on that until the end of next spring anyway.",
            "score": 9,
            "author": "WinterSoldier45",
            "replies": [
                {
                    "level": 1,
                    "comment": "The whole situation is BS. Just a fyi though, the north lot always has a ton of spots open. It sucks and isn’t close to anything except the student center, but it beats getting to campus 4 hours early.",
                    "score": 5,
                    "author": "knagy17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s where I’ve been parking recently but even by the time I get there that lot is half full already, so I think a lot of people have the same idea 😅. It’d be nice if they opened all the pay lots except for like Alex bc as far as I know not a ton of people park over there since most people have passes I’d imagine",
                            "score": 4,
                            "author": "WinterSoldier45",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea I’ve been parking there since my first year and immediately after the garage closed I could tell just how much of an effect it had. The amount that park there now easily is doubled, maybe even tripled.",
                                    "score": 3,
                                    "author": "knagy17",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I believe it entirely considering I’ve never parked there until this semester lol. I’ve also never seen the parking structure at full functionality except for like maybe back in 2018 since then it’s always been closed partially or entirely for “maintenance”",
                                            "score": 3,
                                            "author": "WinterSoldier45"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yea by 9-930 every day anything near the science center and library are gone",
                    "score": 2,
                    "author": "snugglestruggle5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love their reasoning too. It needs to be closed to conduct an “assessment of needed repairs.” This being just ONE year after they *originally* shut it down for repairs. What happened? Who’s at fault? When can we expect it to open again? It’s been nearly a MONTH since the announcement was made, it’s time for some answers.",
            "score": 4,
            "author": "knagy17",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly and Why wouldn’t they do this during the summer if this was so important that it needed to happen only conveniently after all the commuters paid for their passes.They are the slum lords of parking and EMU is letting it happen",
                    "score": 3,
                    "author": "snugglestruggle5"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jim Smith was bought in to sell the university piece by piece. Dining, housing, and parking have all been privatized. What is next?",
            "score": 2,
            "author": "BigDaddy1054"
        }
    ]
}