{
    "id": "zj8i7p",
    "score": 11,
    "title": "EMU/Ypsi - U of M/Ann Arbor relationship?",
    "author": "OkPainter5082",
    "date": 1670792179.0,
    "url": "https://www.reddit.com/r/emu/comments/zj8i7p",
    "media_urls": [],
    "other_urls": [],
    "postText": "New-ish to the state.  I never realized how geographically close together these universities are.  Do EMU students hang out with Michigan students?  Wondering what EMU students think of Michigan students?  Is it a good relationship?",
    "comments": [
        {
            "level": 0,
            "comment": "I think to a degree some Ann Arbor people look down on Ypsilanti, but I don’t believe it to be the majority of people. I see many people from Ann Arbor visit our restaurants and bars after Michigan football games. I hear many U of M fans say supportive things about Ypsi. Some don’t, but I don’t think they’re a true representation. \n\nLike others have said, EMU is mostly a commuter school. As a commuter I can’t really speak on many relationships between students of both schools, however I do believe there to be a slight difference in culture/perception. \n\nI highly respect a lot of students that go here. I find they don’t often come from very wealthy households and are working round the clock to make ends meet and better themselves. A lot of people I know who went to U of M came from wealthy backgrounds and were given the tools they needed to succeed. There isn’t anything wrong with either situation, it’s just very different between the two. Sometimes people from either background don’t take well to the other, and they may tend to avoid them. I think that’s the core of any issues between students from the opposing schools.\n\n\nEdit: it’s slightly off topic but I wanted to add that I find Ann Arbor drivers to be the absolute worst. Maybe I’ve just had bad luck with them, but anytime I take I-94 east home I see many Ann Arbor decals and plate frames flying past me and cutting people off. I go 75-80 so these people are going 90+. Crazy out there",
            "score": 7,
            "author": "knagy17",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think people looked down on Ypsi more in the past than they do now, and admittedly it was a bit rough around the edges 10+ years ago. Lately it feels like Ypsi is becoming the \"quirky\" place for the A2 yuppies to visit on the weekend if they're tired of all the restaurants in Ann Arbor.",
                    "score": 3,
                    "author": "treycook"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I had more money I would be a U of M student, I believe there are quite a few of us at EMU. So my relationship with U of M students is one of an unachievable dream.",
            "score": 9,
            "author": "Gregtheboss00",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the response!  Is the tuition significantly more?  This surprises me as they're both in state.",
                    "score": 2,
                    "author": "OkPainter5082",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The instate tuition per credit hour is usually within $4,000, but commonly they have higher fees in books, room and board, etc. Hence why 10% of the student body is from the 1% of median family incomes and the median family income for UofM student body is about 154k.  Eastern is has a median family income of 75k and &lt;1% of student body from the 1%.",
                            "score": 8,
                            "author": "SneakyTurtle823"
                        },
                        {
                            "level": 2,
                            "comment": "I would say between room and board costs and all extraneous fees there’s around a 10-15 thousand dollar difference for in state students. Out of state tuition at umich is around $40k. I am however an EMU student and all of my friends attend UofM. EMU is largely a commuter school and I wouldn’t say it has a very strong community unless you live in the dorms or join a frat/sorority.",
                            "score": 5,
                            "author": "No-Claim-3242"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "U of M has a large out of state student population so a good chunk of U of M students don't even know EMU exists if that answers your question",
            "score": 3,
            "author": "Millsappp"
        },
        {
            "level": 0,
            "comment": "They hang out not infrequently. Sometimes they dislike each other for no clear reason, but it's rare.",
            "score": 1,
            "author": "funkmon"
        },
        {
            "level": 0,
            "comment": "A lot of EMU students go to U of M parties, my roommates go there often. Also since EMU is a large commuter school, a lot of students are from the Ann Arbor area as well.",
            "score": 1,
            "author": "Asian-Eggroll-17"
        }
    ]
}