{
    "id": "11w83es",
    "score": 55,
    "title": "My brain is just running on low power mode this semester",
    "author": "I_Am_Hella_Bored",
    "date": 1679285391.0,
    "url": "https://www.reddit.com/r/gmu/comments/11w83es",
    "media_urls": [],
    "other_urls": [],
    "postText": "Or rather even lower power mode than normal. \n\nIt's my last semester and it's also the most stressful one so far. My classes aren't even that difficult compared to previous classes but seeing the now 60 day countdown to graduation has just made my brain shut off. \n\nOn top of everything, this ADHD shit is getting worse by the minute. I procrastinated till 5 pm on Sunday to get **started** on my CS465 hw, and I managed to get it working perfectly by midnight. Biggest fucking clutch in my 4 years here. \n\nCS468... I got lost a few weeks ago and never managed to catch back up. That midterm was fucking rough. And Simon just isn't making the class engaging in any way. \n\nCS450. I procrastinated till this weekend to get started on he that we had a month to do. At least I'm almost done with it tho. All in all, probably the easiest senior level class at GMU. \n\nCS482. Fuck this class. Alright. The professor is too smart to teach me. I just can't with this class. I have spent more time on the projects **and** quizzes for this class than any other class in my 4 years here. More than 367, 330 and 471. And projects and quizzes are still kicking my ass. \n\nAnd don't even get me started on CS451. Just a pro tip for CS students. Don't take Chen seriously don't. You'll regret it. He isn't a terrible dude but this class is ridiculous. The lectures are so dull that if you are having trouble sleeping, this class will be more effective than melatonin or any other sleep medication you can legally buy. I would rather take another class like 471 or 482 than to deal with this class. I've never been so damn bored and there has never been a time when I haven't been bored. \n\nHe's made me hate computer graphics as a topic. Should've taken 351 instead, or data mining. \n\nJust 59 more days. Yes while writing this post the countdown went from 60 to 59. I'm so exhausted and my brain isn't up for this semester. I just wanna sleep. \n\nAnyways, this is probably my last time posting on this sub so I thought I'd do one final \"rant\".",
    "comments": [
        {
            "level": 0,
            "comment": "As someone also with ADHD, the adderall shortage is kicking my ass 💀",
            "score": 18,
            "author": "mulroo",
            "replies": [
                {
                    "level": 1,
                    "comment": "same! i havent been able to get my meds for the past two months because of shortages and i need them to even function at all school wise",
                    "score": 5,
                    "author": "beanstealer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "School sucks lol",
            "score": 12,
            "author": "bshaq34"
        },
        {
            "level": 0,
            "comment": "Focus on one step and then the next. Before you know it, the semester will be done.",
            "score": 7,
            "author": "Dan-in-Va"
        },
        {
            "level": 0,
            "comment": "Senioritis",
            "score": 4,
            "author": "slowkid68"
        },
        {
            "level": 0,
            "comment": "Same here. On Top of everything, job search and lay offs are putting me down!",
            "score": 4,
            "author": "FireFighterExpress29",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea that too.",
                    "score": 1,
                    "author": "I_Am_Hella_Bored"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Chen is boring as fuck, but his assignments are easy",
            "score": 2,
            "author": "halox6000",
            "replies": [
                {
                    "level": 1,
                    "comment": "True but the class is useless",
                    "score": 1,
                    "author": "I_Am_Hella_Bored"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Head down, plug n chug. Almost there.",
            "score": 2,
            "author": "thagoodwizard"
        },
        {
            "level": 0,
            "comment": "check your thyroid",
            "score": 1,
            "author": "masonmechanics",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why?",
                    "score": 1,
                    "author": "I_Am_Hella_Bored"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is my last semester too! We're almost there. You got this!",
            "score": 1,
            "author": "thermoharmonics"
        }
    ]
}