{
    "id": "11wwiat",
    "score": 3,
    "title": "Do I need to retake the math placement test?",
    "author": "KawsXXI",
    "date": 1679347575.0,
    "url": "https://www.reddit.com/r/gmu/comments/11wwiat",
    "media_urls": [],
    "other_urls": [],
    "postText": "So long story short I took the placement test back in 2021 (i think summer) and passed 2/3 sections. So I took math 123 but decided to take a break from math classes and ultimately changed majors. The major I changed to now gives me the option to take math 124 or math 108. I want to take math 108 rather than 124 because it’s easier and i honestly forgot most concepts from 123. When I tried to sign up for 108 it said I needed a math exam score but when i try to sign up for 124 it gives me no issue. So do you guys think I could get an override to take 108 instead of 124 or am I gonna have to take the test again.",
    "comments": [
        {
            "level": 0,
            "comment": "I know some experts who can help with your math class! Check your chats.",
            "score": 1,
            "author": "Alternative_Pick16"
        },
        {
            "level": 0,
            "comment": "Ask for an override. Math 108 only required you to pass the first section of the math test.",
            "score": 1,
            "author": "symtyx"
        },
        {
            "level": 0,
            "comment": "Not to be a condescending AH but I'm v curious what led you to take a break from math in the middle of a two part math sequence knowing that'd you'd have to come back for 124 anyways.",
            "score": 1,
            "author": "c0nn0rmurphy1",
            "replies": [
                {
                    "level": 1,
                    "comment": "good question; I started my degree and after the first semester I knew that i didn’t wanna do it anymore. I was gonna take 124 right after 123 but my schedule with other classes and work just didn’t match up. So rather than changing all my classes around I chose to not take 124 but rather another mason core class instead.",
                    "score": 1,
                    "author": "KawsXXI"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When in doubt, ask the math department. I took pre-calc in a VCCS college and nowhere does it state that it waives me from the math placement test. I emailed them, told them my story, and they waived the requirement and I was able to sign up for MATH108.",
            "score": 1,
            "author": "Coffrius"
        }
    ]
}