{
    "id": "11wyk79",
    "score": 4,
    "title": "summer courses",
    "author": "pekoyamaaa",
    "date": 1679351910.0,
    "url": "https://www.reddit.com/r/gmu/comments/11wyk79",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys! \n\nI'm a health informatics major and I plan on taking at least two classes in the summer, so far I know I want to take HAP 202 but I'm not sure what other classes I should do so does anyone have any ideas about what to take?\n\nfor mason core, i still have to knock out: ECON 103, CDS 101/102, Oral communication, STAT 250, &amp; ENGH 302\n\nbut i'm not sureee how easy those courses are in the summer without me feeling mega burnt out lol so some feedback will be useful!",
    "comments": [
        {
            "level": 0,
            "comment": "Talk to an advisor and see if you can take econ 103 at nova, someone I knew did that a few years ago and said it was super easy",
            "score": 3,
            "author": "mamamia81063",
            "replies": [
                {
                    "level": 1,
                    "comment": "if you are already enrolled at mason they will not let you take nova classes in the summer. i just met with my advisor last week and that is what i was told. however if you are living relatively far from mason during the summer, you may be able to take courses at your local cc granted credits will transfer",
                    "score": 3,
                    "author": "l3nzzo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't take English 302 (in the summer) unless you can write a LOT and do a lot of research in a very small amount of time. I'm an English grad with my undergrad in English, as well. I took my time on my writings and research intensive classes.",
            "score": 3,
            "author": "greeneyes826",
            "replies": [
                {
                    "level": 1,
                    "comment": "im a pretty good writer but i def take my time doing so (especially with research) so noted! thank you :D",
                    "score": 1,
                    "author": "pekoyamaaa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I recommend ECON and COMM. Two very easy classes, to me at least.",
            "score": 3,
            "author": "thermoharmonics"
        },
        {
            "level": 0,
            "comment": "I'm taking the stat class rn, if you are okay with easy maths and have some statistics background, I think you should go ahead and take it. Also, don't take 302 in the summer. Just trust me :)",
            "score": 2,
            "author": "makeawishdotcom"
        },
        {
            "level": 0,
            "comment": "out of all the classes you listed, i think CDS-101 &amp; 102 and oral comm (i assume comm 101) would be the easiest and best option to knock out during the summer. stat250 is personally not a class that i would take over the summer regardless if you're a math person or not; i feel like you would also get burnt out because stats is crammed during the summer bc theres a lot of stuff to learn. english 302 would be difficult to take over the summer as well but that's just me (im in engl 302 and its not something i could do over the summer)",
            "score": 2,
            "author": "Stellar_Cookies",
            "replies": [
                {
                    "level": 1,
                    "comment": "also, did your advisor say you had to take econ? im pretty sure you can take something else bc that econ class has a difficult professor or something. look under the gmu mason core for social science or whatever its called.",
                    "score": 2,
                    "author": "Stellar_Cookies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "well she didn't say i have to take econ but i def will check for anything else to replace the social sciences! thank you for mentioning that",
                            "score": 1,
                            "author": "pekoyamaaa"
                        }
                    ]
                }
            ]
        }
    ]
}