{
    "id": "11zm6kc",
    "score": 68,
    "title": "Me, a Whitetop Hall student getting ready to go to bed at 12:30 last night only for the smoke alarm to ring out thanks Rogers Hall",
    "author": "BadApple37",
    "date": 1679581914.0,
    "url": "https://www.reddit.com/r/gmu/comments/11zm6kc",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Previous Potomac Heights resident: First time?",
            "score": 21,
            "author": "ultimateformsora",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a previous whitetop resident, if it took to the end of March for this to happen, they are lucky. It's always Rogers.",
                    "score": 4,
                    "author": "CMalkus52",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Correct. Whenever we get a “fire” it’s almost always due to Rogers Hall. Apparently one night last springs the smoke alarms rung out at 3 in the morning. I was so lucky I was staying over at my parents’ house when that happened.",
                            "score": 1,
                            "author": "BadApple37"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah we legit had a fire alarm like 2 days ago.... the Potomac Heights experience",
                    "score": 1,
                    "author": "samTheMan45411"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro even at my community college dorms the buildings had separate systems that shit is bogus",
            "score": 3,
            "author": "SoniCode12"
        },
        {
            "level": 0,
            "comment": "It was the apartment next to mine. They had a toaster that caught fire",
            "score": 2,
            "author": "graymalkin2"
        },
        {
            "level": 0,
            "comment": "Can’t wait to get the hell out of here. Why would the fire alarms be connected anyway?",
            "score": 5,
            "author": "Latmaso",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's part of the fire code, not a wiring accident. I forget the specifics, but the buildings are either too close, or share resources of some kind.",
                    "score": 12,
                    "author": "Shishjakob"
                },
                {
                    "level": 1,
                    "comment": "Because if one room is actually on fire the fire itself or the smoke it produces could spread to other units and kill people in their sleep. Older buildings that did not have a connected fire alarm system could and did cause mass casualty events when they burned if the originating units occupants weren’t able to warn others and trigger the manual building wide alarms.",
                    "score": 2,
                    "author": "mattumbo"
                },
                {
                    "level": 1,
                    "comment": "Think the alarms are all connected over there bc that part of campus is old af",
                    "score": 3,
                    "author": "TechnoGamer16"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I sometimes used to just sleep through those. It's probably someone doing something dumb.",
            "score": 1,
            "author": "Gloved-Bald-Rooney"
        },
        {
            "level": 0,
            "comment": "At this point unless I smell smoke I just stay in my room\n\nAlso to anyone thinking about living in Rogers next cycle, don’t do it",
            "score": 1,
            "author": "Read_Maximum",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is my second year at Whitetop!",
                    "score": 1,
                    "author": "BadApple37"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can’t believe anyone still participates in those dumbass drills? I hear the fire alarm and go straight back to sleep, I haven’t gone out for a drill in 2 semesters. If you hear a drill, just assume it’s 99% a foolish Rogers student trying to burn popcorn at 3 am, put your earphones in and go back to sleep.",
            "score": 1,
            "author": "Acrobatic-School-720"
        }
    ]
}