{
    "id": "121wklp",
    "score": 71,
    "title": "George Mason University students start petition to remove Gov Youngkin as 2023 commencement speaker",
    "author": "ansolo00",
    "date": 1679772860.0,
    "url": "https://www.reddit.com/r/gmu/comments/121wklp",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Just go to the speech and stand with your backs to him when he speaks because there’s no way gmu is gonna get rid of him",
            "score": 38,
            "author": "Quople"
        },
        {
            "level": 0,
            "comment": "I feel like this whole thing has gone way too far.",
            "score": 47,
            "author": "Frosty-Search"
        },
        {
            "level": 0,
            "comment": "FYI to everyone- I am posting this out of respect to let this subreddit see this article, but I am not posting to insult governor glenn youngkin.",
            "score": 18,
            "author": "ansolo00",
            "replies": [
                {
                    "level": 1,
                    "comment": "nah we post to insult the governor lol",
                    "score": 10,
                    "author": "KingParity"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Utterly silly that the Student Gov is really wasting time and energy on this shit\n\n\nMeanwhile:\n-tuition increases \n-parking costs a fuck load of money\n-no administrative action on malingering professors\n-prohibited from taking nova classes unless you live like 50 miles from Mason\n-paper towel dispensers never get fixed",
            "score": 27,
            "author": "Straight-Priority499",
            "replies": [
                {
                    "level": 1,
                    "comment": "Student govt has no sway nor power in the decisions of the university. Just write an open letter to the president. You literally learn how to do this is Comm 101 or 110 whatevevr it is.",
                    "score": 14,
                    "author": "DimitriVogelvich",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s almost as if you’re telling me the student govt is useless…",
                            "score": 8,
                            "author": "Straight-Priority499",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They are a resume fill and you get to be mentioned in the fourth estate",
                                    "score": 7,
                                    "author": "DimitriVogelvich",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "can confirm, was in student gov and got a fourth estate article at about the same time lmao",
                                            "score": 3,
                                            "author": "mikebailey"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Resume padding",
                                    "score": 1,
                                    "author": "XtremelyNooby"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Alrighty gonna do my best to get to Student Gov from my personal experiences from like 2018-2021 and hopefully people can use it as reference material.\n\nHaving been in student gov, it's largely performative people with a House of Cards complex. I was an undersecretary under the David Kanos admin ([which... I mean...](https://gmufourthestate.com/2018/04/29/how-a-title-ix-report-in-student-government-dragged-on-for-over-a-year/)) and quit before the news broke because it smelled so rotten. Just passive aggressivism and Roberts Rules of Order. I then rejoined [and quit again after like a third of the senate walked](https://gmufourthestate.com/2019/03/25/six-student-senators-resign-in-two-days/) and I liked some of them/found them redeemable (if they were approached in good faith at any point). Since then they [literally tried to impeach the younger Kanos sister and her admin for basically being lazy](https://gmufourthestate.com/2021/10/27/student-senators-attempt-to-impeach-student-body-president-and-vice-president-fails/). Now I'm not taking sides in these three arguments because it's incredibly stupid and inconsequential, but:\n\n1. It's not hard to see when you enter this room with these forty or fifty prospective prospective politicians all spitting on each other how actual politics aren't any better.\n2. Since it's all political majors, there's something to be said about how a hive mind famously accomplishes nothing, in the same way that if it was ENTIRELY STEM majors nobody would have a constructive conversation.\n3. Maybe I just don't understand how it works in capital hill hiring, but I fail to see how indiscriminately knife fighting for four years sets you up for good career prospects. Broadly speaking, the people out there hiring are generally adults are idealistic about looking to see if you put your head down and worked on something valuable during college.\n4. It bleeds over into other orgs, namely Fraternity and Sorority Life, and FSL isn't exactly setup to tackle university issues socially. FSL is also such a huge deal at Mason it centralizes power even more - if FSL gets a disproportionate ear of Student Involvement and Student Government does too and SG is in FSL, then GG.\n\nWhen you add all of this up, it just look like people wasting their own time which I find incredibly wasteful, especially in college. College is a time where you have access and resources to make actual difference, as someone who started a (at least then) student org which ran tri-state cybersecurity summits, sent dozens of competitive teams across state lines, etc. I could absolutely not do that today just incorporating a non-profit or something. It takes me no more than a few weeks to step back and go \"man I got nothing done lately\" - I don't get how people do it for a full four years. If you want to argue and spread rumors, that's what high school was for.\n\nMason Lobbying Day seemed to mostly be internship hunting, having been offered a summer gig at it (I refused because I didn't even realize I was being offered it - \"well what are you doing this summer? do you need something to do?\", much to the chagrin of the polisci people with me). It felt indicative of the broader org for the students to get a paid trip to Reston only to job hunt.",
                    "score": 2,
                    "author": "mikebailey"
                },
                {
                    "level": 1,
                    "comment": "I've known a couple people in Student Gov, and heard about a good couple of others through friends who run in those circles. And my impression of those people is that most of them do not care and are just there to pad their resume, stroke their own egos, and promote their friends/fraternities. I can literally count on one finger the number of people I know on student gov who actually care. \n\nLike two years ago there was a prominent member that made some public remarks denying the Armenian Genocide on social media, got called out for it, and refused to apologize. Turns out she was running for like Student Gov chair of student involvement at the next student gov meeting, and I firmly believe she would have gotten it if people didn't show up.  All her friends voted for her or refused to vote against her. The debating for letting her on went on for far too long though. Too many people were protecting her scummy behavior. \n\nLiterally the only good things student government did in my time there was Patriot Pantry, and Patriot Protection Program. Nothing else in my time there was of use at all.",
                    "score": 4,
                    "author": "Shishjakob",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why would they care?  It's a powerless dress up position.",
                            "score": 7,
                            "author": "Hafslo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They take it way too seriously. And they have very little power, but they do have some.",
                                    "score": 1,
                                    "author": "Shishjakob"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "honestly, the dude is gna come speak for an hour and leave. people blow shit that doesn't matter out of proportion, why not have this energy for actual issues that needs fixing?",
                    "score": 2,
                    "author": "Flooavenger"
                },
                {
                    "level": 1,
                    "comment": "\"Mason Spirit.\" Lol.",
                    "score": 0,
                    "author": "Administrative_Tone4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you don’t like him, just do not go.",
            "score": 21,
            "author": "Longjumping-Arm-8859"
        },
        {
            "level": 0,
            "comment": "No amount of coping will change anything.",
            "score": 7,
            "author": "UcakTayyare"
        },
        {
            "level": 0,
            "comment": "I say just leave it fucking be unless you want to pay more in tuition.",
            "score": 3,
            "author": "Caylanthe"
        },
        {
            "level": 0,
            "comment": "Sorry, Glen isn't on your side of the aisle for politics, but that doesn't mean he can't give a speech. People like you are the reason why college liberals are memes.",
            "score": 3,
            "author": "halox6000",
            "replies": [
                {
                    "level": 1,
                    "comment": "The danger of identity politics. \n\nAnd I feel you should also point out the elitist/ignorant republicans.",
                    "score": -4,
                    "author": "Administrative_Tone4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anyone who thinks it's okay to just censor and deplatform someone just because you disagree with them, learn what the 1st amendment means.\n\nI just find it quite hilarious that the people who are signing this petition, people who no doubt probably call Youngkin a \"fascist\" (because that word has lost all meaning), are acting in the exact same way actual fascists do by trying to stifle and censor free speech and discourse, the very bedrock of western civilization.",
            "score": 0,
            "author": "WildSyde96",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now I'm actually apathetic towards him speaking but let's hold the fucking phone - dude bans books, and expressed direct support for total legal circumvention of local Commonwealth Attorneys, which are elected positions.\n\nGlenn Youngkin may not be everything everyone accuses him of, but he certainly approaches the legal system exactly like fascists do.\n\nYou're clearly unaware of what the First Amendment means as well since you think it's relevant here. It's actually First Amendment rights protecting the PETITIONERS, not Glenn Youngkin, you fucking clown.\n\nIt's 100% okay to censor and deplatform people, that's literally what Free Speech's running mate, the Marketplace of Ideas, is for. We put the ideas we don't like out of business and this is how you do that. Stop crying at free speech functioning exactly how it's supposed to, leave it to someone who knows more than you.\n\nMf'in comp sci majors out here thinking the First Amendment is here to protect the head of the state government and not the citizens. You go to GEORGE MASON learn the Bill of Rights lmao",
                    "score": 12,
                    "author": "Dvjex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "(2/2)\n\n&amp;#x200B;\n\n&gt;It's 100% okay to censor and deplatform people, that's literally what Free Speech's running mate, the Marketplace of Ideas, is for.\n\nNo, it's not and it's laughable that you think it is.\n\nYou cannot have a marketplace of ideas if you censor ideas contrary to your own anymore than you could have an actual marketplace if you forbid all but one type of item.\n\nThe entire purpose of the Marketplace of Ideas is to let *everyone* provide their arguments and have the best and most valid arguments win out, something that does not and cannot occur when you silence individuals whom you disagree with.\n\nOnce again, another one of my favorite quotes is appropriate here:\n\n&gt;The peculiar evil of silencing the expression of an opinion is, that it is robbing the human race; posterity as well as the existing generation; those who dissent from the opinion, still more than those who hold it. If the opinion is right, they are deprived of the opportunity of exchanging error for truth: if wrong, they lose, what is almost as great a benefit, the clearer perception and livelier impression of truth, produced by its collision with error.\n\n\\- John Stuart Mill\n\nThe fact that you are claiming it is the purpose of the Marketplace of Ideas to *silence and deplatform* those whom you disagree with shows that you *fundamentally misunderstand* what the Marketplace of Ideas is.\n\n&amp;#x200B;\n\n&gt;We put the ideas we don't like out of business and this is how you do that.\n\nNo, the way you do it is by defeating the arguments with better arguments, not by silencing them.\n\nOnce again, time for another relevant quote:\n\n&gt;When you tear out a man's tongue, you are not proving him a liar, you're only telling the world that you fear what he might say.\n\n\\- George R.R. Martin\n\n&amp;#x200B;\n\n&gt;Stop crying at free speech functioning exactly how it's supposed to\n\nThat is not how it's supposed to work and you either fully well know that or your education has failed you.\n\nOnce again, the way freedom of speech works is not silencing those you disagree with, it's having everyone openly and freely express their ideas and having the best ideas win out in the field of debate.\n\n&amp;#x200B;\n\n&gt;leave it to someone who knows more than you.\n\nLike you, someone who fundamentally misunderstanding basic concepts like freedom of speech and the marketplace of ideas?\n\nI'm sure you of course know *far more* than the founding fathers as well as countless generations of philosophers and great minds who's writings and teachings have all shown that you are dead wrong, right?\n\n&amp;#x200B;\n\n&gt;Mf'in comp sci majors out here thinking the First Amendment is here to protect the head of the state government and not the citizens.\n\nIt is here to protect everyone. Rights don't magically stop applying to you simply because you are an elected official. It does not magically make it okay to silence someone simply because they were elected to office, that's not how rights work my man.\n\n&amp;#x200B;\n\n&gt;You go to GEORGE MASON learn the Bill of Rights lmao\n\nThis is a *LAUGHABLE* level of lack of self-awareness.\n\nNot to mention, you're clearly showcasing that your education has indeed failed you because *James Madison* wrote the Bill of Rights, not George Mason, something that you should have learned as part of the Gen. Ed. History courses you are required to take to graduate from this university.\n\nBut if we're going to talk about going to Mason, how about I *directly quote the university website?*\n\n[Being exposed to competing perspectives is essential for questioning our assumptions, testing our beliefs and refining our knowledge. Our goal as a community must be to create an environment where we can engage in difficult and challenging conversations with civility and mutual respect, where confronting opposing ideas and perspectives becomes an opportunity to learn from and with each other.](https://www.gmu.edu/about/integrity-and-standards/free-speech-mason)\n\nNow call me crazy but that right there seems to be _directly_ in opposition with everything you just tried to claim.\n\nAnyway, I think I'm done here. Have a fine day",
                            "score": -2,
                            "author": "WildSyde96",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a whole lot of words for someone who has no fucking idea what they're talking about. I'd have to write a paper longer than the legal arguments I wrote at Mason to respond to this, but unlike you I'm not terminally online nor jerking off to online debate so I don't have the time to respond to this with essay responses.\n\n[Here](https://richmond.com/news/state-and-regional/facing-opposition-from-commonwealths-attorneys-miyares-scales-down-request-for-new-power-to-prosecute/article_38cfcfcd-33e1-5473-bd36-98bf3605a377.html) is your requested source. It's hard to find articles about this because Youngkin and AG backed down immediately after conservative attorney generals started calling it gross overreach. A lot has happened in a year.\n\nWhen fascists rose to power in Germany and Italy, the first books they burned were ones they believed to be sexually immoral. Noticing a trend between Nazis burning books that had gay lovers in them and Youngkin banning books with gay lovers in them.\n\nTrends don't seem to be something you pick up on all that well though, considering censorship has been a tool primarily utilized by the conservative movement. Prosecuting communists and homosexuals in the 50s, can't discuss sexual orientation in schools... It's interesting how the side screaming free speech always has their \"reasonable exceptions.\" Let's be real, it's just about you wanting only your ideas unrestricted, and that's why I don't have to engage in this debate above.\n\nNot to mention getting that George Mason wrote the precursor to the Bill of Rights and that's why I referenced it, you clearly can't get past one-step thinking.\n\nAnyone who wants to see your views on free speech can go through your unhinged post history like I have. Posting on TheDonald and prolife subreddits about satanists, you've clearly got your own invented reality that there's no point to me trying to reason through.\n\nYou can grandstand all day, but the 1st Amendment works for private citizens, it doesn't protect government officials acting in their roles, only when acting as private citizens. An event getting cancelled does not legally suggest disruption, which has to do with public spectacle (and not the kind of spectacle you're going to try and argue anyway).\n\nYou should take Civil Law at Mason, it'd help you a lot with grounding your imaginary views.\n\nOr better yet, leave it to those of us who actually study it.",
                                    "score": 2,
                                    "author": "Dvjex",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“i dont have time to respond tho this” *proceeds to write 8 paragraphs* 💀💀💀",
                                            "score": 1,
                                            "author": "ogotp8",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Literally use the eyes in your skull to look at how he used quote tweets or whatever they're called and wrote an essay response to each comment. There's a difference between a general retort that takes a minute thirty to type versus something this sweaty neckbeard took the time to formulate. Me calling him a clown wasn't an invitation for you to present your best attempt.",
                                                    "score": 1,
                                                    "author": "Dvjex"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;That's a whole lot of words for someone who has no fucking idea what they're talking about.\n\nI have plenty idea of what I'm talking about, and surely if I don't know what I'm talking about, you'd be able to prove me wrong with counterarguments, you know, *engage in the marketplace of ideas* that you seem to know so little about.\n\n&amp;#x200B;\n\n&gt;I'd have to write a paper longer than the legal arguments I wrote at Mason to respond to this\n\nAh, no it wouldn't. If I was as clueless and wrong as you're claiming, it would be remarkably easy for you to counter my arguments.\n\n&amp;#x200B;\n\n&gt;but unlike you I'm not terminally online nor jerking off to online debate so I don't have the time to respond to this.\n\nMy man, I am not terminally online, I barely have time to rest with the amount of projects I have in my CS classes.\n\nAs for \"jerking off\" to online debates, nope sorry, but that is once again a personal attack and wrong. I simply am not going to let bullshit fly. When someone is sitting here trying to claim that *its the purpose of freedom of speech to censor others*, I'm going to call that out.\n\n&amp;#x200B;\n\n&gt;Here is your requested source. It's hard to find articles about this because Youngkin and AG backed down immediately after conservative attorney generals started calling it gross overreach. A lot has happened in a year.\n\nHilariously, this article actually disproves your entire argument because literally the first thing said in the article is that Miyares was doing this, not Youngkin. Additionally, the article stated that once the Virginia Association of Commonwealth Attorneys voiced concern, Miyares immediately rewrote the bill and scaled it back, not something someone acting like a \"fascist\" would do. So thank you for inadvertently proving my point.\n\n&amp;#x200B;\n\n&gt;When fascists rose to power in Germany and Italy, the first books they burned were ones they believed to be sexually immoral.\n\nWhich might be an excellent argument, if removing books from schools was even remotely similar to banning and burning books.\n\n&amp;#x200B;\n\n&gt;Noticing a trend between Nazis burning books that had gay lovers in them and Youngkin banning books with gay lovers in them.\n\nFunny how you are failing to mention that the \"gay lovers\" in the book in question are *underage children* and said book contains explicit illustrations of said underaged children *performing oral sex on each other*. Seems like a weird thing to leave out, doesn't it?\n\n&amp;#x200B;\n\n&gt;Trends don't seem to be something you pick up on all that well though, considering censorship has been a tool primarily utilized by the conservative movement.\n\nOh my holy shit that is a laughable statement.\n\nNot even remotely close my friend. The left have been the ones for the past several decades pushing for \"hate speech\" laws, and pushing for comedy to be censored and comedians to cancelled if their jokes are \"offensive.\"\n\nOr hey, what about the information that was revealed as part of the twitter files, where it was shown that the democrats where actively colluding with Twitter to censor speech they didn't like?\n\nOr hell, let's just skip all of that and just straight up show the Pew Research data that proves you wrong:\n\n[Democrats and Democratic-leaners have increased their support of government censorship from 40% to 65% and their support of tech companies censoring online content from 60% to 76%. Over the same time, Republican and GOP-leaning adults have soured on both, dropping from 37% support for government censorship and 48% support for Big Tech censorship to 28% and 37%, respectively.](https://www.pewresearch.org/fact-tank/2021/08/18/more-americans-now-say-government-should-take-steps-to-restrict-false-information-online-than-in-2018/)\n\n&amp;#x200B;\n\n&gt;Prosecuting communists and homosexuals in the 50s, can't discuss sexual orientation in schools...\n\nFunny how you have to go back to the 50s for an example of the conservatives censoring while I can provide you examples of the left censoring within the last couple months. It's really telling.\n\nAs for the whole \"can't discuss sexual orientation in school\" part, once again, you oddly enough seem to be leaving out important parts that I really can't see any other reason to leave out other than knowing that if they are brought up it destroys your whole argument. And of course that particular fact you're leaving out is that the only part of schools that were banned from discussing sexual orientation are K-5 classrooms, which of course begs the question, why do you want to talk about sexual orientation and sexual stuff with young, prepubescent children? If they have questions about that stuff they can ask their parents because school teachers should not be talking about sex with children under the age of 11.\n\n&amp;#x200B;\n\n&gt;It's interesting how the side screaming free speech always has their \"reasonable exceptions.\"\n\nNot talking about sex with prepubescent children is not a reasonable exception?\n\nMeanwhile, the left is saying that anything that they disagree with is a \"Reasonable\" exception.\n\n&amp;#x200B;\n\n&gt;Let's be real, it's just about you wanting only your ideas unrestricted, and that's why I don't have to engage in this debate above.\n\nAgain, more laughable lack of self-awareness. At this point if I didn't know any better I'd say you're trolling me.\n\nPoint to me any time where conservatives have tried to get a leftist speaker banned from speaking, literally any at all. Because I can point to countless examples of leftists constantly trying to censor and deplatform anyone they disagree with.\n\n&amp;#x200B;\n\nAs for saying you don't have to engage in the debate because \"I'm right and you're wrong\" , I'm sorry buddy, but that's not how debate works.\n\nOnce again, time for quotes:\n\n&gt;We can never be sure that the opinion we are endeavoring to stifle is a false opinion; and if we were sure, stifling it would be an evil still.\n\n\\- John Stuart Mill\n\n&gt;To refuse a hearing to an opinion because they are sure that it is false, is to assume that their certainty is the same thing as absolute certainty. All silencing of discussion is an assumption of infallibility.\n\n\\- John Stuart Mill\n\n&amp;#x200B;\n\n&gt;Anyone who wants to see your views on free speech can go through your unhinged post history like I have. Posting on TheDonald\n\nAh yes, I've posted so much on a subreddit that was banned even before I joined reddit, clearly. Not to mention, attacking me on shit like where I post instead of the actual content of my arguments, classic move of someone who can't actually win on the content of their argument.\n\n&amp;#x200B;\n\n&gt;and prolife subreddits about satanists,\n\nFunny how once again, you leave out important context. Seems to be a favorite pastime of yours. Nevermind that the comment in question was regarding a pro-choice person who was literally using Satanism as their argument, which is the only reason I brought it up in my comment. I'm an atheist my man, I don't give the slightest shit about religion.\n\n&amp;#x200B;\n\n&gt;you've clearly got your own invented reality that there's no point to me trying to reason through.\n\nOnce again, speaking to a mirror there friend.\n\n&amp;#x200B;\n\n&gt;You can grandstand all day, but the 1st Amendment works for private citizens, it doesn't protect government officials acting in their roles, only when acting as private citizens.\n\nGiving a speech at a university is acting as a private citizen. He isn't acting in his capacity as governor by doing a speaking event.\n\n&amp;#x200B;\n\n&gt;imaginary views.\n\nAh yes, the teachings of the most influential liberal thinkers in history, the beliefs of the founding fathers, the actual inarguable written goal of GMU, *imaginary views*. You are a bucket of laughs my guy.\n\nAnyway, I have projects to work on so I'm done with this. Farewell.",
                                            "score": 1,
                                            "author": "WildSyde96",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Actually I'll bite on this one I caught on the end about him being a private citizen when speaking... He is NOT, he is being invited AS the Governor of Virginia. This is what you clearly don't understand about the real world - just because the argument can be made doesn't mean that's actually how it holds up in law. If he were a past governor or he wasn't being invited because of the grants he secured Mason as governor, it might be different. For all we actually know, Youngkin could have directed the university to select him.\n\nIt's comparable to having a CEO of an organization invited as guest speaker to the organization's event. He's not a guest speaker, he's the guy in fucking charge.",
                                                    "score": 3,
                                                    "author": "Dvjex"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I’m not gonna respond to anything other than the fact we can see your profile age and you just lied about joining Reddit after the Donald was banned so everything else you just said is invalidated",
                                                    "score": 1,
                                                    "author": "chadabuez",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sorry he's posting in /r/ask_TheDonald with blatantly conservative views, I guess that means he's technically not a TheDonald poster lmao",
                                                            "score": 1,
                                                            "author": "Dvjex"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Gonna ask ChatGPT for the tl;dr bro, the most comp sci thing about this is that you think a three sentence reddit response is a counterargument. We're not having a debate right now, I'm flaming you for handling this like a neckbeard trying to engage someone intellectually like this. It's not how the real world works. Touch grass dude.\n\nLike you're sitting here trying to play gotchas with things I linked like we're reviewing sources for a fake case. No, Youngkin's AG who he is openly a political ally though pushed for this legislation, without a peep from the governor. It took other conservatives telling him no - Youngkin would have pushed back if he had an issue. Why are you sitting here arguing that logically a fascist wouldn't reneg? Fascists and authoritarian statesmen in governments regularly do this tactic - you propose extremes and then roll it back to make yourself seem reasonable. Nazis did it, Italian fascists did it, Spanish fascists did it, Japanese fascists did it, Brazil, Hungary... \n\nAnd citing one single weird book as a strong argument for banning at least 20 books at once isn't a real argument.\n\nLike what point are you making? That in your simulated debate world things don't work a certain way? Yeah but you need to recognize that logicing you way through all these issues isn't how any relevant party is actually acting. You are grounding your beliefs in a FICTION of how you think people should behave, not the on-the-ground facts.\n\nThose are the only tidbits I saw and I really don't care for the rest of what you have to say. I can sit here and perform for the passive readers, or let them continue to read you sitting here demanding a high school debate classroom approach to discussing world events on reddit.",
                                                    "score": 1,
                                                    "author": "Dvjex"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "(1/2)\n\nAlright, let's address this piece by piece, shall we?\n\n&amp;#x200B;\n\n&gt;dude bans books\n\nNo, I'm sorry but not allowing sexually explicit books to be in K-8 classrooms and libraries is not \"banning books.\" You are still more than capable of getting the books if you so desire to read them, no law is going to prevent you from doing so. Hell, no law is even going to prevent you from getting it and giving it to your kids. There is a stark difference between not allowing inappropriate books in schools and literally banning books so no one can read them.\n\n&amp;#x200B;\n\n&gt;and expressed direct support for total legal circumvention of local Commonwealth Attorneys\n\nCare to provide a source to this claim because I just searched for about 20 minutes and couldn't find a single thing even suggesting that Youngkin ever expressed such.\n\nCome now, this is an institute of higher learning, you should know by now that claims must be backed by evidence.\n\n&amp;#x200B;\n\n&gt;which are elected positions.\n\nOkay, so since you seem to be claiming to have an issue with people going against elected officials, do you take issue with the fact that President Biden has enacted more executive orders than any president in history, enacting hundreds alone in just the first couple weeks? After all, congress members are elected officials, are they not? And considering executive orders directly bypass Congress, surely you'd have an issue with that as well right?\n\n&amp;#x200B;\n\n&gt;Glenn Youngkin may not be everything everyone accuses him of, but he certainly approaches the legal system exactly like fascists do.\n\nAh no, he approaches the legal system in the exact way the Constitution of Virginia gives the governor the power to do so.\n\nHowever, you know who has acted much like fascists do? Oh, that's right, Northam.\n\nTell me, did you take issue with Northam when he violated due process by firing board officials in the middle of a hearing because they were going against what he wanted? Did you take issue with the extensive number of executive orders he signed? Did you take issue with his extensive pushes to violate Virginians’ 2nd amendment rights, and his attempts to bypass Commonwealth Attorneys (hmm, why does that sound familiar) by forcing them to enforce said unconstitutional gun laws?\n\n&amp;#x200B;\n\n&gt;You're clearly unaware of what the First Amendment means as well since you think it's relevant here.\n\nNo, I am fully aware of what it means and I will direct you to the Supreme Court Case *Healy v. James* which explicitly states that the inability to infringe upon first amendment rights extends fully to any publicly funded body including public universities.\n\nFurthermore, as is explained in the [Report of the Committee on Freedom of Expression](https://provost.uchicago.edu/sites/default/files/documents/reports/FOECommitteeReport.pdf) of the University of Chicago, under this extension of the 1st amendment to universities, a university has a \"commitment to free, robust, and uninhibited debate and deliberation among all members of the University’s community.\"\n\n&amp;#x200B;\n\n&gt;It's actually First Amendment rights protecting the PETITIONERS, not Glenn Youngkin\n\nYes, and that would be the case if they were protesting, not trying to silence someone and prevent them from speaking.\n\nIf people so wish to go and protest outside his event, they're completely within their right to do so and I in fact fully encourage them to do so as doing so is to exercise their rights.\n\nHowever, as has already been pointed out by another individual on here, protests are not allowed to physically disrupt the event they are protesting. Now it's pretty inarguable that shutting down an event before it can even occur is disrupting rhe event.\n\nFurther more, simply put, silencing and deplatforming political opponents is not something *classically liberal* individuals who care about *upholding rights and freedoms* do. Silencing and deplatforming political opponents is something *authoritarians and fascists* do.\n\nIf your opponent is wrong, then you provide counter arguments, you do not silence them.\n\nTo relay one of my favorite quotes which is very appropriate in this particular case:\n\n&gt;You cannot take away freedom to protect it, you cannot destroy the free market to save it, and you cannot uphold freedom of speech by silencing those with whom you disagree. To take rights away to defend them or to spend your way out of debt defies common sense.\n\n&amp;#x200B;\n\n&gt;you fucking clown.\n\nAh, those who can't defend their position with arguments instead resort to insults.",
                            "score": -5,
                            "author": "WildSyde96"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As someone who regrettably seems to lean politically the same as you, let me say you seem to have no idea how the first amendment works",
                    "score": 5,
                    "author": "Shishjakob",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, I seems tl be the other way around that you don't seem to understand how the first amendment works.\n\nAccording to the _Healy v. James,_ the first amendment fully applies to any public university or college, a decision thag has been upheld numerous times since that original case.\n\nGeorge Mason is a public university therefore the first amendment fully applies here. A public university has a \"commitment to free, robust, and uninhibited debate and deliberation among all members of the University's community.\"\n\nBut by all means, please continue to tell me that I don't understand how the first amendment works.",
                            "score": 4,
                            "author": "WildSyde96",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't disagree that it applies to public universities, I disagree that you seem to think no one is allowed to express public outrage. They can't for example protest so loudly that they're a disruption, but they can voice their concerns to the school and attempt to have the school not have a speaker, so long as they aren't doing so by violence or coercion. \n\nThe first amendment doesn't prevent people from protesting, the scope of the first amendment does not cover restricting someone else's free speech, and it also doesn't require anyone to listen to anyone else's free speech.",
                                    "score": 5,
                                    "author": "Shishjakob",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not saying people can't express public outrage and nothing I said even implies that. If you disagree with a speaking guest, you're fully welcome to protest the speaker but that is significantly different from trying to prevent them from being able to speak.\n\nYou yourself said that people are not allowed to protest ao loud that they cause a disruption to an event, so enlighten me as to how trying to prevent someone from having a speaking event in the first place is somehow not a disruption and perfectly acceptable.\n\nThe issue here is that you don't seem to understand the difference between peaceful protesting and actively trying to silence someone.",
                                            "score": 2,
                                            "author": "WildSyde96"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Snowflakes have nothing better to do\n\n![gif](giphy|6AiLWJpuzyBlMR22ox)",
            "score": -8,
            "author": "Bobofett69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah while I don't love him he is our governor and he gives us ton of money, so we should at least respect that. Why can't people just go and, as someone else said, turn their backs to him or something?",
                    "score": -2,
                    "author": "samTheMan45411",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly 👆🏼",
                            "score": -2,
                            "author": "Bobofett69"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glenn Youngkin gives students and schools money like he’s been great.",
            "score": -7,
            "author": "SweetButtSmasher"
        },
        {
            "level": 0,
            "comment": "Meanwhile at GW we got “Bryan Stevenson, founder and Executive Director of the Equal Justice Initiative” \n\nGMU could never …",
            "score": 0,
            "author": "tiredzillenial",
            "replies": [
                {
                    "level": 1,
                    "comment": "Eh, I'm fine with this arrangement",
                    "score": 1,
                    "author": "Shishjakob",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds about yt",
                            "score": 3,
                            "author": "tiredzillenial"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations to these GMU students for further dividing our country. They should be proud.",
            "score": 1,
            "author": "bomberb17"
        },
        {
            "level": 0,
            "comment": "Please for the love of all things sacred, take a nap.",
            "score": -2,
            "author": "DimitriVogelvich"
        },
        {
            "level": 0,
            "comment": "Who the f goes to Commencement?! If you care about this even a little, you are a looser, and you should just go to your individual schools ceremony. \nNo one I know went to the commencement. Honestly who gives a fuk?! \nI was on a beach somewhere in the south of Florida by the time my commencement came around. \n\nSad that kids these days actually give a fuk about who speaks at some bulshit event that doesn’t matter in the slightest on your future.",
            "score": -1,
            "author": "kimjongil1953"
        }
    ]
}