{
    "id": "126fw6f",
    "score": 8,
    "title": "how's the econ faculty?",
    "author": "stoned-nerd",
    "date": 1680162415.0,
    "url": "https://www.reddit.com/r/gmu/comments/126fw6f",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I recently got admitted into GMU '27 with a bachelor in Econ. I've heard pretty mixed reviews about George Mason but I see more positives than negatives when looking at it, however, I haven't heard any in-depth opinions on the Econ faculty and was hoping that someone here could help me with their personal experience.\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "As an Econ grad, if you have the mental bandwidth, go into a more robust field. Take 5 years to do a STEM degree if you have to. Ppl aren’t exactly lining up to hire Econ folks. I did well for myself but your mileage may vary. The faculty are great for the most part, highly recommend Airline Econ.",
            "score": 11,
            "author": "GucciGear"
        },
        {
            "level": 0,
            "comment": "I'm a BS Econ student here at Mason. I'm gonna counter the opinions of some of the other commenters here.  It really depends on what you want to do with your Econ degree. If you want to go onto a PhD or do research in economics, I would at least consider other options. GMU's program here is pretty heterodox (like TheSwimmingPelican referenced), which might count against you in admissions and is definitely not the predominant academic philosophy driving economics at the moment. The program here isn't as mathematically rigorous as it probably should be and IMO, the lower level faculty aren't great here, and they definitely have a certain political slant which may put you off. \n\nIf you want a resource on Econ department rankings, look at this:\n\n[https://ideas.repec.org/top/top.econdept.html](https://ideas.repec.org/top/top.econdept.html) \n\nThat being said, I definitely think you can learn a lot at the program here, and there's a lot of young faculty that does really good work in experimental economics. \n\nIf you do decide to come here, please do yourself a favor and supplement your education with math, stats, and coding skills. You're gonna want it when you look for jobs. \n\nIf you want to graduate and do data analysis or business or similar then yea, Econ here is fine, but I would probably also consider a degree in stats or CS or accounting if that's what you want to go with.",
            "score": 5,
            "author": "GMUECONTHROWAWAY",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was considering getting a minor in either IT or Statistics, is a minor good enough or would I have to double major?",
                    "score": 1,
                    "author": "stoned-nerd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think double majoring is tough since there's not a lot of overlap in coursework, so you're gonna be doing a lot of classes, probably more than 120 credits if you're doing IT/Econ. Do you have an idea of what you want to do with the degree?",
                            "score": 1,
                            "author": "GMUECONTHROWAWAY",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "OP was referring to a minor degree, not dual major.",
                                    "score": 1,
                                    "author": "Frosty-Search"
                                },
                                {
                                    "level": 3,
                                    "comment": "to be honest, I have no idea what I want to do as a career and the idea of doing the same job for 40+ years sounds hellish to me - but I chose Econ because I like it and it's a very broad subject that could help me get my foot in with a lot of different career paths. I chose IT as a minor because it's high paying and I think both Econ and IT knowledge it could help me get my foot in data analysis or network security, or even cloud computing to an extent. So yeah, I'm not really sure what I want to do but IT is a \"safety\" option because it's practically always in high demand.",
                                    "score": 1,
                                    "author": "stoned-nerd"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Accounting would be a lot more practical",
            "score": 3,
            "author": "Leadwolf620",
            "replies": [
                {
                    "level": 1,
                    "comment": "Accounting is in really high demand. I’m in shock how useful an accounting degree is.",
                    "score": 2,
                    "author": "GucciGear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely, do you have one?",
                            "score": 1,
                            "author": "Leadwolf620",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, Econ grad. Honestly kind of jealous of the CPA’s out there. Very useful degree to have. Lots of jobs ask for a minimum of accounting credits and letter grade to qualify.",
                                    "score": 2,
                                    "author": "GucciGear"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Econ and Law are GMU’s best departments, and probably by a long-shot. BUT the Econ you'd get at GMU is different than what you'd get most other places (Austrian/Chicago school as opposed to Keynesian). This is great for Public Policy, Politics, Philosophy routes, etc. (hence why the PPE concentration exists, which I'd highly recommend if that's your forte). Political economics was basically invented at GMU. If you're going for a more traditional econ/econometrics route, you'll be served just fine, but arguably another school could do just as well. It's probably also worth mentioning that GMU econ is decidedly right-of-center (with exceptions), so if you're looking to go into conservative/libertarian politics, you have a really solid option here. \n\nFaculty-wise, I have no major complaints. People like to go on about Rustici, but if you're an econ major and already have general knowledge off the field, you won't have problems in that class. Most of the complaints about him are coming from the people outside of that major who are required to fill the credit. \n\nThose are my two cents!",
            "score": 5,
            "author": "TheSwimmingPelican",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Especially for the part mentioning how GMU deals with more conservative/libertarian aspects - I'm not particularly drawn to ideologies such as those but I think the PPE program seems great and was already considering doing it. Again, thanks!",
                    "score": 1,
                    "author": "stoned-nerd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "as gucci said if you can handle cs or something more technical then yeah do that but if you like public policy and want to like double major in something then yes gmu has a world class econ department.",
            "score": 3,
            "author": "majesticPolishJew"
        },
        {
            "level": 0,
            "comment": "I would go with finance. Someone said something about accounting, but I have an accounting job right now and I can go into something else if I want to after a while",
            "score": 1,
            "author": "SnooCapers7789"
        }
    ]
}