{
    "id": "12amm7y",
    "score": 7,
    "title": "How to get out of in person orientation",
    "author": "ef12345678",
    "date": 1680533060.0,
    "url": "https://www.reddit.com/r/gmu/comments/12amm7y",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a transfer student starting Fall 2023, and in-person orientation seems super long and not useful. They say it’s required but what happens if I don’t go? Is there an easy way to get out of it?",
    "comments": [
        {
            "level": 0,
            "comment": "I didn't go when I transferred and nothing happened.",
            "score": 40,
            "author": "nd10609"
        },
        {
            "level": 0,
            "comment": "When I was a freshman I went and got bored so I dipped early. Nothing happened. This isn't to say nothing would happen to you as it could have changed. All I'm saying is that when I did it  I wasn't punished lol.\n\nEdit: I was a freshman 3 years ago if that helps.",
            "score": 19,
            "author": "monosyllabicyowl"
        },
        {
            "level": 0,
            "comment": "Coming from an orientation leader, it’s not exactly necessary. Be sure to be there on day 2 when you need to register for classes.\n\nIt’s more for building a set of Peers so you have someone to ask anything during the first couple of weeks. The info sessions are useful only to those that haven’t had any information on Mason before. And free food if that’s important to you",
            "score": 11,
            "author": "ilvdunkin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wdym by day 2? I only see one virtual session and one in person day",
                    "score": 2,
                    "author": "ef12345678",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, transfer students have a lot less info to take in. So be sure to attend those days.\nMy bad I thought you were going to a freshman session.",
                            "score": 3,
                            "author": "ilvdunkin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do u know what happens if I don’t go?",
                                    "score": 1,
                                    "author": "ef12345678",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you don't go make sure to make a meeting with an advisor in your major as soon as orientation starts because you'll be late to the game of signing up for classes. \n\nAlso walk around campus and find out where your classes will be after you sign up.",
                                            "score": 2,
                                            "author": "xXChampionOfLightXx"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Honestly, I’m not sure. If you’re able to get what to do through a friend, then you’re set to go.\nI was an orientation leader before covid happened, so I’m not sure what changes have been made",
                                            "score": 1,
                                            "author": "ilvdunkin"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think you need to register for classes during orientation",
                                            "score": 1,
                                            "author": "_s7_f7"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ey fellow patriot leader 😎",
                    "score": 2,
                    "author": "niyurii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "you can sign up for classes yourself starting on the day of orientation, but its still good to talk to your advisor, so maybe aim to go see your advisor but dip out for the rest of the day\n\nyou can also try to talk to your advisor directly (check out navigate mason if it works cause it'll mention your advisors, if it doesnt then google the advisor(s) for your major). you can say that you'll probably miss orientation &amp; want to schedule a meeting to figure out your class schedule soon",
            "score": 5,
            "author": "phakephish"
        },
        {
            "level": 0,
            "comment": "Sign up and don’t go. You don’t have to and tbh it’s a big waste of time. They just give u a tour of campus which doesn’t matter unless you wanna be familiar. But after 1st week of classes you’ll know.",
            "score": 3,
            "author": "bshaq34"
        },
        {
            "level": 0,
            "comment": "You can simply just not show up, they don’t take attendance. People are saying you need to go to orientation to register for classes: this is not strictly true and actually can be counterproductive depending on which classes you need because orientation is so late.\n\nIf you check patriot web in the class registration system, under “prepare for registration” you can view your “time ticket”. On the day and time listed, you Will automatically be allowed to register for classes. You can use the planner section to make a list of what you want to register for, then all you have to do is a press a button when the time comes. Make sure you check the student profile to clear any holds that may be around beforehand.\n\nI went to the transfer orientation when I came in despite already having registered just to see if there was anything of value, and I found that there was no information that wasn’t already on the transfer checklist or elsewhere in the website. If you want to talk to an advisor you can but I preferred to talk to them when they weren’t juggling hundreds of students at once.",
            "score": 3,
            "author": "brainstormisland"
        },
        {
            "level": 0,
            "comment": "i transferred this spring! virtual orientation was kind of a joke; i didn’t get any information i didn’t already know. registration was already open for me before i had virtual orientation (but idk if it’s different between spring and fall). the in-person orientation is where you get your id card, but you could get it from an office somewhere if you hadn’t taken your picture yet (i assume you could get your id there if you hadn’t gone to orientation)",
            "score": 2,
            "author": "emlies_",
            "replies": [
                {
                    "level": 1,
                    "comment": "So there’s nothing at the in-person orientation regarding opening registration or anything consequential?",
                    "score": 1,
                    "author": "ef12345678",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "idk if it’s different for fall but registration was open before any orientation (our in person registration was a week before class started and virtual was a month before that). i even got an email from cec telling me to register for classes before orientation",
                            "score": 1,
                            "author": "emlies_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "so nothing consequential happened at orientation",
                                    "score": 1,
                                    "author": "emlies_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You just don’t go? There are no consequences.",
            "score": 2,
            "author": "DimitriVogelvich"
        },
        {
            "level": 0,
            "comment": "You don’t have to go, but registering for classes while your advisor is right there helping you was worth it, since they can advise you on the best classes to take to knock out your requirements",
            "score": 2,
            "author": "Zeus_JB"
        },
        {
            "level": 0,
            "comment": "I never went. Nothing happened.",
            "score": 1,
            "author": "Bricksquad305"
        },
        {
            "level": 0,
            "comment": "You don’t need to go. You almost can’t hear any useful informations. I recommend you make appointment with your department’s advisor to talk about register course and future schedule.",
            "score": 1,
            "author": "Longjumping-Arm-8859"
        },
        {
            "level": 0,
            "comment": "I would recommend online orientation as I found it useful to ask questions. I skipped inperson because I knew where to get answers if I needed them.",
            "score": 1,
            "author": "K3RZeuz45"
        }
    ]
}