{
    "id": "12ewo29",
    "score": 5,
    "title": "Senior in HS needs help deciding if GMU and my major is the right choice",
    "author": "this_is_no_zaku",
    "date": 1680896237.0,
    "url": "https://www.reddit.com/r/gmu/comments/12ewo29",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm having difficulty deciding whether enrolling at George Mason or Cleveland Institute of Art would be the smartest decision.\n\n I was accepted for the bachelor of fine arts major at GMU and accepted into transportation and industrial design at CIA, which are the two majors I ultimately want to get into. Besides tuition being cheaper at Mason, I also live a very short drive from the campus and could live at home, making it the more attractive option for me at the moment. I'm just concerned if the BFA is the right path for me if I want to transfer into industrial and/or transportation design at CIA or other schools later on, because I do not intend on graduating from Mason. \n\nI do not want to enroll in Mason and find out the classes I was taking would not help me progress towards my passions whatsoever, however I just am not sure if I am ready to go far from home and attend a dedicated, expensive art school yet. I would really appreciate thoughts and comments or advice about if I would be making the right decision or not if I went to GMU.\n\nAlso, could any CVPA students tell me what it's like? Or if I picked the right major for what I want to get into?",
    "comments": [
        {
            "level": 0,
            "comment": "If you’re not sure what path you want to go on yet, then it might be best to go with mason since it’s cheaper and less of a commitment. You can look at the classes they offer for that program and talk with counselors at CIA to see if they line up. I can’t say for sure bc I don’t know the art program specifics, but I’d imagine the CIA program is more art focused and GMU’s program is gonna be almost all history/psychology/math etc classes for the first two years. If it’s the same thing at CIA and the transferring is easy, then it sounds like GMU would be a good place to start. But for actual art classes, the curriculum at gmu ain’t shit and you’re better off going to a better school if you actually want to learn",
            "score": 2,
            "author": "Toffutipunani"
        },
        {
            "level": 0,
            "comment": "Hi, I'm a graphic design BFA student! As of last semester, new AVT BFA students have two concentration options: graphic design or studio arts. Within each concentration, you can of course pick electives that are more aligned with your goals like UX, painting, etc., but we really have much in terms of industrial or transportation design classes. The closest that we have is just one packaging design class. \n\nAside from that, I've really liked my graphic design courses here and the professors have been great! Feel free to reply or PM me if you want to talk more about it!",
            "score": 2,
            "author": "j0zten",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi! I am an admitted at Mason can you tell me more about studio arts? it is like animation?",
                    "score": 1,
                    "author": "One-Proposal-8453"
                }
            ]
        }
    ]
}