{
    "id": "12gyqbu",
    "score": 4,
    "title": "Is there a major at GMU similar to Virginia Tech's BIT?",
    "author": "Embarrassed-Land-459",
    "date": 1681080786.0,
    "url": "https://www.reddit.com/r/gmu/comments/12gyqbu",
    "media_urls": [],
    "other_urls": [],
    "postText": "To be honest, I was debating between VT and GMU and wondered if there were any similar majors to VT's BIT. \n\nI applied for CS when applying to GMU, but I feel that what VT offered with their BIT major would fit better with my interest and values. I know other schools most likely cannot replicate their programs, but I want the feeling of business and technology that is offered within the BIT major. Any help?\n\nOn a side note, if someone would like to share their experience of CS at GMU or BIT at VT, please share below!!",
    "comments": [
        {
            "level": 0,
            "comment": "It’s called MIS which is Management Information Systems. You learn Python, Tableau and SQL.",
            "score": 15,
            "author": "Impossible-Car5115"
        },
        {
            "level": 0,
            "comment": "MIS",
            "score": 8,
            "author": "bluberrycuteness"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mason has a higher IT and CS ranking",
                    "score": 0,
                    "author": "Optimal-Spring-9785",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "HAHAHAHAHAHA",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It does. Ask why nearly every government contractor in NOVA hires most of their new grad SWEs from Mason.\n\nVT is better when it comes to the true engineering fields however.",
                                    "score": -1,
                                    "author": "symtyx",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "anybody that can rub 2 brain cells together could get into mason. Only reason I went here is cause its cheap",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Automod has removed your post/comment due to low comment karma. If you need your post to be approved, please contact the mods via modmail.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gmu) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        }
    ]
}