{
    "id": "12s1ut8",
    "score": 4,
    "title": "GMU for biology",
    "author": "Alive-Club81",
    "date": 1681921791.0,
    "url": "https://www.reddit.com/r/gmu/comments/12s1ut8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have just been accepted as a transfer in GMU. Do you recommend gmu for biology majors? I am doing biology as my pre-medicine and I would like to go to a university where the science program is valued. Also, what is social life like? I'm currently at UDC and it's very difficult to relate to other people here.",
    "comments": [
        {
            "level": 0,
            "comment": "As long as you already took chemistry you’ll be fine. I wouldn’t say GMU is a super social campus.",
            "score": 3,
            "author": "MLMontiel"
        },
        {
            "level": 0,
            "comment": "I've taken several bio classes (forensic science major) and I've really enjoyed all of the professors I've had from that department! I'm sure they're not all stellar, but there are a lot of really great professors in the program. The chem department is notoriously awful, but there are a couple of okay professors so seek them out if you have to take gen chem/orgo here. \n\nAs far as social life- I know this sounds like a cop-out answer, but social life is really what you make of it. There are a lot of commuters on campus, and if you just come for classes and leave you won't feel very connected. However, if you put in a little effort to make connections and join clubs, try out new activities, etc., you can have a great experience. I've honestly enjoyed GMU as a late-20's commuter student more than I enjoyed the \"traditional\" on-campus experience I had when I was 18. There's something for everyone here, you just have to put in the effort to find it. Look at some of the research jobs/opportunities on campus, meet with your advisor, talk with other students in your classes (especially when you hit the upper level courses and you have the same peers in several different classes each semester!)",
            "score": 2,
            "author": "girlwithdadjokes"
        },
        {
            "level": 0,
            "comment": "Social life isn't big since most students commute. There's posts about it often here, so take a look. Do you qualify for in-state tuition? It's not worth paying for a lot, if you're doing pre-medicine.",
            "score": 1,
            "author": "Ereshkigal20"
        }
    ]
}