{
    "id": "13gyadv",
    "score": 61,
    "title": "Missed final due to urgent reasons",
    "author": "Due_Junket3340",
    "date": 1684026336.0,
    "url": "https://www.reddit.com/r/gmu/comments/13gyadv",
    "media_urls": [],
    "other_urls": [],
    "postText": "So as the title says, I missed my final. My cousin was killed and it threw me off and I missed my final. I emailed my professor on the 8th and she just posted today (right now) about final grades. I didn’t get any email back, am I stuck or what happens? I emailed her 3 times since the 8th with no response. It304",
    "comments": [
        {
            "level": 0,
            "comment": "Sorry for what happened. \n\nReach out to the dean and let the department know what happened and ask kindly if you can take the exam now or if they can use old grades to accommodate your final.",
            "score": 84,
            "author": "Fuzzy-Maximum-8160",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you",
                    "score": 24,
                    "author": "Due_Junket3340"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Talk to the dean/head of the department. Honestly if they don’t allow you to take the exam or you don’t feel mentally prepared, ask for the incomplete and take it next semester. You have special circumstances and you deserve to both grieve and be able to take the exam while in a good head space. Good luck!",
            "score": 65,
            "author": "Accomplished-Shop514",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much.",
                    "score": 18,
                    "author": "Due_Junket3340"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly for your mental health I’d ask for a incomplete grade so you have like months to study.",
            "score": 31,
            "author": "Denji_Toast374",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much.",
                    "score": 9,
                    "author": "Due_Junket3340"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's awful.. the professor needs to respond because if that's urgent, you have a right to miss your final",
            "score": 23,
            "author": "Conscious_Ad1603"
        },
        {
            "level": 0,
            "comment": "Reach out to the IT department directly at istdept@gmu.edu if you don’t get a response from your instructor.",
            "score": 22,
            "author": "sasakem",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much!!",
                    "score": 8,
                    "author": "Due_Junket3340"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely get in contact with the ist department. As long as you have documentation to back up the family death and its impact on you, you should be able to get an extension.\n\nSince you said 304, I'm assuming you have Sargent and she's a really understanding and chill teacher so I wouldn't get upset about it. Good luck!",
            "score": 16,
            "author": "Frosty-Search",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much. This happened in Trinidad, I have the news headlines (which I provided in all emails) and the funeral I watched from my laptop. Do you think that’s enough?",
                    "score": 11,
                    "author": "Due_Junket3340",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's plenty. If necessary, you should also be able to get a copy of your brother's death certificate, but that's only if Mason is being a dick about it",
                            "score": 6,
                            "author": "SkylineLofe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you",
                                    "score": 2,
                                    "author": "Due_Junket3340"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i'm sorry for your loss.\n\nif the ist department cant really help you, then you can talk to the ssac (student support and advocacy center) for help in guiding you through it. they can reach out to the dean/ist on your behalf &amp; get you in touch with other campus resources.\n\nyou also have time to deal with this. send a few emails, then give some more time to yourself. even if you are graduating this semester, you can do all of this later when you're ready. and please reach out again if you need anymore help.",
            "score": 8,
            "author": "phakephish",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much, I really appreciate the help and advice.",
                    "score": 2,
                    "author": "Due_Junket3340"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m so sorry",
            "score": 6,
            "author": "Far_Engineer8143"
        },
        {
            "level": 0,
            "comment": "I’m so sorry for your loss! I think all the other comments are providing sound advice. I wish you the best. ❤️",
            "score": 4,
            "author": "Kind-Dig1361",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much.",
                    "score": 2,
                    "author": "Due_Junket3340",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course!",
                            "score": 1,
                            "author": "Kind-Dig1361"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Talk to your teacher in person or email a higher up as previously commented. Reach out to ur counselor they have better access to resources than u. Take it and get it done. Then u have summer to cope and bounce back. If they don’t let u slide w a serious reason like tht they are dumb af. This is why ppl hate school",
            "score": 3,
            "author": "bshaq34",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much",
                    "score": 1,
                    "author": "Due_Junket3340"
                }
            ]
        },
        {
            "level": 0,
            "comment": "definitely go to the dean",
            "score": 3,
            "author": "powerhouseofthiscell"
        },
        {
            "level": 0,
            "comment": "Please update on how it turned out!",
            "score": 2,
            "author": "Economics_Matt"
        },
        {
            "level": 0,
            "comment": "That is still bad excuse to say because that happened. You gotta understand that profs have deadlines to meet. If their boss cannot allow it, then they don’t have a say. On syllabus, you agreed 💯 that you abide by the expectations and rules. In other words, no bullshit or whatsover is going on with your life. I have dealt with things like this before. I chose not to let it get into me because I’ve already gotten this far.\n\n\nIf you get lucky, talk to the Dean. Actually, back up your reasons like why should Dean allow you. Its one of those decision where they have to use proper judgement. If the Dean doesn’t say anything, it means they dont wanna waste time to ask more proof or whatver reasons you have. Or gl to your prof’s office in campus and find the bldg",
            "score": -28,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ugh…this is a depressing response.  It’s sad to see people think this lack of compassion and empathy is the way the world should be.  We should expect more from ourselves and others.",
                    "score": 7,
                    "author": "chezewizrd"
                },
                {
                    "level": 1,
                    "comment": "?????",
                    "score": 8,
                    "author": "caelinday"
                },
                {
                    "level": 1,
                    "comment": "To OP : sorry you had to hear this arrogant, cruel and evil response. Ignore it. \n\nTo Odd_Kangaroo_5074:\nWhat makes you say that this is not a reasonable request? \n\nWhat if I got into an accident, and was admitted to ICU for a few days? I agreed I would abide by the expectations and rules and sure as hell profs have deadlines. \nSo what? If you can’t make an exception based on an urgent emergency situation then I believe it’s not worth all this education or the society, we all can just go back to the forest and live along with wild animals. \n\nAny medical reason, valid enough, should be treated as an exception. \nNot including it in the syllabus is a mistake on the professor’s part and on the university’s part for hiring those incompetent professors.",
                    "score": 4,
                    "author": "Fuzzy-Maximum-8160"
                },
                {
                    "level": 1,
                    "comment": "I feel like you didn’t read the full thing. And if you did, that’s a rather callous thing to say. If most jobs can offer days off for bereavement leave, I’m sure colleges can be accommodating as well. Hell, I worked at an adult store with a super toxic boss, and even he told me to take the rest of the week off to get in a better mental space when I had a family member pass away.",
                    "score": 10,
                    "author": "Parapara12345"
                },
                {
                    "level": 1,
                    "comment": "I’m sorry but this is such an unkind and ignorant thing to say. I hope you felt high and mightily writing this BS from behind a screen. Have some compassion maybe? Do us all a favor and delete this and maybe just get off this forum and go touch grass. \n\nMost jobs offer bereavement or some type of accommodations now. So a university can also be expected to provide some accommodation as well. ✌🏼✌🏼",
                    "score": 6,
                    "author": "Accomplished-Shop514"
                },
                {
                    "level": 1,
                    "comment": "You would be the type of mf to tell a student who got into a car crash \"don't get into a car crash bozo, maybe then you wouldn't of missed the final\". The university literally states that you must have a valid reason to why you missed the final or even a class, death of an immediate family member is one of those excusable absences.  The teacher is being a clown",
                    "score": 1,
                    "author": "SubUwuBRZz"
                },
                {
                    "level": 1,
                    "comment": "Rather yall ranting here and there i rather follow up with what prof tell you. Dont waste your time showing your feelings here. Im playing devil advocate 🤦🏻‍♂️ let us know how did it go",
                    "score": -8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the prof hasn’t responded to his 3 emails bro what are you on",
                            "score": 1,
                            "author": "caelinday",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No shit i didnt see it 😂",
                                    "score": -5,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}