{
    "id": "13px40t",
    "score": 13,
    "title": "Unable to purchase a gym membership at Mason",
    "author": "DigitTheFennec",
    "date": 1684867816.0,
    "url": "https://www.reddit.com/r/gmu/comments/13px40t",
    "media_urls": [],
    "other_urls": [
        "https://preview.redd.it/7fd8nhv8nm1b1.png?width=604&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=0892368264f58d9bdbd8f7528f90446c50b57125"
    ],
    "postText": "I'm a recent Grad of Mason and I'm enrolled in the master's program here but it won't let me purchase a membership online for the summer. I've tried calling and emailing to no reply. I walked in and tried to pay at the desk but they couldn't resolve the issue either. This is what I see when looking at the sales portal on the mason recreation website.   \nAnyone else having problems?   \n\n\nhttps://preview.redd.it/7fd8nhv8nm1b1.png?width=604&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=0892368264f58d9bdbd8f7528f90446c50b57125",
    "comments": [
        {
            "level": 0,
            "comment": "As an online-only grad student who lives in the area, I went into one of the gyms and sorted it out with them face-to-face. They'll pass you around on the phone and your emails will go unanswered. Talk to a real live person in person, you shall find the answers you seek.",
            "score": 18,
            "author": "owiygul",
            "replies": [
                {
                    "level": 1,
                    "comment": "I shall try once more today, last time they did not care lmao",
                    "score": 12,
                    "author": "DigitTheFennec"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work there. Just come talk to us, we know the email people suck but we still have to say it. We’ll give you a card then email them, and then just show proof of email every time you come in and we’ll let you in. Not your fault if they don’t do their job",
            "score": 9,
            "author": "Visible-Ad7624"
        },
        {
            "level": 0,
            "comment": "It may be perhaps you aren’t in the window of a registered student, considering the time?",
            "score": 2,
            "author": "DimitriVogelvich",
            "replies": [
                {
                    "level": 1,
                    "comment": "But I’ve been able to register for classes for fall 2023 and patriot web says I’m able to register with no holds. So I’m unsure",
                    "score": 2,
                    "author": "DigitTheFennec",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ya so ideally you’d go to the gym then. Were you a student or graduate this past semester?\n\nEdit. Reread the post.\n\nNormally they’d just let you walk by and work out if you explain it.",
                            "score": 1,
                            "author": "DimitriVogelvich",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup, I graduated recently. It could be their system being screwy???",
                                    "score": 2,
                                    "author": "DigitTheFennec",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes. I had a similar problem. Glory of electronics instead of human interaction.",
                                            "score": 2,
                                            "author": "DimitriVogelvich"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If it doesn’t work, just use someone else card. The people at the desk don’t get paid enough to care.",
            "score": 2,
            "author": "true_tedi"
        }
    ]
}