{
    "id": "13vszvs",
    "score": 4,
    "title": "Double Major Question",
    "author": "thomas_the_kid2",
    "date": 1685459686.0,
    "url": "https://www.reddit.com/r/gmu/comments/13vszvs",
    "media_urls": [],
    "other_urls": [],
    "postText": "So, I am an upcoming freshman as this post will probably make painfully obvious. I want to do a double Major and a Minor. Cybersecurity Engineering and Computer Engineering with a minor in physics, or some quantum physics classes, so I can work doing Quantum CYSE or Quantum CE. Does this seem doable if I put my nose to the grindstone? I’m coming in with only 9 credit hours, so I still have 111 for just my Major alone. What are the odds I can do that in 4 years? Does it depend on what classes overlap? Can I do some summer classes? Thank you for any advice you may have!",
    "comments": [
        {
            "level": 0,
            "comment": "Think about what you want to do after you graduate. This looks like you might be spreading yourself too thin here.  If there are courses that overlap with both majors, that makes it easier. Instead of taking additional courses, you could try to do an internship or work in a research lab in the field of your interest. Additionally, don't forget to factor in some downtime for yourself.",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I definitely think that since my major doesn’t really start kicking in til 4th semester of my college experience that an internship my freshman year would be super helpful in deciding that. I’m just an abundantly curious person so it’s really difficult cuz I just want to learn everything lol.",
                    "score": 3,
                    "author": "thomas_the_kid2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You will be much better off looking into the accelerated master's programs",
            "score": 4,
            "author": "ogbrosephstalin",
            "replies": [
                {
                    "level": 1,
                    "comment": "What makes your say that?",
                    "score": 1,
                    "author": "thomas_the_kid2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is a pathway for CYSE undergrad and accelerated master's for computer engineering. You can take 5 classes (15 credits) of master's coursework that count for both undergrad and master's. The CpE master's has a concentration in cryptographic engineering that includes post-quatum cryptography.\n\nSo in 5 years, you can earn a master's degree with advanced coursework in an area you're interested in vs. the same amount of time for a double major.",
                            "score": 2,
                            "author": "ogbrosephstalin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "See, you’re thinking with your brain, I appreciate that insight. I will most CERTAINLY be looking into this and talking to my advisor the second I can.",
                                    "score": 1,
                                    "author": "thomas_the_kid2"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What the hell is quantum cyber security engineering?",
            "score": 3,
            "author": "Frosty-Search",
            "replies": [
                {
                    "level": 1,
                    "comment": "Preparing for the future with quantum cryptography and stuff like that. It’s basically preparing for quantum computers and their implications",
                    "score": 0,
                    "author": "thomas_the_kid2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are double major student, you may need 150 credits (I graduated in fall 2022, double major) and need extra 1-2 semesters to graduate (although some courses can meet both major’s requirements). And maybe you can’t add minor if you already have double majors. If you just want to reach 120 credits, May be you can add two minors. It’s just my own advice, you may need to talk with you advisor when you enter Mason.",
            "score": 2,
            "author": "Longjumping-Arm-8859",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I appreciate the input! :)",
                    "score": 2,
                    "author": "thomas_the_kid2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting. I didn’t mention my aptitude for CS, but I could definitely see that being a good option as well. I definitely need to weigh my options.",
                    "score": 1,
                    "author": "thomas_the_kid2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For computer engineering and cyber, all the math and physics classes, cs 112(basic python), cs 222(basic c), and a lot of the electives(English, history,art,etc.) are the same. If you’re able to grind through math all the way through differential  equations and physics 1 and 2, cyber with a minor in physics is pretty doable. If you add computer engineering to that mix, you will definitely need to add summer classes(especially if you’re trying to graduate in 4 years) unless you are willing to spend more than 4 years in college. If I were you, I’d do cybersecurity engineering with a minor in physics, and then do accelerated masters(or masters if you wanna take it slow and got extra money) in computer engineering.",
            "score": 1,
            "author": "CycleCute5601",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s an interesting way to go about it. If I did the accelerated masters in CE, what would happen? Would I be in college for 9 years or could I do the BS in CYSE w the minor in physics alongside the MS in CE in 5 years?",
                    "score": 1,
                    "author": "thomas_the_kid2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you take a certain number of credits via summer classes you can definitely do the bachelors degree in 3-4 years, and then if you got the option for accelerated masters, you might add an extra 2-3 years(ask an advisor to be sure tho) as some accelerated masters classes can replace bachelors level classes from what I’ve heard.",
                            "score": 1,
                            "author": "CycleCute5601",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The accelerated master's are designed to only take an additional 2 semesters after completing undergrad",
                                    "score": 2,
                                    "author": "ogbrosephstalin"
                                },
                                {
                                    "level": 3,
                                    "comment": "Interesting. I’ll have to ask my advisor about this when I go. Thank you for the insight! I’ve noticed a lot of technical electives overlap for the CYSE and ECE degrees, so that may also help.",
                                    "score": 1,
                                    "author": "thomas_the_kid2"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s unrealistic to double major in two stem fields which don’t have much overlap, as any academic advisor would assure you, much less double majoring and minoring; lest so to expect to graduate in four years, you could do a masters program in one, or take summer classes, but you also have to consider financing all the supplementary credits and also burnout from the workload",
            "score": 1,
            "author": "Sudont-199X",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not too concerned with burnout as I’ve always been pretty good with that, but I could see how it could happen for sure. Thinking forward with rose tinted glasses if you will. I will say, there is a shocking amount of overlap between the two, more so than I thought. I found 4 or 5 different classes that state “Equivalent to CYSE XYZ”. I do think it may end up being smarter and more financially effective to come back once I have a steady job though in order to have them pay for it instead. I’ll definitely speak to my advisor",
                    "score": 1,
                    "author": "thomas_the_kid2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I’m not too concerned with burnout as I’ve always been pretty good with that, but I could see how it could happen for sure.\n\nI'm assuming that since you said you're an incoming freshman, you just graduated high school. So, I'm here to tell you not to get cocky /lh. College courses aren't a breeze like high school ones, even the accelerated ones (AP, IB, AICE, etc). All of those are significantly easier in comparison. The biggest reason for this is time. Classes in university are only 15 weeks, not 36. All of your exams happen at once, and they make or break your grade since you tend to have 3 per class at most, rather than a much less weighted one every two weeks. Commuter burnout is real, driving in nova Sucks. Hell, even living On campus gets exhausting because the food here is awful. I don't mean to paint it like everything sucks, i just want to warn you, genuinely, that burnout is real, and it's coming for you just like everyone else.",
                            "score": 2,
                            "author": "c0nn0rmurphy1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree with the person who suggested an accelerated master's. Same amount of time, but you're not spreading yourself out nearly as much. If you have a need for speed, you should make sure to keep summer classes open for mason cores if and when you can. Your degree doesn't 'start' your 4th semester. It can start your first if you want. It just depends on when you enroll in classes towards your degree. For that reason, i suggest mason cores over summer, so you can get more degree coursework done early (though, of course, you still need some mason cores during the semester to balance it out). Plus, who the hell wants to take a 5-week physics course over their summer break?",
            "score": 1,
            "author": "c0nn0rmurphy1",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s true. That being said, do you think I could viably do a masters in 4 years then? It’s not even necessarily a need for speed, it’s satiating my hunger for knowledge as corny as that sounds. I’m incredibly excited to go to college and I want to learn about all this stuff so damn bad that I just want to get the boring stuff out of the way to take the interesting stuff lol",
                    "score": 2,
                    "author": "thomas_the_kid2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do i think it's possible? Yes. Does it sound exhausting and a little miserable? Also, yes. You're excited, and that's awesome! But energy does run out. Start slow, and build up. My first semester i only took 10 credits, and I've managed to increase my workload little by little so that i finished last semester successfully with 17 credits while working 3 jobs (two in my field). \n\nYes i think it's doable but it doesn't sound easy to sustain. I'd say, start aiming for 4½. In all seriousness though, if you spend enough time on patriot web, degreeworks, and your college's website, you can map out every single course you'd need to take every semester until you graduate, and then adjust if you want it shorter. You can access degreeworks on patriotweb &gt; student services &gt; student profile. Get out a pen and paper, write down 4-5 classes to take each semester, and use the \"what if\" function on degreeworks to see if those classes count for something and what you'll need to do from there. It's a miracle tool, i swear.",
                            "score": 1,
                            "author": "c0nn0rmurphy1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s a great idea actually. I haven’t heard of degreeworks, but I’m gonna look it up and see what that’s all about. And yeah, I’m definitely concerned my energy will run out lol. 4 1/2 sounds better than 5 though ;p",
                                    "score": 2,
                                    "author": "thomas_the_kid2"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}