{
    "id": "b5a4hq",
    "score": 422,
    "title": "Happy Monday Everyone",
    "author": "s0upsnakes8",
    "date": 1553517206.0,
    "url": "https://www.reddit.com/r/gmu/comments/b5a4hq",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This is such an interesting semester. ",
            "score": 109,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The writers this season have really outdone themselves. ",
                    "score": 86,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can't wait to see the season finale in May.",
                            "score": 47,
                            "author": "stinkyhat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The first blood shed will be a Starship.",
                                            "score": 2,
                                            "author": "ProcyonLotorMinoris"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "First off, singular AFAIK. Second, aren't the law and economic schools pretty seperate from GMU proper?",
            "score": 23,
            "author": "telperiontree",
            "replies": [
                {
                    "level": 1,
                    "comment": "Scalia Law School is a separate entity yeah, economics is a department in CHSS, not separate at all",
                    "score": 22,
                    "author": "LAsportsnpoliticsguy"
                },
                {
                    "level": 1,
                    "comment": "What's with the economic school?",
                    "score": 6,
                    "author": "Current_Selection",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I vaguely remember something about the Koch brothers and the economics... grad school? Something.",
                            "score": 7,
                            "author": "AccidentalHacker39",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Koch brothers and their foundation largely fund the economics program and appoint professors that push their views, mostly right wing economic theory. This applies to both undergrad and grad school.",
                                    "score": 11,
                                    "author": "brotherbaran",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nah econ department asked for the money, different than just receiving an offer. Not saying is okay, just saying target the right people ",
                                            "score": 5,
                                            "author": "AllThingsAirborn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fair point!",
                                                    "score": 3,
                                                    "author": "brotherbaran",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thanks, I've worked with transparent and talked to profs abt it ",
                                                            "score": 3,
                                                            "author": "AllThingsAirborn"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Pretty much right-libertarian/limited government kind of thing. If you've ever taken Rustici you'll know what I mean lmao.  ",
                                                    "score": 5,
                                                    "author": "deadreject"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "*He was just trying to date someone*",
            "score": 64,
            "author": "AmericanRot",
            "replies": [
                {
                    "level": 1,
                    "comment": "*wanna see my art?*",
                    "score": 27,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whoa dude Lol \nI’m surprised that’s still up.  I’m assuming it was already there right or did you OP place it there?",
            "score": 19,
            "author": "wiriux",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was there when I came in at 7:15",
                    "score": 23,
                    "author": "Twisted_Galaxi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hope I see it when I come in today at 2pm :D",
                            "score": 12,
                            "author": "wiriux"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Still there when I was walking to my 9 am ",
                    "score": 17,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I did not 😂 honestly when I saw it I thought it was something legitimate for the university",
                    "score": 12,
                    "author": "s0upsnakes8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Still there!!! ",
                            "score": 9,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hold up, what is the backstory to this??",
            "score": 4,
            "author": "elliephantonthebeach",
            "replies": [
                {
                    "level": 1,
                    "comment": "GMU hired Brett Kavanaugh for the law school",
                    "score": 7,
                    "author": "The_Mega_Void",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah a two week seminar in London for the summer and ne gorsuch for the same but in Padua Italy. ",
                            "score": 2,
                            "author": "AllThingsAirborn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "aaaaand it’s gone.",
            "score": 4,
            "author": "Slut4Tea",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was gone when I walked by at noon today. There were tours of the campus going on today so I’m sure it was removed as soon as they were aware of it. ",
                    "score": 5,
                    "author": "s0upsnakes8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He just wanted to pick some pictures out of his Instagram.. /s",
            "score": 15,
            "author": "MrCelestial"
        },
        {
            "level": 0,
            "comment": "Hey Kavanaugh was investigated and found clear of any wrong doing fair and square!  Even if the investigators were forbidden from: talking to witnesses, collecting evidence, subpoenaing anyone, or asking anyone besides Kavanaugh himself if he did anything wrong!\n\n ^.../s",
            "score": 52,
            "author": "ElChrisman99",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is this actually true? ",
                    "score": 6,
                    "author": "PM-ME-UR-CODE",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He was “investigated” under extremely shady premises with crazy boundaries (only like 2 witnesses questioned) for ~7 days. \n\nRegardless of whether or not he committed sexual assault, it’s my opinion that someone who would publicly act the way he did during his hearings should not be a judge at any level. But I’m nobody. ",
                            "score": 25,
                            "author": "smittynoname",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "All witnesses involved denied that it ever happened, please stop spreading propaganda",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No, they didn’t though.",
                                            "score": 3,
                                            "author": "smittynoname",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There is absolutely no evidence to support her claims. https://www.google.co.uk/amp/s/www.wsj.com/amp/articles/sex-crimes-prosecutor-claims-from-ford-against-judge-kavanaugh-lack-sufficient-evidence-1538369619\nThe fact that you still peddle this bullshit is an embarrassment",
                                                    "score": 4,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sure thing bro. Not gonna argue with you. Enjoy the downvotes",
                                                            "score": 2,
                                                            "author": "smittynoname"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes, the FBI held two separate investigations involving the matter and found no evidence to conclude that Kavanough was guilty. In one they found that one of the accusers friends fabricated the entire thing. \n\nDo I think he’s a scum bag? Yeah\n\nDo I agree with his politics? NAH\n\nIs it fair to ignore evidence and react based on how we feel, or what we think of a person? Nah\n\n\nI think it’ll bring more money and reputation(good and bad) to Mason and thus is an overall good thing. \n\nJust my 2 cents ",
                            "score": 19,
                            "author": "PigletsFury",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I also found no evidence that Kavanaugh was guilty, and didn’t do much less than the FBI investigators in the Ford matter did. ",
                                    "score": 6,
                                    "author": "ReaderHarlaw"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I doubt it but I can't confirm or deny. I still hate the fact they hired someone accused of rape. Plus he's a scumbag anyways\n\n&amp;#x200B;\n\nEdit: AND why the fuck does GMU want his name related to the school? I feel so bad for any victims of assault, this is supposed to be an inclusive school so fuck Mason for thinking this was the slightest bit ok",
                            "score": 9,
                            "author": "Humanity_Why",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just because someone is \"accused\" of something means nothing. \"innocent until proven guilty\" is the way our criminal justice system works. The victim in question was given every opportunity to tell her story and give witnesses that could corroborate it, her own best friend that she said was at the party with her had no recollection of Kavanaugh being there or anything like that happening. Anyone can go around and \"accuse\" someone of something, doesn't mean you did it.",
                                    "score": 16,
                                    "author": "httr540",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; the way our criminal justice system works\n\nGood thing this has nothing to do with the criminal justice system. The dude was essentially at a high profile job interview for a lifetime position as one of the most powerful people in the country. He was *not* on trial or being threatened with any kind of sentence. He was there to determine if he was fit for the job, and put on a show that would have lost him an opportunity at McDonalds.",
                                            "score": 4,
                                            "author": "ranma1_5",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 4,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I never said that proved he was a rapist. I said his behavior should have immediately disqualified him. Multiple allegations of rape *which he implicated himself in* are just the icing on the shit cake that would have gotten him rejected for any position of power, aside from our federal government apparently. Almost any other candidate would have been better, but for whatever reason they stuck with him.\n\nMeanwhile, Dr Ford has had to move several times due to credible death threats, and it’s *Kavanaugh’s* life that’s been ruined. Ha!",
                                                            "score": 1,
                                                            "author": "ranma1_5"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Good thing this has nothing to do with the criminal justice system\n\nYea, it's only accusations that could ruin a man's life, smear his name and put immense political and social pressure on not only him but his entire family. \n\nThat you write off the concept of *innocent until proven guilty* so quickly because it's not an \"official court of law\" is just laughable. I mean come on dude, even forgetting Kav for a second, you just believe accusations in life with no evidence? ",
                                                    "score": 3,
                                                    "author": "richraid21",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean, the whole yelling and having a hissy fit in front of congress (people giving the interview) was actually on live tv. I could link it to you if u want evidence.\n\nI hope you wouldn't want to hire someone with that level of outburst to a lifelong position where they literally JUDGE people. \n\nHe was also showing pretty big red flags of abusive tendencies too, which I understand you may not believe. \n\nBut in any case, he was not only able to get the job, our own university thought a professor with that much of a controversial record, possible abusive tendencies, and prone to crazy outbursts would be okay to represent mason as faculty, even though his name STILL triggers sexual assault victims on campus due to the grueling, inappropriate questions by congress toward his accuser &amp; the literal fact that women are hardly ever believed.\n\nBut sure, go on. Talk about innocent until proven guilty. Ill just be here comforting my friends who are reliving traumatic experiences because a man accused of assault is now accepted by our faculty &amp; country (he's literally FINE btw), while the woman who accused him is currently unable to go back to work AS A PROFESSOR due to constant death threats and fear for her safety. \n\nThat's the world we live in. That's what you're protecting. So, remember that. \n\n(And to the victims out there getting discouraged by comments like these, I want you to know that way more people on this campus support you. We believe you, and we will stand in solidarity with you until these toxic views change and you can one day feel safe on campus &amp; in this world. With so much love, daughter of a victim. Solidarity. ❤✊). ",
                                                            "score": 0,
                                                            "author": "jlrigby",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "When your entire argument relies on emotional appeal, it means you have a bad argument. ",
                                                                    "score": 2,
                                                                    "author": "richraid21",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "When you skip over the facts that I mentioned (accuser still unable to go back to work, Kavanaugh not affected at all due to numerous job opportunities, victims on campus traumatized), so you can justify your own shitty narrative, it means you have a bad argument. \n\n\n\n\n",
                                                                            "score": 0,
                                                                            "author": "jlrigby"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 2,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Cute.",
                                                                            "score": 0,
                                                                            "author": "jlrigby"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "FYI, the user “smitty...” lied to you to try to make you share similar political views as them. The true number of witnesses was 9, and a quick google search will reveal that. ",
                            "score": -4,
                            "author": "_theBLT"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't give him even a moment's respite: let Kavanaugh know every moment of the day exactly what you think of him. Let him know that the world isn't solely made up of rich white assholes who will protect him.",
            "score": 9,
            "author": "FunkyChewbacca",
            "replies": [
                {
                    "level": 1,
                    "comment": "Replace “white” with “black” and then read it back... remember what Martin Luther King Jr. said, \"I have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin, but by the content of their character.\"",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kavanaught was checked and cleared he never raped anyone. They did this to Clarance Thomas too. It’s a political tactic people. ",
            "score": 5,
            "author": "whahua",
            "replies": [
                {
                    "level": 1,
                    "comment": "Clarence Thomas did, in fact, sexually harass Anita Hill. Just because Congress chose to disbelieve her doesn't change that.\n\nHe's a pretty bad judge, too.",
                    "score": 9,
                    "author": "gemInTheMundane"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought he was teaching in London tho ",
            "score": 1,
            "author": "deadreject"
        },
        {
            "level": 0,
            "comment": "Just proves the left cannot meme again.  \nFacts&gt;no facts\n\n&amp;#x200B;",
            "score": -5,
            "author": "Shootemup899",
            "replies": [
                {
                    "level": 1,
                    "comment": "The left? You realize that Liberals are not the left right?\n\nEdit. \n\nWhy are y’all booing? I’m right. \n\nThe left is characterized by anti capitalist views, liberals love their boot licking too much to be leftists. ",
                    "score": -3,
                    "author": "Augustus420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They don't like to hear anything that goes against the rhetoric spewed by their Fox and MSM gods. Best not to try to argue with them. It will never be worth ur time, especially on the Reddits. They still probably think Russia &amp; Venezuela are communist anyway. \n\n(Hey there fellow lefty! ✊ Wonder if I know you lol) ",
                            "score": 3,
                            "author": "jlrigby",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "begone chapocels",
                                    "score": -1,
                                    "author": "Oppenheimeranalysis4",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Heeeyyy we're talkin' here! ",
                                            "score": 1,
                                            "author": "jlrigby"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol, right wing nibbas use the same tired memes over and over again as well. None of you can meme.",
                    "score": -13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tf lol",
                            "score": 4,
                            "author": "AllThingsAirborn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Way to spread fake news",
            "score": -27,
            "author": "Shadow_driu",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not like there was little to no evidence and the accuser only came out to the media when he was being nominated as a Supreme Court judge or anything.",
                    "score": -8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly ",
                            "score": 1,
                            "author": "Shadow_driu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Downvoted Gang.",
                                    "score": 0,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[Laughs in false rape alegations]",
                                            "score": -1,
                                            "author": "Shadow_driu",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\\*laughs in the use facts over feelings\\*",
                                                    "score": 0,
                                                    "author": "Shootemup899"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is just a distraction from the real (Fairfax) campus issues ",
            "score": -3,
            "author": "AllThingsAirborn"
        },
        {
            "level": 0,
            "comment": "facts are facts america",
            "score": -9,
            "author": "gmustudentmeh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Found this post through another sub, here to tell you that I’m not sleeping on your Monique Heart. Brown cow stunning. ",
                    "score": 1,
                    "author": "JediMasterVII",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I WAS HOPING SOMEONE WOULD NOTICE 😭😭 i love you so much",
                            "score": 0,
                            "author": "gmustudentmeh"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "QnJldHQgS2F2YW5hdWdoIGRpZCBub3RoaW5nIHdyb25nLg==\n\nMan I love the number 64.",
            "score": -3,
            "author": "hugh_munghus"
        }
    ]
}