{
    "id": "iiscsj",
    "score": 267,
    "title": "Hope the admins see this and realized they are clowns",
    "author": "CalciumRichMilk",
    "date": 1598707608.0,
    "url": "https://www.reddit.com/r/gmu/comments/iiscsj",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Whoever put that up is brave. Im nervous about saying anything in general; when I got selected for randomized testing, everyone who was working there side eyed/judged me for being skeptical. I felt really bad for trusting my gut and wanting testing somewhere else. I really hope that GMU president hears our concerns and does something.",
            "score": 81,
            "author": "noendcredits",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 20,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like I could be wrongfully punished for wanting a safer option. There's a power dynamic that makes it difficult for us to stand up for ourselves.",
                            "score": 27,
                            "author": "noendcredits"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol I did shit like this for indigenous peoples day at gmu and some highways",
                    "score": 4,
                    "author": "AllThingsAirborn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "JMU has ~200 cases, VCU lists the # of both student and employee active cases. \n\nHow many cases are at GMU?",
            "score": 28,
            "author": "MissingAUsername",
            "replies": [
                {
                    "level": 1,
                    "comment": "10 total. You can go to the data dashboard found on this page: [https://www2.gmu.edu/mason-covid-health-check](https://www2.gmu.edu/mason-covid-health-check) for the breakdown.",
                    "score": 26,
                    "author": "Warlock_Ben",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The only issue is they aren’t listing all tests yet, only a portion of the Kallaco tests. They’ve listed 543 total student tests, all from the past 3 weeks (none this week so far), up from 521 at the beginning of the week. So we’re missing data on about 4000 tests",
                            "score": 18,
                            "author": "the-awesomest-dude"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 5,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -14,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh don't worry, more frequent randomized MANDATORY tests being required for students, voluntary for Staff 🤔",
            "score": 10,
            "author": "blks2k2"
        },
        {
            "level": 0,
            "comment": "Keep in mind, if you opted out of the information sharing form that was presented to you when you finished the back to school covid training, if you opted in to the randomized testing, you just opted back in to the information sharing.  \n\n\nAnd now that it's mandatory, it seems that they're only giving you the illusion of choice now :/",
            "score": 5,
            "author": "M0th0"
        },
        {
            "level": 0,
            "comment": "Edit: Don’t have proof about Kallaco test claim, heard it through rumors. My bad. Article is legit though.\n\nLove the passion, but Mason has stopped using Kallaco tests....\n\nAlso, you can read the analysis by the associate dean of research for College of Science. Pretty sure he has everything to lose if he were to be dishonest. [https://www2.gmu.edu/news/588251](https://www2.gmu.edu/news/588251)",
            "score": 9,
            "author": "psypfgm8720",
            "replies": [
                {
                    "level": 1,
                    "comment": "a Dean writing a message at the behest of the President has a *lot* more to lose by not saying what the President wants, than by being dishonest. Or let's not say \"dishonest\": let's say, \"deliberately using hedge words and twisting the arguments made by critics so as to minimize them.\" because that's what he does, especially about the home sample collection issue--and the secondary issue that he does not mention, which is whether the results obtained via that round of testing should be considered valid (they shouldn't).",
                    "score": 3,
                    "author": "hacking4freed0m",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For the sake of your argument, let's say that the President is telling the dean to disseminate false information. \n\nOption 1) Dean says no, shares accurate scientific analysis - leaders are mad, but dean has respect of scientific community and can easily get another high-ranking job.\n\nOption 2) Dean goes with the flow, intentionally shares incorrect scientific information with the community - loses respect/confidence of entire science community, no one will ever work with him or publish him again. Lose his position with National Center for Biodefense and Infectious Diseases. Lose his position with Virginia Drug Discovery Consortium. Lose his position with Virginia Catalyst. Blacklisted from receiving private institution funding/grant money for his projects.",
                            "score": -2,
                            "author": "psypfgm8720"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Love the passion, but Mason has stopped using Kallaco test kits....\n\nWhere does it say this...?",
                            "score": 5,
                            "author": "WorthyAct8"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let’s put one up about Blackboard, too.",
            "score": 5,
            "author": "GTA-CasulsDieThrice"
        },
        {
            "level": 0,
            "comment": "Lol I hope they see the poster too. \nHow about having us in thousand dollar dorms, saying \"We'll have a mix of online and in person classes.\" Then offer 90% online classes, THEN change the few in-person classes to online, last minute. \nThen on top of that, have the nerve to not have working ethernet ports. Lol you have me here paying 1k for a dorm during a pandemic where I can't even use my pc to attend class and do homework? I had to use my phone for near a week. Their priorities are pretty obvious imo. \nBut they're doing slightly better than other universities supposedly, they made sure to mention that in the emails 🙄. But let's be honest, the bar is low .",
            "score": 6,
            "author": "kaywala"
        },
        {
            "level": 0,
            "comment": "Boy that’ll teach em",
            "score": 1,
            "author": "ZedDead9631"
        },
        {
            "level": 0,
            "comment": "Mason Student Resistance\n\nWhat a joke. You chose to come here. They take themselves way too seriously. Like good message, but fuck what a stupid group name.",
            "score": -5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You guys know Kallaco isn't doing the tests right? You know you could take the semester off right?",
            "score": -14,
            "author": "oreopocky",
            "replies": [
                {
                    "level": 1,
                    "comment": "they subcontract to Opteo labs. so what? Kallaco is the company WM paid.",
                    "score": 10,
                    "author": "hacking4freed0m"
                }
            ]
        }
    ]
}