{
    "id": "53yswd",
    "score": 5,
    "title": "Would a preppy southern conservative fit in at Furman?",
    "author": "[deleted]",
    "date": 1474548981.0,
    "url": "https://www.reddit.com/r/Furman/comments/53yswd",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm looking for a preppy, southern, conservative school.  I've looked at places like Hampden-Sydney and Sewanee. Would I fit in at Furman? Does it have a preppy conservative vibe? I'm looking for a college that has the feel of a prep school.",
    "comments": [
        {
            "level": 0,
            "comment": "Yes\n",
            "score": 3,
            "author": "Ewokboi"
        },
        {
            "level": 0,
            "comment": "Aside from a few oddities, thats the only shit there is here to be honest bud...",
            "score": 4,
            "author": "nm1515"
        },
        {
            "level": 0,
            "comment": "Yeah, you'd fit right in with 99% of the school.",
            "score": 3,
            "author": "Amozav3n"
        },
        {
            "level": 0,
            "comment": "Im a 2015 graduate from Greenville, have two siblings that go there currently and my dad is Director of Facilities. I'll try to give a decent review:\n\nFurman definitely has the southern prep school culture! The campus is consistently touted as one of the most beautiful campuses for both private schools nationally and all schools in the southeast, and well over half of the student body is Greek which only adds to the prep aesthetic. The culture as a whole is very positive, and if you let it sweep you up and get very involved, you come out a much more wholesome person all around. Furman is deeply rooted in the history of the upstate area; graduates are highly respected and sought after all over the Carolinas once out in the real world.\n\n The academics are challenging, but with any liberal arts college you'll be able to expose yourself to a lot of incredible people and philosophies through a broad selection of classes and majors. Greek life is very influential on campus, and often heads up alot of the social and philanthropic events (was a chapter president). The food is top notch now that it's \"Bon Appetite\" (7 of America's top 10 colleges use the same food service) on top of Moe's, Chikfila, sushi made in front of you, and a bar/restaurant style place called \"The Paddock\". On campus housing is all but a requirement, but even though I lived 10 mins away I still lived on campus. The upperclassmen apartments are located on campus as well and was the highlight of the accommodations for me (though most of the dorms are on the smaller side, kind of have to keep your door open in some buildings just to have them feel more spacious but if you have a good group on the hall this becomes a plus)\n\nOverall, I couldn't recommend Furman more! The three major drawbacks are the lack of big college football (other sports like soccer do better/are more fun to watch), the academic rigor can take its toll, and that hefty tuition price tag is nothing to sneeze at.\n",
            "score": 3,
            "author": "ThickRick",
            "replies": [
                {
                    "level": 1,
                    "comment": "ʰᶦ ʳᶦᶜᵏʸ",
                    "score": 4,
                    "author": "GKrollin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hi Grant",
                            "score": 5,
                            "author": "marine3300",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey Munder",
                                    "score": 4,
                                    "author": "1stonepwn"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "oh absolutely. Furman pretty much *is* southern preppy. ",
            "score": 1,
            "author": "vosgestart"
        }
    ]
}