{
    "id": "wspb6p",
    "score": 2,
    "title": "Music students, how does Furman's music school compare to other southern universities? UGA for example?",
    "author": "ed_spaghet12",
    "date": 1660944047.0,
    "url": "https://www.reddit.com/r/Furman/comments/wspb6p",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm looking to major in double bass performance and i'm just trying to have a better grasp on the quality of furman's music program",
    "comments": [
        {
            "level": 0,
            "comment": "Furman’s music department was top notch when I was a student 2009-2013. It’s probably pretty similar still. The problem is, they act as if they are a conservatory and not part of a liberal arts college",
            "score": 4,
            "author": "andyrlecture",
            "replies": [
                {
                    "level": 1,
                    "comment": "What did you play/do?",
                    "score": 1,
                    "author": "ed_spaghet12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was music ed. Percussion was my primary, but I also took voice lessons and studio. I had phenomenal professors!",
                            "score": 1,
                            "author": "andyrlecture"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's the great inheritance of the woman's college, Furman's music program.",
                    "score": 1,
                    "author": "SusannaG1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Furman has one of the best in the area. But I second the comment above. As someone who was not a music major but who wanted to be involved in ensembles as extracurriculars, it was alienating. But if you want to be a performance major it is probably a good plan. You will be part of a tight knit group. Visit and meet the prof you would study under.",
            "score": 3,
            "author": "HermioneMarch"
        },
        {
            "level": 0,
            "comment": "I chose Furman over UGA.  I loved the trumpet teacher at UGA.  I had a few lessons with him before applying.  However, I felt Furman was a little more well-rounded in terms of the skills I would need as a professional.  I went to a big high school for music.  14% of the student population was in band and we also had an excellent orchestra and chorus.  I saw that many private lessons teachers, who were professional musicians, gave lessons to middle schoolers starting out on similar instruments because sometimes you just can't find a horn/euphonium/trombone teacher.  And again, this was a kick ass school in a major metropolitan area.  I liked how Furman, with its strong music ed program, made sure performance majors had these cross skills too.  It can be the difference between making ends meet and not.  I also liked that I was able to be in SO MANY groups even if it was taxing my last semester.  And the professors were good at ensuring we had Easter gigs if we wanted them.\n\nCaveat: I didn't do much with my music degree after all.  After an attempt at a PhD, I went to law school.  Just wanted to fully disclose my path if that helps with your decision.",
            "score": 2,
            "author": "_Treaty709",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know several people who go to schools like that with amazing fine arts but my city has none of those :( i have to travel far to do most things. \n\nUGA has been higher on my list right now than Furman just because my costs would be drastically cheaper, I love the bass professor, and I'm seeking to double major in music and something else as well. But this is definitely very informative about Furman and I'll continue to consider it!",
                    "score": 1,
                    "author": "ed_spaghet12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you have any questions, feel free to reach out.  Furman was also super generous with scholarships.  It beat UGA and I had the HOPE Scholarship that covered tuition at UGA.  Just saying that you never know!",
                            "score": 2,
                            "author": "_Treaty709",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dang, that's crazy that it beat UGA with HOPE. I'm also trying to go to Mercer, which covers full tuition for strings students, but if I don't then Furman's scholarships will be great",
                                    "score": 2,
                                    "author": "ed_spaghet12"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}